{
  "Abstract": "In this paper, we present the details of Women in Com-puter Vision Workshop - WiCV 2024, organized along-side the CVPR 2024 in Seattle, Washington, United States.WiCV aims to amplify the voices of underrepresentedwomen in the computer vision community, fostering in-creased visibility in both academia and industry. We be-lieve that such events play a vital role in addressing gen-der imbalances within the field. The annual WiCV@CVPRworkshop offers a) opportunity for collaboration betweenresearchers from minority groups, b) mentorship for femalejunior researchers, c) financial support to presenters to alle-viate financial burdens and d) a diverse array of role modelswho can inspire younger researchers at the outset of theircareers. In this paper, we present a comprehensive reporton the workshop program, historical trends from the pastWiCV@CVPR events, and a summary of statistics related topresenters, attendees, and sponsorship for the WiCV 2024workshop.",
  ". Introduction": "Despite remarkable progress in various computer visionresearch areas in recent years, the field still grapples witha persistent lack of diversity and inclusion. While the fieldof computer vision rapidly expands, female researchers re-main underrepresented in the area, constituting only a smallamount of professionals in both academia and industry. Dueto this, many female computer vision researchers can feelisolated in workspaces which remain unbalanced due to thelack of inclusion.The WiCV workshop is a gathering designed for allindividuals, irrespective of gender, engaged in computervision research.It aims to appeal to researchers at all levels, including established researchers in both industryand academia (e.g.faculty or postdocs), graduate stu-dents pursuing a Masters or PhD, as well as undergradu-ates interested in research. The overarching goal is to en-hance the visibility and recognition of female computer vi-sion researchers across these diverse career stages, reachingwomen from various backgrounds in educational and indus-trial settings worldwide.There are three key objectives of the WiCV workshop: Networking and MentoringThe first objective is to ex-pand the WiCV network and facilitate interactions betweenmembers of this network. This includes female studentslearning from seasoned professionals who share career ad-vice and experiences. A mentoring banquet held alongsidethe workshop provides a casual environment for junior andsenior women in computer vision to meet, exchange ideasand form mentoring or research relationships. Raising VisibilityThe workshops second objective is toelevate the visibility of women in computer vision, both atjunior and senior levels. Senior researchers are invited togive high quality keynote talks on their research, while ju-nior researchers are encouraged to submit their recent orongoing work, with many of these being selected for oral orposter presentation through a rigorous peer review process.This empowers junior female researchers to gain experiencepresenting their work in a professional yet supportive set-ting. The workshop aims for diversity not only in researchtopics but also in the backgrounds of presenters. Addition-ally, a panel discussion provides a platform for female col-leagues to address topics of inclusion and diversity.",
  ". Workshop Program": "The workshop program featured a diverse array of ses-sions, including 4 keynotes, 6 oral presentations, 41 posterpresentations, a panel discussion, and a mentoring session.Consistent with previous years, our keynote speakers werecarefully selected to ensure diversity in terms of the topicsthat were covered, their backgrounds, whether they work inacademia or industry, and their seniority. This deliberatechoice of diverse speakers is of paramount importance, as itoffers junior researchers a multitude of potential role mod-els with whom they can resonate and, in turn, envision theirunique career paths.The workshop schedule at CVPR 2024 featured a diverserange of sessions and activities, including:",
  ". Hybrid Setting": "This year, our organizational approach underwent slightadjustments due to CVPR 2024 being held in a hybrid set-ting, accommodating both in-person and virtual attendance.We took deliberate steps to sure that the virtual WiCV work-shop was an engaging and interactive event. To achieve this,we took the following steps: Talks, oral sessions, and thepanel were streamed via Zoom for virtual attendances. Theposter session was repeated virtually a week after the con-ference, mirroring the format of the main conference. Wealso facilitated online mentoring sessions via Zoom, cater-ing to mentors and mentees who could only participate vir-tually.",
  ". Workshop Statistics": "The first edition of the Women in Computer Vision(WiCV) workshop was held in conjunction with CVPR2015. Over the years, both the participation rate and thequality of submissions to WiCV have steadily increased.Following the examples from the editions held in previousyears we have continued to curate top-quality submissions into our workshop proceedings.Byproviding oral and poster presenters the opportunity to pub-lish their work in the conferences proceedings, we aim tofurther boost the visibility of female researchers.This year, the workshop was held as a half-day in-personevent with hybrid options, while the virtual componentwas hosted via Topia and Zoom. The in-person gatheringtook place at the Seattle Convention Center in Seattle,Washington, United States. Senior and junior researcherswere invited to present their work, including the posterpresentations detailed in the previous . The organizers for this years WiCV workshop comefrom diverse backgrounds in both academia and industry,representing various institutions across different time zones.Their diverse backgrounds and wide-ranging research areashave enriched the organizing committees perspectives andcontributed to a well-rounded approach. Their broad rangeof research interests in computer vision and machine learn-ing encompass video understanding, object detection, non-verbal communication, open-source benchmark datasets,activity recognition, anomaly detection, autoencoders, gen-eralization, captioning, 3D Point Cloud, medical imagingand vision for robotics.",
  ": WiCV Sponsors. The number of sponsors andthe amount of sponsorship for WiCV. The amount is ex-pressed in US dollar (USD)": "tion, Classification, and Medical applications. Out of the81 submissions, 65 underwent the review process. Six pa-pers were selected as oral presentations and inclusion in theCVPR24 workshop proceedings, while 41 papers were cho-sen for poster presentations. The comparison with previousyears is presented in . Thanks to the diligent ef-forts of an interdisciplinary program committee compris-ing 41 reviewers, the submitted papers received thoroughevaluations and valuable feedback. Additionally, during thementoring session, 48 mentees received in-person guidancefrom 8 mentors, and 5 mentees attended virtual sessionswith 2 mentors in separate meetings via Zoom.This year, we continued the WiCV tradition from previ-ous workshops by providing grants to assistthe authors of accepted submissions in participating in theworkshop. These grants covered a range of expenses, withthe specifics varying for each attendee depending on theirindividual needs, including, for example, conference regis-tration fees, round-trip flight itineraries, and two days of ac-commodation for all authors of accepted submissions whorequested funding.The total sponsorship for this years workshop amountedto $52,000 USD, with contributions of 9 sponsors, meetingour target. In you can find the details with respectto the past years.",
  ". Conclusions": "WiCV at CVPR 2024 has once again proven to be a valu-able opportunity for presenters, participants, and organiz-ers, providing a platform to unite the community. It con-tinues to address the persistent issue of gender balance inour field, and we believe it has played a significant role instrengthening the community. It provided an opportunityfor people to connect from all over the world from the com-fort of their personal spaces. With a high number of papersubmissions and even greater number of attendees, we an- ticipate that the workshop will continue the positive trajec-tory of previous years, fostering a stronger sense of commu-nity, increased visibility, and inclusive support and encour-agement for all female researchers in academia and indus-try. Moreover, WiCV Members participated in the Diversity& Inclusion Social event at CVPR. Furthermore, WiCV alsogot featured by in the CVPR 2024 Magazine and Diver-sity, Equity, & Inclusion News .",
  ". Acknowledgments": "We express our sincere gratitude to our sponsors, includ-ing our Platinum sponsors: Apple, Wayve, Meta, and Toy-ota Research Institute, as well as our Silver Sponsor: googleResearch, and Bronze sponsors: Meshcapade, Austrian In-stitute of Technology, Disney Research, and Tencent. Ourappreciation also extends to the San Francisco Study Center,our fiscal sponsor, for their invaluable assistance in manag-ing sponsorships and travel awards. We are thankful forthe support and knowledge-sharing from organizers of pre-vious WiCV workshops, without whom this WiCV eventwould not have been possible. Finally, we extend our heart-felt thanks to the dedicated program committee, authors, re-viewers, submitters, and all participants for their valuablecontributions to the WiCV network community.",
  "Website: :": "Z. Akata, D. Bazazian, Y. Hasson, A. Kanazawa, H. Kuehne,and G. Varol.WiCV at ECCV2018: The Fifth Women inComputer Vision Workshop.In Proceedings of EuropeanConference on Computer Vision Workshops, 2018. I. Amerini, E. Balashova, S. Ebrahimi, K. Leonard, A. Na-grani, and A. Salvador. WiCV 2019: The Sixth Women InComputer Vision Workshop. In Proceedings of the IEEE/CVFConference on Computer Vision and Pattern Recognition(CVPR) Workshops, June 2019."
}