{
  "Abstract": "Various trending image generative techniques, such asdiffusion models, have enabled visually appealing outcomeswith just text-based descriptions. Unlike general images,where assessing the quality and alignment with text descrip-tions is trivial, establishing such a relation in a clinicalsetting proves challenging. This work investigates variousstrategies to evaluate the clinical significance of syntheticpolyp images of different pathologies. We further explore ifa relation could be established between qualitative resultsand their clinical relevance.",
  ". Introduction": "In recent years, creating a pictorial view of what we imaginehas become possible with the advent of diffusion models.This capability is coupled with text-based control, allow-ing us to type in a text prompt that describes our desiredimage output. These models can be fine-tuned to down-stream tasks, expanding their viability to different applica-tions. Generally, in most such applications, the visual out-comes during each fine-tuning iteration can be used to cor-relate them with improvement or overfitting. However, doesthis concept extend to medical images? Does solely relyingon appealing visuals provide enough evidence for the clin-ical significance of generated medical images? These aresome crucial questions that need attention for critical medi-cal analysis tasks. In this work, we investigate the feasibility of syn-thetic medical data in both qualitative terms and clini-cal relevance to provide insights into the above questions.This study aims to generate colonoscopy images featur-ing polyps, which are precursors to colorectal cancer, thethird most common malignancy.These polyps can beadenomatous (AD), which means malignancy potential, ornon-adenomatous (Non-AD), which means benign.Ad-",
  ". The image illustrates the diffusion model training pro-cess and assesses synthetic image quality in a clinical setting": "ditionally, we emphasized high-quality image generation.The synthetic images are obtained using a stable diffusionmodel and are further examined for pathological rele-vance by performing a binary classification (AD/Non-AD).The existing literature lacks such pathology-based studiesand mainly focuses on polyp generation using binary masks. Our contributions are summarized below: We investigate the correlation between diffusion mod-els qualitative and quantitative results to determine theiralignment or disparity in clinical settings.",
  "Real0.79010.83120.81010.59380.52780.55880.6795Real+Synthetic0.76540.80520.78480.53130.47220.50000.6387": "with a denoising U-Net module. This module undergoesa two-step training process. Initially, the model learns froma large number of polyp and non-polyp colonoscopy im-ages with additional quality-specific text prompts. This stepallows it to learn polyp-focused patterns that could assistin further training it on a small-scale polyp classificationdataset. Subsequently, we freeze some layers of the U-Netencoder and train it using pathology (AD/Non-AD) basedhigh-quality images. To enhance the models performance,we also included a few samples of the previous dataset andsome high-quality images for which pathological annota-tions are unavailable.The generated images of AD andNon-AD classes are further evaluated using three strategiesto assess their clinical relevance. These strategies includeplotting t-SNE embeddings, using the Kernel Inception Dis-tance (KID) metric, and augmenting the real images withgenerated images for a binary classification. Additionally,our approach incorporates iteration-wise analysis to ascer-tain whether a relation between qualitative outcomes andtheir clinical viability could be established.",
  ". Experiments": "Theexperimentsareconductedusingthreepub-licly available datasets,namely,SUN Database (1, 09, 554 non-polyp and 49, 136 polyp frames), CVC-ClinicHDSegment (164 images), and CVC-ClinicHDClassif (train set:536 adenoma, 252non-adenoma, test set: 77 adenoma, 36 non-adenoma). Weused the official validation set of CVC-ClinicHDClassiffor testing due to the unavailability of the annotations inthe official test set.The initial training of our diffusionmodel is conducted using the SUN Database, which isfine-tuned using the other two datasets. The pathologicaland clinical relevance evaluation is performed using CVC-ClinicHDClassif.The implementation uses the PyTorchframework, and execution is performed on NVIDIA A100and NVIDIA Titan-Xp GPUs.First, we conducted an iteration-wise analysis using t-SNE plots and the KID metric. Simultaneously, we tried torelate them with qualitative outcomes. It can be observedfrom , , and that despite visually stun-ning outcomes in the initial iterations, the corresponding t-SNE plots and KID metrics signify clinical irrelevance ofthe synthetic images. This observation contradicts generalimages, where qualitative results often show correlationswith quantitative outcomes. Moreover, it is difficult to vi-sually conclude the pathology of such anomalies without",
  ". Row1: AD, Row2: Non-AD. From left to right, andcontinuing the same sequence in the next row, the synthetic imagescorrespond to iterations 1k, 4k, and 8k": "clinical expertise. Furthermore, the best outcomes of t-SNEplots and KID metrics, i.e., iteration 8k, could not outper-form real images when used for augmentation (see ). The reason for underperformance can be inferred from, where iteration 8k is selected based on comparingsynthetic AD/Non-AD with their real counterparts. How-ever, it is important to consider the comparison betweensynthetic AD/Non-AD and real Non-AD/AD, respectively.This comparison signifies how distinct one class is from an-other, which is unfavorable in the 8k iteration.",
  ". Conclusion": "In this work, we proposed a diffusion-based approach togenerate polyp images with different pathologies and inves-tigated different strategies to assess their clinical relevance.We demonstrated that, unlike general images, it is difficultto establish a direct relation between qualitative outcomesand their clinical significance without some additional in-vestigations. Our study provides pathways for future re-search using generative techniques with clinical images.",
  "Jorge Bernal, Javier Sanchez, and Fernando Vilarino. To-wards automatic polyp detection with a polyp appearancemodel. Pattern Recognition, 45(9):31663182, 2012. 2": "JorgeBernal,FJavierSanchez,GloriaFernandez-Esparrach, Debora Gil, Cristina Rodrguez, and FernandoVilarino.Wm-dova maps for accurate polyp highlightingin colonoscopy: Validation vs. saliency maps from physi-cians. Computerized medical imaging and graphics, 43:99111, 2015. 2 Jorge Bernal, Aymeric Histace, Marc Masana, QuentinAngermann,CristinaSanchez-Montes,CristinaRo-driguez de Miguel,Maroua Hammami,Ana Garca-Rodrguez, Henry Cordova, Olivier Romain, et al. Gtcre-ator: a flexible annotation tool for image-based datasets.International journal of computer assisted radiology andsurgery, 14(2):191201, 2019. 2 Roman Machacek, Leila Mozaffari, Zahra Sepasdar, Sravan-thi Parasa, Pal Halvorsen, Michael A Riegler, and VajiraThambawita. Mask-conditioned latent diffusion for gener-ating gastrointestinal polyp images. In Proceedings of the4th ACM Workshop on Intelligent Cross-Data Analysis andRetrieval, pages 19, 2023. 1 Masashi Misawa, Shin-ei Kudo, Yuichi Mori, Kinichi Hotta,Kazuo Ohtsuka, Takahisa Matsuda, Shoichi Saito, ToyokiKudo, Toshiyuki Baba, Fumio Ishida, et al. Developmentof a computer-aided detection system for colonoscopy and apublicly accessible large colonoscopy video database (withvideo). Gastrointestinal endoscopy, 93(4):960967, 2021. 2 Alexander K Pishva, Vajira Thambawita, Jim Torresen, andSteven A Hicks. Repolyp: A framework for generating re-alistic colon polyps with corresponding segmentation masksusing diffusion models.In 2023 IEEE 36th InternationalSymposium on Computer-Based Medical Systems (CBMS),pages 4752. IEEE, 2023. 1 Robin Rombach, Andreas Blattmann, Dominik Lorenz,Patrick Esser, and Bjorn Ommer.High-resolution imagesynthesis with latent diffusion models.In Proceedings ofthe IEEE/CVF conference on computer vision and patternrecognition, pages 1068410695, 2022. 1 Cristina Sanchez-Montes, Francisco Javier Sanchez, JorgeBernal, Henry Cordova, Mara Lopez-Ceron, Miriam Cu-atrecasas, Cristina Rodrguez De Miguel, Ana Garca-Rodrguez, Rodrigo Garces-Duran, Mara Pellise, et al.Computer-aided prediction of polyp histology on white lightcolonoscopy using surface pattern analysis. Endoscopy, 51(03):261265, 2019. 2"
}