{
  "Abstract": "Geometry-agnostic system identification is a techniquefor identifying the geometry and physical properties of anobject from video sequences without any geometric as-sumptions. Recently, physics-augmented continuum neuralradiance fields (PAC-NeRF) has demonstrated promisingresults for this technique by utilizing a hybrid EulerianLagrangian representation, in which the geometry is rep-resented by the Eulerian grid representations of NeRF, thephysics is described by a material point method (MPM),and they are connected via Lagrangian particles. However,a notable limitation of PAC-NeRF is that its performanceis sensitive to the learning of the geometry from the firstframes owing to its two-step optimization. First, the gridrepresentations are optimized with the first frames of videosequences, and then the physical properties are optimizedthrough video sequences utilizing the fixed first-frame gridrepresentations. This limitation can be critical when learn-ing of the geometric structure is difficult, for example, ina few-shot (sparse view) setting. To overcome this limita-tion, we propose Lagrangian particle optimization (LPO),in which the positions and features of particles are opti-mized through video sequences in Lagrangian space. Thismethod allows for the optimization of the geometric struc-ture across the entire video sequence within the physicalconstraints imposed by the MPM. The experimental resultsdemonstrate that the LPO is useful for geometric correctionand physical identification in sparse-view settings.1",
  ". Introduction": "System identification is a technique used to identify the ge-ometry and physical properties of an object based on visualobservations. It has been actively studied in computer vi-sion and physics because of its wide range of applications,including 3D reproduction, environmental understanding,and content creation. To solve this problem in a realistic en-vironment, it is important to adequately address both the ex-trinsic geometric structure and the intrinsic physical prop-",
  "PSNR: 23.99PSNR: 30.07": ". Impact of the proposed Lagrangian particle optimiza-tion (LPO) in sparse-view geometric-agnostic system identifica-tion. We aim to identify the geometry and physical properties ofan object from visual observations without any geometric assump-tions in severe (e.g., sparse-view) settings. As shown in (b), astandard PAC-NeRF has difficulty learning the geometry ina sparse-view setting (particularly, when the number of views isthree). Consequently, it also fails to estimate the physical proper-ties (Youngs modulus E and Poissons ratio ). As shown in (c),LPO is useful for correcting this failure and succeeds in improvingthe identification of both geometry and physical properties. erties. For example, to identify the geometry and physicalproperties of an object from the observation that it collideswith the ground, it is necessary to understand not only theappearance and shape change in the geometry but also otherinternal factors in physics which are necessary to explainthis phenomenon without any discrepancies over time.Generally, this problem is ill-posed and challenging toresolve. However, the emergence of powerful geometricrepresentations by neural fields , 2D3D connectionsby neural rendering , and trainable physical simula-tions using differentiable physical simulators provideclues for solving this problem. For instance, previous stud-ies succeeded in estimating physical proper-ties such as velocity, mass, friction, inertia, and elasticitydirectly from video sequences by combining differentiablephysical simulators with differentiable renderers.Although these studies have yielded promising resultsin terms of physical property estimation, their applicabil-ity is restricted by the assumption that the geometric struc-",
  "arXiv:2406.04155v1 [cs.CV] 6 Jun 2024": "ture of a scene is completely known, which makes it dif-ficult to apply them in practical scenarios.To eliminatethis assumption, geometry-agnostic system identification,which is a technique for identifying the geometry and phys-ical properties of an object from visual observations withoutany geometric assumptions, has been studied. Specifically,a pioneering model involves physics-augmented continuumneural radiance fields (PAC-NeRF) , which is an exten-sion of NeRF that is enforced to follow the conserva-tion laws of continuum mechanics. PAC-NeRF obtains thisfunctionality utilizing a hybrid EulerianLagrangian repre-sentation, that is, the geometry (volume density and colorfields) is represented with the Eulerian grid representationsof NeRF , which are transformed into Lagrangian parti-cles in material space, and physical simulation is conductedon the particles using a material point method (MPM) (par-ticularly, differentiable MPM (DiffMPM) ). Becauseall modules are differentiable, PAC-NeRF can be traineddirectly with multi-view video sequences and can optimizethe geometry and physics without explicit supervision.Although PAC-NeRF has enabled the tackling of newtasks, its notable limitation is that its performance is sen-sitive to the learning of the geometry from the first framesof the video sequences owing to its two-step optimization.First, the Eulerian grid representations were trained with thefirst frames of the video sequences, and then the physicalproperties were optimized across the video sequences byutilizing the frozen first-frame grid representations. Thislimitation makes it difficult to apply it to cases in whichgeometry learning is difficult, for example, in a few-shot(sparse-view) setting, as shown in (b).One possible solution is to train the Eulerian grid rep-resentations using all video sequences and not just the firstframe. However, a critical problem with this approach isthat Eulerian grid representations cannot be trained with ex-plicit physical constraints on the particles because they areoptimized in Eulerian (i.e., world or grid) space and can-not reflect all physical phenomena occurring in Lagrangian(i.e., material or particle) space; for example, they cannotpropagate gradients calculated for particle positions.To solve this problem, we propose Lagrangian parti-cle optimization (LPO), in which the positions and features(i.e., volume density and color) of the particles are opti-mized in Lagrangian space and not in Eulerian space. Con-trary to the abovementioned possible solution, this methodallows for the optimization of the geometric structure acrossvideo sequences with explicit physical constraints on theparticles imposed by the MPM. Thus, the gradients calcu-lated for the particle positions are reflected.Furthermore, LPO is useful not only for geometry cor-rection, but also for corrections to the physical identifica-tion because this task is closely related, that is, an accurategeometry is useful for accurately identifying the physicalproperties, and vice versa. This motivated us to utilize thegeometry corrected by LPO to reidentify the physical prop- erties and propose iterative geometryphysics optimizationfor gradually seeking the optimal states. (c) showsthe effectiveness of this method.We evaluated the effectiveness of LPO in sparse-viewsettings. In particular, we first applied LPO to a pretrainedPAC-NeRF and demonstrated that LPO is useful for cor-recting geometric structures through video sequences. Sub-sequently, we employed LPO in iterative geometryphysicsoptimization and demonstrated that LPO contributes to im-proving the performance of physical identification. Abla-tion and comparative studies were conducted to determinethe importance of each component.Our contributions can be summarized as follows: To improve the performance of geometry-agnostic systemidentification, we propose LPO, which optimizes the po-sition and features of the particles in Lagrangian space tooptimize the geometric structures across video sequenceswithin the physical constraints of an MPM.",
  ". Related work": "Neural radiance fields (NeRF). Novel view synthesis isa fundamental problem in computer vision and graphicsand has been addressed in a large body of research. Re-cently, a substantial breakthrough has been achieved withthe emergence of neural fields that represent a scene utiliz-ing a coordinate-based network (e.g., a survey paper ).NeRF is a representative variant of such neural fieldsand has attracted significant attention because of its geo-metric consistency and high-fidelity novel view synthesis.Various studies have been conducted since the emergenceof NeRF. These can be categorized into three topics. (1)Improvements to the image quality and expanding of the ap-plicable settings, such as wild or few-shot settings (e.g., ), (2) speeding up the training or inference speed(e.g., ), and (3) incorporating other modelsor functionalities, such as generative models (e.g., ) and dynam-ics/physics (e.g., ).Among these, this study relates to the first in terms of its ap-plication to few-shot settings. This study relates to the thirdin terms of seeking physics-informed models. As studieson NeRF are benefiting from developments in adjacent cat-egories, applying our ideas to other categories and modelswill be an interesting future research direction.NeRF with dynamics/physics.As mentioned above, NeRFs with dynamics/physics have been actively studied(e.g., ). Thesestudies have one characteristic in common: they learnedtime-varying neural fields from video sequences. These canbe roughly categorized into two models. (1) Non- (or weak)physics-informed models (e.g., ) and (2) physics-informed models (e.g., ).The advantage of the first is that it can be applied to scenesor objects that are difficult to describe physically; however,its disadvantage is that it requires a large amount of trainingdata to learn dynamics from scratch, and the learned rep-resentations are not necessarily interpretable because theyare not based on physics.The advantage of the secondis that it can obtain interpretable representations based onphysics; however, the disadvantage is that its application islimited to physically describable objects or scenes. In par-ticular, physics informed NeRF targets smoke scenesand does not address the boundary conditions; therefore, itcannot handle solid or contact materials. NeuroFluid focuses on fluid dynamics grounding and solves it using anintuitive physics-based approach in which formal instruc-tion in physics is not explicitly defined. In contrast, PAC-NeRF is based on a principled and interpretable phys-ical simulator and can be applied to various materials, in-cluding Newtonian/non-Newtonian fluids, elastic materials,plasticine, and granular media. This study focused on thePAC-NeRF and attempted to widen its applicability whileprioritizing its interpretability. However, a Lagrangian par-ticle representation is commonly utilized in physics (e.g.,NeuroFluid 2); therefore, applying our ideas, that is,LPO, to other models is an interesting research topic.NeRF for few-shot (sparse-view) settings. In practice, it isoften laborious or impractical to collect multi-view images.Recent studies ad-dressed this problem by refining NeRF such that it couldbe applied to few-shot (sparse-view) settings. These meth-ods can be roughly divided into three approaches. (1) Reg-ularization using external models. For example, normal-izing flow -based , VGG -based , depth-based , and CLIP -based regulariza-tions have been proposed. (2) Utilization of general andtransferable models . They are trained usingexternal datasets, and in several studies, they are finetunedfor each scene. (3) Introduction of advanced training meth-ods, such as gradual training to prevent overfitting to sparseviews, including frequency regularization and layer-by-layer growing strategies . Among these categories,the proposed LPO is categorized as the third one, that is, op-timization is conducted for each scene, and external modelsand datasets are not required. The main difference betweenthe LPO and previous methods is that LPO attempts to opti- 2Note that NeuroFluid optimizes the transition probability of particlesunder the assumption that the initial particle positions are known, that is,fixed. In contrast, LPO optimizes the initial particle positions to correctthe geometry estimation of the first frames. Therefore, NeuroFluid andLPO are complementary. mize geometric structures through video sequences with thephysical constraints of an MPM. However, previous studieshave not sufficiently considered these constraints. Owing tothis difference in applications, the proposed method is com-plementary to, rather than competitive with, other methods.System identification of soft bodies. Soft bodies are notonly high-dimensional, but also allow large deformations;therefore, it is challenging to identify their geometry andphysical properties. Typical methods can be categorizedinto three types. (1) Gradient-free methods , (2)neural network-based methods , and (3) dif-ferentiable physics-simulation-based methods . The strength of the methods in thefirst and second categories is that they are flexible; how-ever, they have difficulty achieving a high accuracy owingto their black-box modeling. Methods in the third categoryrequire sophisticated modeling to fill the gap between sim-ulations and the real world; however, they have recentlydemonstrated promising results owing to advancements indifferentiable physical simulators. The third category canbe further divided into two subcategories. (i) Methods thatassume that watertight geometric mesh representations ofobjects are available and (2) meth-ods that do not assume this . Among these meth-ods, we focused on the final category, PAC-NeRF ,which prioritizes general and fast characteristics. Specifi-cally, PAC-NeRF adopts an MPM that can be applied to var-ious materials, including fluids , sand , foam ,and elastic objects . In particular, PAC-NeRF utilizesDiffMPM to construct a fully differentiable simulationrendering system. This study is based on this advancement.In particular, sensitivity to geometry learning from the firstframes is one of the bottlenecks of PAC-NeRF. Therefore,this study focused on alleviating this bottleneck and at-tempted to widen its applicability to severe (e.g., sparse-view) settings.",
  ". Optimization pipelines of PAC-NeRF (1)(2) and the proposed LPO (3)": "r(s) R3 is a camera ray defined as r(s) = o + sd, whereo R3 is the camera origin, d S2 is the view direction,and s [sn, sf] is a distance from the camera origin. Dur-ing training, r is sampled from a set of ray collections inthe training data, that is, R. t R+ is a time variable, andduring training, it is sampled from {t0, . . . , tN1}, whereN is the number of frames. Given these training data, weattempt to (1) predict the color observation C(r, t) that canrecover C(r, t) from the training data and those for novelviews, and (2) identify the physical properties. In partic-ular, to widen its applicability, we addressed a scenario inwhich input views are sparse, that is, R is limited.",
  ". Preliminary: PAC-NeRF": "To solve the abovementioned problem, PAC-NeRF employsthree core components: a continuum NeRF, particle-grid in-terconverters, and a Lagrangian field.Continuum NeRF. PAC-NeRF extends a standard (static)NeRF to a continuum NeRF to address the dynamics of continuum materials. To achieve this, a standard NeRF isfirst extended to a dynamic NeRF for dynamic scenar-ios. In a dynamic NeRF, the volume density and color fieldsfor point x and view direction d are defined as (x, t) andc(x, d, t), respectively, where the time variable t is intro-duced to represent the dynamics. The color of each pixelC(r, t) is calculated using volume rendering",
  "Dt = T + g,(5)": "where is the physical density field, T is the internalCauchy stress tensor, and g is the acceleration of gravity.This equation is solved using DiffMPM .Particle-grid interconverters. As shown in (1)(2),in PAC-NeRF, a physical simulation is conducted in La-grangian particle space using DiffMPM , whereas neu-ral rendering is performed in Eulerian grid space with adiscretized voxel-based NeRF . To bridge these twospaces, grid-to-particle (G2P) and particle-to-grid (P2G)conversions are conducted.",
  "p wip,(6)": "where F is a field (e.g., volume density or color field); Pand G denote particle and grid views, respectively; p and iindicate the index of the particle and grid node, respectively;and wip is the weight of the trilinear shape function definedon i and evaluated at p.Lagrangian field. As shown in (1), during train-ing, the Eulerian voxel field FG(t0) is optimized for thefirst frames of the video sequences. Subsequently, this fieldis converted into a Lagrangian particle field FP (t0) usingG2P, in which the positions of the particles are determinedby random sampling around voxel grids. The geometricshape is represented in Lagrangian space by removing theparticles whose alpha values are small, that is, the remain-ing particles represent the shape of the object. As shownin (2), the particle field in the next step, that is,FP (t1), where t1 = t0 + t and t is the duration of thesimulation time step, is calculated based on FP (t0) usingDiffMPM .After this process, FP (t1) is convertedto the Eulerian voxel field FG(t1) using P2G, and pixelsare rendered based on this field using voxel-based volumerendering , in which the volume density and color of apoint at position x are rendered as follows:",
  ". Geometric correction with LPO": "As explained above, in PAC-NeRF, the Eulerian voxel fieldsFG(t0) are optimized for the first frames of the video se-quences ((1)). These are fixed while optimizingthe physical properties using video sequences ((2)).This approach is problematic when the learning of the Eu-lerian voxel field from the first frames is difficult, for exam-ple, in sparse-view settings, because failure of this learningcannot be corrected after the process. This also means thatin dynamic scenes, information over time is useful for cov-ering a lack of information owing to sparse views; however,this approach cannot utilize this information to optimize thevolume density and color.One possible solution is to train FG(t0) with the en-tire video sequence and not just the first frame. However,in this approach, the optimization targets are limited to thevolume density and color of the grids; therefore, it is diffi-cult to reflect the physics-based optimization that occurs inLagrangian particle space.4 This can cause excessive mod-ification of the geometry beyond physical constraints.Alternatively, we developed Lagrangian particle opti-mization (LPO), in which the geometric structure is opti-mized not in Eulerian grid space but in Lagrangian par-ticle space ((3)). More formally, in the Eulerianvoxel grid optimization, volume density and color fields ofthe grids are optimized for the fixed voxel grid. In contrast,in LPO, not only the volume density and color fields of theparticles, that is, P and cP , but also the particle position,that is xP , are optimized.5 Because xP is defined in La-grangian space, it can reflect the physical constraints of theMPM. Consequently, we can optimize the geometric struc-tures within the physical allowance.",
  ". Physical identification with LPO": "Identifying both the geometry and physical properties fromlimited observations is ill-posed and challenging becausethere is a chicken-and-egg relationship between the geomet-ric structure and the physical properties, that is, accurate ge-ometry estimation is necessary for accurate physical identi-fication and vice versa. Considering that particle-based geo-metric correction is highly challenging when there is a largegap between the ground truth and the predicted pixels owingto the high-dimensional nature (e.g., in extreme cases, par-ticles can diverge), in practice, we apply LPO after physicalproperty optimization, as shown in .However, an interesting question is whether the cor-rected geometric structures can be utilized to improve the 4More precisely, as explained in .2, particles are randomlysampled around equally spaced voxel grids, and the Eulerian voxel fields(precisely, alpha values calculated from them) are utilized to mask themwith a non-differentiable way. Consequently, gradients calculated for theparticle positions cannot propagate to FG(t0).5Note that the values of P and cP are changed in training but theyare time-invariant, i.e., have the same values across sequences. Therefore,the conservation laws (Equation (4)) are preserved.",
  ": end for": "identification of the physical properties. We developed it-erative geometryphysics optimization (Algorithm 1) to an-swer this question. As described above, we first conductPAC-NeRF optimization ((1) and (2)) and then apply LPO(3). Subsequently, we render the images in the first framebased on the updated P , cP , and xP (4). We denote themas C(r, t0), where r R and R is designed such that itcovers the missing area in R in the training data. We re-train PAC-NeRF from scratch using the combination of theoriginal C(r, t0) and synthesized C(r, t0) as training data.Specifically, to alleviate the negative effect caused by in-complete geometry correction, which can occur at the be-ginning of the iterative calculation, we only utilize C(r, t0)for the Eulerian static voxel grid optimization and do notutilize it to optimize the physical properties and particles.Another possible solution is to update the voxel grids byapplying P2G to the updated P , cP , and xP instead of (4)and (1). However, we found that the repeated utilizationof G2P and P2G tends to produce artifacts (such as thosetypically occurring in the erosion process) owing to theirapproximate nature (Equation (6)).6 Therefore, the full re-calculation approach described above was adopted.",
  "Two experiments were conducted to investigate the effec-tiveness of the proposed LPO. First, we evaluated the effec-": "6A similar phenomenon was observed in the original study on PAC-NeRF . Based on this observation, they rendered an image in the firstframe by utilizing the voxel grids obtained after the P2G and G2P con-versions, that is, FG(t0), instead of the original voxel grids FG(t0) tomake the rendering conditions the same as those in other frames. tiveness of LPO for geometric correction (.2) andthen we investigated the utility of LPO for physical identifi-cation (.3). The main results of these experimentsare presented here, and the detailed analyses, extended re-sults, and implementation details are provided in the Ap-pendices. Video samples are available at the project page.1",
  "In this section, we provide the experimental setup commonto both experiments and other setups in subsequent sections": "Dataset.We investigated the benchmark performanceon the dataset provided by the original study on PAC-NeRF .7This dataset comprised nine scenes andvarious continuum materials, including Newtonian fluids(Droplet and Letter with fluid viscosity and bulk modu-lus ), non-Newtonian fluids (Cream and Toothpaste withshear modulus , bulk modulus , yield stress Y , andplastic viscosity ), elastic materials (Torus and Bird withYoungs modulus E and Poissons ratio ), plasticine (Play-doh and Cat with E, , and Y ), and granular media (Tro-phy with friction angle fric). In each scene, the objects fallfreely under the influence of gravity and undergo collisions.The ground-truth simulation data were generated using theMLS-MPM framework . A photorealistic simulationengine rendered objects under diverse environmental light-ing conditions and ground textures. Each scene was cap-tured from 11 viewpoints with cameras evenly spaced onthe upper hemisphere, including the object. To evaluate ourmethod under sparse-view settings, three views were usedfor training and the remaining eight views were used fortesting. To show the robustness to the view settings, we pro-vide the results for the other view settings in Appendix C. Assumptions and preprocessing. For a fair comparison,we follow the assumptions and preprocessing used in PAC-NeRF . It was assumed that the intrinsic and extrin-sic parameters of the set of static cameras were previouslyknown. Moreover, it was assumed that collision objects,such as the ground plane, were previously known. As men-tioned in , this is not difficult to estimate from the ob-served images. For preprocessing, a video matting frame-work was applied to remove static background objectsand focus the rendering on the target object.",
  ". Evaluation of geometric correction": "Compared models. In the first experiment, we investigatedthe effectiveness of LPO on the geometric correction (i.e.,the method described in .3). Three models wereused as the baseline. (I) PAC-NeRF was the same as thatin the original and was trained with all views, includ-ing the eight views that were used for testing. We examinedthis model to determine the upper bound of its performance.(II) PAC-NeRF-3v was trained using three views. The train-ing settings were the same as those for (I) except that the 7Note that although only one dataset was used, this dataset is usefulfor assessing the versatility because it includes a wide variety of materials,surpassing the scope of previous studies (e.g., elastic objects only in ).",
  ". Comparison of PSNR, SSIM, and LPIPS on geometric correction. The scores for each scene are provided in inAppendix B. The qualitative comparisons are provided in Figures 37 in Appendix D": "number of views varied. (III) PAC-NeRF-3v was an im-proved variant of (II) for sparse-view settings. An interest-ing question is whether LPO, which is a few-shot learningmethod for dynamic scenes, can be used with other few-shot learning methods, such as those for static scenes. Toanswer this question, we adjusted the Eulerian static voxelgrid optimization ((1)) of PAC-NeRF-3v, such thatit became robust to sparse views. Specifically, we sched-uled a surface regularizer to reduce unexpected artifacts, in-troduced a view-invariant pixel-wise loss to compensate forthe lack of views, and adjusted the training length to pre-vent overfitting. Details are provided in Appendix A.8 Weapplied LPO to both (II) and (III) to investigate the effectof the initial Eulerian static voxel grid optimization. Here-after, we denote these variants by +LPO. Furthermore, threecomparative and ablation models were evaluated to deter-mine the importance of each component. (i) +LPO-F and(ii) +LPO-P are variants of LPO, in which only the fea-tures and positions of the particles are optimized. (iii) +GOoptimized Eulerian voxel grids through the entire video se-quence instead of using Lagrangian particles. (i)(iii) areused as alternatives to +LPO. These variants were appliedto both (II) and (III). Evaluation metrics. We evaluated the performance of thegeometric correction using metrics commonly used to as-sess the performance of novel view synthesis in NeRF stud-ies: the peak signal-to-noise ratio (PSNR), structural sim-ilarity index measure (SSIM) , and learned perceptualimage patch similarity (LPIPS) . In particular, we cal-culated the scores using all test data over time. Results. The results are summarized in . Our find-ings are threefold. (1) PAC-NeRF-3v/3v vs. +LPO. +LPOimproved both baselines in terms of all metrics. In partic-ular, the utility of +LPO for PAC-NeRF-3v indicates animprovement in the Eulerian static voxel grid optimizationand that of LPO are complementary. (2) +LPO vs. +LPO-F/P. We found that +LPO was superior or comparable to+LPO-F/P. This is because the feature and position opti-mizations are complementary. Intuitively, feature optimiza-tion is useful for correcting features of the appearance thatare invisible in the first frame but visible after the object 8In the preliminary experiments, we examined the previous representa-tive few-shot learning methods (e.g., DietNeRF and FreeNeRF ).However, we found that they were less stable than PAC-NeRF-3v, possi-bly because in our experimental settings, the number of views was small(three) despite the wide range of the views (upper hemisphere), and explicitvoxel representations were more useful than the fully implicit representa-tion in . However, this study and previous studies are complemen-tary. Further investigations will be important in future work. has moved. Similarly, position optimization is effective forcorrecting features of the shape that are invisible in the firstframe but visible after the object has moved. In severe (e.g.,sparse-view) settings, the utilization of both is important.(3) +LPO vs. +GO. +LPO outperforms +GO, possibly be-cause +LPO can optimize the geometry adequately withinthe physical constraints of the MPM, whereas +GO cannotbecause of the absence of an explicit physical constraint.",
  ". Evaluation of physical identification": "Compared models. In the second experiment, we verifiedthe usefulness of LPO for physical identification (i.e., themethod described in .4). In addition to the modelsdescribed in .2, we examined +None, for whichiterative optimization (Algorithm 1) was conducted with-out geometric correction (i.e., Step (3) was skipped). Thismodel was used to investigate the importance of geometriccorrection. For a fair comparison, we set the number of it-erations (i.e., R in Algorithm 1) to four for all models. Weuse the superscript 4 (e.g., +LPO4) to specify this.Evaluation metrics. To evaluate the performance of thephysical identification, we measured the absolute distancebetween the ground truth and the estimated physical proper-ties. For an easy comparison, we calculated these distancesafter adjusting the scale (i.e., either a logarithmic scale ora linear scale) following the study of PAC-NeRF . Thesmaller the values, the better was the performance.Results.The results are summarized in .Ourfindings are fourfold. (1) PAC-NeRF-3v/3v vs. +LPO4.+LPO4 improved the physical identification of PAC-NeRF-3v/3v in most cases.In particular, the effectiveness of+LPO4 for PAC-NeRF-3v indicates that the improvementin the Eulerian static voxel grid optimization and that ofLPO are complementary for physical identification.(2)+LPO4 vs.+LPO-F4/P4.In some cases, superioritydepends on the physical properties because the physicalproperties interact with each other, and finding the opti-mal balance is difficult. However, we found that +LPO-F4/P4 sometimes had obvious difficulties (e.g., PAC-NeRF-3v+LPO-F4 on Bird and PAC-NeRF-3v+LPO-P4 on Play-doh), whereas +LPO4 exhibited good stability. We con-sider that the joint optimization of the features and positionsis useful for tackling difficult situations.(3) +LPO4 vs.+GO4. +GO4 experienced difficulties in some cases (e.g.,on Bird). +LPO4 exhibited a more stable performance. (4)+LPO4 vs. +None4. +None4 sometimes worsened the per-formance. The results indicated that simple iterations wereinsufficient and that geometric correction was essential.",
  "Trophyfric [rad]0.0480.0530.0550.0510.0560.0570.0540.0300.0390.0410.0430.0440.039": ". Comparison of the absolute differences between the ground-truth and the estimated physical properties on physical identification.The smaller the values, the better was the performance. The values of the physical properties (i.e., not the absolute differences) are providedin Tables 6 and 7 in Appendix B. The qualitative comparisons are presented in Figures 39 in Appendix D.",
  ". Comparison of PSNR, SSIM, and LPIPS on geo-metric recorrection. The scores for each scene are provided in in Appendix B. The qualitative comparisons are providedin Figures 39 in Appendix D": "Applications. As mentioned above, there is a chicken-and-egg relationship between the geometric structure and phys-ical properties. An interesting question is whether the cor-rected physical properties can be used to reestimate the ge-ometry (the opposite problem). To answer this question, weinvestigated the geometry identification performance afterphysical identification. The results are summarized in Ta-ble 3. These results indicate that accurate physical identi-fication is useful for improving the geometry identificationperformance.",
  "The calculation time of LPO ((3)) is almost identical to thatof the main process of physical property optimization ((2)) be-cause the forward and backward processes are identical with different op-": "tion 3.4).10 However, it is not trivial to obtain robustness tosparse views only by increasing the training time becauseoverfitting is a typical factor that causes learning to fail.(2) LPO is sensitive to the state before applying LPO (e.g.,either PAC-NeRF-3v or -3v) because solving geometry-agnostic system identification in sparse-view settings is ill-posed and challenging. We believe that the advancementsin previous few-shot learning methods () and thenewly introduced few-shot learning method with physicalconstraints (LPO) will solve this problem.",
  ". Conclusion": "We proposed LPO to improve PAC-NeRF-based geometric-agnostic system identification.Our core idea is to opti-mize the geometry not in Eulerian space but in Lagrangianspace, utilizing the particles to directly reflect the physicalconstraints of an MPM. The results demonstrate that LPOis useful for both geometric correction and physical identifi-cation. Although we focused on PAC-NeRF while prioritiz-ing its high generality, Lagrangian particles are commonlyemployed in physics-informed models (e.g., several studiesdiscussed in ). We expect that our ideas can beutilized in other models or tasks. timization targets. Similarly, the calculation times for +LPO-F, +LPO-P,and +GO were almost identical to those for +LPO, indicating that the im-provement was attributable to the ingenuity of the algorithm and not to anincrease in the calculation cost. The computation times are discussed indetail in Appendix B.2.10The total computation time increases linearly when running Algo-rithm 1 repeatedly but is adjustable under a quality-and-time trade-off asdiscussed in Appendix B.3.",
  "Eric R. Chan, Marco Monteiro, Petr Kellnhofer, Jiajun Wu,and Gordon Wetzstein. pi-GAN: Periodic implicit genera-tive adversarial networks for 3D-aware image synthesis. InCVPR, 2021. 2": "Eric R. Chan, Connor Z. Lin, Matthew A. Chan, KokiNagano, Boxiao Pan, Shalini De Mello, Orazio Gallo,Leonidas J. Guibas, Jonathan Tremblay, Sameh Khamis,Tero Karras, and Gordon Wetzstein.Efficient geometry-aware 3D generative adversarial networks. In CVPR, 2022.2 Eric R. Chan, Koki Nagano, Matthew A. Chan, Alexander W.Bergman, Jeong Joon Park, Axel Levy, Miika Aittala, ShaliniDe Mello, Tero Karras, and Gordon Wetzstein. Generativenovel view synthesis with 3D-aware diffusion models. InICCV, 2023. 2",
  "Lingjie Liu, Jiatao Gu, Kyaw Zaw Lin, Tat-Seng Chua, andChristian Theobalt. Neural sparse voxel fields. In NeurIPS,2020. 2": "Pingchuan Ma, Tao Du, Joshua B. Tenenbaum, WojciechMatusik, and Chuang Gan. RISP: Rendering-invariant statepredictor with differentiable simulation and rendering forcross-domain parameter estimation. In ICLR, 2022. 1, 3 Ricardo Martin-Brualla, Noha Radwan, Mehdi S. M. Sajjadi,Jonathan T. Barron, Alexey Dosovitskiy, and Daniel Duck-worth. NeRF in the wild: Neural radiance fields for uncon-strained photo collections. In CVPR, 2021. 2",
  "Tetsuya Takahashi and Ming C. Lin. Video-guided real-to-virtual parameter transfer for viscous fluids.ACM Trans.Graph., 38(6), 2019. 3": "Ayush Tewari, Justus Thies, Ben Mildenhall, Pratul P. Srini-vasan, Edgar Tretschk, Yifan Wang, Christoph Lassner,Vincent Sitzmann, Ricardo Martin-Brualla, Stephen Lom-bardi, Tomas Simon, Christian Theobalt, Matthias Niener,Jonathan T. Barron, Gordon Wetzstein, Michael Zollhoefer,and Vladislav Golyanik.Advances in neural rendering.Comput. Graph. Forum, 41, 2022. 1 Edgar Tretschk, Ayush Tewari, Vladislav Golyanik, MichaelZollhofer, Christoph Lassner, and Christian Theobalt. Non-rigid neural radiance fields: Reconstruction and novel viewsynthesis of a dynamic scene from monocular video.InICCV, 2021. 2, 3",
  "In the experiments (), we used PAC-NeRF-3v": "as the stronger baseline. PAC-NeRF-3v is an improvedvariant of PAC-NeRF-3v for sparse-view settings in whichEulerian static voxel grid optimization ((a)) is im-proved.We examined this model to determine whetherthe proposed LPO, a few-shot learning method for dynamicscenes, can be combined with other few-shot learning meth-ods, such as those for static scenes.11 This appendix ex-plains the details of the model. PAC-NeRF-3v adopts threemodifications: scheduling a surface regularizer, introduc-ing view-invariant pixel-wise loss, and adjusting the train-ing length.",
  ",(9)": "where p indicates the alpha value of a particle with length1 and is calculated as p = 1exp(softplus(p)), wherep denotes the volume density of the particle. This regu-larizer minimizes the total surface area, making the spreadof the particles more compact and tightening their shapes.Consequently, the quality of the reconstructed geometriesimproved .In a preliminary experiment, we found that this regu-larizer was also effective in eliminating unexpected massesthat tend to appear in places where there are few clues ow-ing to the lack of views. However, we also found that thisregularizer has a side effect: it removes necessary compo-nents when it is too strong. Based on these observations, wescheduled this regularizer.1. At the beginning of the training, the weight of Lsurf isinitialized to a default value of PAC-NeRF .",
  ". From the beginning of the training, the weight of Lsurfis gradually increased for a certain period of time": "3. After a certain period, the weight of Lsurf is graduallydecreased until it reaches the default value.We do not impose a large weight on Lsurf from the begin-ning of the training (Step 1) because it can eliminate all par-ticles, leading to learning none object. We decreased the 11As described in the footnote of the main text,8 in preliminary exper-iments, we found that previous representative few-shot learning methods(for example, DietNeRF and FreeNeRF ) were less stable thanthe standard PAC-NeRF-3v. This is possible because, in our experimentalsettings, the number of views was small (three) despite the wide range ofviews (upper hemisphere), and explicit voxel representations were moreeffective than the fully implicit representation in . Therefore, weused an improved variant that we developed. However, this study and pre-vious studies are not competitive but complementary. Therefore, furtherinvestigation is important. weight of Lsurf in Step 3 to alleviate the negative effectscaused by the introduction of strong regularization.Implementation details.In the experiments, we doubledthe weight of Lsurf in Step 2 every 100 iterations until theweight reached eight times its default value. In Step 3, wehalved the weight of Lsurf each time the resolution of voxelgrids was scaled. This halving process was conducted threetimes; therefore, the weight of Lsurf returned to the defaultvalue when all halving processes were finished.View-invariant pixel-wise loss. In sparse view settings,it is challenging to distinguish view-dependent from view-independent factors because there are few clues. Specifi-cally, in NeRF (mainly, voxel-based NeRF ), theview-dependent and view-independent factors (i.e., colors)are represented by a multilayer perceptron (MLP), whichadditionally receives a view direction d, and color fieldscG that do not receive d, respectively (Equation (8)). Insparse-view settings, dividing the roles between the MLPand cG is not trivial. In extreme cases, the MLP can over-fit specific views in the training data (in such cases, cG nolonger plays an essential role in representing colors), mak-ing it difficult to represent colors in novel views. To allevi-ate this difficulty, we introduce a view-invariant (VI) pixel-wise loss LV Ipixel, which is a variant of the pixel-wise lossLpixel (Equation (3)) where the color of a sample on a ray,i.e., c, is calculated by the following equation instead ofEquation (8)",
  "c(x, d, t) = MLP(interp(x, cG), d),(10)": "where d S2 denotes the view direction randomly sampledfrom a unit sphere. Here, we use c to denote c and distin-guish it from the original c. This loss encourages MLP andcG to capture the colors of the training images independentof the viewing direction. Consequently, the model makes itpossible to avoid extreme cases (i.e., it mitigates the MLPto overfit specific views in the training data and prevents cG",
  "Lpixel = Lpixel + LV Ipixel,(11)": "where is a hyperparameter balancing the two losses. Dur-ing training, Lpixel was used instead of Lpixel.Implementation details. We set = 0.1 in the experiments.Adjustment of training length. As discussed in previousstudies , one of the factors that make learning dif-ficult in few-shot settings is overfitting to sparse views inthe training data, causing a loss of generalization ability. Inpreliminary experiments, we observed a similar tendencyin our settings. Based on this observation, we adjusted thetraining length (TL). In particular, the number of iterationswas reduced. Despite its simplicity, we empirically foundthat this solution works well in severe view settings (e.g.when the number of views is three).",
  "AveragePSNR27.4328.9428.6228.2727.85SSIM0.9780.9800.9800.9790.979LPIPS0.0360.0330.0360.0350.034": ". Comparison of PSNR, SSIM, and LPIPS on static voxel grid optimization. The scores are calculated for the first framesof the video sequences in the test set. Here, PAC-NeRF-3V (b), an improved variant of PAC-NeRF-3v, is compared with the originalPAC-NeRF-3v (a) and the ablated models, including PAC-NeRF-3V without scheduling of Lsurf (c), that without LV Ipixel (d), and thatwithout adjustment of TL (e). PAC-NeRF-3V (b) achieved the 20 best and five second-best scores among 27 evaluation items. Implementation details. In the experiments, we reduced thenumber of iterations to one-third; the default number (6000)was reduced to 2000. Based on this change, we reduced thetiming of scaling the resolution of voxel grids by one-third.",
  "B. Detailed analyses on main experiments": "The main text focuses on representative results because ofspace limitations. This appendix provides the extended re-sults that further clarify the effectiveness of the proposedmethod.In particular, we provide the scores for eachscene (Appendix B.1), discuss the computation times (Ap-pendix B.2), and discuss the impact of the number of itera-tions in Algorithm 1 (Appendix B.3).",
  "B.1. Scores for each scene": "In this appendix, we provide the scores for each scene. Toevaluate the effectiveness of the proposed method from vari-ous perspectives, we describe three experiments in the maintext. (I) Evaluation of the geometric correction (),where the image quality after LPO was applied once, wasevaluated. (II) Evaluation of the physical identification (Ta-ble 2), in which the accuracy of the physical property esti-mation after Algorithm 1 was applied, was evaluated. (III)Evaluation of the geometric recorrection (), in whichthe image quality after Algorithm 1 was applied, was eval-uated. In this appendix, we discuss these issues in detail.",
  ". Comparison of PSNR, SSIM, and LPIPS for each scene on geometric correction. This table is an extended version of .The qualitative comparisons are provided in Figures 37": "the scores for each scene on geometric correction (imagequality after LPO was applied once) in detail. sum-marizes the results. This is an extension of the list in Ta-ble 1. We discuss the results from three perspectives. (1) PAC-NeRF-3v/3v vs. +LPO. When PAC-NeRF-3v wasused as the baseline, +LPO outperformed the baseline inmost cases (21 wins, 5 draws, and 1 loss). Similarly, whenPAC-NeRF-3v was used as the baseline, +LPO outper-formed the baseline in most cases (20 wins, 5 draws, and2 losses). Consequently, in both cases, +LPO yielded betteraverage scores for all metrics. These results demonstratethat +LPO is effective for geometric correction indepen-dent of the baseline models. The qualitative comparisonsare shown in Figures 37. (2) +LPO vs. +LPO-F/P. +LPO-F and +LPO-P are ablatedvariants of +LPO. In +LPO-F, position (shape) optimiza-tion is ablated, and only feature (appearance) optimizationis conducted. In +LPO-P, feature (i.e., appearance) opti-mization is ablated, and only position (i.e., shape) optimiza-tion is conducted. +LPO outperformed +LPO-F/P in mostcases when both PAC-NeRF-3v and PAC-NeRF-3v wereused as the baselines.Specifically, when PAC-NeRF-3vwas used as the baseline, +LPO outperformed +LPO-F with20 wins, 4 draws, and 3 losses and outperformed +LPO-P",
  "with 15 wins, 10 draws, and 2 losses. When PAC-NeRF-3v": "was used as the baseline, +LPO outperformed +LPO-F with17 wins, 8 draws, and 2 losses, and outperformed +LPO-Pwith 12 wins, 13 draws, and 2 losses, respectively. Between+LPO-F and +LPO-P, +LPO-P tends to outperform +LPO-F. Specifically, when PAC-NeRF-3v was used as the base-line, +LPO-P outperformed +LPO-F with 17 wins, 5 draws,and 5 losses. When PAC-NeRF-3v was used as the base-line, +LPO-P outperformed +LPO-F with 13 wins, 9 draws,and 5 losses. We consider this because shape correctionby +LPO-P can correct the failure estimation of the geome-try within the physical constraints of MPM. In contrast, ap-pearance correction by +LPO-F cannot do so and can causeovercorrection beyond the physical constraints, as shown in. These results indicate that the feature and positionoptimizations are complementary rather than competitive. (3) +LPO vs. +GO. The difference between these two mod-els is that +LPO conducts optimization in Lagrangian parti-cle space and can optimize not only the features but also thepositions of the particles, whereas +GO performs optimiza-tion in Eulerian grid space and can optimize the featuresof the grids, but cannot optimize their positions. Owing tothese characteristics, the performance of +GO is close tothat of +LPO-F, which also optimizes the features but not",
  ". Comparison of PSNR, SSIM, and LPIPS for each scene on geometric recorrection. This table is an extended version of. The qualitative comparisons are provided in Figures 39": "the positions.12 Specifically, when PAC-NeRF-3v was usedas the baseline, +LPO outperformed +GO with 18 wins, 5draws, and 4 losses. When PAC-NeRF-3v was used as thebaseline, +LPO outperformed +GO with 16 wins, 6 draws,and 5 losses. These results confirm the importance of posi-tion optimization in the +LPO. II. Evaluation of physical identification. Next, we discussthe scores for each scene for physical identification (the ac-curacy of the physical property estimation after Algorithm 1was applied) in detail. in the main text summarizesthe absolute differences between the ground truth and theestimated physical properties. Tables 6 and 7 summarizethe physical property values when PAC-NeRF-3v and PAC-NeRF-3v were used as the baselines, respectively. Theseresults are discussed from four perspectives. (1) PAC-NeRF-3v/3v vs. +LPO4. +LPO4 improved thephysical identification of PAC-NeRF-3v/3v in most cases.Specifically, when PAC-NeRF-3v was used as the baseline,+LPO4 outperformed the baseline for 21 of the 23 evalu-ation items. When PAC-NeRF-3v was used as the base- 12The main differences between these two models are that, in +LPO-F, the positions of particles are fixed during training, while in +GO, thepositions of particles are changed in each iteration by random sampling(note that they are not trainable). line, +LPO4 outperformed the baseline for 21 of 23 evalua-tion items. These results indicate that +LPO is effective forphysical identification independent of the baseline models.The qualitative comparisons are shown in Figures 37. (2) +LPO4 vs. +LPO-F4/P4. When comparing these mod-els, we found that superiority depends on the physical prop-erties. This is because the physical properties interact, andfinding the optimal balance for performance is challeng-ing. However, +LPO-F4/P4 sometimes encountered appar-ent difficulties. For example, the difference in log10(E) andthat in on Bird was large when +LPO-F4 was used withPAC-NeRF-3v and the difference in log10(E) on Playdohwas large when +LPO-P4 was used with PAC-NeRF-3v.In contrast, +LPO4 exhibited stable performance. Owingto this stability, +LPO4 outperformed +LPO-F4 and +LPO-P4 in most cases. Specifically, when PAC-NeRF-3v wasused as the baseline, +LPO4 outperformed +LPO-F4 for 18items and outperformed +LPO-P4 for 17 of the 23 evalua-tion items. When PAC-NeRF-3v was used as the baseline,+LPO4 outperformed +LPO-F4 for 13 items and outper-formed +LPO-P4 for 16 of the 23 evaluation items. Theseresults indicate that the joint optimization of features andpositions in Lagrangian space is useful for obtaining stabil-ity and tackling difficult situations. (3) +LPO4 vs. +GO4. +GO4 also sometimes suffers fromcritical difficulties. For example, the difference in log10(E)and that in on Bird was large when +GO4 was used withPAC-NeRF-3v. In contrast, +LPO4 exhibited stable perfor-mance and outperformed +GO4 in most cases. Specifically,when PAC-NeRF-3v was used as the baseline, +LPO4 out-performed +GO4 for 18 of the 23 evaluation items. WhenPAC-NeRF-3v was used as the baseline, +LPO4 outper-formed +GO4 for 18 of the 23 evaluation items. (4) +LPO4 vs.+None4.+None4 is outperformed bythe dynamic optimization methods (i.e., +LPO4, +LPO-F4,+LPO-P4, and +GO4) in most cases. In particular, whenPAC-NeRF-3v was used as the baseline, +LPO4 outper-formed +None4 for 20 of the 23 evaluation items. WhenPAC-NeRF-3v was used as the baseline, +LPO4 outper-formed +None4 for 19 of the 23 evaluation items. Theseresults indicate that simple iterative updates without geo-metric correction in Algorithm 1 are insufficient to improvephysical identification and that it is crucial to correct geo-metric structures using a dynamic optimization method. III. Evaluation of geometric recorrection.Finally, wediscuss the scores for each scene in the geometry recorrec-tion (image quality after Algorithm 1 was applied) in de-tail. summarizes these results. This is an extensionof the results in . We observed tendencies similarto those for geometry correction. Specifically, +LPO4 out-performed not only the baselines (PAC-NeRF-3v and PAC-NeRF-3v) but also the ablated and comparative models, in-cluding +LPO-F4, +LPO-P4, +GO4, and +None4, in mostcases. These results indicate that joint optimization of thefeatures and positions of particles in Lagrangian space isessential not only when geometric correction is conductedonce but also when geometric correction is repeatedly con-ducted along with physical reidentification through Algo-rithm 1.Qualitative comparisons of PAC-NeRF-3v/3v,+LPO, and +LPO4 are shown in . Qualitativecomparisons of +LPO4, +LPO-F4, +LPO-P4, +GO4, and+None4 are presented in Figures 8 and 9.",
  "B.2. Computation times": "lists the computation times for executing Algo-rithm 1 for one iteration on Droplet with PAC-NeRF-3v+LPO.13 The total computation time increases linearlywhen repeatedly running Algorithm 1. However, it is ad-justable under a quality-and-time trade-off, as discussed inAppendix B.3. The computation time of LPO (3) is almostidentical to that of the main process of physical propertyoptimization (2-c) because the forward and backward pro-cesses are identical with different optimization targets, asshown in Figures 2(2) and (3). Similarly, the calculationtimes for +LPO-F, +LPO-P, and +GO were almost identical",
  "B.3. Impact of the number of iterations": "In the main experiments, we fixed the number of iterationsin Algorithm 1, that is, R, to four for simplicity and faircomparison. However, it is interesting and important to in-vestigate how the number of iterations affects performance.To answer this question, we analyze the impact of the num-ber of iterations in this appendix. Results. summarizes the performance changeswith geometry (re)correction when the number of iterationswas changed. This table calculates the scores using the im-ages in the test set. lists the scores calculated usingimages in the training set. We investigated these two casesto examine the trade-off between the feasible reconstructionof the training data and the generalization ability for the testdata. presents the performance changes with phys-ical identification when the number of iterations is changed.When PAC-NeRF-3v was used as the baseline, the per-formances for geometry (re)correction (for both the test andtraining sets) and physical identification were the best whenthe number of iterations was four in most cases. Specifi-cally, as listed in , 6, 8, 13, and 18 itmes achievedthe best scores among the 27 evaluation items when thenumber of iterations was one, two, three, and four, respec-tively, for geometry (re)correction for the test set. Whenscores were the same, they were counted multiple times. Aslisted in , 1, 3, 11, and 25 items achieved the bestscores among the 27 evaluation items when the number ofiterations was one, two, three, and four, respectively, forgeometry (re)correction for the training set. As listed in Ta-ble 12, 2, 3, 3, and 16 items achieved the best scores amongthe 23 evaluation items when the numbers of iterations wereone, two, three, and four for physical identification.In contrast, when PAC-NeRF-3v was used as the base-line, the performance of the geometry (re)correction for thetest set was the best when the number of iterations wasthree, whereas that for the training set was the best whenthe number of iterations was four. The performance of thephysical identification was the best when the number ofiterations was three or four. Specifically, as listed in Ta-",
  ". Comparison of PSNR, SSIM, and LPIPS on geometric (re)correction when the number of iterations in Algorithm 1 ischanged. The scores were calculated using the images in the test set": "ble 10, 5, 10, 15, and 10 items achieved the best scoresamong the 27 evaluation items when the number of itera-tions was one, two, three, and four, respectively, for geome-try (re)correction for the test set. As listed in , 0, 4,14, and 26 items achieved the best scores among the 27 eval-uation items when the number of iterations was one, two,three, and four, respectively, for geometry (re)correctionfor the training set.As listed in , 1, 4, 7, and11 items achieved the best scores among the 23 evaluationitems when the numbers of iterations were one, two, three,and four for physical identification. We consider that these differences arise from differencesin the initial static voxel grids. PAC-NeRF-3v had bet-ter static voxel grids; therefore, fewer updates were re-quired to obtain the best performance (i.e., optimal geomet-ric structures). Note that it is generally not trivial to de-termine when to stop iterative updates because there is anintractable trade-off between faithful reproduction of train-ing data and overfitting. When PAC-NeRF-3v was used asthe baseline, the performance improvement continued un-til four iterations because the geometric reconstruction wasmore influential than overfitting. In contrast, when PAC-NeRF-3v was used as the baseline, the performance im-provement (particularly for geometric (re)correction for thetest set) was saturated at three iterations because the perfor- mance achieved the upper bound in an earlier phase. Fromthis time on, the overfitting problem became non-negligible.Conducting further studies on this topic and exploring animproved method (for example, determining the number ofiterations adaptively during training) will be interesting fu-ture research topics. Furthermore, the effect of the above-mentioned trade-off on the physical identification perfor-mance is an open issue. A detailed investigation of this willbe an interesting topic for future research.",
  "C. Experiments on other view settings": "In the main text (), we investigate the performancewhen three specific views are selected as training data. Inthis appendix, experiments were conducted using other set-tings to investigate the versatility of the proposed method.In particular, we investigated the robustness of the selec-tion of views (Appendix C.1) and the number of views (Ap-pendix C.2).",
  ". Comparison of PSNR, SSIM, and LPIPS averaged over five view settings on geometric correction and recorrection": "views. Specifically, we investigated performance when fivedifferent view sets were used for training. The number ofviews used for training was fixed at three, and the remainingeight were used for testing. Compared models. We used PAC-NeRF-3v as the base-line and applied +LPO and +LPO4. Furthermore, we exam-ined the performances of the ablated and comparative mod-els. Specifically, in the evaluation of the geometry correc-tion, we examined the performance when +LPO-F, +LPO-P, and +GO were applied to the baseline. In the evaluationof the physical identification and geometric recorrection,we examined the performance when +LPO-F4, +LPO-P4,+GO4, and +None4 were applied to the baseline. Results. summarizes the geometric correctionand recorrection results. We observed tendencies similar tothose for the results when three specific views were used fortraining (see Appendix B.1). Specifically, with respect togeometry correction, +LPO outperformed not only the base-line (PAC-NeRF-3v) but was also superior to or compara-ble to the ablated and comparative models, including +LPO-F, +LPO-P, and +GO. Similarly, with respect to geome-try recorrection, +LPO4 outperformed not only the baseline(PAC-NeRF-3v) but was also superior to or comparable tothe ablated and comparative models, including +LPO-F4,+LPO-P4, +GO4, and +None4. In terms of physical prop-erty identification, +LPO4 outperformed PAC-NeRF-3v,+LPO-F4, +LPO-P4, +GO4, and +None4 in the 20.81.2,15.22.0, 16.62.0, 17.81.2, and 18.81.9 cases, re-spectively, across the 23 properties for each view setting.These results indicate that the joint optimization of featuresand positions in Lagrangian space is effective for geometry-agnostic system identification, regardless of the selection ofviews used for training.",
  "C.2. Robustness of the number of views": "In the main experiment () and the above exper-iments (Appendix C.1), we investigated the performancewhen the number of views in the training set was three. Toinvestigate the robustness of the number of views, we ex-amined the performance when the number of views in thetraining set was changed to six. Specifically, among the 11views in the dataset, six were used for training, and the re-maining five were used for testing. Compared models. We used PAC-NeRF-6v, that is, PAC-NeRF trained with six views, as the baseline. In pre-liminary experiments, we found that PAC-NeRF-6v demon-strated reasonable performance without the advanced tech-niques described in Appendix A owing to the increase in the number of views. Therefore, we only used this modelas the baseline. We applied +LPO and +LPO4 to the base-line. Furthermore, we investigated the performances of theablated and comparative models. Specifically, in the eval-uation of the geometry correction, we investigated the per-formance when +LPO-F, +LPO-P, and +GO were appliedto the baseline. In the evaluation of the physical identifi-cation and geometric recorrection, we investigated the per-formance when +LPO-F4, +LPO-P4, +GO4, and +None4 were applied to the baseline.Results. Tables 14, 15, and 16 summarize the results ofgeometry correction, physical identification, and geometryreconstruction, respectively. Similar tendencies were ob-served when the number of views in the training set wasthree (as discussed in and Appendix C.1). Specif-ically, with respect to geometry correction, +LPO outper-formed not only the baseline (PAC-NeRF-6v) but also theablated and comparative models, including +LPO-F, +LPO-P, and +GO, in most cases. On physical identification andgeometry recorrection, +LPO4 outperformed not only thebaseline (PAC-NeRF-6v) but also the ablated and compar-ative models, including +LPO-F4, +LPO-P4, +GO4, and+None4, in most cases. These results indicate that the jointoptimization of features and positions in Lagrangian spaceis effective for geometry-agnostic system identification, re-gardless of the number of views used for training.",
  "PSNR: 30.26": ". Qualitative comparisons among PAC-NeRF-3v/3v, +LPO, and +LPO4 on Newtonian fluids (Droplet and Letter). Blue fontsindicate the scores obtained by the baselines (PAC-NeRF-3v/3v). Red fonts indicate the scores obtained by the proposed methods (+LPOand +LPO4). Given the initial estimation by the baseline (b)(e), +LPO first corrects the geometric structures (including appearance andshape) (c)(f). By repeatedly conducting physical identification and geometric correction via Algorithm 1, +LPO4 reidentifies physicalproperties and recorrects geometric structures (d)(g). In the Droplet scene, the bottom of the droplet is sharply pointed, and its tip iswhitened in the baseline (b)(e). They are gradually mitigated by applying +LPO (c)(f) and +LPO4 (d)(g). In the Letter scene, +LPO (c)(f)and +LPO4 (d)(g) succeed in gradually eliminating artifacts existing in the vicinity of the left line of the letter R., which arise in thebaselines (b)(e).",
  "(a) Ground truth(b) PAC-NeRF-3v(c) +LPO (proposed) (d) +LPO4 (proposed)(e) PAC-NeRF-3v(f) +LPO (proposed) (g) +LPO4 (proposed)": ". Qualitative comparisons among PAC-NeRF-3v/3v, +LPO, and +LPO4 on granular media (Trophy). Blue fonts indicate thescores obtained by the baselines (PAC-NeRF-3v/3v). Red fonts indicate the scores obtained by the proposed methods (+LPO and +LPO4).Given the initial estimation by the baseline (b)(e), +LPO first corrects the geometric structures (including appearance and shape) (c)(f).By repeatedly conducting physical identification and geometric correction via Algorithm 1, +LPO4 reidentifies physical properties andrecorrects geometric structures (d)(g). In the Trophy scene, the baselines (b)(e) achieve good performance in terms of physical identification(comparable with PAC-NeRF with full-view supervision). However, they tend to make the trophy darker than the ground truth (a). Thismisestimation is corrected by +LPO and +LPO4.",
  "PSNR: 26.51PSNR: 28.74PSNR: 26.08PSNR: 24.95": ". Qualitative comparisons among +LPO4, +LPO-F4, +LPO-P4, +GO4, and +None4 in the scenes where +LPO-P4 outperformed+LPO-F4 in terms of PSNR. In the +LPO-F4, position (that is, shape) optimization was ablated, and only feature (that is, appearance)optimization was conducted. In the +LPO-P4, feature (that is, appearance) optimization was ablated, and only position (that is, shape)optimization was conducted. In the above scenes, large geometric gaps exist between the ground truth (a) and PAC-NeRF-3v (b). Forexample, in the second row of the Droplet scene, the bottom of the droplet is flat in the ground truth (a), while that is bulging in PAC-NeRF-3v (b). As shown in (d), only appearance correction by +LPO-F4 is insufficient to correct this geometry failure estimation, andthe bottom of the droplet is still bulging. Instead, +LPO-F4 attempts to solve this problem by changing the appearance, making the colorsovercorrected. In contrast, shape correction by +LPO-P4 effectively addresses this failure, and the bottom of the droplet is flat in (e). Thesame correction was also conducted in +LPO4 (c), a combination of +LPO-F4 and +LPO-P4. Similarly, in the Bird scene, the directionsof the tail are adequately corrected in +LPO4 (c) and +LPO-P4 (e). In contrast, those are not sufficiently conducted in +LPO-F4 (d). Also,in this case, +LPO-F4 (d) attempts to solve this problem by overcorrecting the colors. +GO4 (f), which also only corrects appearance, hasthe same difficulty as +LPO-F4 (d). In the Droplet scene, the bottom of the droplet is bulging; in the Bird scene, the birds tail is corrupted.+None4 (g), which performs Algorithm 1 without geometry correction, does not have a sufficient correction ability. In the Droplet scene,shape and appearance are almost identical to those in PAC-NeRF-3v (b). In the Bird scene, the pose of the bird is not corrected.",
  "PSNR: 34.51PSNR: 33.94PSNR: 34.40PSNR: 31.49": ". Qualitative comparisons among +LPO4, +LPO-F4, +LPO-P4, +GO4, and +None4 in the scenes where +LPO-F4 outperformed+LPO-P4 in terms of PSNR. In the +LPO-F4, position (that is, shape) optimization was ablated, and only feature (that is, appearance)optimization was conducted. In the +LPO-P4, feature (that is, appearance) optimization was ablated, and only position (that is, shape)optimization was conducted. As discussed in , +LPO-F4 is unsuitable for significantly correcting the geometric shape becauseit focuses on correcting appearance. However, as shown in the above scenes, when PAC-NeRF-3v (b) captures the geometric structurerelatively well, +LPO-F4 (d) also works well because appearance correction is more important than shape correction. For example, in theLetter scene, +LPO-F4 (d) succeeds in eliminating artifacts existing in the vicinity of the left line of the letter R. In the Toothpaste scene,+LPO-F4 (d) succeeds in making the color of the material brighter and closer to the ground truth (a). Notably, in both scenes, +None4 (g) fails to do so and produces almost the same results as those in PAC-NeRF-3v (b). These results indicate that appearance correctionby +LPO-F4 is essential (simple iterative updates in Algorithm 1 are insufficient) to address these problems. Another interesting findingis that +LPO-P4 (e), which focuses on correcting shape, also works well. For example, in the Letter scene, +LPO-P4 (e) eliminates theartifacts existing in the vicinity of the left line of the letter R, and in the Toothpaste scene, it makes the material brighter. This is possiblebecause moving correctly colored particles from other places allows for appearance changes.",
  "Trophy with fric = 40": "In each scene, the objects fall freely under the influenceof gravity and undergo collisions. The ground-truth sim-ulation data were generated using the MLS-MPM frame-work . A photorealistic simulation engine rendered ob-jects under diverse environmental lighting conditions andground textures. Each scene was captured from 11 view-points with cameras evenly spaced on the upper hemi-sphere, including the object.To evaluate our method insparse-view settings, three views were used for training, andthe remaining eight views were used for testing in the mainexperiments () and the experiments described inAppendix C.1. Six views were used for training, and theremaining five were used for testing in the experiments de-scribed in Appendix C.2. Data were downloaded from thewebsite14 provided by the authors of PAC-NeRF .",
  "E.2. Model": "The models were implemented based on the official PAC-NeRF source code.14 For simplicity and fair comparison,we used the default model configurations provided in thesource code for the experiments. Specifically, the archi-tecture of a discretized voxel-based NeRF followed directvoxel grid optimization , in which a volume densityfield and color field were represented by voxel grids, anda 2-layer MLP with a hidden dimension of 128 was applied",
  "E.3. Training settings": "For simplicity and fair comparison, we conducted Eulerianstatic voxel grid optimization ((1)) and physicalproperty optimization ((2)) using the default train-ing settings provided in the source code,14 in PAC-NeRF,PAC-NeRF-3v, and PAC-NeRF-6v, except that the numberof views was changed. In PAC-NeRF-3v, we applied thethree modifications described in Appendix A (schedulingof Lsurf, introduction of LV Ipixel, and adjustment of traininglength) to the Eulerian static voxel grid optimization andadopted the default training settings for physical propertyoptimization. For the LPO ((3)), we trained thefeatures and positions of the particles for 100 iterations us-ing the Adam optimizer . In particular, we optimizedthe features of the particles at a learning rate of 0.1, whichis the default value used for training the feature grids in theEulerian static voxel grid optimization. The positions of theparticles were optimized at a learning rate of dx 32 , where dxindicates the voxel grid size and differs depending on thescene (set in the configuration files in the source code14).In a preliminary experiment, we found that careful settingof this learning rate is vital for stable training because theparticles can diverge when the learning rate is exceptionallyhigh. Based on this observation, we used a learning rate ad-justed according to dx. We set the momentum terms of theAdam optimizer, 1 and 2, to 0.9 and 0.999, respectively.",
  "E.4. Evaluation metrics": "Evaluation of geometric (re)correction. We evaluated theperformance of the geometric (re)correction using metricscommonly used to assess the performance of novel viewsynthesis in NeRF studies: the peak signal-to-noise ratio(PSNR), structural similarity index measure (SSIM) ,and learned perceptual image patch similarity (LPIPS) .For PSNR and SSIM, the larger the values, the better theperformance. For LPIPS, the smaller the values, the betterthe performance. In particular, we report the scores aver-aged over the video sequences in a test set.Evaluation of physical identification. To evaluate the per-formance of the physical identification, we measured theabsolute distance between the ground truth and the esti-mated physical properties. The values of the ground-truthphysical properties are provided in Appendix E.1. For aneasy comparison, we calculated these distances after adjust-ing the scale (i.e., either a logarithmic scale or a linear scale)following the study of PAC-NeRF . The smaller the val-ues, the better the performance."
}