{
  "Deformable image registration is a fundamental step for": "medical image analysis. Recently, transformers have been used for registration and outperformed Convolutional Neural Networks (CNNs). Transformers can capture long-range dependence among image features, which have been shown beneficial for registration. However, due to the high computation/memory loads of self-attention, transformers are typically used at downsampled feature resolutions and cannot capture fine-grained long-range dependence at the full image resolution. This limits deformable registration as it necessitates precise dense correspondence between each image pixel. Multi-layer Perceptrons (MLPs) without self-attention are efficient in computation/memory usage, enabling the feasibility of capturing fine-grained long-range dependence at full resolution. Nevertheless, MLPs have not been extensively explored for image registration and are lacking the consideration of inductive bias crucial for medical registration tasks. In this study, we propose the first correlation-aware MLP-based registration network (CorrMLP) for deformable medical image registration. Our CorrMLP introduces a correlation-aware multi-window MLP block in a novel coarse-to-fine registration architecture, which captures fine-grained multi-range dependence to perform correlation-aware coarse-to-fine registration. Extensive experiments with seven public medical datasets show that our CorrMLP outperforms state-of-the-art deformable registration methods.",
  "Medical image registration is a fundamental requirement": "for medical image analysis and has been an active research focus for decades . It spatially aligns medical images acquired from different patients, times, or scanners, which serves as a crucial step for various clinical tasks, such as tumor growth monitoring and group analysis . Due to pathological changes or anatomy variations among patients, medical images carry many non-linear local deformations, especially for complex organs such as the brains cerebral cortex . Therefore, different from the common natural image registration tasks (e.g., panorama stitching ) that aim to remove the global misalignments caused by parallax, medical image registration heavily relies on deformable registration, and this motivates the current research focus . For example, many medical image registration studies assume that the images can be globally aligned after affine registration and mainly focus on deformable registration with non-linear local deformations .",
  "Deformable image registration aims to find a dense non-": "linear spatial transformation between a pair of images so that the two images can be spatially aligned with each other. Traditional image registration methods usually formulate deformable registration as a time-consuming iterative optimization problem . Recently, deep registration methods based on Convolutional Neural Networks (CNNs) or transformers have been widely used to perform fast end-to-end registration . These methods learn a mapping from image pairs to spatial transformations based on a set of training data, which have shown superior registration performance than traditional methods .",
  "The Visual transformer (ViT) and its window-based": "variant, Swin transformer , have been widely adopted in various vision tasks for their great capability to capture long-range dependence via self-attention. This capability has been shown beneficial for deformable registration as it can enlarge the receptive field to model large deformations between images . Nevertheless, due to the high computation and memory loads of self-attention operations, transformers are usually employed at downsampled feature resolutions , which prevents them from processing the subtle textural information and capturing fine-grained long-range dependence at the full image resolution. This limitation is catastrophic for deformable medical image registration, as the full-resolution textural information is crucial to identify subtle anatomy in medical images and find precise pixel-wise spatial correspondence between the anatomical structures. To compensate for this limitation, convolutional layers were employed at the full/half image resolutions in state-of-the-art hybrid CNN-transformer registration networks . Unfortunately, convolutional layers have difficulties in capturing the fine-grained long-range dependence at high resolutions, which results in sub-optimal registration performance.",
  "The desire for modeling long-range dependence has also": "motivated another research trend toward models based on Multi-layer Perceptrons (MLPs) . By removing self-attention, MLPs are more computationally efficient than transformers while also being able to capture long-range dependence . It has been demonstrated that MLPs can be used at the full image resolution to capture fine-grained long-range dependence and have achieved state-of-the-art performance in natural image processing tasks and medical dense prediction tasks . This hints at the potential of leveraging MLPs, as promising alternatives to transformers, to improve deformable image registration. However, MLPs have not been extensively explored for registration and lack the consideration of inductive bias that is crucial for medical registration tasks. For example, existing MLP-based models tend to globally mix feature information along the spatial and channel axes and do not explicitly model the local correlations between features, while the modeling of local correlations has been shown beneficial for deformable registration . In addition, state-of-the-art deep registration methods tend to address difficult large deformations via multiple steps of coarse-to-fine registration , which also has not been investigated by existing MLP-based models.",
  "In this study, we propose a correlation-aware coarse-to-": "fine MLP-based network (CorrMLP) for deformable image registration. To the best of our knowledge, this is the first study that introduces MLPs for coarse-to-fine deformable registration. In the CorrMLP, we propose a correlation-aware multi-window MLP (CMW-MLP) block, which calculates the local correlations between feature maps and then captures correlation-aware multi-range dependence via multi-window MLP operations. The CMW-MLP block is used in a novel coarse-to-fine registration architecture, where the correlations between images (image-level) and between registration steps (step-level) are both leveraged to realize a correlation-aware coarse-to-fine registration process. Our main contributions are summarized as follows:",
  "Early deep registration methods train networks in a fully": "supervised manner and need ground truth transformations as labels . However, pixel-wise ground truth labels are hard to obtain. To remove the reliance on labels, recent deep registration methods tend to employ image similarity metrics (e.g., mean square error) to train networks in a fully unsupervised manner . As one of the most commonly benchmarked registration methods, Balakrishnan et al. proposed a CNN-based network, VoxelMorph, using a hierarchical encoder-decoder architecture similar to Unet . Subsequent studies followed this encoder-decoder architecture and introduced transformers into the networks . Chen et al. proposed a hybrid CNN-transformer registration network, TransMorph, that employs Swin transformer blocks in the encoder. Zhu et al. also proposed a pure transformer-based registration network, Swin-VoxelMorph, that employs a pure Swin transformer architecture similar to Swin-Unet . These studies demonstrate the benefits of modeling long-range dependence for image registration. However, transformers are computationally expensive and were used after 444 patch embedding. To restore image detail information, TransMorph employed convolutional layers at the full/half image resolutions. Unfortunately, fine-grained long-range dependence still cannot be captured.",
  "Besides the Unet-style direct registration architecture,": "coarse-to-fine registration architectures were also widely adopted to improve deformable image registration, where multiple steps of registration are performed in a coarse-to-fine manner . Mok et al. proposed a laplacian pyramid image registration network (LapIRN), where multiple laplacian pyramid networks were cascaded to perform multiple registration steps. Shu et al. also proposed a ULAE-net to iteratively perform coarse-to-fine registration by running the network for multiple iterations. Recently, Meng et al. proposed a non-iterative coarse-to-fine registration network (NICE-Net) that employs a pyramid network to perform coarse-to-fine registration in a single iteration. The NICE-Net has also been extended to a transformer-based variant, NICE-Trans . This NICE-Trans outperformed its CNN predecessors (NICE-Net) and attained state-of-the-art performance but still did not model fine-grained long-range dependence at full resolution.",
  "In addition, modeling the local correlations between": "image features has also been shown to facilitate deformable image registration . For example, Kang et al. proposed a dual-stream pyramid network (Dual-PRNet++) that enhances deformable image registration by modeling the local 3D correlations between image feature pyramids. However, existing registration methods only considered the correlations between images, while the correlations between registration steps have not been investigated.",
  "MLP-based models have attracted wide attention in the": "vision community for their capability to capture long-range dependence without relying on self-attention . Early MLPs-based models followed the earlier ViT to process single-scale features after 1616 patch embedding . Tolstikhin et al. proposed an MLP-Mixer that employs MLPs to separately mix channel and spatial information via matrix transpose. Liu et al. also proposed gMLP that introduces spatial gating units for spatial projections. Recently, MLPs have been used in hierarchical pyramid structures , which extends the application of MLPs to dense prediction. Tu et al. proposed a hierarchical MLP-based model (MAXIM) for low-level natural image processing such as denoising and deblurring. This model achieved state-of-the-art performance on image processing tasks and also demonstrates the feasibility of leveraging MLPs at the full image resolution to capture fine-grained long-range dependence. However, these hierarchical MLP-based models were not optimized for image registration, thus lacking the consideration of inductive bias crucial for deformable medical registration tasks.",
  "So far, MLPs have not been extensively investigated for": "deformable registration. To the best of our knowledge, only Wang et al. conducted a preliminary study, where both MLP- and transformer-based models were adopted for 2D echocardiography registration. They adopted early MLP-Mixer to perform single-scale image registration and then combined three sub-networks at the 1/4, 1/8, and 1/16 image resolutions for final registration. This method did not employ the recent hierarchical MLP-based models and also cannot capture fine-grained long-range dependence at full/half resolution. Therefore, Wang et al. s method only achieved similar performance to early VoxelMorph and did not fully reveal the potential of MLPs for deformable medical image registration.",
  "Image registration aims to find a spatial transformation": "that warps a moving image ! to a fixed image \", so that the warped image !$ = ! is spatially aligned with the fixed image \". The ! and \" are two volumes defined over a -D spatial domain %. In this study, we focus on 3D image registration (i.e., = 3) and assume that the ! and \" are uni-modal, single-channel, grayscale images, which is consistent with common deformable medical image registration studies .",
  "shows the architecture of our CorrMLP, which": "consists of a hierarchical feature extraction encoder and a correlation-aware coarse-to-fine registration decoder. The encoder extracts multi-scale hierarchical features from ! and \" separately, which is composed of four successive convolutional (Conv) modules with 222 max-pooling applied between adjacent Conv modules. This feature extraction encoder produces two four-level hierarchical feature pyramids ! 1!",
  "* are fed into a CMW-MLP block to explore": "their spatial correspondence. The resultant features are fed into a deformable registration head that maps the features into an initial displacement field '. Beginning from the second registration step, there are two CMW-MLP blocks used at each step to model image-level and step-level correlations respectively. Specifically, the ' is used to guide the second registration step, where the warped features !",
  ") are fed into the first": "CMW-MLP block. The second CMW-MLP block then processes the output features from its former CMW-MLP block and the upsampled features derived before the first registration head. The resultant features from the second CMW-MLP block are fed into a deformable registration head. A residual displacement field is produced by the registration head, which is then added to the upsampled ' to form the displacement field (. The above process is repeated for two more times to derive the displacement fields ) and *. The * is the final registration result that warps the ! to spatially align with the \".",
  "The registration decoder employs a novel correlation-": "aware coarse-to-fine registration architecture, which can perform multiple steps of coarse-to-fine registration within a single iteration of the decoder. Compared with previous coarse-to-fine registration architectures , our architecture leverages the correlations between images and between registration steps as supplementary information. The correlations between features of two images have been proven to be effective guidance in establishing the spatial correspondence between the two images , while the correlations between the steps of coarse-to-fine registration have not been investigated. Our study incorporates step- level correlations to offer important contextual information to each registration step, enabling the model to perform each current registration step based on the awareness of what has been done by its previous steps.",
  "illustrates the architecture of our CMW-MLP": "blocks. It takes two sets of feature maps (denoted by ' and () as input and then explores the potential correspondence between them, which is purposely optimized to capture correlation-aware multi-range dependence for deformable medical image registration. To achieve this, each CMW-MLP block has a 3D correlation layer to calculate the local correlations, followed by a multi-window MLP module to capture correlation-aware multi-range dependence.",
  "Specifically, the ' and ( are fed into a 3D correlation": "layer to obtain a 3D correlation map .. We set the max displacement = 3 to calculate the local correlations around the 3D neighborhood of 333. The resultant . has the same shape as the ' and ( with a channel number of )=27. The ', (, and . are concatenated and then fused as a correlation-aware feature map /011 by a 333 convolutional layer. The /011 is further processed by a multi-window MLP module, where window-based MLP branches with different window sizes are used in parallel to capture multi-range dependence. In each window-based MLP branch, the feature map is split into non-overlapped regions according to the window size, and then gMLP is adopted to process the features within each region. The outputs of the MLP branches are fused by channel-wise weighted summation, where the weights are dynamically adjusted via global average pooling (GAP), two-layer MLP, and softmax function. Finally, we followed to employ a residual channel attention module to highlight crucial feature channels, which consists of layer normalization, convolutional layers, LeakyReLU activation, and squeeze- : The architecture of our CMW-MLP block. It contains a 3D correlation layer to calculate the local correlations, a multi-window MLP module to capture multi-range dependence, and a residual channel attention module to highlight crucial feature channels.",
  "Our CMW-MLP block is purposely optimized with the": "consideration of crucial prior knowledge for deformable medical image registration. First, deformable registration aims to resolve local non-linear deformations, where the paired pixels usually appear within the local neighborhood of each other . Second, there might exist a wide range of deformations among medical images. As exemplified in , the brain Magnetic Resonance Imaging (MRI) images carry both large (red box) and small (blue box) local non-linear deformations among images. Our CMW-MLP block captures multi-range dependence via multiple local window-based MLP branches, enabling it to handle both large and small local deformations.",
  "The learnable parameters of CorrMLP are optimized": "using an unsupervised loss that does not require labels. The consists of two terms 2+! and 134 , where the 2+! is an image similarity term penalizing the differences between the warped image !$ and the fixed image \", while the 134 is a regularization term encouraging smooth and physically realistic spatial transformations .",
  "For brain image registration, we adopted six public 3D": "brain MRI datasets that have been widely used to evaluate medical image registration . We followed the dataset settings in : a total of 2,656 brain MRI images acquired from four public datasets (ADNI , ABIDE , ADHD , and IXI ) were used for training; two public brain MRI datasets with anatomical segmentation (Mindboggle and Buckner ) were adopted for validation and testing. The Mindboggle dataset contains 100 MRI images and was randomly split for validation/testing with a ratio of 50%/50%. The Buckner dataset contains 40 MRI images and was used for independent testing. We followed the existing studies to perform inter-patient registration for evaluation, where 100 image pairs were randomly picked from each of the Mindboggle and Buckner testing sets, resulting in 200 testing image pairs in total. We performed standard brain MRI preprocessing procedures, including brain extraction, intensity normalization, and affine registration by FreeSurfer and FLIRT . All images were affine-transformed and resampled to align with the MNI-152 brain template with 1mm3 isotropic voxels, which were then cropped into 144192160.",
  "For cardiac image registration, we adopted the public": "ACDC dataset that contains 4D cardiac cine-MRI images of 150 patients. Each 4D cine-MRI image contains tens of 3D frames acquired from different time-points, including End-Diastole (ED) and End-Systole (ES) frames with segmentation labels of the left ventricular cavity, right ventricular cavity, and myocardium. The ED is defined as the first frame when the mitral valve closes and the ES is defined as the first frame when the aortic valve closes. ED and ES delineate the two ends of a cardiac cycle and show the largest deformation in the cardiac cycle . The ACDC dataset provides 100 cine-MRI images in the training set and 50 cine-MRI images in the testing set, where we randomly divided the training set into 90 and 10 cine-MRI images for training and validation and used the provided testing set for testing. Following , we aim to register the ED and ES frames of the same patient. The intra-patient ED and ES frames were registered with each other (ED-to-ES and ES-to-ED), resulting in 100 testing image pairs derived from the testing set. All cine-MRI : Illustration of local non-linear deformations in medical images. The 2D slices of 3D brain MRI images are presented as examples. The red and blue boxes highlight the regions with relatively large and small deformations among images.",
  "Our CorrMLP was implemented using PyTorch on an": "NVIDIA GeForce RTX 4090 GPU with 24 GB memory. We adopted an ADAM optimizer with a learning rate of 0.0001 and a batch size of 1. The regularization parameter was set as 1. For brain image registration, the CorrMLP was trained for 100,000 iterations with inter-patient image pairs randomly picked from the training set. For cardiac image registration, the CorrMLP was trained for 40,000 iterations with intra-patient image pairs that consist of two frames randomly picked from the same cine-MRI image. At the last 10,000 iterations, the CorrMLP was trained with intra-patient image pairs consisting of only ED and ES frames, which optimizes the model to register ED and ES frames. We performed validation after every 1,000 training iterations and preserved the model achieving the highest validation result for final testing. Our code is available at",
  "Our CorrMLP was extensively compared to state-of-the-": "art deformable image registration methods, including two traditional optimization-based registration methods and ten deep registration methods. The two traditional methods are SyN and NiftyReg , and we ran them using cross-correlation as the similarity measure. The included deep registration methods are VoxelMorph , TransMorph , Swin-VoxelMorph , TransMatch , LapIRN , ULAE-net , Dual-PRNet++ , NICE-Net , NICE-Trans , and SDHNet . Moreover, we also incorporated MAXIM , a state-of-the-art MLP-based natural image processing method, into the comparison. We adapted it to deformable registration by reimplementing it as a 3D model and modifying its output layer to produce displacement fields. Due to its highly complex architecture requiring large GPU memory, the MAXIM is difficult to apply to 3D brain MRI images and we, therefore, evaluated it only on cardiac image registration with relatively smaller image size. All deep learning methods were trained with the same loss functions and data split settings as ours.",
  "We adopted standard evaluation metrics commonly used": "in medical image registration studies and in related registration challenges . The registration accuracy was evaluated using the Dice similarity coefficients (DSC) between the segmentation labels of the fixed and warped images (\" and !$). A two-sided value less than 0.05 is considered to indicate a statistically significant difference between two DSCs. The smoothness and invertibility of the predicted spatial transformations were evaluated using the percentage of Negative Jacobian Determinants (NJD) . There often is a trade-off between registration accuracy and transformation smoothness by adjusting the regularization parameter . Therefore, registration methods should be evaluated in terms of both DSC and NJD.",
  "In the first ablation study, we explored the effects of": "different architecture designs on registration performance. We built a Unet-like MLP-based registration network as the baseline and followed the popular VoxelMorph and TransMorph to name it as MLPMorph. The MLPMorph adopted an Unet-like encoder-decoder architecture similar to TransMorph, which uses MLP blocks in the encoder and CNN blocks in the decoder. Multi-window MLP (MW-MLP) blocks (a variant of our CMW-MLP that removes the 3D correlation layer) were used in the MLPMorph to extract hierarchical multi-scale image features beginning from the full image resolution. We also used MW-MLP blocks in our coarse-to-fine registration architecture, resulting in three degraded models that cannot leverage the image-level and/or step-level correlation information.",
  "In the second ablation study, we studied the registration": "performance when using different MLP blocks. We kept our network architecture and replaced our CMW-MLP blocks with existing MLP blocks including Spatial-shift MLP (S2-MLP) , Sparse MLP (sMLP) , Hire-MLP , Swin-MLP , and the multi-axis gated MLP used in MAXIM . We also attempted to remove some of the MLP branches in our CMW-MLP blocks to validate the effectiveness of the multi-window MLP design.",
  "and show the quantitative comparison": "between the CorrMLP and existing registration methods for brain and cardiac image registration. Among the existing methods, transformer-based TransMorph and Swin-VoxelMorph achieved higher DSCs than the widely benchmarked CNN-based VoxelMorph, which validates the benefits of capturing long-range dependence for image registration. Furthermore, the single-stage and multi-stage (3) variants of MAXIM were evaluated for cardiac image registration, and both of them achieved higher DSCs than the transformer-based direct registration methods (Table 2). This illustrates the superiority of MLP-based models for deformable registration tasks. However, the MAXIM is particularly optimized for natural image processing tasks, which is not competitive with state-of-the-art coarse-to-fine registration methods due to the lack of inductive bias crucial for medical image registration.",
  "Moreover, coarse-to-fine registration methods attained": "consistently higher DSCs than direct registration methods, validating the superiority of coarse-to-fine registration. By employing transformers in a coarse-to-fine registration architecture, the NICE-Trans achieved higher DSCs than all other comparison methods. Nevertheless, our CorrMLP outperformed the NICE-Trans and achieved significantly higher DSCs than all comparison methods. Our CorrMLP obtained similar NJDs to other registration methods, which means that our CorrMLP did not sacrifice transformation smoothness for registration accuracy. The runtime of each method is also reported in and , which shows that our CorrMLP is much faster than the traditional : Qualitative comparison for brain image registration. Below each image is an error map that shows the intensity differences from the fixed image, with the mean absolute error placed in the upper left corner. A cleaner error map indicates a better registration result.",
  "presents the DSC results of the ablation study on": "MLP blocks. The NJD results are omitted as all methods adopted the same regularization settings and achieved similar NJDs. Replacing our CMW-MLP blocks with five different existing MLP blocks all resulted in lower DSCs, which demonstrates the effectiveness of our CMW-MLP block. This effectiveness can be partly attributed to the awareness of correlation information in modeling long-range dependence. However, even when the correlation layer was removed, the MW-MLP block also outperformed the five existing MLP blocks, which implies that our multi-window MLP design is also beneficial for deformable image registration. To further validate this, we separately removed one of the MLP branches in CMW-MLP blocks and found that removing any MLP branch degraded the registration performance. We also attempted to add an extra MLP branch with a window size of 999, but we did not identify any further improvements in performance. This suggests that a 777 MLP branch has been sufficient to capture large deformations, while the 333 and 555 MLP branches are crucial to capture subtle deformations.",
  "By employing MLP blocks in a correlation-aware": "coarse-to-fine registration architecture, our CorrMLP also outperformed MLPMorph by a large margin. To validate the effects of correlation information on coarse-to-fine registration, we separately removed the image-level and step-level correlation information and found that removing either information degraded the registration performance. This ablation study suggests that both image-level and step-level correlations are beneficial for coarse-to-fine registration and also proves that our correlation-aware coarse-to-fine registration architecture outperforms the existing coarse-to-fine architectures that do not leverage these correlation information.",
  "In this study, we have shown the effectiveness of MLPs": "for deformable medical image registration by developing the first MLP-based coarse-to-fine registration network (CorrMLP). In the CorrMLP, we introduce a correlation-aware multi-window MLP (CMW-MLP) block and use it in a novel coarse-to-fine registration architecture that takes into account both image-level and step-level correlations. Extensive experiments on both brain and cardiac image registration show that, with the CMW-MLP block and the correlation-aware coarse-to-fine registration architecture, our CorrMLP can outperform state-of-the-art registration methods. Furthermore, we suggest that our CMW-MLP block can serve as a general MLP block applying to various network architectures for image registration tasks, and our CorrMLP also can apply to multi-modal registration tasks such as multi-parametric brain MRI registration . Acknowledgement: This work was supported in part by Australian Research Council (ARC) Grant DP200103748."
}