{
  "Abstract": "This research examines a specific category of structured nonconvex-nonconcave min-max problems that demon-strate a characteristic known as weak Minty solutions. This concept, which has only recently been defined, hasalready demonstrated its effectiveness by encompassing various generalizations of monotonicity at the same time.We establish new convergence findings for an enhanced variant of the optimistic gradient method (OGDA) withinthis framework, achieving a convergence rate of 1/k for the most effective iteration, measured by the squaredoperator norm, a result that aligns with the extragradient method (EG). Furthermore, we introduce a modifiedversion of EG that incorporates an adaptive step size, eliminating the need for prior knowledge of the problemsspecific parameters.",
  "Introduction": "The recent advancements in machine learning models, particularly those that can be formulated as min-max optimization problems,have generated significant interest in saddle point problems. Examples of these models include generative adversarial networks,adversarial learning frameworks, adversarial example games, and actor-critic methods. While practical methods have been developedthat generally perform well, the theoretical understanding of scenarios where the objective function is nonconvex in the minimizationcomponent and nonconcave in the maximization component remains limited, with some research even suggesting intractability incertain cases. A specific subset of nonconvex-nonconcave min-max problems was analyzed, and it was found that the extragradient method (EG)exhibited favorable convergence behavior in experimental settings. Surprisingly, these problems did not appear to possess any ofthe recognized favorable characteristics, such as monotonicity or Minty solutions. Subsequently, a suitable concept was identified(see Assumption 1), which is less restrictive than the presence of a Minty solution (a condition frequently employed in the existingliterature) and also extends the idea of negative comonotonicity. Because of these properties that unify and generalize, the concept ofweak Minty solutions was quickly investigated.",
  "F(u)2u Rd.(1)": "Moreover, it has been demonstrated that a modified version of EG is capable of addressing problems with such solutions, achievinga complexity of O(1) for the squared operator norm. This adaptation, referred to as EG+, is based on a bold extrapolation stepfollowed by a cautious update step. A similar step size approach has been previously examined in the context of a stochastic variantof EG. In a similar vein, we explore a variation of the optimistic gradient descent ascent (OGDA), also known as Forward-Reflected-Backward (FoRB). We address the following question with an affirmative answer:",
  "minx maxyf(x, y)": "the operator F mentioned in Assumption 1 naturally emerges as F(u) := [xf(x, y), yf(x, y)] with u = (x, y). However,by examining saddle point problems from the broader viewpoint of variational inequalities (VIs) through the operator F, we canconcurrently address more scenarios, such as certain equilibrium problems. The parameter in the definition of weak Minty solutions (1) is crucial for both the analysis and the experiments. Specifically, itis essential that the step size exceeds a value proportional to . Simultaneously, as is typical, the step size is limited from aboveby the inverse of the Lipschitz constant of F. For instance, since some researchers require the step size to be less than14L, theirconvergence claim is valid only if <14L. This condition was later improved to <12L for the choice = 1 and to < 1 L foreven smaller values of . As in the monotone setting, OGDA requires a smaller step size than EG. Nevertheless, through a differentanalysis, we are able to match the most general condition on the weak Minty parameter < 1",
  "Our contributions are summarized as follows:": "1. We establish a new convergence rate of O(1/k), measured by the squared operator norm, for a modified version of OGDA,which we call OGDA+. This rate matches that of EG and builds upon the recently introduced concept of weak solutions tothe Minty variational inequality. 2. Even when a stronger condition is imposed, specifically that the operator is also monotone, we enhance the range of feasiblestep sizes for OGDA+ and obtain the most favorable result known for the standard method ( = 1).",
  ". We demonstrate a complexity bound of O(2) for a stochastic variant of the OGDA+ method": "4. We also introduce an adaptive step size version of EG+. This version achieves the same convergence guarantees withoutrequiring any knowledge of the Lipschitz constant of the operator F. Consequently, it can potentially take larger steps inareas with low curvature, enabling convergence where a fixed step size strategy might fail.",
  "Related literature": "We will concentrate on the nonconvex-nonconcave setting, as there is a substantial body of work on convergence rates in terms of a gapfunction or distance to a solution for monotone problems, as well as generalizations such as nonconvex-concave, convex-nonconcave,or under the Polyak-ojasiewicz assumption. Weak Minty. It was observed that a specific parameterization of the von Neumann ratio game exhibits a novel type of solution,termed \"weak Minty,\" without having any of the previously known characteristics like (negative) comonotonicity or Minty solutions.Convergence in the presence of such solutions was demonstrated for EG, provided that the extrapolation step size is twice as large asthe update step. Subsequently, it was shown that the condition on the weak Minty parameter can be relaxed by further reducing thelength of the update step, and this is done adaptively. To avoid the need for additional hyperparameters, a backtracking line search isalso proposed, which may incur extra gradient computations or require second-order information (in contrast to the adaptive stepsize we propose in Algorithm 3). A different approach is taken by focusing on the min-max setting and using multiple ascent stepsper descent step, achieving the same O(1/k) rate as EG. Minty solutions. Numerous studies have presented various methods for scenarios where the problem at hand has a Minty solution.It was shown that weakly monotone VIs can be solved by iteratively adding a quadratic proximity term and repeatedly optimizingthe resulting strongly monotone VI using any convergent method. The convergence of the OGDA method was proven, but without aspecific rate. It was noted that the convergence proof for the golden ratio algorithm (GRAAL) is valid without any changes. Whilethe assumption that a Minty solution exists is a generalization of the monotone setting, it is challenging to find non-monotoneproblems that possess such solutions. In our setting, as per Assumption 1, the Minty inequality (MVI) can be violated at any pointby a factor proportional to the squared operator norm. Negative comonotonicity. Although previously studied under the term \"cohypomonotonicity,\" the concept of negative comono-tonicity has recently been explored. It offers a generalization of monotonicity, but in a direction distinct from the concept of Mintysolutions, and only a limited number of studies have examined methods in this context. An anchored version of EG was studied, andan improved convergence rate of O(1/k2) (in terms of the squared operator norm) was shown. Similarly, an accelerated version ofthe reflected gradient method was investigated. Whether such acceleration is possible in the more general setting of weak Mintysolutions remains an open question (any Stampacchia solution to the VI given by a negatively comonotone operator is a weak Mintysolution). Another intriguing observation was made, where for cohypomonotone problems, a monotonically decreasing gradientnorm was demonstrated when using EG. However, we did not observe this in our experiments, emphasizing the need to differentiatethis class from problems with weak Minty solutions. Interaction dominance. The concept of -interaction dominance for nonconvex-nonconcave min-max problems was investigated,and it was shown that the proximal-point method converges sublinearly if this condition is met in y and linearly if it is met in bothcomponents. Furthermore, it was demonstrated that if a problem is interaction dominant in both components, it is also negativelycomonotone. Optimism. The positive effects of introducing the simple modification commonly known as optimism have recently attracted theattention of the machine learning community. Its name comes from online optimization. The idea dates back even further and hasalso been studied in the mathematical programming community.",
  "Notions of solution": "We outline the most frequently used solution concepts in the context of variational inequalities (VIs) and related areas. Theseconcepts are typically defined with respect to a constraint set C Rd. A Stampacchia solution of the VI given by F : Rd Rd is apoint u such that:F(u), u u 0u C.(SVI)In this work, we only consider the unconstrained case where C = Rd, and the above condition simplifies to F(u) = 0. Closelyrelated is the following concept: A Minty solution is a point u C such that:F(u), u u 0u C.(MVI)For a continuous operator F, a Minty solution of the VI is always a Stampacchia solution. The converse is generally not true butholds, for example, if the operator F is monotone. Specifically, there are nonmonotone problems with Stampacchia solutions butwithout any Minty solutions.",
  "Notions of monotonicity": "This section aims to revisit some fundamental and more contemporary concepts of monotonicity and the relationships between them.An operator F is considered monotone if:F(u) F(v), u v 0.Such operators naturally arise as the gradients of convex functions, from convex-concave min-max problems, or from equilibriumproblems. Two frequently studied notions that fall into this category are strongly monotone operators, which satisfy:F(u) F(v), u v u v2,and cocoercive operators, which fulfill:F(u) F(v), u v F(u) F(v)2.(2)Strongly monotone operators emerge as gradients of strongly convex functions or in strongly-convex-strongly-concave min-maxproblems. Cocoercive operators appear, for instance, as gradients of smooth convex functions, in which case (2) holds with equalto the inverse of the gradients Lipschitz constant. Departing from monotonicity. Both of the aforementioned subclasses of monotonicity can serve as starting points for exploringthe non-monotone domain. Given that general non-monotone operators may display erratic behavior, such as periodic cycles andspurious attractors, it is reasonable to seek settings that extend the monotone framework while remaining manageable. First andforemost is the extensively studied setting of -weak monotonicity:F(u) F(v), u v u v2.Such operators arise as the gradients of the well-studied class of weakly convex functions, a rather general class of functions as itincludes all functions without upward cusps. In particular, every smooth function with a Lipschitz gradient turns out to fulfill thisproperty. On the other hand, extending the notion of cocoercivity to allow for negative coefficients, referred to as cohypomonotonicity,has received much less attention and is given by:F(u) F(v), u v F(u) F(v)2.Clearly, if a Stampacchia solution exists for such an operator, then it also fulfills Assumption 1. Behavior with respect to the solution. While the above properties are standard assumptions in the literature, it is usually sufficientto require the corresponding condition to hold when one of the arguments is a (Stampacchia) solution. This means that instead ofmonotonicity, it is enough to ask for the operator F to be star-monotone, i.e.,F(u), u u 0,or star-cocoercive,F(u), u u F(u)2.In this spirit, we can provide a new interpretation to the assumption of the existence of a weak Minty solution as asking for theoperator F to be negatively star-cocoercive (with respect to at least one solution). Furthermore, we want to point out that while theabove star notions are sometimes required to hold for all solutions u, in the following we only require it to hold for a single solution.",
  "L, we can find a small enough such that the above bound holds": "The first observation is that we would like to choose a as large as possible, as this allows us to treat the largest class of problemswith < a. To be able to choose a large step size a, we must decrease , as evident from (3). However, this degrades the algorithmsspeed by making the update steps smaller. The same effect can be observed for EG+ and is therefore not surprising. One couldderive an optimal (i.e., minimizing the right-hand side) from Theorem 3.1, but this results in a non-intuitive cubic dependence on. In practice, the strategy of decreasing until convergence is achieved, but not further, yields reasonable results.",
  "In particular, we can choose = 1 and a <12L": "There are different works discussing the convergence of OGDA in terms of the iterates or a gap function with a <12L. However, wewant to compare the above bound to more similar results on rates for the best iterate in terms of the operator norm. The same rate asours for OGDA is shown, but requires the conservative step size bound a 1 16L. This was later improved to a 13L. All of theseonly deal with the case = 1. The only other reference that deals with a generalized (i.e., not necessarily = 1) version of OGDAis another work, where the resulting step size condition is a 2 4L , which is strictly worse than ours for any . To summarize, notonly do we show for the first time that the step size of a generalization of OGDA can go above12L, but we also provide the leastrestrictive bound for any value of .",
  "OGDA+ stochastic": "In this section, we discuss the setting where, instead of the exact operator F, we only have access to a collection of independentestimators F(, i) at every iteration. We assume here that the estimator F is unbiased, i.e., E[F(uk, )|uk1] = F(uk), and hasbounded variance E[F(uk, ) F(uk)2] 2. We show that we can still guarantee convergence by using batch sizes B of orderO(1).",
  "EG+ with adaptive step sizes": "In this section, we present Algorithm 3, which is able to solve the previously mentioned problems without any knowledge of theLipschitz constant L, as it is typically difficult to compute in practice. Additionally, it is well known that rough estimates will lead tosmall step sizes and slow convergence behavior. However, in the presence of weak Minty solutions, there is additional interest inchoosing large step sizes. We observed in Theorem 3.1 and related works the fact that a crucial ingredient in the analysis is that thestep size is chosen larger than a multiple of the weak Minty parameter to guarantee convergence at all. For these reasons, we wantto outline a method using adaptive step sizes, meaning that no step size needs to be supplied by the user and no line-search is carriedout. Since the analysis of OGDA+ is already quite involved in the constant step size regime, we choose to equip EG+ with an adaptivestep size which estimates the inverse of the (local) Lipschitz constant, see (4). Due to the fact that the literature on adaptive methods,especially in the context of VIs, is so vast, we do not aim to give a comprehensive review but highlight only a few with especiallyinteresting properties. In particular, we do not want to touch on methods with a linesearch procedure, which typically result inmultiple gradient computations per iteration. We use a simple and therefore widely used step size choice that naively estimates the local Lipschitz constant and forces a monotonedecreasing behavior. Such step sizes have been used extensively for monotone VIs and similarly in the context of the mirror-proxmethod, which corresponds to EG in the setting of (non-Euclidean) Bregman distances. A version of EG with a different adaptive step size choice has been investigated, with the unique feature that it is able to achieve theoptimal rates for both smooth and nonsmooth problems without modification. However, these rates are only for monotone VIs andare in terms of the gap function. One of the drawbacks of adaptive methods resides in the fact that the step sizes are typically required to be nonincreasing, whichresults in poor behavior if a high-curvature area was visited by the iterates before reaching a low-curvature region. To the best of ourknowledge, the only method that is allowed to use nonmonotone step sizes to treat VIs and does not use a possibly costly linesearchis the golden ratio algorithm. It comes with the additional benefit of not requiring a global bound on the Lipschitz constant of F atall. While it is known that this method converges under the stronger assumption of the existence of Minty solutions, a quantitativeconvergence result is still open.",
  "(a/2 )uk0 u2": "Algorithm 3 presented above provides several benefits but also some drawbacks. The main advantage resides in the fact that theLipschitz constant of the operator F does not need to be known. Moreover, the step size choice presented in (4) might allow usto take steps much larger than what would be suggested by a global Lipschitz constant if the iterates never, or only during lateriterations, visit the region of high curvature (large local L). In such cases, these larger step sizes come with the additional advantagethat they allow us to solve a richer class of problems, as we are able to relax the condition <14L in the case of EG+ to < a/2,where a = limk ak /L.",
  "On the other hand, we face the problem that the bounds in Theorem 4.1 only hold after an unknown number of initial iterations whenak/ak+1 1": "is finally satisfied. In theory, this might take a long time if the curvature around the solution is much higher than inthe starting area, as this will force the need to decrease the step size very late into the solution process, resulting in the quotientak/ak+1 being too large. This drawback could be mitigated by choosing smaller. However, this will result in poor performancedue to small step sizes. Even for monotone problems where this type of step size has been proposed, this problem could not becircumvented, and authors instead focused on the convergence of the iterates without any rate.",
  "Numerical experiments": "In the following, we compare the EG+ method with the two methods we propose: OGDA+ and EG+ with adaptive step size (seeAlgorithm 1 and Algorithm 3, respectively). Last but not least, we also include the CurvatureEG+ method, which is a modificationof EG+ that adaptively chooses the ratio of extrapolation and update steps. In addition, a backtracking linesearch is performed withan initial guess made by second-order information, whose extra cost we ignore in the experiments.",
  "x, Sy ,(5)": "where R Rmn and S Rmn with x, Sy > 0 for all x m, y n, with := {z Rd : zi > 0, di=1 zi = 1} denotingthe unit simplex. Expression (5) can be interpreted as the value V (x, y) for a stochastic game with a single state and mixed strategies. We see an illustration of a particularly difficult instance of (5). Interestingly, we still observe good convergence behavior, althoughan estimated is more than ten times larger than the estimated Lipschitz constant.",
  "4z2 1": "2z. This problem exhibits a Stampacchia solution at (x, y) (0.08, 0.4), but also two limitcycles not containing any critical point of the objective function. In addition, it was also observed that the limit cycle closer tothe solution repels possible trajectories of iterates, thus \"shielding\" the solution. Later, it was noticed that, restricted to the box(x, y) < 3, the above-mentioned solution is weak Minty with 2 0.477761, which is much larger than12L 0.08. In linewith these observations, we can see that none of the fixed step size methods with a step size bounded by 1 L converge. In light of thisobservation, a backtracking linesearch was proposed, which potentially allows for larger steps than predicted by the global Lipschitzconstant. Similarly, our proposed adaptive step size version of EG+ (see Algorithm 3) is also able to break through the repellinglimit cycle and converge to the solution. On top of this, it does so at a faster rate and without the need for additional computations inthe backtracking procedure.",
  "Conclusion": "Many intriguing questions persist in the domain of min-max problems, particularly when departing from the convex-concaveframework. Very recently, it was demonstrated that the O(1/k) bounds on the squared operator norm for EG and OGDA for thelast iterate (and not just the best one) are valid even in the negatively comonotone setting. Deriving a comparable statement in thepresence of merely weak Minty solutions remains an open question. In general, our analysis and experiments seem to suggest that there is minimal benefit in employing OGDA+ over EG+ for themajority of problems, as the reduced iteration cost is counterbalanced by the smaller step size. An exception is presented by problem(7), which is not covered by theory, and OGDA+ is the only method capable of converging. Finally, we note that the previous paradigm in pure minimization of \"smaller step size ensures convergence\" but \"larger step sizegets there faster,\" where the latter is typically constrained by the reciprocal of the gradients Lipschitz constant, does not appearto hold true for min-max problems anymore. The analysis of various methods in the presence of weak Minty solutions indicatesthat convergence can be lost if the step size is excessively small and sometimes needs to be larger than 1"
}