{
  "Abstract": "Computing the partition function, Z, of an Ising model over a graph of N spins is mostlikely exponential in N.Efficient variational methods, such as Belief Propagation (BP)and Tree Re-Weighted (TRW) algorithms, compute Z approximately by minimizing therespective (BP- or TRW-) free energy. We generalize the variational scheme by buildinga -fractional interpolation, Z(), where = 0 and = 1 correspond to TRW- and BP-approximations, respectively. This fractional scheme coined Fractional Belief Propagation(FBP) guarantees that in the attractive (ferromagnetic) case Z(T RW ) Z() Z(BP ), andthere exists a unique (exact) such that Z = Z(). Generalizing the re-parametrizationapproach of (Wainwright et al., 2001) and the loop series approach of (Chertkov & Chernyak,2006a), we show how to express Z as a product, : Z = Z() Z(), where the multiplicativecorrection, Z(), is an expectation over a node-independent probability distribution builtfrom node-wise fractional marginals. Our theoretical analysis is complemented by extensiveexperiments with models from Ising ensembles over planar and random graphs of mediumand large sizes. Our empirical study yields a number of interesting observations, such asthe ability to estimate Z() with O(N 2::4) fractional samples and suppression of variation in estimates with an increase in N for instances from a particular random Ising ensemble,where [2 :: 4] indicates a range from 2 to 4. We also verify and discuss the applicability of thisapproach to the problem of image de-noising. Based on these experiments and the theory,we conclude that both the computation of the partition function and the computation ofmarginals can be efficiently performed via FBP at the optimal value of .",
  "Introduction": "Graphical Models (GM) are a major tool of Machine Learning that allow expressing complex statisticalcorrelations via graphs. Ising models are the most widespread GM for expressing correlations between binaryvariables associated with nodes of a graph, where the probability is factorized into a product of terms, eachassociated with an undirected edge of the graph. Many methods of inference and learning in GM are firsttested on Ising models and then generalized, , for example, beyond binary and pair-wise assumptions. In this manuscript, we focus on computing the normalization factor Z (called the partition function), overthe Ising models. The problem is known to be of sharp-P complexity, likely requiring computational effortsthat are exponential in the size (number of nodes, N) of the graph (Welsh, 1991; Jerrum & Sinclair, 1993;Goldberg & Jerrum, 2015; Barahona, 1982). There are three general approximate methods to compute Z:(a) elimination of (summation over) the variables one-by-one (Dechter, 1999; Dechter & Rish, 2003; Liu &Ihler, 2011; Ahn et al., 2018); (b) the variational approach (Yedidia et al., 2001; 2005); (c) Monte Carlo",
  "Published in Transactions on Machine Learning Research (11/2024)": "We also anticipate that all of these developments, presented in this manuscript and others to follow, willhelp to make variational GM techniques competitive with other, and admittedly more popular, methodsof Machine Learning, such as Deep Learning (DL). We foresee that in the future, there will be more ex-amples where variational GM techniques will be enhanced with automatic differentiation, e.g. in the spiritof (Lucibello et al., 2022), and also integrated into modern Deep Learning protocols, e.g.as discussedin(Garcia Satorras & Welling, 2021). This hybrid GM-DL approach is expected to be particularly beneficialand powerful in physics problems where we aim to learn reduced models with graphical structures prescribedby the underlying physics from data.",
  "Relation to Prior Work": "In addition to the aforementioned relations to foundational work on the variational approaches (Yedidiaet al., 2001; 2005), MCMC approaches (Andrieu et al., 2003), and lower and upper variational bounds(Ruozzi, 2012; Wainwright et al., 2003), this manuscript also builds on recent results in other related areas,in particular: We extend the ideas of parameterized interpolation between BP (Yedidia et al., 2001; 2005) andTRW (Wainwright et al., 2003; 2005), in the spirit of fractional BP (Wiegerinck & Heskes, 2002;Chertkov & Yedidia, 2013), thus introducing a broader family of variational approximations. Expanding on the previous point, since our approach can be considered as an interpolation bridgingthe TRW and BP approximations for the GMs partition function, it seems appropriate to cite(Knoll et al., 2023), where another interpolation approach was unveiled. The interpolation discussedin (Knoll et al., 2023) is of an annealing type it starts with the trivial (high-temperature) modelwhere all components are independent, and then the potentials of the pair-wise model are tunedgradually, adjusting the scaling parameter from 0 to 1. At every incremental step, a BP algorithmis employed to track the fixed point, ensuring the methods precision and reliability. The primaryobjective of this approach was to surpass the conventional BP in both accuracy and convergencerates. In contrast, our approach is designed to ascertain the exact value of the partition functionand marginals, thus setting a new standard for precision in the analysis of complex systems. We utilize and generalize re-parametrization (Wainwright et al., 2001), gauge transformation, andloop calculus (Chertkov & Chernyak, 2006a;b; Chertkov et al., 2020) techniques, as well as thecombination of the two (Willsky et al., 2007). Our approach is also related to the development of MCMC techniques with polynomial guarantees,the so-called Fully Randomized Polynomial Schemes (FPRS), developed specifically for Ising modelsof specialized types, e.g., attractive (Jerrum & Sinclair, 1993) and zero-field, planar (Gmez et al.,2010; Ahn et al., 2016).",
  "This Manuscripts Contribution": "We introduce a fractional variational approximation that interpolates between the classical Tree Re-Weighted(TRW) and Belief Propagation (BP) cases. The fractional free energy, F () = log Z(), defined as thenegative logarithm of the fractional approximation to the exact partition function, Z = exp( F), requiressolving an optimization problem, which is achieved practically by running a fractional version of one of thestandard message-passing algorithms. The parameter interpolates between the = 1 and = 0cases, corresponding to BP and TRW, respectively. The interpolation technique, particularly our focus on, which lies somewhere between = 0 and = 1 and for which Z() = Z, is novel to the best ofour knowledge, this is the first manuscript where the interpolation technique is discussed. Basic definitions,including problem formulation for the Ising models and variational formulation in terms of the node andedge beliefs (proxies for the respective exact marginal probabilities), are given in . Assuming that",
  "We show in that under some mild asumptions F () is a continuous and monotone functionof (Theorem 3.1 proved in Appendix B), which is also concave in (Theorem 3.2)": "Our main theoretical result, Theorem 4.1, presented in and proven in Appendix C, statesthat the exact partition function can be expressed as a product of the variational free energy anda multiplicative correction, Z = Z() Z(). The latter multiplicative correction term, Z(), is statedas an explicit expectation of an expression over a well-defined mean-field probability distribution,where both the expression and the mean-field probability distribution are stated explicitly interms of the fractional node and edge beliefs. We note that such a bridge between the exact partitionfunction and the approximate partition function, known as the Loop Series/Calculus, was introducedin Chertkov & Chernyak (2006a;b) and elaborated upon in Willsky et al. (2007) for the case of theBethe (Belief Propagation), where = 1. However, to the best of our knowledge, it has not beenreported in the literature for any other values of interpolating between BP and TRW,particularly for = 0 corresponding to TRW.",
  "The theory is extended with experiments reported in . Here we show, in addition to confirming ourtheoretical statements (and thus validating our simulation settings), that:": "Evaluating Z() Z() at different values of and confirming that the result is independent of suggests a novel approach to a reliable and efficient estimate of the exact Z the Fractional MessagePassing Algorithm 1. Analyzing ensembles of the attractive Ising models over graphs of size N, we observe that fluctuationsof the value of within the ensemble, where Z() = Z, decrease dramatically with an increase inN. This observation suggests that estimating for an instance from the ensemble allows efficientapproximate evaluation of Z for any other instance from the ensemble. Studying the importance-sampling procedure based on TRW BP, we empirically estimate Z() andobserve convergence with the number of samples.Analyzing the speed of convergence with thenumber of nodes, N, in the Ising model, our experiments show that the correct mean of Z(),evaluated at = , is recovered with N 2 samples. Additionally, the variance of the respectiveimportance sampling is reduced beyond a pre-fixed O(1) tolerance with N 4 samples.",
  "Analysis of mixed Ising ensembles (where attractive and repulsive edges alternate) suggests that forinstances with sufficiently many repulsive edges, finding, may not be feasible": "We demonstrate the effectiveness of our approach in the context of image denoising, as detailed in.7. This application highlights the practical utility of our theoretical developments in areal-world machine learning task. Furthermore, the denoising experiments support the conjecturethat the optimal is special not only because the Fractional Belief Propagation (FBP) at thisvalue yields the exact partition function, but also because estimating marginal probabilities at is significantly more accurate. The error in these estimates decreases as the size of the problemincreases, underscoring the robustness and scalability of our method.",
  "{a,b}EEab(xa, xb),{a, b} E : Eab(xa, xb) = Jabxaxb haxa/da + hbxb/db,(2)": "where da is the degree of node a in G and J := (Jab|{a, b} E), h = (ha|a V) are the pair-wise andsingleton vectors, assumed given. E(x; J, h) is the energy function and Z(J, h) is the partition function.Solving the Ising model inference problem means computing Z which generally requires an effort that isexponential in N = |V|.",
  "As discussed in in detail, = 0 results in Z() which upper bounds the exact Z, and = 1 resultsin a lower bound if the model is attractive": "The optimization over beliefs in Eq. (8) can be restated in the Lagrangian form (see Appendix A.1). Fixedpoints of the Lagrangian (potentially many) satisfy the so-called message-passing equations (see AppendixA.2). We will refer to the iterative algorithm that finds marginal probabilities B and respective messagevariables by solving these equations as the basic Fractional Belief Propagation (FBP) algorithm. Consistentwith the equations from Appendices A.1 and A.2, the resulting messages can then be used to find the FBPapproximation, Z(), for the partition function Z as follows:",
  "Properties of the Fractional Free Energy": "Given the construction of the fractional free energy, described above in .3 and also detailed inAppendix A, we are ready to make the following statements.Theorem 3.1. [Monotonicity of the Fractional Free Energy] Assuming := (ab|{a, b} E) is fixed, andB() is differentiable in , F () is a continuous, monotone function of .",
  "Proof. See Appendix B": "Remark. The continuity of B() in is a technical condition that almost always holds. This condition maybreak, albeit in some rare cases, when at a particular value of , two (or more) distinct local minima of thefractional free energy F ()(B) (considered as a function of B) yield the same value. In such instances, as wevary and pass through this special value of , the absolute minimum can jump from one local minimumto another.",
  "where we used the fact that F ()(B()) = minB F ()(B) F ()(B()) at the inequality step. This provesthe concavity of F () in": "Note that all the statements in this manuscript so far are made for arbitrary Ising models, i.e., without anyrestrictions on the graph and vectors of the pair-wise interactions, J, and singleton biases, h. If the discussionis limited to attractive (ferromagnetic) Ising models, {a, b} E : Jab 0, the following statement becomesa corollary of Theorem 3.1:",
  "Lemma 3.3. [Exact Fractional] In the case of an attractive Ising model, any fixed , and also assumingthat B() is differentiable in , there exists such that Z() = Z": "Proof. In the case of attractive Ising model, BP provides a lower bound on the exact partition function,Z(=1) Z, as proven in (Ruozzi, 2012). On the other hand, we know from (Wainwright & Jordan, 2008),and also by construction, that Z(=0) Z, i.e., the TRW estimate of the partition function provides an upperbound to the exact partition function. These lower and upper bounds, combined with the monotonicity ofZ() stated in Theorem 3.1, result in the desired statement.",
  ". Return Z = Z()": "Suppose we have access to the exact value of the partition function Z. Then, Theorem 4.1 suggests Algorithm2, which allows us to identify the optimal , that is, the value of for which FBP (which can be evaluatedefficiently, typically in linear time with respect to the problem size) outputs the exact result for the partitionfunction. The exact value of Z, required as an input for Algorithm 2, can be determined via the followingTRW- (or BP-) based computations:",
  "Setting, Use Cases and Methodology": "In this section, we present the results of our numerical experiments, supporting and also further developingthe theoretical results of the preceding sections. Specifically, we will describe the details of our experimentswith the Ising model in the following use cases: (1) Over an exemplary planar graph N N square grid,where N = [3 :: 5]; (2) Over a fully connected graph, KN, where N = [9 :: 52]. The notation [a :: b] indicatesa range from a to b. In both cases, we consider attractive models and mixed models that is, models with some interactions beingattractive (ferromagnetic), Jab > 0, and some repulsive (antiferromagnetic), Jab < 0. We experiment withthe zero-field case, h = 0, and also with the general (non-zero field) case. All of our models are disorderedin the sense that we have generated samples of random J and h. Specifically, in the attractive (mixed)case, components of J are i.i.d. from the uniform distribution, U(0, 1) (U(1, 1)), and components of h arei.i.d. from U(1, 1). In some of our experiments, we draw a single instance of J and h from the respectiveensemble. However, in other experiments aimed at analyzing the variability within the respective ensemble we show results for a number of instances. We acknowledge that there is significant flexibility in selecting a set of spanning trees and then re-weightingrespective contributions to := (ab | {a, b} E) according to Eq. (7). (See some discussion of experimentswith possible in (Wainwright et al., 2005).) However, we chose not to test this flexibility. Instead, inall of our experiments, is chosen uniformly for a given graph. A direct corollary of Lemma 7.3.2 from(Wainwright, 2002) is that if the edge-uniform re-weighting is feasible, the following relation holds for alla, b E: ab = (|V|1)/|E|. This lemma allows us to restate the set of linear constraints defining the polytopein the TRW rules of Eq. (7) solely in terms of the edge-weights, ab, thereby excluding tree-weights. Moreover,it was shown in (Wainwright, 2002) that the edge-uniform re-weighting is feasible and optimal, providing thelowest TRW upper-bound in the case of highly symmetric graphs, such as fully connected or double-periodicsquare grids. Our experiments are conducted on graphs where identifying the feasibility of edge-uniformre-weighting is straightforward. However, we also note, consistently with a remark in (Wainwright, 2002),that there exist some exotic graphs for which edge-uniform assignment is infeasible. We introduced the -optimal FBP Algorithm 1, which approximately calculates the partition function fora specified Ising model on a graph G = (V, E).This algorithm generalized traditional message-passingmethods by interpolating between the Tree-Reweighted case ( = 0) and the Belief Propagation case ( =1) for any .Utilizing Theorem 4.1, the algorithm identifies a particular value, denoted as ,where the fractional partition function Z() is approximately equal to the exact partition function Z. Thealgorithm employs Eq. (12) to determine the correction factor Z() utilizing fractional node and edge beliefs.Additionally, we initialize the edge appearance probabilities ab uniformly. To compute the fractional free energy, F () (minus the log of the fractional estimate for the partitionfunction), we generalize the approach of (Bixler & Huang, 2018), which allows efficient, sparse-matrix-basedimplementation. Our code is available on To compare the fractional estimate F () = log Z() with the exact free energy, F = log Z, we either usedirect computations (feasible for the 8 8 grid or smaller and for the fully connected graph over 64 nodesor smaller) or, in the case of the planar grid and zero-field, when computation of the partition function isreduced to computing a determinant, we use the code from (Likhosherstov et al., 2019) (see also referencestherein). Our computations are done for values of equally spaced with the increment 0.05, between 0 and1.",
  "(d)": ": Planar zero-field Ising models for n n grid with J U(0, 1). For each n, four different instancesare generated by sampling uniformly at random from the unit interval and the exact values, , are shownby open symbols on each graph. (a) 10 10 (b) 20 20 (c) 30 30 (d) 40 40.",
  "Relation between Exact and Fractional": "Figs. 1, also provide empirical confirmation of Lemma 3.3 on existence of in the case of attractive Isingmodel for which Z() = Z. Moreover, the full statement of Theorem 4.1, i.e., the equality between the left-and right-hand sides of Eq. (11), is also confirmed in all of our simulations (over Ising models, attractive ornot) with high accuracy (when we can verify it by computing Z directly). 0.00.20.40.60.81.0 4.10 4.15 4.20 4.25 4.30 4.35 4.40 log Z( ) N",
  "(b)": ": F () vs for a number of instances (shown in different colors) drawn for the Ising model ensemblesover, (a) 3 3 grid, and (b) K9 graph, where elements of J and h are i.i.d. from U(0, 1). Circles markrespective exact values, . 0.00.20.40.60.81.0 45.0 45.5 46.0 46.5 47.0 log Z( )",
  "Fractional Approach for Mixed (Attractive and Repulsive) Cases": "in Appendix D shows two distinct situations which may be observed in the mixed case where someof the interactions are attractive but others are repulsive, allowing Z() to be smaller or larger than Z. Theformer case is akin to the attractive model and , while in the latter case there exists no such that Z() = Z.",
  "Application in Machine Learning Image De-Noising": "Consider a black-and-white image represented as a binary vector, x = (xa = 1|a V), where V is the setof nodes in a two-dimensional n n square grid. For example, the cameraman image shown in is a256 256 = 65536 pixel image, which is represented as a binary vector, x {1}65536. The de-noising problem is set up as follows Koller & Friedman (2009): assume that an image is sent througha noisy Bernoulli channel, where each pixel is flipped independently with a probability . The noisy versionof the image y is received, and the task is to recover the original image x. We also make the plausible assumption that images are constructed in such a way that the probability fortwo neighboring pixels a and b to have the same values xa and xb, exp(J)/(cosh(J)), is higher than theprobability exp(J)/(cosh(J)) that they have opposite values, where J > 0.",
  "Total number of pixels": "We find that in the BP and TRW cases, the optimal J values (minimizing the error) are 0.28 and 0.32respectively. In the case of the basic FBP, we optimize not only over J but also over , resulting in optimalvalues of J = 0.3 and = 0.1. We observe that the basic FBP algorithm demonstrates improved performancecompared to both BP and TRW algorithms. Note that this example is too large to reliably evaluate our -optimal FBP algorithm 1.However, weconjecture that the value of obtained by minimizing the error will converge, in the thermodynamic limitof a large graph, to the value of which is optimal within Algorithm 1.This conjecture is intuitivelybased on two facts. First, the error is expressed in terms of pixel marginals. Second, the that optimizesthe pixel marginals should be close to the that optimizes the partition function. This is because, in thethermodynamic limit, the marginals can be reformulated in terms of the partition functions of the graphicalmodels, which differ from the original one only by fixing the respective xa variable (to 1) at a single pixelamong many.",
  ": Different algorithms and their corresponding errors (listed below each image) for image de-noising": "It is also important to emphasize that even though the optimal was defined for Z the partition function inspired by results reported in .5, we have used it in this section to compute marginals. Indeed,a major empirical observation made in .5 suggests that computing the multiplicative correction Zby sampling at the optimal value, , requires significantly fewer samples. In other words, the variance ofsampling is minimal at the optimal value. This suggests that evaluating other expectations, particularlythose corresponding to marginals, will also require fewer samples.Moreover, we also observed that thevariance decreases with the model size. Based on all these observations, as well as the empirical advantage ofevaluating marginals via FBP at illustrated in , we hypothesize that evaluating FBP at the optimal will provide exact results not only for the partition function but also asymptotically (when the problemsize increases) for marginals. Adding to this discussion, observations reported in .4 on the concentration of in large ensemblesprovide further support for the hypothesis that it is sufficient to estimate for only one (representative)GM from the ensemble. This result can then be used not only to estimate the partition function in otherGM models of the ensemble but also to compute marginals via FBP efficiently. Note that this hypothesisalso emphasizes the utility of Algorithm 2, which allows us to estimate from the exact Z.",
  "Conclusions and Path Forward": "This manuscript suggests a new promising approach to evaluating inference in Ising Models. The approachconsists in, first, solving a fractional variational problem via a distributed algorithm resulting in the fractionalestimations for the partition function and marginal beliefs.We then compute multiplicative correctionto the fractional partition function by evaluating a well-defined expectation of the mean-field probabilitydistribution both constructed explicitly from the marginal beliefs.We showed that the freedom in thefractional parameter is useful, e.g. for finding optimal value of the parameter, , where the multipicativecorrection is unity. Our theory-validated experiments result in a number of interesting observation, such asstrong suppression of fluctuations of in large ensembles. We also demonstrate how the FBP approach canefficiently and more accurately solve the de-noising problem in machine learning compared to BP and TRWapproaches. Finally, the combination of theoretical and empirical observations led us to hypothesize thatthe optimal value of , computed for a single graphical model within an ensemble, provides asymptoticallyexact values (in the limit of large and increasing system size) not only for the partition function but also forthe marginals.",
  "Proving or disproving the concentration conjecture and small number of samples conjecture, madeinformally in .4 and .5, respectively": "Generalizing the interpolation technique, e.g. building a scheme interpolating between TRW andMean-Field (see e.g. Chapter 5 of Wainwright & Jordan (2008)). This will be of special interest forthe case of the mixed ensembles which are generally out of reach of the fractional approach (betweenTRW and BP) presented in the manuscript.",
  "Rina Dechter and Irina Rish. Mini-buckets: A general scheme for bounded inference. J. ACM, 50(2):107153,Mar 2003. ISSN 0004-5411": "Vctor Garcia Satorras and Max Welling. Neural enhanced belief propagation on factor graphs. In ArindamBanerjee and Kenji Fukumizu (eds.), Proceedings of The 24th International Conference on Artificial In-telligence and Statistics, volume 130 of Proceedings of Machine Learning Research, pp. 685693. PMLR,1315 Apr 2021. Laurent Ghaoui and Assane Gueye. A convex upper bound on the log-partition function for binary distri-butions. In D. Koller, D. Schuurmans, Y. Bengio, and L. Bottou (eds.), Advances in Neural InformationProcessing Systems, volume 21. Curran Associates, Inc., 2008. Leslie Ann Goldberg and Mark Jerrum. A complexity classification of spin systems with an external field. Pro-ceedings of the National Academy of Sciences, 112(43):1316113166, 2015. doi: 10.1073/pnas.1505664112.",
  "Daphne Koller and Nir Friedman. Probabilistic Graphical Models: Principles and Techniques. Adaptivecomputation and machine learning. MIT Press, Cambridge, MA, USA, 2009": "Valerii Likhosherstov, Yury Maximov, and Misha Chertkov. Inference and sampling of k33-free ising models.In Kamalika Chaudhuri and Ruslan Salakhutdinov (eds.), Proceedings of the 36th International Conferenceon Machine Learning, volume 97 of Proceedings of Machine Learning Research, pp. 39633972. PMLR,0915 Jun 2019. Qiang Liu and Alexander Ihler. Bounding the partition function using hlders inequality. In Proceedingsof the 28th International Conference on International Conference on Machine Learning, ICML11, pp.849856, Madison, WI, USA, 2011. Omnipress. ISBN 9781450306195. Carlo Lucibello, Fabrizio Pittorino, Gabriele Perugini, and Riccardo Zecchina. Deep learning via messagepassing algorithms based on belief propagation. Machine Learning: Science and Technology, 3(3):035005,Jul 2022. Nicholas Ruozzi. The bethe partition function of log-supermodular graphical models. In F. Pereira, C.J.Burges, L. Bottou, and K.Q. Weinberger (eds.), Advances in Neural Information Processing Systems,volume 25. Curran Associates, Inc., 2012.",
  ",": "where L()(B; , ) is the (extended) Lagrangian dependent on both the primary variables (beliefs, B) and thenewly introduced dual variables, := (ba(xa) R|a V, b a, xa = 1) and := (a R|a V).The stationary point of the Lagrangian (14), assuming that it is unique, is defined by the following systemof equations",
  "xbB()ab (xa, xb)": "Note (on a tangent), that the ()-(message) variables introduced here are related but not equivalent to theM ()-messages which can also be seen used in the BP-literature, see e.g. .1.3 of (Wainwright &Jordan, 2008). Specifically in the case of BP, i.e. when ()ab = 1, relation between () and M () variablesis as follows, (()ba(xa))da1 =",
  "DMore Figures from Numerical Experiments": ", mentioned in .4 shows for a number of instances drawn from the respective ensembles ofthe Ising model (over planar and complete graphs). We observe that in the planar case, [0.75, 0.95],while in the case of the complete graph, [0.05, 0.15]. , mentioned in .6, shows results for the mixed case when the pair-wise interaction can varyin sign from edge to edge. In this mixed case, as seen in the presented examples, we can not guarantee thatBP provides a lower bound on the partition function, and thus may or may not be identified within the interval."
}