{
  "Abstract": "This manuscript takes a critical look at the interactions between Koopman theory and repro-ducing kernel Hilbert spaces with an eye towards giving a tighter theoretical foundation forKoopman based dynamic mode decomposition (DMD), a data driven method for modelinga nonlinear dynamical system from snapshots. In particular, this paper explores the variousnecessary conditions imposed on the dynamics when a Koopman operator is bounded orcompact over a reproducing kernel Hilbert space.",
  "Ultimately, it is determined that for many RKHSs, the imposition of compactness or bound-edness on a Koopman operator forces the dynamics to be ane": "However, a numerical method is still recovered in more general cases through the consid-eration of the Koopman operator as a closed and densely dened operator, which requiresa closer examination of the connection between the Koopman operator and a RKHS. Byabandoning the feature representation of RKHSs, the tools of function theory are brought tobear, and a simpler algorithm is obtained for DMD than what was introduced in Williamset al (2016). This algorithm is also generalized to utilize vector valued RKHSs.",
  "Introduction": "Dynamic mode decomposition (DMD) has been gaining traction as a model-free method of making short-runpredictions for nonlinear dynamical systems using data obtained as snapshots of trajectories. DMD aims toobtain a nite rank representation of the Koopman operator by studying its action on the full state observable(i.e. the identity function) (Rowley et al., 2009). Koopman operators over reproducing kernel Hilbert spaces(RKHSs) were studied to take advantage of innite dimensional feature spaces to extract more informationfrom the snapshots of a system in (Williams et al., 2015a). This perspective also enacts a dimensionalityreduction by formulating the DMD method in a reproducing kernel Hilbert space (RKHS) framework andimplicitly using the kernel trick to compute inner products in the high-dimensional space of observables. In",
  "(Williams et al., 2015b), it is shown that kernel-based DMD produces a collection of Koopman modes thatagrees with other DMD results in the literature": "The introduction of kernel based techniques for Koopman analysis and DMD has catalyzed a new direction forKoopmanism. The new perspective added by kernel methods is that of approximations and it is at the centerof the work presented in this manuscript. Universal RKHSs, such as those corresponding to Gaussian RBFsand exponential dot product kernel functions, have the ability to approximate any continuous function overa compact subset of Rn to any desired accuracy up to computational precision. Moreover, when the kernelfunction is continuous or bounded, convergence in RKHS norm yields point wise everywhere convergenceand uniform convergence over compact subsets of Rn (Steinwart & Christmann, 2008). This everywhereconvergence stands in contrast to the perspective through the lens of ergodic methods, where convergenceresults only hold almost everywhere.For additional insight into the point wise everywhere convergenceproperty described above see example 1 in Appendix A.1. The study of dynamical systems through the Koopman formalism over RKHSs manifests as a search forfunctions that are close to being eigenfunctions of the Koopman operator, rather than the actual eigenfunc-tions. Since only a nite amount of data can be available for the study of an innite dimensional operator,actual eigenfunctions typically cannot be computed. In fact, there is no requirement that KF even has anyeigenfunctions. The universality property arises in the search for Koopman eigenfunctions, which, givena particular Koopman operator and kernel space, might not exist, since the existence of an eigenfunctiondepends on the Hilbert space. However, the formal equation, (F(x)) (x) = 0 may still hold for somecontinuous function . If one is working over a RKHS corresponding to a universal kernel, then for any givencompact set and > 0, there is a function H such that |(x) (x)| < for all x in that compact set,which provides for an approximate eigenfunction. Here we dene approximate eigenfunctions as follows:",
  "Denition 1. For > 0 an approximate eigenfunction is a function in the Hilbert space H together with C such that |KF (x) (x)| < for all x X": "This is particularly important for DMD methods, which attempt to construct a nite rank approximationof a Koopman operator from a nite collection of observed snapshots. Note that obtaining approximateeigenfunctions as in Example 1 is not dissimilar to the objective of ergodic methods, where approximation ofsystem invariants and eigenfunctions using time averages is sought. The existence of eigenfunctions dependson the selection of the Hilbert space, as will be shown in , and eigenfunctions may not be presenteven in the L2 ergodic setting (Budii et al., 2012). The objective of this manuscript is to present the kernel perspective of Koopmanism as a distinct study fromthe ergodic perspective. With that goal in mind, the paper is structured in the following way:",
  ": Discusses properties of Koopman operators over RKHSs. It is demonstrated that assump-tions of boundedness and compactness hold for a very small collection of Koopman operators": ": A numerical algorithm for a Koopman based DMD method is presented, which relaxes theassumptions of bounded and compact Koopman operators to densely dened Koopman operators.This yields a new theoretical foundation for the study of Koopman DMD over RKHSs. The newalgorithm still relies on some of the same matrices presented in (Williams et al., 2015b)."
}