{
  "Abstract": "Intelligent Tutoring Systems (ITSs) can pro-vide personalized and self-paced learning ex-perience. The emergence of large languagemodels (LLMs) further enables better human-machine interaction, and facilitates the devel-opment of conversational ITSs in various dis-ciplines such as math and language learning.In dialogic teaching, recognizing and adaptingto individual characteristics can significantlyenhance student engagement and learning effi-ciency. However, characterizing and simulatingstudents persona remain challenging in train-ing and evaluating conversational ITSs. In thiswork, we propose a framework to constructprofiles of different student groups by refiningand integrating both cognitive and noncogni-tive aspects, and leverage LLMs for personality-aware student simulation in a language learningscenario. We further enhance the frameworkwith multi-aspect validation, and conduct ex-tensive analysis from both teacher and studentperspectives. Our experimental results showthat state-of-the-art LLMs can produce diversestudent responses according to the given lan-guage ability and personality traits, and triggerteachers adaptive scaffolding strategies.",
  "Introduction": "Intelligent Tutoring Systems (ITSs) aim to offer in-dividualized learning process, instant feedback, anddynamic knowledge tracing to learners (Nye et al.,2014; Kulik and Fletcher, 2016; Mousavinasabet al., 2021). To align teaching activities with dif-ferent characteristics and needs of students, ITSsleverage various techniques to generate learningcontents, personalized instructional strategies andadaptive learning process (VanLEHN, 2011; Maet al., 2014; Graesser et al., 2018). Given the cru-cial role of dialogic teaching in stimulating and de-veloping students understanding, thinking, and rea-soning, conversational ITSs could significantly im-",
  ": Tutoring conversation segments of two stu-dents with different personality traits": "prove learning experience and outcomes (Paladinesand Ramirez, 2020). The recent emergence of largelanguage models (LLMs) further reduces the re-liance on domain-specific supervision from manualannotation (MacLellan and Koedinger, 2022), andcan be adopted as tutoring agents for math (Macinaet al., 2023a; Sonkar et al., 2023), language learn-ing (Kasneci et al., 2023; Liu et al., 2024), andsocial skill coaching (Hsu et al., 2023).Aside from delivering effective and fluent dia-logic teaching, there is increased interest in explor-ing LLMs potential for personalized education(Stasaski et al., 2020; Macina et al., 2023b; Sonkaret al., 2023). In the real-world classroom, accord-ing to students characteristics, human tutors adoptscaffolding strategies to improve their engagementand knowledge acquisition (Alexander, 2006; Mer-cer et al., 2012). Among these characteristics, per-sonality traits play a significant role in shaping stu- dents learning style, motivation, and achievement(Poropat, 2009; Komarraju et al., 2011). However,characterizing and simulating students persona re-main challenging when building and evaluatingconversational ITSs. Considering the complexityand diversity of language and persona, it requiresa certain amount of real participants to constructthe training data, and is difficult to scale up: theprocess of user recruitment, data collection, andannotation is labor-intensive and time-consuming,and student groups in pilot studies are often in smallsize and lack diversity. On the other hand, for quan-titative evaluation, previous studies primarily focuson post-learning aspects, such as student feedbackand learning outcomes (Kulik and Fletcher, 2016;Wang et al., 2023a), while pay less attention topersonality-related dialogic analysis (e.g., scaffold-ing and engagement).In this work, we propose a personality-awaresimulation and validation framework for conversa-tional ITSs. To anchor a practical application, weconduct a case study on image description for lan-guage learning. As shown in , for primaryschool students, image description and storytellingtasks are commonly used to assess and improvetheir language ability from word- and sentence-level to discourse-level skills (Justice et al., 2010).To better reflect students characteristics and lan-guage ability, we modulate the models generationfrom both cognitive and noncognitive perspectives.More specifically, given that personality is one ofthe most influential noncognitive factors on lan-guage development (Drnyei, 2014), we refine andconstruct the five personality types for tutoring con-versations (i.e., BF-TC) based on the Big Five the-ory (Costa and McCrae, 1999), and integrate theminto student simulation instructions. By modulatingpersonality traits, one can collect diverse dialoguesamples. To extensively evaluate of the simulationand reveal its pedagogical influence, we propose amulti-aspect validation, and conduct a quantitativeanalysis of the generated tutoring conversationsat dialogue and utterance level, from student andteacher perspectives.Our results on representative LLMs indicate that:(1) LLMs can follow instructions to simulate stu-dents with specified language abilities and per-sonality traits, yet there remains a margin for im-provement. (2) Student simulation following ourBF-TC scheme shows a high correlation with thevanilla Big Five theory. (3) LLM-based tutoringsystems are shown to adapt scaffolding strategies to fit different personality traits. Our work highlightsthe importance of incorporating scalable, personal-ized simulations to better understand and enhancehuman-AI interactions in educational scenarios,and it paves a new way to the designing, develop-ing, and evaluating conversational ITSs, ensuring amore engaging and effective learning environmenttailored to diverse student needs.",
  "Intelligent Tutoring Systems": "The advancement of ITSs has marked a significantstep forward in education practice (Graesser et al.,2018; Demszky and Hill, 2023; Wang et al., 2023b).These systems provide personalized learning ex-periences and instant feedback (Chaffar and Fras-son, 2004; Harley et al., 2015; Grivokostopoulouet al., 2017), tailored to learners characteristicsand needs (Dzikovska et al., 2014; Grawemeyeret al., 2016; Nihad et al., 2017), and are shown topositively influence students engagement in learn-ing and academic performance (Kulik and Fletcher,2016; Xu et al., 2019).Dialogue tutor is a particular type of intelligenttutoring system that interacts with students via nat-ural language conversation (Nye et al., 2014; Ruanet al., 2019). In STEM domains, conversationalITSs can facilitate university students in problem-solving by providing real-time feedback and hintsin text formats (Nye et al., 2023; Paladines andRamirez, 2020; Arnau-Gonzlez et al., 2023). Priorwork in this field has widely relied on rule-basedsystems with human-crafted domain knowledge(Nye et al., 2014; Graesser et al., 2018), or data-driven approaches that require certain amount ofhuman annotation for supervised learning (MacLel-lan and Koedinger, 2022). Recent work showsstrong potential of leveraging pre-trained languagemodels to build dialogue tutors with less data su-pervision and higher coherence (Afzal et al., 2019;Demszky and Hill, 2023; Macina et al., 2023b), andcan be further improved by integrating with peda-gogical and learning science principles (Stasaskiet al., 2020; Sonkar et al., 2023; Macina et al.,2023a; Liu et al., 2024).",
  ": Overview of our proposed framework for personality-aware simulation and multi-aspect validation": "nificantly influences an individuals character andmoral values. On the other hand, specific person-ality traits, such as perseverance, emotional stabil-ity, and openness, can impact ones ability beliefs,and academic performance (Busato et al., 1998;Crozier, 2013). In language education, a significantcorrelation has been identified between individualdifferences and language development, showingthe indispensable role of personality traits in learn-ing motivation (Rosander et al., 2011), learningstrategies (Serri et al., 2012), willingness to com-municate (Oz, 2014; Yashima et al., 2018), andlanguage proficiency (Robinson et al., 1994; Ver-hoeven and Vermeer, 2002), and so on. As a result,personality has been recognized as a key individualcharacteristic and a significant predictor of suc-cess in language learning (Dewaele, 2012; Drnyei,2014; Chen et al., 2022). In this work, we focuson modulating the LLMs personality traits (Jianget al., 2023; Dorner et al., 2023) for diverse stu-dent simulation, which can facilitate evaluating anddeveloping personalized scaffolding and tutoringstrategies.",
  "User Simulation for Dialogue Systems": "User simulations are becoming increasingly pop-ular in the field of dialogue systems due to theavailability of large-scale annotated datasets andthe development of advanced machine-learningtechniques. Previous work adopted data-driven ap-proaches such as using recurrent neural networks(Asri et al., 2016; Gur et al., 2018) or transformers(Lin et al., 2022) to learn from data and generatedialogue acts (Asri et al., 2016) or at the utterancelevel (Kreyssig et al., 2018; Cheng et al., 2022; Liuet al., 2022). In addition, research also explores integrating user simulators into conversational in-formation retrieval systems (Wang et al., 2024).These data-driven methods achieve a significantadvantage over rule-based systems by capturingcomplex patterns, such as goal coherence and re-sponse diversity. However, they heavily rely onwell-annotated data, and show low generalizationacross various domains. While recent LLM-baseduser simulation has addressed the above limitationsand investigated in task-oriented dialogue systems,such as booking services (Hu et al., 2023; Terragniet al., 2023), its application to ITSs and personality-aware user simulation still remains limited.",
  "Cognitive Level Simulation": "To reflect the language development of real-worldstudents, we refer to the Narrative Assessment Pro-tocol (NAP) (Justice et al., 2010), a standardizedrubric that is designed to assess students spokennarrative language abilities, and we define stu-dents language abilities across five dimensions:phrases, sentence structure (e.g., making completesentences), modifiers, nouns, and verbs. Moreover,in the cognitive level simulation, students with highlanguage ability demonstrate (1) good comprehen-sion and expression in teacher-student interactions,and (2) the ability to create sentences to describe",
  "Noncognitive Level Simulation": "Noncognitive skills are broadly defined as person-ality traits, character, motivations, and preferencesthat represent patterns of behavior (Kautz et al.,2014). Previous research revealed that personalityis one of the most influential noncognitive factorsimpacting language development (Mercer et al.,2012; Drnyei, 2014). To systematically analyzethe role of personality in learning, researchers em-ploy established frameworks. The Big Five theory(Costa and McCrae, 1999) stands as the most rep-resentative one in personality psychology, and itconsists of five main personality traits: Openness,Conscientiousness, Extraversion, Agreeableness,and Neuroticism, which reflect core aspects of hu-man personality and have significant influences onbehavior (McCrae and Costa, 1987; Costa Jr andMcCrae, 1992).Openness refers to a persons willingness to becurious, imaginative, investigative, and exploring.Learners with higher levels of openness tend tohave curiosity and interest to explore new thingsand phenomena (Verhoeven and Vermeer, 2002;Oz, 2014; Chen et al., 2022).Conscientiousness refers to being responsible,well-organized, and self-disciplinary.Learnerswith higher levels of conscientiousness tend to have positive attitudes and try their best to answerquestions and finish the given task (Pourfeiz, 2015;Dumfart and Neubauer, 2016).Extraversion is characterized by sociability,talkativeness, and passion for engaging in inter-personal and social activities. It is directly linkedwith the students willingness and courage tospeak, communicate, and collaborate (Dumfart andNeubauer, 2016; Cao and Meng, 2020).Agreeableness refers to being helpful, sympathetic,friendly, and caring for others. Students with highagreeableness show greater engagement and morepositive attitudes toward language learning andother events (Shirdel et al., 2018).Neuroticism is related to emotions like anxiety,worry, and nervousness. Students with high levelNeuroticism might easily feel anxiety when en-countering challenging questions (Dewaele, 2013).To build personality-aware simulation in con-versational ITSs, we gain insights into languagelearning of primary school students from the ChildLanguage Data Exchange System (CHILDES)(MacWhinney and Snow, 1990), a collection thatincludes a wide variety of spoken language sam-ples from different age groups and conversationcontexts: The way that students respond to theteachers questions and pay attention to incidents ofthe image could underline their personality. Basedon this observation, we refine each dimension ofthe Big Five in order to align with dialogic interac-tions and language learning context. For example,in the original Big Five scheme, High Extraversionis defined as Enjoys being the center of attentionand enjoys meeting new people, we reformulate it",
  "C1: Teacher Role Instruction": "[Role & Task Definition] You are a primary schoollanguage teacher. You teach the student to describe thepicture.[Pedagogical Instruction] You are using the knowledgeconstruction approach to help me describe the picture.This involves any one of the following: building onprior knowledge, selecting information, integratingideas, and making inferences.[Behavior Constraint] Ask me only one question at atime. Always wait for my input before proceeding to thenext step. Correct my answers if they are inaccurate. to Being active in the conversation, and willing tocommunicate, while we refine the Low Extraver-sion as Being reluctant to talk, and hesitating inanswers. By doing so, we construct the Big Fivefor Tutoring Conversation (BF-TC) model, whichadapts learners personality traits to the languagelearning context, as shown in .",
  "Multi-aspect Validation Framework": "While LLM generations can be shaped along de-sired dimensions to mimic specific human personal-ity profiles (Safdari et al., 2023; Jiang et al., 2023),they may not perform consistently under the speci-fied role-play setting (Dorner et al., 2023). There-fore, we set up a multi-aspect validation to measureand improve the simulation quality (see ).BF-TC Categorization To evaluate whether thegenerated dialogue demonstrates the same stu-dent personality traits as the instruction, the dia-logue content can be labeled by a human or modelfor noncognitive traits categorization (e.g., Open-ness, Conscientiousness). Following the instruc-tion shown in Table A.1, for each dimension, theannotator will produce a label of High or Low.Language Ability Labeling We also take a label-ing task on the language ability of the simulatedstudent. Given a single tutoring conversation, it isto assess whether the indicated language ability isconsistent with the simulated student. Moreover,it can also be used to label multiple tutoring con-versations of the same student group, to track theirlearning outcomes and progress.Vanilla BFI Categorization To measure five com-prehensive personality factors, one of the most stan-dard personality metrics is the Big Five Inventory(BFI) (John et al., 1999). Here we use it to measurethe effectiveness of our proposed BF-TC schemeunder the language learning context. As the in-struction shown in Table A.1, based on the studentpersonality demonstrated in the tutoring conver-",
  "C2: Student Role Instruction": "[Role & Task Definition] You are a primary schoolstudent. You are taking a language learning class, anddescribing the given pictures.[Personality Description]Openness: Creativity in answers; Open to new ideasfrom the teacher; Curiosity in learning;... ...Neuroticism: Feeling anxious; Nervous in the conver-sation; Dramatic shifts in mood;[Behavior Constraint] Always wait for the teachersinput before proceeding to the next step. sation, the model is prompted to answer 44 BFIdescriptive statements that require respondents torate on a 5-point Likert scale (from strongly dis-agree 1 to strongly agree 5). We then calculate thescores and map them to the Big Five traits.Aside from the consistency validation of studentsimulation, we further investigate how differentstudent profiles (i.e., language ability, BF-TC traits)affect the teachers teaching strategy.Utterance-level Scaffolding Analysis Scaffoldingstrategies are not a one-size-fits-all pedagogicalmethod. Instead, they must be tailored to meetthe diverse needs, learning styles, and educationalexperiences of both low- and high-achieving learn-ers (Hargis, 2006). In addition, the effectivenessof scaffolding approaches can vary significantlyacross different personality traits. For instance, lowachievers often feel uncomfortable expressing theirideas because they may lack prior knowledge andself-confidence. Consequently, they tend to waitfor assistance rather than attempting to solve prob-lems independently. Moreover, students with lowerlevels of openness and extraversion may hesitateto engage in discussions, and communicate withinstructors (Oz, 2014; Chen et al., 2022). Suchstudents require more interactive and adaptive scaf-folds to facilitate their engagement and learning.Here we evaluate the scaffolding process of tu-toring conversations at the utterance level. We aimto investigate how the tutoring systems adapt tostudents with varying language abilities as well asdistinct personality traits. Based on previous work(Wells, 1999; van de Pol et al., 2010; Liu et al.,2024), we adopt a rubric of quantitative analysisfor the teachers utterance, and it consists of sevendimensions, as shown in Table A.1: Feeding back,Hints, Instructing, Explaining, Modeling, Question-ing, and Social-emotional Support. The model isto predict one or multiple scaffolding types of eachutterance, as the examples shown in .",
  "Task Description & Role Setting": "In this work, the conversational ITS is designed forlanguage learning, and particularly focuses on theimage description task. In each session, the studentis presented with a picture and asked to describethe incidents. Their answers should include a par-ticular place or setting, people or animals, itemsand actions, etc. The teacher guides students stepby step until they can independently complete theimage description task. We build a multi-agentcommunication environment following previouswork (Zhang et al., 2023; Wu et al., 2023).For the teacher role: Teaching and improving pri-mary students language learning through imagedescription is a dynamic and engaging approach.Beyond listing the objects in the image, the teacherguides students to describe how items look, feel, orsound, and encourages students to use adjectivesand adverbs. Moreover, scaffolding plays a crucialrole in the meaning-making process and provideslinguistic assistance for students language devel-opment (Walqui, 2006; Kayi-Aydar, 2013). Humanteachers apply scaffolding strategies, such as ques-tioning, reformulation, repetition, and elaborationto assist learners in knowledge construction and ex- pression, thereby making these processes visibleto them (Gibbons, 2015). Therefore, following pre-vious work, we integrate pedagogical instructionsinto the teacher role, as shown in Codebox C1.For the student role: We follow the learning pro-cess via human-machine interaction, where the tu-toring system (i.e., teacher) leads the conversation,and we feed responses from a student simulatorinstead of the human participants. With the supportand guidance from teachers, students are encour-aged to complete the given task, and improve theirlanguage skills including vocabulary, organization,and fluency (de Oliveira et al., 2023).",
  "Experimental Setup": "We conduct experiments with four representativeLLMs: Zephyr-7B-beta (Tunstall et al., 2023),Vicuna-13B-v1.5 (Zheng et al., 2023), GPT-3.5,and GPT-4 (Achiam et al., 2023).Followingprevious work (Touvron et al., 2023), we adjustpersonality-aware instructions to the prompt formatof each model. For tutoring simulation (),both teacher and student roles use the same model,and we feed the concatenated utterances for dia-logue generation. For fair comparison and reliableanalysis results, we use GPT-4 for all the valida-tion tasks (.3). We randomly sampled 100open-sourced cartoon images and used their imagedescription to generate 500 tutoring dialogues. Thetotal utterance number is 10K.",
  ": Personality prediction consistency between our proposed BF-TC and the Vanilla BFI": "annotated set to evaluate its performance. Morespecifically, we randomly select 50 generated dia-logues and invite two experts to label the person-ality traits for each sample, then compare it withthe predicted labels generated by the model-basedannotator (i.e., GPT-4), the prediction scores (inthe form of accuracy) of each dimension are: Open-ness: 0.78, Conscientiousness: 0.90, Extraversion:0.92, Agreeableness: 0.80, and Neuroticism: 0.92,which is at a reasonable level. Evaluating BF-TC Simulation via AutomatedCategorization We then measure the consistencyof the personality-aware generation of each model.For each dialogue, we compare its specified BF-TCtypes (as described in .2) with the pre-dicted BF-TC types. Zephyr, Vicuna, and GPT-3.5can generate fluent conversation, but show limitedcapability of consistent generation on the specifiedBF-TC traits (as shown in ). Surprisingly,the few-shot prompting did not bring substantialimprovement, but resulted in lower scores of sometypes. We speculated that giving fixed examplesfor the personality-aware generation may affectgenerality. In comparison, GPT-4 outperforms the othermodels significantly, and its generation success-fully differentiates personality traits through ex-pressions and interaction behaviors. As shown in, simulated students responses are dis-tinct by conditioning on BF-TC traits. For instance,",
  ": Student response embedding distribution ofsimulation w/o BF-TC (blue) and w/ BF-TC (orange)": "when characterized by Low Extraversion and HighNeuroticism, the student shows a lot of hesitationbefore answering, worries about incorrect answers,and difficulty in following the teachers instructions(e.g., I... I dont know the word., Am I wrong?).Conversely, the student in High Extraversion tendsto be talkative, engaging, and gives longer answers,such as Oh, yes! I love playing outside. We of-ten play card games and sometimes hopscotch.1 Moreover, the evaluation scores across five BF-TCtraits show a slight difference, demonstrating thatGPT-4 can be modulated on all aspects.As shown in , models show the same rankconditioned to the specified language ability level(i.e., High, Low), where GPT-4 still performsmuch better than the rest models. As describedin .1 and the examples shown in ,",
  "Consistency between BF-TC and BFI": "Since we formulate our BF-TC scheme based onthe Big Five theory, it is necessary to investigate thealignment between the personalities revealed in oursimulation (i.e., BF-TC) and those defined by theoriginal Big Five. A degree of consistency indicatesthe effectiveness of our refinement (.2).First, we conduct a psychometric test of simu-lated students on the original Big Five scheme. Weprompt all simulated students to complete the 44-item BFI (John et al., 1999). The aggregated scoresfor each dimension can be interpreted as a specifictype of personality. presents the descriptivestatistics, reliabilities, and Pearson correlation offive dimensions of personality traits. The Cron-bachs alpha values obtained from 500 samplesof the user simulator demonstrate high reliabilityfor our BF-TC model ( = 0.906 (Openness), = 0.921 (Conscientiousness), = 0.936 (Extraver-sion), = 0.922 (Agreeableness), and = 0.924(Neuroticism)). The Pearson correlation results re-veal significant positive relationships among thesevariables except Neuroticism, which is aligned with previous work (Oz, 2014; Cao and Meng, 2020).Upon the significance, we compare the generatedpersonality traits of BF-TC and Vanilla BFI. Morespecifically, for each simulation, we convert the re-sult of the 44 items to categorical labels (e.g., HighOpenness, Low Extraversion), and use the BF-TCcategorization from the generated dialogue as refer-ence. We observe that, while only GPT-4 achievesbetter instruction following of the indicated BF-TC(see ), all models show a high agreementlevel between the predicted BF-TC and Vanilla BFIlabels, as shown in . This demonstrates thatour refined BF-TC can precisely represent the BigFive personality traits in tutoring conversations.",
  "Adaptability of Scaffolding Strategies": "Here we conduct two analyses to understand howdialogic teaching adapts to students upon their lan-guage abilities and BF-TC personality traits.First, we calculate the correlation between thebinary language ability setting and utterance-levelscaffolding scores. As shown in , studentswith higher language proficiency receive more pos-itive feedback, instructions, and questions: theteacher provides more affirmations to the responsesand encourages students to explore details in thegiven picture. Conversely, students with lower lan-guage proficiency may struggle with vocabularyand sentence structure, require support in organiz-ing answers, and they receive more hints, explana-tions, and modeling (Liu et al., 2024).We then investigate the relationship betweenscaffolding strategies and personality traits. Asshown in , the correlation between scaf-folding changes and BF-TC traits is more apparentwithin student groups of lower language ability. Inparticular, the low indicator of Openness, Consci-entiousness, and Extraversion results in more hintsfrom the teacher (Vygotsky, 1978), and Neuroti-cism is negatively related to all scaffolding strate-gies except questioning. This is probably attributed to the students sensitivity, emotional instability,and concerns about answering questions incorrectly.Consequently, the teacher comforts students moreand assists them in focusing on the task. Evenwith minimal instruction of the scaffolding strat-egy, based on the tutoring goal, LLMs like GPT-4are still able to adjust their scaffolding strategiesaccording to the students ability levels and person-ality traits. This implies the potential of conversa-tional ITSs to provide individualized and self-pacedlearning experience, by considering both cognitiveand noncognitive characteristics.",
  "Conclusion": "In this paper, we proposed a personality-awaresimulation framework by integrating cognitive andnoncognitive traits into tutoring conversations. Weadapted the general Big Five theory for dialogic in-teraction, and enhanced the framework with multi-aspect validation. Our experiments and analysesunder a language learning scenario showed thatLLMs can be modulated by specifying personalitytraits to simulate different student groups and pro-duce diverse responses, and scaffolding strategieswould be adjusted upon student characteristics. Ourwork emphasizes the need for scalable, personal-ized simulations to improve human-AI interactions,advancing the design and assessment of conversa-tional tutoring systems for a more engaging andcustomized learning experience.",
  "Limitations": "All samples used and generated in this work are inEnglish, thus to apply the model to other languages,it will require additional data pre-processing stepson the specified language or using multilingual lan-guage backbones. We are aware that it remains anopen problem to mitigate hallucinations and biasesin large language models, which may cause com-munication issues in human-machine interactionand computer-assisted education. Of course, cur-rent models and laboratory experiments are alwayslimited in this or similar ways. We do not foreseeany unethical uses of our proposed methods or theirunderlying tools, but hope that it will contribute toreducing incorrect system outputs.",
  "We acknowledge that all of the co-authors of thiswork are aware of the provided ACL Code of Ethicsand honor the code of conduct. In our experiments,": "models are applied under proper license. All dataused in this work are only for academic researchpurposes and should not be used outside of aca-demic research contexts. Our proposed method-ology in general does not create a direct societalconsequence and are intended to be used to im-prove the performance, robustness, and safety ofthe intelligent tutoring systems. This research is supported by the AI4EDU Pro-gramme in the Institute for Infocomm Research(I2R), Agency for Science, Technology and Re-search (A*STAR), and the National Research Foun-dation, Singapore under its AISG Programme(AISG2-GC-2022-005). We thank the anonymousreviewers for their precious feedback to help im-prove and extend this piece of work. Josh Achiam, Steven Adler, Sandhini Agarwal, LamaAhmad, Ilge Akkaya, Florencia Leoni Aleman,Diogo Almeida, Janko Altenschmidt, Sam Altman,Shyamal Anadkat, et al. 2023. Gpt-4 technical report.arXiv preprint arXiv:2303.08774. Shazia Afzal, Tejas Dhamecha, Nirmal Mukhi, RenukaSindhgatta, Smit Marvaniya, Matthew Ventura, andJessica Yarbro. 2019. Development and deploymentof a large-scale dialog-based intelligent tutoring sys-tem. In Proceedings of the NAACL 2019, pages 114121, Minneapolis, Minnesota. Association for Com-putational Linguistics.",
  "Layla El Asri, Jing He, and Kaheer Suleman. 2016. Asequence-to-sequence model for user simulation inspoken dialogue systems": "Vittorio V Busato, Frans J Prins, Jan J Elshout, andChristiaan Hamaker. 1998. The relation betweenlearning styles, the Big Five personality traits andachievement motivation in higher education. Person-ality and Individual Differences, 26(1):129140. Chun Cao and Qian Meng. 2020. Exploring personalitytraits as predictors of english achievement and globalcompetence among chinese university students: En-glish learning motivation as the moderator. Learningand Individual Differences, 77:101814. Soumaya Chaffar and Claude Frasson. 2004. Inducingoptimal emotional state for learning in intelligenttutoring systems. In International Conference onIntelligent Tutoring Systems, pages 4554. Springer.",
  "Boele De Raad and Henri C. Schouwenburg. 1996. Per-sonality in learning and education: a review. Euro-pean Journal of Personality, 10(5):303336": "Dorottya Demszky and Heather Hill. 2023. The nctetranscripts: A dataset of elementary math classroomtranscripts. In Proceedings of the 18th Workshopon Innovative Use of NLP for Building EducationalApplications (BEA 2023), pages 528538. Jean-Marc Dewaele. 2012. Personality: PersonalityTraits as Independent and Dependent Variables. InSarah Mercer, Stephen Ryan, and Marion Williams,editors, Psychology for Language Learning, pages4257. Palgrave Macmillan UK, London.",
  "Arthur C Graesser, Xiangen Hu, and Robert Sottilare.2018. Intelligent tutoring systems. In Internationalhandbook of the learning sciences, pages 246255.Routledge": "Beate Grawemeyer, Manolis Mavrikis, Wayne Holmes,Sergio Gutierrez-Santos, Michael Wiedmann, andNikol Rummel. 2016. Affecting off-task behaviour:how affect-aware feedback can improve student learn-ing. In Proceedings of the Sixth International Confer-ence on Learning Analytics & Knowledge, LAK 16,page 104113, New York, NY, USA. Association forComputing Machinery. Foteini Grivokostopoulou, Isidoros Perikos, and Ioan-nis Hatzilygeroudis. 2017. An Educational Systemfor Learning Search Algorithms and AutomaticallyAssessing Student Performance. International Jour-nal of Artificial Intelligence in Education, 27(1):207240.",
  "Charles H Hargis. 2006. Teaching low achieving anddisadvantaged students.Charles C Thomas Pub-lisher": "Jason M. Harley, Franois Bouchet, M. Sazzad Hus-sain, Roger Azevedo, and Rafael Calvo. 2015. Amulti-componential analysis of emotions during com-plex learning with an intelligent multi-agent system.Computers in Human Behavior, 48:615625. Shang-Ling Hsu, Raj Sanjay Shah, Prathik Senthil,Zahra Ashktorab, Casey Dugan, Werner Geyer, andDiyi Yang. 2023. Helping the helper: Supportingpeer counselors via ai-empowered practice and feed-back. arXiv preprint arXiv:2305.08982. Zhiyuan Hu, Yue Feng, Anh Tuan Luu, Bryan Hooi,and Aldo Lipani. 2023. Unlocking the potential ofuser feedback: Leveraging large language model asuser simulator to enhance dialogue system. arXivpreprint arXiv:2306.09821.",
  "Oliver P John, Sanjay Srivastava, et al. 1999. The big-five trait taxonomy: History, measurement, and theo-retical perspectives": "Laura M. Justice, Ryan Bowles, Khara Pence, and Car-olyn Gosse. 2010. A scalable tool for assessing chil-drens language abilities within a narrative context:The NAP (Narrative Assessment Protocol). EarlyChildhood Research Quarterly, 25(2):218234. Enkelejda Kasneci, Kathrin Seler, Stefan Kchemann,Maria Bannert, Daryna Dementieva, Frank Fischer,Urs Gasser, Georg Groh, Stephan Gnnemann, EykeHllermeier, et al. 2023. Chatgpt for good? on op-portunities and challenges of large language modelsfor education. Learning and individual differences,103:102274.",
  "Hayriye Kayi-Aydar. 2013. Scaffolding language learn-ing in an academic ESL classroom. ELT Journal,67(3):324335": "Meera Komarraju, Steven J. Karau, Ronald R. Schmeck,and Alen Avdic. 2011. The Big Five personalitytraits, learning styles, and academic achievement.Personality and Individual Differences, 51(4):472477. FlorianKreyssig,IigoCasanueva,PaweBudzianowski, and Milica Gaic. 2018. Neural usersimulation for corpus-based policy optimisation ofspoken dialogue systems. In Proceedings of the 19thAnnual SIGdial Meeting on Discourse and Dialogue,pages 6069, Melbourne, Australia. Association forComputational Linguistics.",
  "James A. Kulik and J. D. Fletcher. 2016. Effectivenessof Intelligent Tutoring Systems: A Meta-AnalyticReview. Review of Educational Research, 86(1):4278": "Hsien-chin Lin, Christian Geishauser, Shutong Feng,Nurul Lubis, Carel van Niekerk, Michael Heck, andMilica Gasic. 2022. GenTUS: Simulating user be-haviour and language in task-oriented dialogues withgenerative transformers. In Proceedings of the 23rdAnnual Meeting of the Special Interest Group on Dis-course and Dialogue, pages 270282, Edinburgh,UK. Association for Computational Linguistics. Hong Liu, Yucheng Cai, Zhijian Ou, Yi Huang, andJunlan Feng. 2022. A generative user simulator withGPT-based architecture and goal state tracking forreinforced multi-domain dialog systems. In Proceed-ings of the Towards Semi-Supervised and ReinforcedTask-Oriented Dialog Systems (SereTOD), pages 8597, Abu Dhabi, Beijing (Hybrid). Association forComputational Linguistics.",
  "Wenting Ma, Olusola O. Adesope, John C. Nesbit, andQing Liu. 2014. Intelligent tutoring systems andlearning outcomes: A meta-analysis. Journal of Edu-cational Psychology, 106(4):901918": "Jakub Macina, Nico Daheim, Sankalan Chowdhury, Tan-may Sinha, Manu Kapur, Iryna Gurevych, and Mrin-maya Sachan. 2023a. Mathdial: A dialogue tutoringdataset with rich pedagogical properties grounded inmath reasoning problems. In Findings of EMNLP2023, pages 56025621. Jakub Macina, Nico Daheim, Lingzhi Wang, TanmaySinha, Manu Kapur, Iryna Gurevych, and MrinmayaSachan. 2023b. Opportunities and challenges in neu-ral dialog tutoring. In Proceedings of the 17th Con-ference of the European Chapter of the Associationfor Computational Linguistics, pages 23572372.",
  "Robert R McCrae and Paul T Costa. 1987. Validationof the five-factor model of personality across instru-ments and observers. Journal of personality andsocial psychology, 52(1):81": "Sarah Mercer, Stephen Ryan, and Marion Williams.2012. Psychology for language learning: Insightsfrom research, theory and practice. Palgrave Macmil-lan. Publisher Copyright: Sarah Mercer, StephenRyan and Marion Williams 2012., their respectiveauthors 2012, Zoltn Drnyei 2012. Elham Mousavinasab, Nahid Zarifsanaiey, Sharareh R.Niakan Kalhori, Mahnaz Rakhshan, Leila Keikha,and Marjan Ghazi Saeedi. 2021. Intelligent tutor-ing systems: a systematic review of characteristics,applications, and evaluation methods. InteractiveLearning Environments, 29(1):142163. Elghouch Nihad, En-naimi El Mokhtar, and Yassine Za-oui Seghroucheni. 2017.Analysing the outcomeof a learning process conducted within the systemals_corr(lp). International Journal of Emerging Tech-nologies in Learning (iJET), 12(03):pp. 4356.",
  "David Robinson, Norman Gabriel, and Olga Katchan.1994. Personality and second language learning. Per-sonality and Individual Differences, 16(1):143157": "Pia Rosander, Martin Bckstrm, and Georg Stenberg.2011. Personality traits and general intelligence aspredictors of academic performance: A structuralequation modelling approach. Learning and Individ-ual Differences, 21(5):590596. Sherry Ruan, Liwei Jiang, Justin Xu, Bryce Joe-KunTham, Zhengneng Qiu, Yeshuang Zhu, Elizabeth LMurnane, Emma Brunskill, and James A Landay.2019. Quizbot: A dialogue-based adaptive learningsystem for factual knowledge. In Proceedings of the2019 CHI conference on human factors in computingsystems, pages 113. Mustafa Safdari, Greg Serapio-Garca, Clment Crepy,Stephen Fitz, Peter Romero, Luning Sun, MarwaAbdulhai, Aleksandra Faust, and Maja Mataric. 2023.Personality traits in large language models. arXivpreprint arXiv:2307.00184. Fateme Serri, Aliakbar Boroujeni, and Akbar Hesabi.2012. Cognitive, metacognitive, and social/affectivestrategies in listening comprehension and their rela-tionships with individual differences. Theory andPractice in Language Studies, 2.",
  "Taraneh Shirdel et al. 2018. The relationship betweenthe big five personality traits, crystallized intelligence,and foreign language achievement. North AmericanJournal of Psychology, 20(3):519519": "Shashank Sonkar, Naiming Liu, Debshila Mallick, andRichard Baraniuk. 2023. Class: A design frameworkfor building intelligent tutoring systems based onlearning science principles. In Findings of EMNLP2023, pages 19411961. Katherine Stasaski, Kimberly Kao, and Marti A Hearst.2020. Cima: A large open access dialogue dataset fortutoring. In Proceedings of the Fifteenth Workshopon Innovative Use of NLP for Building EducationalApplications, pages 5264.",
  "Silvia Terragni, Modestas Filipavicius, Nghia Khau,Bruna Guedes, Andr Manso, and Roland Mathis.2023.In-context learning user simulators fortask-oriented dialog systems.arXiv preprintarXiv:2306.00774": "Hugo Touvron, Louis Martin, Kevin Stone, Peter Al-bert, Amjad Almahairi, Yasmine Babaei, NikolayBashlykov, Soumya Batra, Prajjwal Bhargava, ShrutiBhosale, et al. 2023.Llama 2:Open founda-tion and fine-tuned chat models.arXiv preprintarXiv:2307.09288. Lewis Tunstall, Edward Beeching, Nathan Lambert,Nazneen Rajani, Kashif Rasul, Younes Belkada,Shengyi Huang, Leandro von Werra, ClmentineFourrier, Nathan Habib, et al. 2023. Zephyr: Di-rect distillation of lm alignment.arXiv preprintarXiv:2310.16944.",
  "Zhenduo Wang, Zhichao Xu, Qingyao Ai, and VivekSrikumar. 2024. An in-depth investigation of userresponse simulation for conversational search": "Gordon Wells. 1999. Dialogic inquiry: Towards a socio-cultural practice and theory of education. Learningin doing: Social, cognitive, and computational per-spectives. Cambridge University Press, New York,NY, US. Qingyun Wu, Gagan Bansal, Jieyu Zhang, Yiran Wu,Shaokun Zhang, Erkang Zhu, Beibin Li, Li Jiang,Xiaoyun Zhang, and Chi Wang. 2023.Auto-gen: Enabling next-gen llm applications via multi-agent conversation framework.arXiv preprintarXiv:2308.08155. Zhihong Xu, Kausalai Wijekumar, Gilbert Ramirez,Xueyan Hu, and Robin Irey. 2019. The effectivenessof intelligent tutoring systems on K-12 students read-ing comprehension: A meta-analysis. British Journalof Educational Technology, 50(6):31193137.",
  "Utterance-level Scaffolding Categorization": "[Feeding back] The teacher directly evaluates thebehavior or response of the student.[Hints] The teacher gives an explicit hint withrespect to the expected answer.[Instructing] The teacher provides information forthe next step.[Explaining]Theteacherprovidesdetailedinformation on why or clarification.[Modeling] The teacher demonstrates an answerexample for students imitation.[Questioning] The teacher asks a question thatrequire an active linguistic and cognitive answer.[Social-emotional Support] Responses related toemotion and motivation such as positive affirmationand showing empathy.",
  "Dialogue-level Vanilla BFI Categorization": "Please indicate your agreement with each of thefollowing statements on a scale from 1 to 5 (1 =\"Strongly disagree\", 2 = \"Disagree\", 3 = \"Neitheragree or disagree\", 4 = \"Agree\", and 5 = \"Stronglyagree\").I see myself as someone who...:1) Is talkative 2) Tends to find fault with others 3)Does a thorough job 4) Is depressed, blue 5) Isoriginal, comes up with new ideas 6) Is reserved7) Is helpful and unselfish with others 8) Can besomewhat careless 9) Is relaxed, handles stress well10) Is curious about many different things 11) Is fullof energy 12) Starts quarrels with others 13) Is areliable worker 14) Can be tense 15) Is ingenious, adeep thinker 16) Generates a lot of enthusiasm 17)Has a forgiving nature 18) Tends to be disorganized19) Worries a lot 20) Has an active imagination 21)Tends to be quiet 22) Is generally trusting 23) Tendsto be lazy 24) Is emotionally stable, not easily upset25) Is inventive 26) Has an assertive personality 27)Can be cold and aloof 28) Perseveres until the taskis finished 29) Can be moody 30) Values artistic,aesthetic experiences 31) Is sometimes shy, inhibited32) Is considerate and kind to almost everyone33) Does things efficiently 34) Remains calm intense situations 35) Prefers work that is routine36) Is outgoing, sociable 37) Is sometimes rude toothers 38) Makes plans and follows through withthem 39) Gets nervous easily 40) Likes to reflect,play with ideas 41) Has few artistic interests 42)Likes to cooperate with others 43) Is easily dis-tracted 44) Is sophisticated in art, music, or literature",
  "Basedonthegiventutoringconversation,rate the students BFI personality traits:<dialogue_content> <output>": "We then use the scores of 44 questions to cal-culate Big Five traits. For each type, we add thescores of its corresponding items (R denotesreverse-scored items), then use the mean as criteriafor High and Low labeling:Extraversion: 1, 6R, 11, 16, 21R, 26, 31R, 36Agreeableness: 2R, 7, 12R, 17, 22, 27R, 32, 37R, 42Conscientiousness: 3, 8R, 13, 18R, 23R, 28, 33, 38,43RNeuroticism: 4, 9R, 14, 19, 24R, 29, 34R, 39Openness: 5, 10, 15, 20, 25, 30, 35R, 40, 41R, 44",
  ": Low scoring description refinement from the general Big Five scheme to our Big Five Tutoring Conversation(BF-TC) scheme": "Image Description:In a classroom, one girl drew a rainbow and another girl drew a fish under the sea.BF-TC Personality Setting:Openness: High, Conscientiousness: High, Extraversion: High, Agreeableness: High, Neuroticism: LowLanguage Ability Setting: High Generated Tutoring Conversation (GPT-4-1106):Teacher: Hello! Can you tell me what the first girl drew in this picture?Student: Sure, from I see, the first girl drew a rainbow.Teacher: Exactly! She made a beautiful rainbow. A rainbow has colors according to a particular order. Do you remember it?Student: Oh, I know. Its red, orange, yellow, green, blue, indigo, and violet, right?Teacher: Brilliant! So, if we want to describe the rainbow she drew, considering the order of the colors, how would you do it?Student: Right, lets see. From red at the top to violet at the bottom.Teacher: Perfect! Now lets look at the another girl. What did she illustrate in the picture?Student: A fish, and its all blue around like water.Teacher: Now, could you describe the picture of the fish using the colors, as you just did for the rainbow?Student: The second girl drew an orange fish swimming under the blue sea.Teacher: Amazing! Now, as a final challenge, could you combine those two descriptions into one or two sentences?Student: In the picture, one girl drew a bright rainbow, and the other girl drew an orange fish swimming in the blue sea.Teacher: Excellent! Youve described the picture perfectly. Keep up the fantastic work! Dialogue-level Student Language Ability Labeling: HighDialogue-level BF-TC Categorization:Openness: High, Conscientiousness: High, Extraversion: High, Agreeableness: High, Neuroticism: LowDialogue-level Vanilla BFI Categorization:Openness: 29 (High), Conscientiousness: 36 (High), Extraversion: 27 (High), Agreeableness: 37 (High), Neuroticism: 17 (Low) Image Description:In a classroom, one girl drew a rainbow and another girl drew a fish under the sea.BF-TC Personality Setting:Openness: High, Conscientiousness: High, Extraversion: Low, Agreeableness: Low, Neuroticism: LowLanguage Ability Setting: Low Generated Tutoring Conversation (GPT-4-1106):Teacher: What a lovely picture here. What do you see in this picture thats colorful and appears in the sky sometimes after itrains?Student: ...Teacher: Its quite alright. Think about the colors you know and how they form a beautiful arc in the sky. What is it called?Student: ... a rainbow.Teacher: Exactly, a rainbow! Now, in our picture, where did the girl draw the rainbow?Student: Up sky.Teacher: Right, she drew it in the sky. Its actually in the sky instead of up sky. Good job! Lets try another detail. What doyou think lives in the sea and can swim?Student: ...Teacher: Think about creatures with fins and tails, maybe one that you like?Student: Fish.Teacher: Brilliant! And in the picture, where is the fish?Student: In the sea.Teacher: Correct, its better to say under the sea. Do you see how the sea is drawn?Student: ...No.Teacher: Thats fine. Look for lines that might look like waves. Do you think the girl included anything like that to representwater?Student: Yes, lines.Teacher: Excellent noticing! Now, if you were to tell a story about this picture using what weve discussed, how would youdescribe it?Student: Girl draw rainbow in sky. Another girl draw fish in water.Teacher: Very close! You meant to say A girl drew a rainbow in the sky, and another girl drew a fish under the sea. Youve donea really good job describing the picture. Remember, its all about noticing the details and describing them as best as you can. Dialogue-level Student Language Ability Labeling: LowDialogue-level BF-TC Categorization:Openness: High, Conscientiousness: High, Extraversion: Low, Agreeableness: High, Neuroticism: LowDialogue-level Vanilla BFI Categorization:Openness: 32 (High), Conscientiousness: 30 (High), Extraversion: 19 (Low), Agreeableness: 33 (High), Neuroticism: 20 (Low)",
  ": Tutoring dialogue examples of the personality-aware student simulation": "Image Description:A wise owl sits on a branch at twilight, its eyes glowing in the dark.BF-TC Personality Setting:Openness: High, Conscientiousness: High, Extraversion: Low, Agreeableness: High, Neuroticism: LowLanguage Ability Setting: High Generated Tutoring Conversation (GPT-4-1106):Teacher: Lets talk about this image. Could you tell me the first thing you noticed in the picture?Student: Um...yeah, there is an owl.Teacher: Very good! Owls are often symbols of wisdom. Knowing this, can you think of why we might say the owl in ourpicture is wise?Student: Because it looks very calm and... focused.Teacher: Exactly! Being calm and focused are signs of wisdom. Is the owl alone, or are there other creatures around it?Student: Its... uh, the owl is alone.Teacher: Well done! So, we have a wise owl. Lets talk about where the owl is. Can you describe the owls location in the image?Student: The owl is sitting on a...branch.Teacher: Excellent. Now, can you tell me what time you think it might be in the picture?Student: It looks like its late evening...Teacher: Good observation! To be more precise, we might call it twilight. Twilight is the time of day just after the sun sets.Remember, specificity helps make our sentences clear. Can you describe the owls eyes?Student: Its eyes are...glowing?Teacher: Thats right! Their glow makes them stand out in the dark, doesnt it? Now, based on all your lovely responses, can youdescribe what you see in the image in one or two sentences?Student: Sure, um...A wise, calm owl is sitting alone on a branch at twilight, its eyes glowing in the darkness.Teacher: Youve done excellent work today! Keep practicing your descriptions like this, and youll improve even more. Utterance-level Scaffolding Analysis:Teacher Utterance: \"Lets talk about this image. Could you tell me the first thing you noticed in the picture?\"Predicted Scaffolding Label: QuestioningTeacher Utterance: \"Very good! Owls are often symbols of wisdom. Knowing this, can you think of why we might say the owlin our picture is wise?\"Predicted Scaffolding Label: Feeding back, Explaining, QuestioningTeacher Utterance: \"Exactly! Being calm and focused are signs of wisdom. Is the owl alone, or are there other creatures aroundit?\"Predicted Scaffolding Label: Feeding back, Explaining, QuestioningTeacher Utterance: \"Well done! So, we have a wise, solitary owl. Lets talk about where the owl is. Can you describe the owlslocation in the image?\"Predicted Scaffolding Label: Feeding back, Instructing, QuestioningTeacher Utterance: \"Excellent. Now, can you tell me what time you think it might be in the picture?\"Predicted Scaffolding Label: Feeding back, QuestioningTeacher Utterance: \"Good observation! To be more precise, we might call it twilight. Twilight is the time of day just after thesun sets. Remember, specificity helps make our sentences clear. Can you describe the owls eyes?\"Predicted Scaffolding Label: Feeding back, Instructing, Modeling, QuestioningTeacher Utterance: \"Thats right! Their glow makes them stand out in the dark, doesnt it? Now, based on all your lovelyresponses, can you describe what you see in the image in one or two sentences?\"Predicted Scaffolding Label: Feeding back, Instructing, Explaining, QuestioningTeacher Utterance: \"Youve done excellent work today! Keep practicing your descriptions like this, and youll improve evenmore.\"Predicted Scaffolding Label: Feeding back, Socio-emotional Support"
}