{
  "Abstract": "In light of the recent 2024 European Parliamentelections, we are investigating if LLMs can beused as Voting Advice Applications (VAAs).We audit MISTRAL and MIXTRAL models andevaluate their accuracy in predicting the stanceof political parties based on the latest EU and Ivoting assistance questionnaire. Furthermore,we explore alternatives to improve models per-formance by augmenting the input context viaRetrieval-Augmented Generation (RAG) rely-ing on web search, and Self-Reflection usingstaged conversations that aim to re-collect rele-vant content from the models internal memory.We find that MIXTRAL is highly accurate withan 82% accuracy on average with a significantperformance disparity across different politicalgroups (50-95%). Augmenting the input con-text with expert-curated information can leadto a significant boost of approx. 9%, which re-mains an open challenge for automated RAGapproaches, even considering curated content.",
  "Introduction": "While Large Language Models (LLMs) exhibit un-precedented Natural Language Understanding ca-pabilities, recent work has been exploring politicalbiases (Feng et al., 2023) and political reasoning ca-pabilities (Chalkidis and Brandl, 2024) in LLMs.1 LLMs prove to have a considerable level of politi-cal knowledge and be capable of reasoning in thiscontext. Hence, an open question is what is thepotential of newer and bigger LLMs to dissemi-nate political information and inform citizens, asan alternative, or in addition, to traditional media.In pre-election periods, e.g., as in May 2024upon the 2024 European Parliament elections inJune, Voting Advice Applications (VAAs) havebeen used to inform the public about the politicalstance of candidate parties and help citizens findout which parties align the most with. VAAs rely on",
  "We present related work in": "fixed (pre-defined) curated questionnaires, wherecitizens have to answer several multiple-choicequestions, which are then parsed by a rule-basedsystem to compute affinity to the candidate parties.While VAAs are good predictors relying on curatedcontent by experts, they are static one-size-fits-allsolutions covering a few topics with pre-definedquestions that do not necessarily cover the interestsof all individual users in detail.In this regard, conversational AI agents (LLMs)could potentially pose an interesting alternative forpolitical information dissemination that better sat-isfies the interests of individual users with differentpriorities in a personalized contextualized respon-sive manner. Users could have open-ended conver-sations that help them cover more topics of interestin greater detail compared to traditional VAAs orother forms of media (e.g., news articles).2 In this work, we ask the question: Could state-of-the-art LLMs potentially be used as VAAs? Andhow, can we enhance their abilities with contextualaugmentation? To answer this question, we em-ploy two of the most recent powerful open-accessLLMs, MISTRAL (Jiang et al., 2023) and MIX- TRAL (Jiang et al., 2024), and audit their abilitiesas VAAs using a newly released dataset based onthe EU and I 2024 (EUANDI-2024) VAA ques-tionnaire.3 Furthermore, we explore alternatives toimprove models performance by augmenting theinput context via Retrieval-Augmented Generation(RAG) relying on web search, and Self-Reflectionusing staged conversations that aim to re-collectrelevant content from the models internal memory.We find that the larger LLM, MIXTRAL, ishighly accurate with an 82% accuracy on averagewhile augmenting the input context with expert-curated gold-standard information can lead toa significant boost of approx. 9%, which remains",
  "We present limitations, and ethical considerations (risksand open challenges) in .3": ": Depiction of the experimental framework. In Setting (0), there is no context augmentation. In Setting (A)the context is augmented using web search to retrieve relevant content. In Setting (B), the context is self-augmentedby asking the model preliminary questions to generate a summary for the party and its expected opinion related tothe question. In Setting (C), the input context is augmented with the partys position related to the question. an open challenge for automated augmentation ap-proaches, even considering curated content. Inter-estingly, RAG leads to a substantial performanceboost in the case of MISTRAL (+8%). Similar toChalkidis and Brandl (2024), we find a significantdisparity in how accurately the models representdifferent political groups (50-95%).",
  "Dataset": "We use the questionnaire from the EU and I 2024(EUANDI-2024) project as an evaluation bench-mark. EUANDI-2024 is a Voting Advice Applica-tion (VAA), released before the recent EuropeanParliament elections to help EU citizens find theiraffinity to candidate parties. The questionnaire has30 questions in the form of a political statementfollowed by 5 available options on Likert scalefrom complete disagreement to complete agree-ment. The EUANDI-2024 project also providesthe answers to the statements in question for allnational parties across EU member states and euro-parties, alongside a verbatim justification, i.e., anexcerpt from the partys program or public mediastatement identified by the project experts.As part of this work, we redistribute EUANDI-2024 as a unified dataset, including the partiesanswers, and justifications.4 We include translatedversions from the original language to English auto-matically derived using MIXTRAL (Appendix C.1).",
  "We audit the models as Voting Assistant Applica-tions (VAAs) in 4 different settings ():": "0. No Context:In this case, we ask the modelto speculate how a specific political party, e.g., theGerman Christlich Demokratische Union (CDU)party, would reply to a given question from theEUANDI-2024 questionnaire with no additionalcontext, to assess its capabilities to reason solelyrelying on its internal knowledge. The only contextavailable is the system prompt (green box in )and the question (last purple box). A. RAG-Augmentation:In this case (part A of), we use Retrieval-Augmented Generation(RAG) (Lewis et al., 2020) with the retrieval engineof HuggingChat5 which relies on web search. First,the system retrieves relevant indexed documents(pages) from the web using the question as a query.In this case, the model can rely on both its internalknowledge and external knowledge retrieved viathe RAG system to answer the question.",
  ": Accuracy of the examined models (MISTRAL in blue, and MIXTRAL in orange) on EUANDI-2024 datasetacross all settings (.3) and examined groups (4 EU Member States + euro-parties)": "B. Self-Reflection:In this case (part B of ),we perform a 3-step staged conversation (dialog)with the model. First, we ask the model to providea summary of the relevant political party. Secondly,we ask the model to speculate the partys stancerelated to the political statement in question. Inboth steps, the model solely relies on its internalknowledge, i.e., no retrieval engine enhances thecontext with external knowledge. Lastly, we askthe model to answer the question in light of the 2preceding question-answers pairs. This can be seenas a form of guided Chain-of-Thought (CoT) (Weiet al., 2022), where the user asks relevant prelimi-nary questions to prepare (contextualize) the modelfor answering the related final question. C. Expert-Augmentation:In this case (part C of), we use the expert-curated gold-standardjustification of the relevant party from the EUANDI-2024 dataset (.1) related to the follow-upquestion to augment the models context. This set-ting can be seen as Retrieval-Augmented Genera-tion (RAG) (Lewis et al., 2020) utilizing an Oracleretriever that always retrieves the perfect relevanttext snippet (source) related to the question in hand.",
  "Use of Data": "We audit the models in English using the EUANDI-2024 dataset (.1) considering the answersand justifications (opinions) of the top 5 mostpopular parties from Germany, France, Italy, andSpain based on the latest national opinion polling(15/05/2024). These are the 4 most populous EUmember states with the most Members of the Eu-ropean Parliament (MEPs). We also consider alleuro- (EU-level) parties that are represented in theEuropean Parliament. These are 27 parties in total.6",
  "We present additional details in Appendix B": "generates the same answer as the examined party.Following Chalkidis and Brandl (2024), we bina-rize parties answers and model responses intotwo groups: agreement and disagreement, sincethe different shades of both groups, e.g., tend toagree and strongly agree, are susceptible to sen-sitive interpretations, i.e., the intensity of agree-ment/disagreement instead of the general stance.",
  "Main Results": "In , we present the main results for the fouralternative settings 0, A-C (.3). First, weobserve that across settings MIXTRAL outperformsMISTRAL, especially when solely relying on its in-ternal knowledge (Set. 0: 82% vs 76%), which is inline with the findings in general NLU benchmark-ing (Jiang et al., 2024). This is highly expectedsince MIXTRAL is a much bigger model with 8more total trained parameters and 2 active param-eters used on inference time.We find that LLAMA-2 (13B) of Touvron et al. (2023) -released July 2023- used in the study ofChalkidis and Brandl (2024) has an accuracy of64%; six months later MISTRAL and MIXTRALscore +12% and +18%, respectively. Concerningperformance disparity across groups in Setting 0,we observe that the performance for French (FR)and euro- (EU) parties is approx. 85% for MIX- TRAL, while for German (DE), Italian (IT) andSpanish (ES) parties is approx 81%.Considering the results in Set. A (), we ob-serve that augmenting the context with a web-basedRAG leads to minor performance improvements(approx. 3%) for MIXTRAL. The performance im-proves approx. 5% for the worst performing EUmember state Spain (ES). Contrary, the smallerMISTRAL, has a significant performance boost, ap-prox. 8% on average. The most commonly usedweb sources across all parties were: Wikipedia(14%), Politico (6%), and The Guardian (5%). Considering the results in Set. B (), self-augmenting the context leads to minor performanceimprovements compared to Set. 0, except for Spain(ES) with a boost of approx. +8%. In this case(Set. B), similar to Set. 0, MISTRAL is limited to itsown knowledge capabilities and is out-performedby 7% from MIXTRAL (77% vs 84%).In , we present results of MIXTRAL, ourbest-performing model, by ablating the contextused in Set. B. We observe that inferring the partysopinion (Set. B2: green bars) relevant to the ques-tion is more beneficial than inferring a general partysummary (Set. B1: orange bars), but combiningboth (Set. B) leads to the best overall results.",
  "Considering the results in Set. C (), wherethe context is augmented with expert-curated gold-standard information, we observe a substantialperformance improvement of approx. 15% for MIS-": "TRAL (91%), and 9% for MIXTRAL (91%) com-pared to Set. 0. This finding signifies that whengold-standard information is utilized as context,performance is improved substantially.Since automated augmentation (Set. A-B) leadsto minor improvements for MIXTRAL, contrary toexpert-curated content (Set. C), we consider theuse of curated domain-specific corpora for RAG,in contrast to open-ended (web-based).",
  "Improving RAG with Curated Corpus": "To test this hypothesis, we create a small cu-rated corpus for retrieval, where the only avail-able sources are paragraphs from the official euro-parties pre-election manifestos.7 In , wepresent the results for the 7 euro-parties. We ob-serve that results vary a lot across euro-parties, butthere is a minor performance improvement of 1.5%",
  "Breakdown by Euro-group": "In , we present the results for MIXTRAL nowgrouped by euro-group alliances, i.e., EuropeanParliament groups that represent different politi-cal ideologies and agendas. Similar to Chalkidisand Brandl (2024), we observe that there is a largeperformance disparity, with higher accuracy whenit comes to groups with distinct political leanings,e.g., the Greens or the right-wing ID, compared toothers, e.g., centre-right parties (EPP, RENEW),and the euro-skeptic ECR. Expert-augmented con-text leads to substantial performance improvementsfor parties affiliated with EPP (+5%) and ECR(+15%), which align with the results in .2.",
  "Qualitative Results": "In Tables 5-8 in Appendix D, we present responsesby the best-performing model, MIXTRAL, acrosssettings, considering examples of both correct andmis- predictions. We observe that the model an-swers the question (pick an option) and then pro-vides a brief justification to support its decision. Asdemonstrated in Tables 6 and 8, in certain cases,where the context is augmented with additionalcontent, it correctly adjusts its answer, comparingto no content (), while in other cases not.",
  "Related Work": "Feng et al. (2023) were the first to explore the po-litical biases of prior-art (smaller, not instruction-tuned, human-feedback aligned) language models,such as BERT and GPT-2, showcasing that mod-els have different political leanings based on thepolitical compass covering a 2-dimensional polit-ical spectrum (left/right, authoritarian/libertarian)heavily focused on the US political context. Fur-thermore, they demonstrated how these biases af-fect downstream performance in critical tasks, e.g.,toxicity classification and fake news detection, andhow continuous pre-training on politically biaseddata can further exacerbate these biases. Santurkar et al. (2023) examined the questionsof whose opinions are reflected by LLMs us-ing the Pew Research Centers American TrendsPanel (ATP) questionnaire and survey. They foundthat base (pretrained-only) LLMs, like GPT-3,mostly align with lower-income, moderate, catholicgroups. Contrary, recent human-feedback-alignedinstruction-tuned LLMs, like GPT-3.5, align morewith high-income, liberal, well-educated, not reli-gious groups, and thus are in general less represen-tative of overall opinions. Chalkidis and Brandl (2024) are the first to ex-plore the political biases of LLMs in the context ofEU politics. They audited the chat-based LLAMA-2-13B on the EUANDI-2019 dataset (Michel et al.,2019) showcasing that the model has limited knowl-edge of parties stances with significant disparityacross political groups.They also adapted themodel to partisan data demonstrating a high de-gree of re-alignment in most cases. Hartmann et al. (2023) conducted a similar anal-ysis focusing on ChatGPT. They audited the modelbased on German and Dutch national question-naires, overall coming to a similar conclusion asFeng et al. (2023) and Chalkidis and Brandl (2024) that ChatGPT leans mostly left-libertarian. In ourwork, we focus on and investigate the potentialof LLMs to disseminate political information andbe used as VAAs accurately, not to examine themodels political leanings out-of-context. Rttger et al. (2024) scrutinize the shortcomingsof the unrealistic closed-form forced evaluation,e.g., multi-choice questionnaires, used in the re-lated work on evaluating values and opinions inLLMs, such as political biases. They demonstratedthe lack of robustness, and compliance in modelsanswers when questioned in open-ended settings.They advocate for application-level evaluations, theuse of robustness tests, and the framing of claimsconcerning only the examined models.Given the aforementioned background, our workexplores the under-studied EU political context.For this, we rely on up-to-date (May 2024) polit-ical content (information), namely the EUANDI-2024 questionnaire, and recently developed open-weight LLMs that give us the flexibility to exam-ine different auditing settings. To the best of ourknowledge, we are the first to investigate the use ofcontextual augmentation via RAG in the context ofpolitical NLP studies (Afli et al., 2024).",
  "Conclusion and Future Work": "In conclusion, we find that recent larger LLMshave a great potential to serve as Voting AdviceApplications (VAAs) with an accuracy of 80%+out-of-the-box. Nonetheless, there is a substan-tial performance disparity among different politicalgroups. The overall performance is improved whenwe consider contextual augmentation with expert-curated information (90%+). Unfortunately, wefind that automatically augmenting the context viaweb-based RAG is still an open challenge lead-ing to minor improvements (+3%) for MIXTRAL;contrary web-based RAG substantially boosts theperformance of the smaller MISTRAL (+8%).In future work, we will further investigate theuse of custom-curated RAG, which has the poten-tial to further improve performance by groundingmodels generation on useful up-to-date crediblesources. We will also investigate the potential ben-efit of continuous instruction-tuning of LLMs withpartisan data, such as the EU Debates corpusof Chalkidis and Brandl (2024). Similarly, a us-ability study assessing the experience of humanactors when interacting with LLMs in the contextof politics is a crucial next step.",
  "Limitations": "EU ScopeThe scope of our work is limited in therecent EU political context (national parties from4 EU member states, and the European ParliamentElections 2024) in English language, so all findingsand claims are subjected to this specific scope. Qualitative analysisOur study is also limited tomostly quantitative results, e.g., how many timesthe models replied with the right option, i.e., multi-class decision. Analyzing the models responsesto investigate their argumentation for justifying(explaining) the given answers is also an impor-tant aspect related to trustworthiness and robust-ness (Rttger et al., 2024). From a usability per-spective, LLMs knowledge should be better under-stood as justified true beliefs, i.e., x thinks that p,p is true, and x has some justification for thinkingit (Nozick, 2000), instead of any other definitionthat does not directly involve the ability to jus-tify; since the value of disseminating information(knowledge) is limited without reasonable justifi-cation (explanation). Fierro et al. (2024) present athorough survey on interpretations of knowledgedefinitions applicable to LLMs. UsabilityAs our work investigates the potentialof LLMs as voting assistants, a usability studywhere we assess users experience while interactingwith the examined LLMs would provide valuableinsights. In the lack of resources, we omit thisaspect for a future study. ModelsIn our study, we considered 2 represen-tative open-weight chat-based LLMs: MISTRAL7B, and MIXTRAL 87 using a single NVIDIAA100 (40G) GPU card. MIXTRAL is the 3rd best-performing open-weight model according to theup-to-date (15 June 2024) results in the HELMLeaderboard (Liang et al., 2023).8 We lack theresources to investigate the 2 best, much bigger,models: Metas Llama-3 70B (released Apr 2024),and the recent Mixtral 822B (released May 2024). Indexed web-based RAGMost web-based RAGsystems rely on an indexed (older) version of theweb rather than an online version retrieving themost recent pages (documents). This can be anissue in time-sensitive applications like the one weexplore, since the most up-to-date information, e.g.,parties manifestos, recent interviews, and talks,may not be part of the library.",
  "Ethical Considerations": "While we firmly believe that conversational AIagents (LLMs) could potentially pose an interest-ing alternative for political information dissemina-tion, several notable risks and challenges should betaken into consideration and mitigated before suchcritical applications are considered for deploymentin public and popularized: First and foremost, LLMs have intrinsic politicalbiases (Feng et al., 2023; Chalkidis and Brandl,2024), which was also a finding in our work,which means that they better represent specificpolitical groups and ideologies over others. Po-litical misrepresentation can be seen as a formof misinformation (Chen and Shu, 2023), whichis a critical issue. It should be also understoodas a form of lack of fairness since some polit-ical groups are better (more accurately) served(represented) than others. Nonetheless, misinfor-mation and misrepresentation, which underminedemocracy, are great open challenges for humansocieties -and traditional media- in general. Secondly, political information dissemination asa sensitive application with critical implicationsin human societies must be grounded in reli-able sources and such sources should accom-pany the models generated text so that users canread them and fact-check information. Retrieval-Augmented Generation (RAG) can be a potentialdirection to tackle this challenge, but in our work,we find that automated RAG-based solutions donot boost performance. Given the promising re-sults we have with the expert-curated augmenta-tion, we believe that the use of curated domain-specific corpora for RAG can be a potential so-lution, limiting retrieval to highly relevant andcredible sources. Moreover, explainability in theera of LLMs should be investigated to help usersidentify how the retrieved sources, alongside theoriginal training data themselves, led to the gen-erated content. In general, the use of conversational AI agents(LLMs) as Voting Advice Applications (VAAs) isa challenging sensitive topic and should be furtherinvestigated. In this direction, collaboration withpolitical scientists, and representatives from the po-litical parties is of paramount importance to securean operational framework under which LLMs willbe considered a credible curated source for politicalinformation dissemination.",
  "Acknowledgements": "We thank our colleagues at the CoAStaL NLPgroup Stephanie Brandl, Constanza Fierro, andDanae Snchez for their valuable comments. Thisproject is is funded by the Novo Nordisk Founda-tion (grant NNF 20SA0066568). Haithem Afli, Houda Bouamor, Cristina Blasi Casagran,and Sahar Ghannay, editors. 2024. Proceedings ofthe Second Workshop on Natural Language Process-ing for Political Sciences @ LREC-COLING 2024.ELRA and ICCL, Torino, Italia. Ilias Chalkidis and Stephanie Brandl. 2024.Llamameets eu: Investigating the european political spec-trum through the lens of llms. In Proceedings ofthe 2024 Conference of the North American Chap-ter of the Association for Computational Linguistics,Mexico City, Mexico. Association for ComputationalLinguistics.",
  "Canyu Chen and Kai Shu. 2023. Combating misinfor-mation in the age of llms: Opportunities and chal-lenges. Preprint, arXiv:2311.05656": "Shangbin Feng, Chan Young Park, Yuhan Liu, and YuliaTsvetkov. 2023. From pretraining data to languagemodels to downstream tasks: Tracking the trails ofpolitical biases leading to unfair NLP models. InProceedings of the 61st Annual Meeting of the As-sociation for Computational Linguistics (Volume 1:Long Papers), pages 1173711762, Toronto, Canada.Association for Computational Linguistics. Constanza Fierro, Ruchira Dhar, Filippos Stamatiou,Nicolas Garneau, and Anders Sgaard. 2024. Defin-ing Knowledge: Bridging Epistemology and LargeLanguage Models. In Proceedings of the 2024 Con-ference on Empirical Methods in Natural LanguageProcessing. Jochen Hartmann, Jasper Schwenzow, and Maximil-ian Witte. 2023. The political ideology of conver-sational ai: Converging evidence on chatgpts pro-environmental, left-libertarian orientation.ArXiv,abs/2301.01768. Albert Q. Jiang, Alexandre Sablayrolles, Arthur Men-sch, Chris Bamford, Devendra Singh Chaplot, Diegode las Casas, Florian Bressand, Gianna Lengyel, Guil-laume Lample, Lucile Saulnier, Llio Renard Lavaud,Marie-Anne Lachaux, Pierre Stock, Teven Le Scao,Thibaut Lavril, Thomas Wang, Timothe Lacroix,and William El Sayed. 2023. Mistral 7b. Preprint,arXiv:2310.06825.",
  "Albert Q. Jiang, Alexandre Sablayrolles, AntoineRoux, Arthur Mensch, Blanche Savary, ChrisBamford, Devendra Singh Chaplot, Diego de las": "Casas, Emma Bou Hanna, Florian Bressand, Gi-anna Lengyel, Guillaume Bour, Guillaume Lam-ple, Llio Renard Lavaud, Lucile Saulnier, Marie-Anne Lachaux, Pierre Stock, Sandeep Subramanian,Sophia Yang, Szymon Antoniak, Teven Le Scao,Thophile Gervet, Thibaut Lavril, Thomas Wang,Timothe Lacroix, and William El Sayed. 2024. Mix-tral of experts. Preprint, arXiv:2401.04088. Patrick Lewis, Ethan Perez, Aleksandra Piktus, FabioPetroni, Vladimir Karpukhin, Naman Goyal, Hein-rich Kttler, Mike Lewis, Wen-tau Yih, Tim Rock-tschel, Sebastian Riedel, and Douwe Kiela. 2020.Retrieval-augmented generation for knowledge-intensive nlp tasks. In Proceedings of the 34th Inter-national Conference on Neural Information Process-ing Systems, Red Hook, NY, USA. Curran AssociatesInc. Percy Liang, Rishi Bommasani, Tony Lee, DimitrisTsipras, Dilara Soylu, Michihiro Yasunaga, YianZhang, Deepak Narayanan, Yuhuai Wu, AnanyaKumar, Benjamin Newman, Binhang Yuan, BobbyYan, Ce Zhang, Christian Cosgrove, Christopher D.Manning, Christopher R, Diana Acosta-Navas,Drew A. Hudson, Eric Zelikman, Esin Durmus,Faisal Ladhak, Frieda Rong, Hongyu Ren, HuaxiuYao, Jue Wang, Keshav Santhanam, Laurel Orr,Lucia Zheng, Mert Yuksekgonul, Mirac Suzgun,Nathan Kim, Neel Guha, Niladri Chatterji, OmarKhattab, Peter Henderson, Qian Huang, Ryan Chi,Sang Michael Xie, Shibani Santurkar, Surya Gan-guli, Tatsunori Hashimoto, Thomas Icard, TianyiZhang, Vishrav Chaudhary, William Wang, XuechenLi, Yifan Mai, Yuhui Zhang, and Yuta Koreeda. 2023.Holistic evaluation of language models. Preprint,arXiv:2211.09110.",
  "Robert Nozick. 2000. . knowledge and scepticism. InSven Bernecker and Fred I. Dretske, editors, Knowl-edge: Readings in Contemporary Epistemology. Ox-ford University Press": "Nils Reimers and Iryna Gurevych. 2019. Sentence-bert:Sentence embeddings using siamese bert-networks.In Proceedings of the 2019 Conference on EmpiricalMethods in Natural Language Processing. Associa-tion for Computational Linguistics. Paul Rttger, Valentin Hofmann, Valentina Pyatkin,Musashi Hinck, Hannah Kirk, Hinrich Schuetze, andDirk Hovy. 2024. Political compass or spinning ar-row? towards more meaningful evaluations for valuesand opinions in large language models. In Proceed-ings of the 62nd Annual Meeting of the Associationfor Computational Linguistics (Volume 1: Long Pa-pers), pages 1529515311, Bangkok, Thailand. As-sociation for Computational Linguistics.",
  "Whose opinions do language models reflect?InProceedings of the 40th International Conference onMachine Learning. JMLR.org": "Kaitao Song, Xu Tan, Tao Qin, Jianfeng Lu, and Tie-YanLiu. 2020. Mpnet: masked and permuted pre-trainingfor language understanding. In Proceedings of the34th International Conference on Neural InformationProcessing Systems, NIPS 20, Red Hook, NY, USA.Curran Associates Inc. Hugo Touvron, Louis Martin, Kevin Stone, Peter Al-bert, Amjad Almahairi, Yasmine Babaei, NikolayBashlykov, Soumya Batra, Prajjwal Bhargava, ShrutiBhosale, Dan Bikel, Lukas Blecher, Cristian CantonFerrer, Moya Chen, Guillem Cucurull, David Esiobu,Jude Fernandes, Jeremy Fu, Wenyin Fu, Brian Fuller,Cynthia Gao, Vedanuj Goswami, Naman Goyal, An-thony Hartshorn, Saghar Hosseini, Rui Hou, HakanInan, Marcin Kardas, Sharan Narang, Aurelien Ro-driguez, Robert Stojnic, Sergey Edunov, and ThomasScialom. 2023. Llama 2: Open foundation and fine-tuned chat models. Preprint, arXiv:2307.09288. Jason Wei, Xuezhi Wang, Dale Schuurmans, MaartenBosma, Ed Huai hsin Chi, F. Xia, Quoc Le, andDenny Zhou. 2022. Chain of thought promptingelicits reasoning in large language models. ArXiv,abs/2201.11903.",
  "Spanish national parties:Partido SocialistaObrero Espaol (PSOE), Partido Popular (PP),Vox, Ahora Repblicas, Sumar, and Podemos": "We also consider all euro-parties that were rep-resented in the 9th European Parliament (2019-2024): European Peoples Party (EPP), Party ofEuropean Socialists (PES), Alliance of Liberalsand Democrats for Europe Party (ALDE), Euro-pean Conservatives and Reformists Party (ECR),European Green Party (EGP), Identity and Democ-racy (ID), and the Party of the European Left (PEL).We conduct all experiments in English.",
  "C.1Machine-Translation": "Since all our experiments are in English, we trans-lated the EUANDI-2024 (.1) parties jus-tification from the original language to Englishautomatically derived using MIXTRAL with thefollowing instruction: You are a helpful profes-sional translation assistant. The translations mustbe faithful and accurate at a professional levelmeeting the highest European Commission offi-cial standards. Translate the following text from[SOURCE LANGUAGE] to English: [JUSTIFI-CATION]. The translated versions are part of thereleased dataset.9",
  "C.2Curated RAG Implementation": "We create a custom-curated corpus for documentretrieval, where the only available sources arethe official pre-election manifestos (programs) ofthe 7 examined euro-parties. We automaticallysplit all manifestos into paragraphs, which leadsto 60-100 paragraphs per euro-party dependingon the length of their manifesto.Then, weembed the paragraphs with the use of one ofthebestopen-sourcedocumentembedders,sentence-transformers/all-mpnet-base-v2,which is based on MPNet (Song et al., 2020) andfine-tuned in many sentence retrieval datasets, re-leased by Reimers and Gurevych (2019). We thenretrieve the top 3 relevant paragraphs from eacheuro-partys manifesto using as query the statementin question, e.g., The European Union shouldbe enlarged to include Ukraine, and augment",
  "AUser: Would the [ORIGIN] [PARTY NAME] party agree or disagree with the statement \"[STATEMENT]\"?User: [RETRIEVED WEB SNIPPETS]Model: The [ORIGIN] [PARTY NAME] party aligns with option ([...]": "BUser: Write a summary for the [ORIGIN] [PARTY NAME] party focused on its recent stance in national and EUpolitics. The summary must be up to 100 words.Model: The [ORIGIN] [PARTY NAME] party [...]User: What would be the position of the [ORIGIN] [PARTY NAME] party related to the statement \"[STATE-MENT]\"? Your answer must be up to 100 words.Model: The [ORIGIN] [PARTY NAME] party [...]User: Would the [ORIGIN] [PARTY NAME] party agree or disagree with the statement \"[STATEMENT]\"?Model: The [ORIGIN] [PARTY NAME] party aligns with option ([...] CUser: According to the \"EU and I 2024\" project, the [ORIGIN] [PARTY NAME] party recently shared thefollowing opinion on the media: \"[JUSTIFICATION]\".User: Would the [ORIGIN] [PARTY NAME] party agree or disagree with the statement \"[STATEMENT]\"?Model: The [ORIGIN] [PARTY NAME] party aligns with option ([...]",
  "C.3Dialogue Templates": "In , we present the dialogue templates acrosssettings (.3). We prepend a short part ofthe models expected response to enforce compli-ance with our instructions (questions). Withoutpremeditating the models response, we risk thelack of compliance due to (a) the models learnedguardrails from AI alignment, e.g., the model willnot respond to questions related to sensitive top-ics or avoid sharing opinions, (b) invalid options,e.g., the model will return an invalid option (nota-e). Also, we eliminate the complexity of post-processing free-text responses, i.e., the responsemay lack references to the alphabetic option (a-e).",
  "In Tables 5-8, we present responses by the best-performing model, MIXTRAL, considering exam-ples of both correct and mis- predictions": "Question: Would the Christlich Demokratische Union Deutschlands (CDU) party agree or disagree with the statement:\"Gender quotas (e.g. a minimum share of positions to be filled by women) are to be welcomed\"?Model Answer: The Christlich Demokratische Union Deutschlands (CDU) aligns with option (b) - tends to disagreewith the statement. The CDU believes in equal opportunities and equal representation, but they generally prefer voluntarymeasures to increase the number of women in leadership positions over gender quotas. However, its essential tounderstand that individual attitudes within the party can vary, and the CDUs stance may evolve over time due to theongoing discussion on gender quotas in politics and corporate settings both in Germany and the European Union.",
  "Party Answer: (d) Tend to agree": "Context: According to the \"EU and I 2024\" project, the Die Linke (Linke) party recently shared the following opinionon the media: \"Despite all of its shortcomings and flawed constructions, we must not retreat from the political successof European integration, not retreat back to the nation-state. We know that the fight for social guarantees, for climatejustice, against energy poverty, against the power of transnational corporations can no longer be successfully wagedon the national level. In order to be successful, we need cross-border cooperation. Therefore, as democratic socialists,we stand both against those who advocate for a market radical EU and against the nationalist concept of a \"Europeof Fatherlands.\" Aware of the European Unions constitution and the existing balance of power, we do not leave theEuropean arena for disagreements to neoliberals and right-wingers. Our vision of democratic socialism is international,encompassing the fight for a more democratic, social European Union.\"Question: Would the Die Linke (Linke) party agree or disagree with the statement: \"European integration is a goodthing\"? Model Answer: The Die Linke (Linke) aligns with option (b) - they tend to disagree with the statement \"European inte-gration is a good thing.\" While they acknowledge some benefits of European integration, such as increased collaborationand economic growth, they are highly critical of its negative consequences, like the democratic deficit and wideningsocial inequalities. The party advocates for a reformation of the EU structure to focus more on social welfare, rather thanits current prioritization of market interests.",
  "Question: Would the German Die Linke (Linke) agree or disagree with the statement: \"European integration is a goodthing\"?": "Model Answer: The German Die Linke (Linke) party aligns with option (b). They tend to disagree with the statementthat European integration is a good thing. The party is critical of some aspects of European integration and believesthat the current form of the European Union (EU) has failed to address the social and economic inequalities between itsmember states. They advocate for a more democratic, socially equitable, and peaceful Europe but with greater respectfor national sovereignty. Nevertheless, the party does not reject the idea of European integration entirely, and their stancemay evolve depending on the context and issues at hand.",
  "Question: Would the French Renaissance (RE) agree or disagree with the statement: \"Taxation on the wealthiest part ofthe population should be increased\"?": "Model Answer: The French Renaissance (RE) party aligns with option (a) - they completely disagree with the statement\"Taxation on the wealthiest part of the population should be increased.\" The party, led by President Emmanuel Macron,advocates for reducing taxes, particularly on businesses and high-earning individuals, to attract investment and stimulateeconomic growth. However, they also believe in implementing targeted welfare programs to help lower-incomehouseholds and encourage social mobility. It is essential to note that perspectives might change depending on specificcontexts and evolving economic conditions.",
  "Party Answer: (a) Completely disagree": "Question: Would the Partido Socialista Obrero Espaol (PSOE) party agree or disagree with the statement: \"To fight theproblem of illegal immigration, the European Union should take responsibility in patrolling its borders\"? RAG Sources: (a) Spain: PSOE government immigration policy aimed at tightening borders ( (b)Spains Popular Party stirs fear over the arrival of millions of migrants ( Answer: The Partido Socialista Obrero Espaol (PSOE) party aligns with option (d) tends to agree with thestatement. The PSOE has recognized the importance of effective border management and a coordinated EU approachto migration. They have supported the development of a European Border and Coast Guard Agency (Frontex) andadvocated for a comprehensive migration policy that addresses both legal and illegal immigration. While they havealso emphasized the need for respect for human rights and the protection of vulnerable migrants, they recognize therole of the EU in patrolling its borders and managing migration flows. This suggests they would tend to agree with thestatement, favoring a stronger EU role in border control as part of a broader strategy to address illegal immigration.",
  "Question: Would the European Peoples Party (EPP) agree or disagree with the statement: \"The single Europeancurrency (Euro) is a bad thing\"?": "Model Answer: The European Peoples Party (EPP) party aligns with option (a) - The party completely disagrees withthe statement. The EPP has historically been supportive of the euro, as it represents European unity and integration.Critics of the euro usually come from eurosceptic or far-right parties, which do not form a large part of the EPPsmembership. The EPP considers the single currency to be essential for the smooth functioning of the European economyand a symbol of European integration. Nonetheless, like any political party, it may hold various opinions among itsdiverse members.",
  "RAG Sources: (a) Angela Merkel and the CDU Quota Curse (www.tandfonline.com) (b) Germanys ruling CDU plansto implement disputed gender (www.xinhuanet.com)": "Model Answer: The German Christlich Demokratische Union Deutschlands (CDU) party aligns with option (d). TheCDU tends to agree with the statement \"Gender quotas (e.g., a minimum share of positions to be filled by women) areto be welcomed.\" The CDU has evolved in its stance on gender quotas, moving from staunch opposition to a moreaccepting position. Initially, the party resisted the idea of quotas, but over time, influenced by the CDU Womens Unionand the need to adapt to changing societal expectations, the CDU has come to embrace the concept of gender equality inpolitical representation. While there may still be internal debates and varying degrees of support within the party, theCDUs recent plans to implement a 50% quota for women by 2025 indicate a clear tendency to agree with the statement.This shift reflects the partys recognition of the importance of equal representation and their willingness to take proactivesteps toward achieving gender parity in politics.",
  "Question: Would the Rassemblement National (RN) party agree or disagree with the statement: \"Retirement age shouldbe raised in order to make the pension system more sustainable\"?": "RAG Sources: (a) Le Pens opposition to pension reform, focus on public order ( (b) MarineLe Pen takes advantage of French pension reform ( (c) Marine Le Pen Isnt on the Same Side asFrances Pension Retirement Reform Protest ( (d) The Far Rights Response to Pension Reform inFrance ( Model Answer: The Rassemblement National (RN) party aligns with option (a): The party completely disagrees withthe statement. The Rassemblement National (RN) party, led by Marine Le Pen, has traditionally supported a retirementage of 60 with 40 years of contributions. This position has placed them in opposition to proposals to raise the retirementage, including the recent pension reform debate in France. Marine Le Pen has argued for a \"social turn,\" prioritizing theinterests of workers and advocating for a retirement age that allows them to enjoy the fruits of their labor. The partysstance aligns with their populist and nationalist ideology, appealing to the concerns of their core constituents, particularlythose in manual labor or physically demanding professions.",
  "RAG Sources: (a) ID Group ( (b) Identity and Democracy ( (c) Defenceand common army: the positions of European parties ( (d) ID Program (": "Model Answer: The European Identity and Democracy (ID) party aligns with option (a) - the party completely disagreeswith the statement \"The European Union should strengthen its security and defence policy\". The party strongly advocatesfor the sovereignty of individual member states and opposes further centralization of power in the EU. They believe thatsecurity and defence are matters that should be handled by national governments, and they reject the idea of a commonEU army or a significant expansion of EU powers in these areas.",
  ": Examples of MIXTRAL responses in Setting A": "Question: Write a summary for the Christlich Demokratische Union Deutschlands (CDU) party focused on its recentstance in national and EU politics. The summary must be up to 100 words.Model Answer: The Christlich Demokratische Union Deutschlands (CDU) The German Christlich DemokratischeUnion Deutschlands (CDU) party the countrys leading center-right Christian democratic party has been a consistentproponent of EU integration and cooperation. In recent years, the CDU emphasized its commitment to a strong andunited Europe, emphasizing principles like rule of law, democracy, and stability. At the national level, the CDU, as partof the governing coalition, has taken a balanced approach to EU politics by reconciling competing interests and positionswithin the Union. With respect to the current issues, the CDU advocates for a balanced and sustainable migration policy,responsible economic growth, and a coordinated approach. Question: What would be the position of the Christlich Demokratische Union Deutschlands (CDU) party related to thestatement: \"Gender quotas (e.g. a minimum share of positions to be filled by women) are to be welcomed\"? Your answermust be up to 100 words.Model Answer: The Christlich Demokratische Union Deutschlands (CDU) The German Christlich DemokratischeUnion Deutschlands (CDU) party as a member of the conservative European Peoples Party (EPP) adopts a nuancedperspective on gender quotas. The CDU supports gender equality and female empowerment; however, it generallyprefers voluntary, non-legislative initiatives to achieve this goal. While the CDU acknowledges the positive aspects ofgender quotas in promoting gender equality, it maintains its concern that such measures might compromise the principleof merit-based appointments and potentially create a stigma, implying that women were appointed due to quotas, nottheir competence. Question: Would the Christlich Demokratische Union Deutschlands (CDU) party agree or disagree with the statement:\"Gender quotas (e.g. a minimum share of positions to be filled by women) are to be welcomed\"?Model Answer: The Christlich Demokratische Union Deutschlands (CDU) party aligns with option (b) the partytends to disagree with the statement, \"Gender quotas (e.g. a minimum share of positions to be filled by women) are tobe welcomed.\" While the CDU supports gender equality and female empowerment, it typically prefers non-legislativemethods to promote gender equality and maintains concerns about potential negative consequences associated withgender quotas. The CDU aims to strike a balance between ensuring equal representation and upholding the principle ofmerit-based appointments.",
  ": Examples of MIXTRAL responses in Setting B": "Context: According to the \"EU and I 2024\" project, the Christlich Demokratische Union Deutschlands (CDU) partyrecently shared the following opinion on the media: \"On Friday, June 11, 2021, the Bundestag agreed to the federalgovernments draft bill \"on the complementation and amendment of the regulations for the equal participation of womenin leadership positions in the private sector and the public service\" (19/26689, 19/27633, 19/28005 No. 6) in the versionamended by the Family Affairs Committee (19/30514). At its 2022 party conference, the CDU passed a gradual womensquota. As of 2023, one third of the district boards must be filled with women. This increases to 40 percent in 2024 and to50 percent in mid-2025. This regulation applies until 2029. The proposal was promoted by CDU leader Friedrich Merzand Julia Klckner.\" Question: Would the Christlich Demokratische Union Deutschlands (CDU) party agree or disagree with the statement:\"Gender quotas (e.g. a minimum share of positions to be filled by women) are to be welcomed\"?Model Answer: The Christlich Demokratische Union Deutschlands (CDU) party aligns with option (d) \"The partytends to agree with the statement.\" While the CDU usually prefers to avoid using quotas, some members of the partyacknowledge the importance of gender quotas to boost female representation and promote gender equality, especially inpolitical and corporate leadership roles. However, the CDUs general stance on gender quotas can sometimes vary basedon specific contexts and individual perspectives, and thus only a trend in favor of the statement can be observed ratherthan a complete agreement.",
  "Party Answer: (e) Completely agree": "Context: According to the \"EU and I 2024\" project, the Identity and Democracy (ID) party recently shared the followingopinion on the media: \"Every country is primarily illegal solely responsible for securing its borders. If some Europeancountries wish to collaborate, there is no need for the EU. There are no EU borders. Only sovereign national states haveborders. As Frontex is responsible for protecting our external borders, it is essential to give a sufficient budget to carryout this task effectively.\" Question: Would the Identity and Democracy (ID) party agree or disagree with the statement: \"To fight the problem ofillegal immigration, the European Union should take responsibility in patrolling its borders\"? Model Answer: The Identity and Democracy (ID) party aligns with option (e) - \"The party completely agrees with thestatement.\" The ID party emphasizes the importance of border control and believes the EU should secure its externalborders to combat illegal immigration. Additionally, I would like to provide more context on the European Identity andDemocracy (ID) partys stance. They aim to: - Limit immigration into the EU by increasing border controls - PromoteEurosceptic and nationalistic views - Focus on maintaining Europes cultural and societal identity"
}