{
  "Abstract": "Language models (LMs) are known to sufferfrom hallucinations and misinformation. Re-trieval augmented generation (RAG) that re-trieves verifiable information from an externalknowledge corpus to complement the paramet-ric knowledge in LMs provides a tangible so-lution to these problems. However, the gen-eration quality of RAG is highly dependenton the relevance between a users query andthe retrieved documents. Inaccurate responsesmay be generated when the query is outside ofthe scope of knowledge represented in the ex-ternal knowledge corpus or if the informationin the corpus is out-of-date. In this work, weestablish a statistical framework that assesseshow well a query can be answered by an RAGsystem by capturing the relevance of knowl-edge. We introduce an online testing procedurethat employs goodness-of-fit (GoF) tests to in-spect the relevance of each user query to detectout-of-knowledge queries with low knowledgerelevance. Additionally, we develop an offlinetesting framework that examines a collection ofuser queries, aiming to detect significant shiftsin the query distribution which indicates theknowledge corpus is no longer sufficiently ca-pable of supporting the interests of the users.We demonstrate the capabilities of these strate-gies through a systematic evaluation on eightquestion-answering (QA) datasets, the resultsof which indicate that the new testing frame-work is an efficient solution to enhance the reli-ability of existing RAG systems.",
  "Introduction": "Recent progress on large-scale pre-trained lan-guage models (LMs) (Brown et al., 2020; Anilet al., 2023) has demonstrated great potential inrevolutionizing a wide array of applications acrossfields, ranging from natural language understand-ing and generation to complex problem-solvingin scientific research. Despite their remarkable abilities, generative LMs suffer from poor inter-pretability and transparency, as well as the intrinsicrisk of hallucination and misinformation, whichcollectively prohibit them from being deployed insafety-critical domains such as healthcare (Wornowet al., 2023; DAntonoli et al., 2024).Retrieval augmented generation (RAG) (Lewiset al., 2020) is a promising approach for enhancinglanguage models (LMs) by incorporating verifi-able, current information from external knowledgedatabases. Incorporating this external context tocomplement the inherent knowledge of LMs hasdemonstrated notable benefits in reducing occur-rences of hallucination and misinformation, therebyimproving the reliability of content produced (Shus-ter et al., 2021). Still, numerous studies (Karpukhinet al., 2020; Gao et al., 2022; Tan et al., 2022; Yanet al., 2024) show that the effectiveness of RAG isdependent on the relevance between the query andretrieved documents. In cases where documentsof weak relevance are provided, they can becomedistractions for the LM (Shi et al., 2023), lead-ing to the generation of incorrect answers. At thepresent moment in time, there is no viable solutionfor safety-critical RAG systems to possess mech-anisms for (1) evaluating the relevance of queriessubmitted from users to the knowledge corpus andflagging low-relevance queries in real-time that can-not be adequately addressed using the availableknowledge or (2) identifying significant shifts inquery distribution that are indicative of a potentialmisalignment between the knowledge corpus anduser interests, which would suggest an outdatedknowledge database that requires updating.To address these deficiencies, in this paper weestablish a statistical framework for accurate assess-ment of the query-knowledge relevance in retrieval-based LMs through hypothesis testing. As illus-trated in , we introduce two testing proce-dures: an online testing procedure (left subfigure)that aims at identifying single out-of-knowledge",
  "Corpus": "Text chunk Q: Does the administration of statins correlate with a reduced risk of cardiovascular events in diabetic patients?A: Yes; B: No; C: Maybe.A: A... Corpus-based query examples Q: Is fenoldopam more effective than low-dose dopamine in improving renal function in critically ill patients with early renal dysfunction? A: Yes; B: No. A: B",
  ": Overview of the hypothesis-testing framework for assessing query-knowledge relevance in RAG": "queries and an offline testing procedure (right sub-figure) for detecting query distribution shifts. Inthe online testing scenario, we cast evaluation ofquery-knowledge relevance as testing against thenull hypothesis that the unknown query arises fromthe same distribution as the empirical in-knowledgequeries (i.e., testing for goodness-of-fit (GoF)). Weutilize the semantic similarity between the queryand the retrieved most relevant documents capturedby text embedding models (Izacard et al., 2022) toderive test statistics and reject query samples thatare unlikely to occur given the empirical distri-bution of in-knowledge queries (queries that canbe answered with the knowledge corpus). In sce-narios when the in-knowledge query distributionis unknown, we generate synthetic in-knowledgequeries, by prompting LMs with document chunks,to serve as a proxy to the true in-knowledge querydistribution. In the offline testing scenario, we em-ploy a two-sample GoF test to determine whetherthe unknown set of queries matches the empiri-cal distribution of historical in-knowledge queries,where a large p-value is suggestive of a significantquery distribution shift. To demonstrate the feasibility of these ap-proaches, we report on a systematic evaluation withtwo biomedical corpus and eight QA datasets, in-cluding three general domain QA datasets and fivebiomedical QA datasets, to investigate seven teststatistics and six retrievers. Our experiments high-light several notable findings. First, the testing-based methods can more reliably capture the rel-evance compared to LM-based relevance scoresand outlier-detection-based baselines. Second, syn-thetic queries can provide a good approximate tothe in-knowledge distribution with similar empir-ical performance for detecting out-of-knowledge queries. Third, there is a misalignment betweenembedding models ability to retrieve relevant doc-uments and their ability to detect out-of-knowledgequeries. And, fourth, query distribution shifts canbe effectively detected through GoF testing withhigh accuracy using a relatively small sample size. 2BackgroundRetrieval Augmented Generation (RAG).RAGsystems (Lewis et al., 2020) leverage externalknowledge bases to assist language models (LMs)in responding to user queries. A RAG system iscomposed of a retriever and a generator . Theretriever is connected to a corpus of knowledgedocument chunks D = {di}ni=1, where di V andV denotes the space of natural texts. Given a userquery q V, the retriever retrieves from D thek-most relevant documents Dr = {dri }ki=1 D.The generator is an LM that generates an answer aaccording to the query q and the retrieved doc-uments Dr. The overall framework can be de-scribed as P(a|q, D) = P(Dr|q)P(a|q, Dr),where P(Dr|q) and P(a|q, Dr) denotes the re-trieval and generation process respectively.Embedding Model.Most modern RAG systemsutilize vector databases to construct retriever (Gaoet al., 2023). In this setting, an embedding modelE : V Rm is employed to encode the docu-ment chunks as a set of vector representations ina m-dimensional latent space that captures seman-tic similarity1. The retriever retrieves a documentaccording to its measured similarity to the query,i.e., P(d|q) exp(S(E(d), E(q))), whereS : Rm Rm R is a similarity metric. Com-mon choices of S include cosine similarity and dotproduct.",
  "Some frameworks use separate embedding models for thequery and document": "Goodness-of-Fit (GoF) Test.A GoF test is a sta-tistical procedure for comparing an observation xto an expected distribution P. Formally, it decidesbetween a null hypothesis H0 : x P indicative offitness and an alternative hypothesis H1 : x P.In a one-sided right-tailed test, the test statistict(x) is compared to the critical value c, and H0is rejected if t(x) c. In practice, c is calcu-lated based on a pre-determined significant level := P(t(x) c|H0) denoting the probability offalsely rejecting the null hypothesis when the nullhypothesis is true. To help interpret the test result,a p-value is reported to indicate the probability ofobtaining a test statistic that is equal to or moreextreme than the actual observed value t under theassumption of H0, i.e., p(t) := P(t(x) t|H0).By convention, p(t) is considered statisticallysignificant to reject H0.",
  "It should be noted that Equation 1 cannot becomputed in general due to the supremum over alldocument chunks and the expectation taken over": "the answer space. Instead, given a set of known in-knowledge queries (i.e., queries that are verified tobe answerable with the corpus), we seek to capturethe empirical relevance via a statistical test. 3.2Online Testing Procedure For IdentifyingSingle Out-of-Knowledge QueryIn safety-critical domains with low fault tolerance,such as medicine and finance, out-of-knowledgequeries should be detected in a timely manner toeither be rejected or trigger human interventionto ensure output quality. The following describesa testing procedure that decides whether a singlequery is out-of-knowledge in an online fashion. Definition 3.4 (GoF Test for Query Relevance).Given a fixed in-knowledge query distribution PIand a new query q sampled from unknown distri-bution P, the problem of deciding if q is out-of-knowledge can be formalized as testing the simplenull hypothesis",
  "H0 : P = PIagainstH1 : P = PI": "Let F(t) = P(t(q) t|H0) denote the cu-mulative distribution function (CDF) of the teststatistics under H0. The the p-value of the test is1 F(t) and the critical value for a test of size isc(; PI) := inf{t : F(t) > 1 }. The GoF testthen rejects H0 if 1F(t) or t c(; PI), in-dicating that the sample is out-of-knowledge, withtype I error bounded by .In practice, the in-knowledge distribution is un-known, such that the p-value and critical valuecannot be calculated analytically. However, theycan be approximated through a sampling process.Given a set of in-knowledge queries QI, we esti-mate the empirical cumulative distribution function(eCDF) of test statistics under H0 using QI:",
  "F(t(q); QI) =1 + qiQI 1{t(qi)t(q)}1 + |QI|.(2)": "The p-value and critical value can thus be obtainedas p(t(q)) = 1 F(t(q); QI) and c(; QI) :=inf{t :F(t; QI) > 1 }.According toDonskers theorem, any desired precision of thisestimation can be achieved by increasing the sam-ple size. A larger p-value indicates that the queryis more relevant to the empirical distribution andthus more likely to be in knowledge. Test Statistics.The proposed hypothesis testingframework requires mapping a given test queryto a numerical score as the test statistics. Ideally,the score should capture the degree to which thetest query deviates from the distribution of queries encapsulated by the corpus, so that a higher scoreindicates that the test query is more likely to be outof knowledge. As there is no clear guidance fromprior literature on which test statistic provides thebest performance in this scenario, we explore thefollowing options:(1) Maximum Similarity Score (MSS). A sim-ple baseline is to use the similarity score be-tween the query and the most relevant docu-ment chunk from the corpus measured in the em-bedding space as the test statistic, i.e., t(q) = maxdD S(E(d), E(q)).(2) k-th Nearest Neighbor (KNN). An exten-sion of the maximum similarity score is to es-timate the similarity score between the queryand its k-th nearest document embeddings (Ra-maswamy et al., 2000; Sun et al., 2022), i.e.,t(q) = sk where sk is the k-th largest element of{S(E(d), E(q))|d D}.(3) Average of k Nearest Neighbors (AvgKNN).AvgKNN computes the average similarity scoreof all k nearest document embeddings (Angiulliand Pizzuti, 2002) as the test statistic, i.e., t(q) = 1 kdDr S(E(d), E(q)).(4) Entropy. The entropy of the retriever prob-ability distribution P(d|q) captures the retrievaluncertainty where a higher value may be suggestiveof potential out-of-knowledge queries (Ren et al.,2019). For computational efficiency, we computethe entropy using only the k nearest document en-tries, i.e., t(q) = ki=1 P(qi) log(P(qi)), whereP(qi) = exp(S(E(d),E(qi))qDr exp(S(E(d),E(q)). (5) Energy. Prior work by (Liu et al., 2020) sug-gests that the free energy function of a softmax-based neural classifier contains useful cues fordistinguishing out-of-distribution samples. Herewe extend this idea to embedding models trainedwith contrastive loss (similar to (Kim and Ye,2022)) by computing the energy score of a querywith respect to its k nearest document entriesas t(q) = log ki=1 g(qi), where g(qi) =exp(S(E(d), E(qi)/) and is a temperatureparameter which we set to 1.0 by default. Meta-analytic Testing.In addition to the afore-mentioned univariate tests, we conduct additionalmeta-analytic tests. This is accomplished by run-ning k independent univariate tests for each of thek nearest neighbors and then performing a meta-analysis on the test results. We employ the Fisher(Fisher, 1970) and Simes (Simes, 1986) methodsfor obtaining an aggregated test statistic for the global null hypothesis as suggested by (Haroushet al., 2022). Specifically, given a set of p-values{pi(q)}ki=0 derived from performing k independenttests using the i-th nearest neighbors, the (6) Fishermethod derives the test statistic as 2 ki=0 pi(q)and the (7) Simes method derives the test statisticas minikp(i)",
  "iwhere p(i) is the i-th p-value aftersorting": "SynthesizingIn-KnowledgeQueries.Theabove testing procedure requires obtaining aset of in-knowledge queries for estimating theeCDF. However, as noted, such a set of queriesmay not be readily available. Thus, we generatesynthetic in-knowledge queries by prompting anLM to generate question-answer pairs based oneach document chunk, i.e., by drawing samplesfrom P(q, a|D). The answers generated alongwith the questions are intended to ensure thegenerated question can be answered based on thecontext of the corpus. We expect the obtainedsynthetic question setQI to serve as a proxyof the in-knowledge queries for deciding thecritical region at development time and the derivedthreshold can be used at test time to detectout-of-knowledge queries. Note that with syntheticqueries this test no longer has a bounded type Ierror rate and the actual performance will dependon the divergence between QI and QI.",
  "Offline Testing Procedure For DetectingQuery Distribution Shift": "We additionally consider an offline scenario wherethe service provider has the opportunity to reviewa collection of user queries gathered during thedeployment stage of the knowledge base to iden-tify any potential shifts in the query distribution.This enables the service provider to determine ifthe RAG knowledge base needs to be updated inresponse to evolving user requirements.We achieve this by extending the test defined inDefinition 3.4 to test against multiple samples fromthe unknown distribution. Specifically, given a setof in-knowledge queries QI and a set of queriesQP from unknown distribution P, we employ thenon-parametric two-sample KolmogorovSmirnov(KS) test that calculates the largest difference ofthe eCDFs as the test statistic, i.e.,",
  "Experiments": "4.1Experimental SetupDatasets and Corpora.We conduct experimentsusing queries from eight QA datasets, includingthree general domain QA datasets and five biomed-ical QA datasets from the MIRAGE benchmark(Xiong et al., 2024). (1) TruthfulQA (Lin et al.,2021) is a general domain QA dataset contain-ing questions from 38 categories including law,finance, and politics.We select a subset withhealth-related questions excluded, resulting in atotal number of 762 questions. (2) WikiQA (Yanget al., 2015) is a large set of 3, 047 general do-main questions sampled from Bing query logsassociated with Wikipedia pages. (3) Common-senseQA (Talmor et al., 2018) is a general domainQA dataset containing 12, 247 questions for testingcommon sense knowledge. (4) MedQA-US (Jinet al., 2021) is a medical examination QA datasetthat includes 1, 273 multi-choice questions the USMedical Licensing Examination. (5) MMLU-Med(Hendrycks et al., 2021) is a medical examinationQA dataset containing 1, 089 questions selectedfrom 6 biomedicine related tasks from MMLU.(6) MedMCQA (Pal et al., 2022) is a medical ex-amination QA dataset with 4, 183 questions fromIndian medical entrance exams. (7) PubMedQA(Jin et al., 2019) is a biomedical research QAdataset with 500 questions that can be answeredwith yes/no/maybe indicative of the veracity of thestatement based on scientific literature. (8) BioASQ-Y/N (Krithara et al., 2023) is a biomedical researchQA dataset containing 618 biomedical semanticquestions from Task B of the BioASQ benchmarkthat can be answered with yes/no.We consider two corpora from the biomedi-cal domain as the knowledge base for the RAGsystem. The first is Textbooks (Jin et al., 2021),which contains a collection of 18 English medicaltextbooks. The second is PubMed (Xiong et al.,2024), which contains abstracts from the biomed-ical literature. MedQA-US serves as the groundtruth in-knowledge queries for the Textbooks cor-pus and PubMedQA serves as the ground truthin-knowledge queries for the PubMed corpus, re-spectively, as both datasets are generated based onthe corresponding corpus. Unless otherwise indi-cated, we use Contriever (Izacard et al., 2022) asthe default embedding model for retriever in ourexperiments. Evaluation Metrics.The detection algorithmsare evaluated on a balanced dataset (i.e., anequal number) of in-knowledge (IK) and out-of-knowledge (OoK) query samples. We report on twothreshold-independent metrics, namely, the areaunder the receiver operating characteristic curve(AUROC) and the area under the precision-recallcurve (AUPRC). Additionally, we report the truepositive rate (TPR), i.e., the number of true out-of-knowledge samples over the total number ofpredicted out-of-knowledge samples, evaluated ata threshold that ensures the false positive rate onthe in-knowledge queries reaches 5%. For testing-based methods, this implies a significance levelof 5%. We further report the detection error rate(DER) at that threshold, i.e., the number of falselyclassified queries over the total number of queries.",
  "Online Testing Results": "Comparison of Test Statistics.We compare teststatistics by randomly drawing 300 samples fromthe IK dataset and 300 samples from the OoKdataset to construct a balanced testing set and mea-suring the AUROC and AUPRC in detecting OoKqueries. We set k = 32 and report the averageresult over 10 independent runs for stability. Ta-ble 1 presents the AUROC, while in Ap-pendix reports on the AUPRC results due to spacelimits. For each corpus, the OoK datasets are la-beled with bright colors indicating near OoK anddark colors indicating far OoK. We observe thaton both corpora, all test statistics achieve high per-formance in distinguishing far OoK queries, withmany achieving over 0.99 AUROC on both cor-pora. We additionally find that the performanceof test statistics varies from each corpus. For in-stance, Energy achieves the overall best AUROCon the Textbooks corpus while MSS performs thebest among all test statistics on the PubMed corpus.This suggests the optimal test statistic should bedecided for each application domain. Comparison with Outlier Detection-based Base-lines.We compare the GoF test using energyscores with five common outlier detection algo-rithms, including Mahalanobis distance (Maha)(Hardin and Rocke, 2004; Lee et al., 2018), One-class SVM (SVM) (Schlkopf et al., 2001), LocalOutlier Factor (LOF) (Breunig et al., 2000), KernelDensity Estimation (KDE) (Latecki et al., 2007),and Copula-Based Outlier Detection (COPOD) (Liet al., 2020). Based on the results presented in, it can be seen that the GoF test consis-",
  "CommonsenseQA0.49750.72180.50010.67880.99990.9999": "tently achieves the best result across all datasets.The weaker performance of the baseline algorithmsis likely due to the limited sample size and theintrinsic difficulty in density modeling for high-dimensional data. Notably, this result demonstratesthat GoF testing is more sample-efficient for de-tecting out-of-knowledge queries compared withconventional outlier detection algorithms.Comparison with LM-based Relevance Score.In , we compare the GoF test with LM-based relevance scores. Specifically, we ask theLM to generate a numerical relevance score foreach query q and its retrieved relevant documentsDr using the prompt in . It can be seenthat the LM-based score failed to capture the rel-evance between the query and the knowledge cor-pus, resulting in poor performance in detectingOoK queries. This is potentially because of LMslack of ability to produce accurate numerical scores(Spithourakis and Riedel, 2018; Liu et al., 2023)and its tendency for hallucination when process-ing complex concepts in long texts (Ji et al., 2023).We provide examples of hallucinated responses inAppendix .Synthetic Queries.The results for threshold-independent metrics assumed that the true IK query distribution is known. However, this is not the casein practice and, thus, we relax this assumption bycomparing the TPR and DER results produced withcritical values estimated using true IK queries withresults produced with synthetic queries. We usegpt-3.5-turbo as the LM for generating syntheticqueries and include the prompt and samples of gen-erated synthetic queries in the Appendix. presents the results of using synthetic queries onthe TruthfulQA datasets and depicts thehistograms on both corpora. It can be seen that the synthetic query distribu-tion on the PubMed corpus closely matches the trueIK query distribution, resulting in similar estima-tions of the critical region. Consequently, the differ-ences between TPRs and DERs produced with IKqueries and synthetic queries are negligible. On theTextbooks corpus, however, we find that the syn-thetic query distribution deviates slightly from thetrue IK query distribution, which is likely due to thecomplexity of questions in MedQA. This resultsin a more conservative estimation of the criticalvalues (more towards the right). Nevertheless, theperformance of synthetic queries is still on par withtrue IK queries in terms of distinguishing far OoKqueries. Along the test statistics dimension, all teststatistics are able to effectively distinguish OoKqueries using synthetic queries except for Entropywhich failed on the PubMed corpus and producessuboptimal results on the Textbooks corpus. Weinclude an extended version of and in the Appendix.",
  ": Comparison of six different embedding mod-els": "ComparisonofEmbeddingModels.WecomparesixembeddingmodelsincludingBM25 (Robertson et al., 2009), BGE (Xiaoet al., 2023), Contriever (Izacard et al., 2022),MedCPT (Jin et al., 2023), Nomic (Nussbaumet al., 2024), and Jina (Gnther et al., 2023),in terms of their ability to distinguish IK andOoK queries and their ability to retrieve relevantdocuments. In , we plot the AUROC ofdetecting OoK queries with KNN test statistics onthe Textbooks dataset and the accuracy of the RAGsystem answering multi-choice questions from theIK dataset (MedQA-US), using gpt-3.5-turboas the LM. We have the following observations:(1) Different embedding models show disparateimpact on detecting OoK queries; (2) The embed-ding models performance of OoK query detection k 0.5 0.6 0.7 0.8 0.9 1.0",
  ": AUROC for PubMedQA as a function of k": "does not align with its performance of retrievingrelevant documents.For example, MedCPT, adomain-specific embedding model pre-trainedon biomedical data, shows the best QA accuracyon the MedQA-US dataset but has the lowestAUROC in detecting OoK queries. Additionally, itappears that pre-training on domain-specific datahas a negative impact on the embedding modelsability to distinguish general queries, resulting in alower AUROC on CommonsenseQA compared toPubMedQA, which is also evident from in Appendix. Sensitivity Analysis for k.In , we reporton experiments with the Textbooks corpus across arange of k values to study the impact of the numberof retrieved samples on the performance of detect-ing OoK queries. As k increases from 8 to 64, itcan be seen that the AUROC of Entropy improves",
  "from 0.8511 to 0.9451 and the AUROC of KNNdecreases slightly from 0.9543 to 0.9245, whileresults on other test statistics remain stable acrossdifferent k": "4.3Offline Testing ResultsWe performed an evaluation of the offline testingprocedure on the Textbooks corpus with three OoKdatasets, i.e., MMLU-US, PubMedQA, and Com-monsenseQA, using energy as the test statistic. Todo so, we draw 50 random samples from the IKdataset (MedQA-US) as QI and another 50 ran-dom samples from both the IK dataset and the OoKdataset to construct QP with varying IK sampleratios. At each IK ratio, we repeat the experiments500 times and collect the p-values. We considera confidence level of 0.05, i.e., predict QP to beOoK if the p-value is below 0.05. depictsthe p-value distribution and the rejection rate (i.e.,the number of occurrences predicting QP as OoKover the total number of trials) at different IK ratios.It can be seen that the general trend that p-values ofthe offline test decrease with the IK ratio, which isexpected since it is easier to detect the distributionshift with more OoK samples in QP. Similar toonline testing, near OoK queries are harder to de-tect. For example, QP containing only 30% Com-monsenseQA queries can be rejected at 100% rate,whereas rejecting MMLU-US queries at 100% raterequires at least 60% OoK samples in QP.",
  "Related Work": "Retrieval Augmented Generation.Retrievalaugmented generation (RAG) (Lewis et al., 2020)provides a tangible solution to address hallucina-tions in knowledge-intensive tasks by retrievingverifiable information from external knowledgecorpora (Shuster et al., 2021; Yang et al., 2023;Wang et al., 2023). However, the truthfulness ofRAG responses highly depends on the relevancebetween the query and the corpus (Karpukhin et al.,2020; Tan et al., 2022; Yan et al., 2024) and maysuffer from increased risk of hallucination under distribution shifts (Kang et al., 2024). While recentstudies mostly focus on improving various stagesof the retrieval and generation pipeline (Jiang et al.,2023; Yan et al., 2024; Asai et al., 2023; Yu et al.,2022), in this work, we take a different perspectiveand improve the RAG systems awareness of theirknowledge boundary to indicate what they knowand when are sufficiently certain that they shouldreturn knowledge to an end user (Ren et al., 2023;Kadavath et al., 2022; Yin et al., 2023; Ni et al.,2024). Out-of-distribution Detection.Our work is re-lated to the emerging research field of out-of-distribution (OoD) detection (Yang et al., 2021),which aims to detect test samples that are outsideof the training data distribution. However, the largebody of prior OoD detection research is in the vi-sion domain with a focus on classification problems(Lee et al., 2018; Liu et al., 2020) and only few re-cent work (Zhou et al., 2021; Ren et al., 2022)explore OoD detection for LMs. Our work aims toaddress a different problem of identifying queriesthat are beyond the knowledge boundary of the cor-pus, where existing OoD detection algorithms areinapplicable as most embedding models are trainedon general domain data.",
  "Conclusion": "Identifying out-of-knowledge queries is an impor-tant step in improving the reliability of RAG sys-tems and reducing hallucination and misinforma-tion. This work establishes a statistical frameworkfor quantifying the relevance of query-knowledgerelevance through goodness-of-fit hypothesis test-ing. We introduce two testing procedures withdifferent goals of identifying low-relevance querysamples and detecting query distribution shifts. Wedemonstrate the effectiveness of these approachesthrough extensive experiments on eight datasetsfrom various domains. We hope our findings canprovide insights for future research on reliableretrieval-based generation.",
  "Limintations": "A reliable RAG system should ensure both rele-vance in retrieval and faithfulness in generation.Our work focuses on the relevance between theuser query and the existing knowledge database toabstain/reject queries with high risk (i.e., low rel-evance) and identify significant query distributionshift, which is an important prerequisite for reliablegeneration, but this may not provide the completepicture of the reliability of RAG in general. Inpractice, our method can be deployed jointly withother approaches that aim to improve the reliabilityof LLMs in the generation phase (e.g., SelfCheck-GPT (Manakul et al., 2023)) to ensure end-to-endrobustness. Our method also extends to other ap-plications beyond reliable generation, for instance,improving RAG system efficiency by selecting themost relevant database when multiple data sourcesare available.",
  "Ethics Statement": "The overarching goal of our work is to enhance thereliability of RAG systems, reduce the risk of mis-information, and improve system trustworthiness.These improvements are crucial for the ethical andsafe deployment of AI, as they help to mitigaterisks associated with unreliable outputs and pro-mote user trust. Data sets used in our experimentsare sourced from the open domain and do not poseany ethical concerns. This research was supported in part by NSF awardsDMS-2204795, OAC-2115094, CNS-2331424,ARL/Army Research Office awards W911NF-24-1-0202 and W911NF-24-2-0114, NIH awards5RM1HG009034-08, 5U54HG012510-04, andK99LM014428, and the Intuit University Collabo-ration Program.",
  "Akari Asai, Zeqiu Wu, Yizhong Wang, Avirup Sil, andHannaneh Hajishirzi. 2023. Self-rag: Learning toretrieve, generate, and critique through self-reflection.arXiv preprint arXiv:2310.11511": "Markus M Breunig, Hans-Peter Kriegel, Raymond TNg, and Jrg Sander. 2000. Lof: identifying density-based local outliers. In Proceedings of the 2000 ACMSIGMOD international conference on Managementof data, pages 93104. Tom Brown, Benjamin Mann, Nick Ryder, MelanieSubbiah, Jared D Kaplan, Prafulla Dhariwal, ArvindNeelakantan, Pranav Shyam, Girish Sastry, AmandaAskell, et al. 2020. Language models are few-shotlearners. Advances in neural information processingsystems, 33:18771901. Tugba Akinci DAntonoli, Arnaldo Stanzione, Chris-tian Bluethgen, Federica Vernuccio, Lorenzo Ugga,Michail E Klontzas, Renato Cuocolo, Roberto Can-nella, and Burak Koak. 2024. Large language mod-els in radiology: fundamentals, applications, ethicalconsiderations, risks, and future directions. Diagnos-tic and Interventional Radiology, 30(2):80.",
  "Johanna Hardin and David M Rocke. 2004. Outlierdetection in the multiple cluster setting using theminimum covariance determinant estimator. Compu-tational Statistics & Data Analysis, 44(4):625638": "Matan Haroush, Tzviel Frostig, Ruth Heller, and DanielSoudry. 2022. A statistical framework for efficientout of distribution detection in deep neural networks.In International Conference on Learning Representa-tions. Dan Hendrycks, Collin Burns, Steven Basart, Andy Zou,Mantas Mazeika, Dawn Song, and Jacob Steinhardt.2021. Measuring massive multitask language under-standing. In International Conference on LearningRepresentations. Gautier Izacard, Mathilde Caron, Lucas Hosseini, Sebas-tian Riedel, Piotr Bojanowski, Armand Joulin, andEdouard Grave. 2022. Unsupervised dense informa-tion retrieval with contrastive learning. Transactionson Machine Learning Research. Ziwei Ji, Nayeon Lee, Rita Frieske, Tiezheng Yu, DanSu, Yan Xu, Etsuko Ishii, Ye Jin Bang, AndreaMadotto, and Pascale Fung. 2023. Survey of halluci-nation in natural language generation. ACM Comput-ing Surveys, 55(12):138.",
  "Anastasia Krithara, Anastasios Nentidis, KonstantinosBougiatiotis, and Georgios Paliouras. 2023. Bioasq-qa: A manually curated corpus for biomedical ques-tion answering. Scientific Data, 10(1):170": "Longin Jan Latecki,Aleksandar Lazarevic,andDragoljub Pokrajac. 2007. Outlier detection withkernel density functions. In International Workshopon Machine Learning and Data Mining in PatternRecognition, pages 6175. Springer. Kimin Lee, Kibok Lee, Honglak Lee, and Jinwoo Shin.2018. A simple unified framework for detecting out-of-distribution samples and adversarial attacks. Ad-vances in neural information processing systems, 31. Patrick Lewis, Ethan Perez, Aleksandra Piktus, FabioPetroni, Vladimir Karpukhin, Naman Goyal, Hein-rich Kttler, Mike Lewis, Wen-tau Yih, Tim Rock-tschel, et al. 2020. Retrieval-augmented generationfor knowledge-intensive nlp tasks. Advances in Neu-ral Information Processing Systems, 33:94599474.",
  "Weitang Liu, Xiaoyun Wang, John Owens, and YixuanLi. 2020. Energy-based out-of-distribution detection.Advances in neural information processing systems,33:2146421475": "Yang Liu, Dan Iter, Yichong Xu, Shuohang Wang,Ruochen Xu, and Chenguang Zhu. 2023. G-eval:Nlg evaluation using gpt-4 with better human align-ment. In The 2023 Conference on Empirical Methodsin Natural Language Processing. Potsawee Manakul, Adian Liusie, and Mark Gales. 2023.Selfcheckgpt: Zero-resource black-box hallucinationdetection for generative large language models. InThe 2023 Conference on Empirical Methods in Natu-ral Language Processing.",
  "Zach Nussbaum, John X Morris, Brandon Duderstadt,and Andriy Mulyar. 2024. Nomic embed: Traininga reproducible long context text embedder. arXivpreprint arXiv:2402.01613": "Ankit Pal, Logesh Kumar Umapathi, and Malaikan-nan Sankarasubbu. 2022. Medmcqa: A large-scalemulti-subject multi-choice dataset for medical do-main question answering. In Conference on health,inference, and learning, pages 248260. PMLR. Sridhar Ramaswamy, Rajeev Rastogi, and KyuseokShim. 2000. Efficient algorithms for mining outliersfrom large data sets. In Proceedings of the 2000 ACMSIGMOD international conference on Managementof data, pages 427438. Jie Ren, Peter J Liu, Emily Fertig, Jasper Snoek, RyanPoplin, Mark Depristo, Joshua Dillon, and BalajiLakshminarayanan. 2019. Likelihood ratios for out-of-distribution detection. Advances in neural infor-mation processing systems, 32. Jie Ren, Jiaming Luo, Yao Zhao, Kundan Krishna, Mo-hammad Saleh, Balaji Lakshminarayanan, and Pe-ter J Liu. 2022. Out-of-distribution detection andselective generation for conditional language mod-els. In The Eleventh International Conference onLearning Representations. Ruiyang Ren, Yuhao Wang, Yingqi Qu, Wayne XinZhao, Jing Liu, Hao Tian, Hua Wu, Ji-Rong Wen,and Haifeng Wang. 2023.Investigating the fac-tual knowledge boundary of large language mod-els with retrieval augmentation.arXiv preprintarXiv:2307.11019.",
  "Bernhard Schlkopf, John C Platt, John Shawe-Taylor,Alex J Smola, and Robert C Williamson. 2001. Esti-mating the support of a high-dimensional distribution.Neural computation, 13(7):14431471": "Freda Shi, Xinyun Chen, Kanishka Misra, NathanScales, David Dohan, Ed H Chi, Nathanael Schrli,and Denny Zhou. 2023. Large language models canbe easily distracted by irrelevant context. In Inter-national Conference on Machine Learning, pages3121031227. PMLR. Kurt Shuster, Spencer Poff, Moya Chen, Douwe Kiela,and Jason Weston. 2021. Retrieval augmentationreduces hallucination in conversation. In Findingsof the Association for Computational Linguistics:EMNLP 2021, pages 37843803.",
  "A.1Implementation Details": "Retrievers / Embedding Models.(1) BM25(Robertson et al., 2009) is a bag-of-word basedretriever function. (2) BGE (Xiao et al., 2023) isa general embedding model that maps the inputtext to a low-dimensional dense vector. We usethe bge-base-en-v1.5 version, a model trainedwith cosine similarity and a dimension size of768. (3) Contriever (Izacard et al., 2022) is a con-trastive dense retriever model developed by Face-book. (4) MedCPT (Jin et al., 2023) is a contrastivetransformer-based embedding model trained onPubMed search logs. (5) Nomic (Nussbaum et al.,2024) is a long context-length text encoder. Weadopt the nomic-embed-text-v1-unsupervisedversion, which uses dot product as the similaritymetric and has an embedding size of 768.(6)Jina (Gnther et al., 2023) is a long context-lengthembedding model based on BERT architecture.We use the jina-embeddings-v2-base-en ver-sion that uses dot product as the similarity metricand has an embedding size of 768. We implementthe RAG system using FAISS index (Johnson et al.,2019) with maximum inner product search (MIPS)algorithms. Synthetic Query Generation.Synthetic queriesare created by sampling document chunks fromthe corpus and using them as context to promptGPT-3.5-turbo. The prompt for generating syn-thetic queries and examples of generated queriesare included in and , respectively. Outlier Detection-based Baselines.We applyoutlier detection-based algorithms to model thedensity of the queries embedding distribution andthen flag those with their embeddings falling intothe tail of this distribution as OoK queries. To en-sure a fair comparison with the training-free meth-ods, we train the outlier detection models using300 synthetic IK queries and report the AUROCand AUPRC on a balanced testing set with 300 IKqueries and 300 OoK queries. We use the PyODpackage (Zhao et al., 2019) with default parametersfor implementing these outlier detection baselines. LM-basedRelevanceScore.WeuseGPT-3.5-turboandGPT-4-turbo-previewmodels accessed through Microsoft Azure as LMrelevance evaluators. The LM evaluator is asked toreason in a step-by-step manner and provide textfeedback along with a numerical score between0 and 1 with a higher score indicating betterrelevance. Long document chunks are truncated tofit the context length. The prompt for generatingrelevance score is included in , whichis modified from the default prompt templateused by the ContextRelevancyEvaluator2 in theLlama-index framework. To analyze the outputof the LM-based relevance score, we additionallyask LM to provide a summary of feedback on theresults.",
  "A.2Discussions": "Risk of OoK Queries.As OoK queries are be-yond the context of the corpus, answering thesequeries with retrieved documents is likely to in-crease the risk of generating hallucinated responses.For instance, using the chain-of-thought promptingstrategy, GPT-3.5 answers PubMedQA and Com-monsenseQA questions with an accuracy of 48.6%and 59.3%, respectively. In contrast, retrievingfrom the Textbooks corpus reduces the accuracyto 22.9% and 29.0%. To improve the generationreliability, there are several potential strategies todeal with an OoK query once it has been detected,including: (1) Rejection: refusing to respond tothe query; (2) Direct Generation: skipping the re-trieval process and invoking the LM to directlyanswer the query; (3) Broader Search: searchingwith a broader knowledge base, such as the Internet,to answer the query; and (4) Human Intervention:triggering an alert to request for assistance fromhuman experts. The appropriate strategy should bedecided based on the specific application scenario. Synthetic Query Quality.Currently, we gener-ate synthetic queries by asking an LM to producequestions based on individual document chunks.However, such method might produce overly sim-ple questions that only directly relate to a singledocument chunk. Consequently, the distributionof the synthetic queries could deviate from that ofthe real IK queries, which tend to be more com-plex in nature, involving knowledge across multiplechunks of the corpus. This complexity is evident",
  "TruthfulQA0.99990.99980.9998": "in the queries found in the Textbooks corpus andthe MedQA-US dataset, as illustrated in .To generate more challenging queries that require ageneral understanding of the subject in the corpus,one straightforward way is to provide the LM withthe entire corpus and ask it to generate syntheticqueries accordingly. However, this contradicts themotivation of deploying RAG and is generally notfeasible due to the limited context window of LMs.Instead, one can employ context-aware chunkingstrategies, such as hierarchical or semantic chunk-ing, to generate more complex synthetic queriesthat involve knowledge from multiple fixed-sizechunks. We leave this for future exploration.",
  "A.3Additional Results": "Impact of Different Sample Sizes.Our mainexperiments are conducted by drawing 300 I.I.D.samples from the In-Knowledge query distribution.To study the impact of different sample sizes andfurther validate the sampling process, we includeadditional experiments with 100 and 500 samplesusing energy score as the test statistic and summa-rize the results in (averaged over 5 inde-pendent runs). We observe that the performance isconsistent across different sample sizes. In particu-lar, the proposed method can achieve high AUROCand AUPRC using only 100 samples for the esti-mation of the query distribution. Results on Entire Datasets.Most of our previ-ous experiments are conducted on a sampled subsetas the considered list of datasets has varying sizes(e.g., PubMedQA has 500 questions whereas Com-monsenseQA has 12247 questions). Here we con-duct additional experiments on the entire dataset of",
  "Synthetic Queries": "IK Queries OoK Queries Critical Value (IK): -109.21 Critical Value (Synthetic): -110.02 t 0.00 0.01 0.02 0.03 0.04 MMLU-US t 0.00 0.01 0.02 0.03 0.04 MedMCQA t 0.00 0.02 0.04 0.06 0.08 TruthfulQA t 0.00 0.02 0.04 WikiQA t 0.00 0.02 0.04 0.06 CommonsenseQA t 0.000 0.005 0.010 0.015 0.020",
  "{\"feedback\": [FEEDBACK],\"score\": [SCORE],}": "[FEEDBACK] should be a string with the detailed feedback with step-by-step explanations on the response.[SCORE] should be a float number between 0 and 1, representing the relevancescore assigned to the query.0 represents no relevance (the query is from a different subject of matter) and 1represents perfect relevance (query is highly related to the context).Partial scores are allowed and encouraged.",
  "GPT-3.5 Example 1": "Query: When you play games with children youre doing what to them?Document: Intervention is needed for caregivers who disclose IPV. It is appropriate to showconcern and to provide available community resources. It is important to assess for the safety ofthe victim and the children. In some states, physicians are mandated to report IPV. Informationfor families that provides details about community resources and state laws is helpful. Youthviolence is a leading cause of pediatric mortality in the United States. Homicide is the secondleading cause of death for all children 1 to 19 years of age. Each year nearly 6000 children,primarily adolescents, are victims of homicide, and 4000 How are things at home and at school?Who lives with you? How do you get along with your family members? What do you like todo with them? What do you do if something is bothering you? Do you feel safe at home? Dopeople fight at home? What do they fight about? How do they fight? Do your friends get intofights often? How about you? When was your last physical fight? Have you ever been injuredduring a fight? Has anyone you know been injured or killed? Have you ever been forced tohave sex against your will? Have you ever been threatened with a gun or a knife? How do youavoid getting in fights? Do you carry a weapon for self-defense? FOR THE PARENT Do youhave any concerns about your child? Who helps with your children? How do you feel aboutyour neighborhood? Do you feel safe at home? Is there any fighting or violence at home? Doesanyone at home use drugs? ...Output: {score: 1, feedback: \"The query is highly relevant to the context. The contextdiscusses the importance of playing developmentally appropriate games with children for theircognitive development and school performance. The query specifically asks what playing gameswith children does to them, which aligns with the context. Therefore, the query is relevant to theretrieved context.\"}",
  "GPT-3.5 Example 2": "Query: What could a solicitor do to warn of upcoming litigation?Document: .3 PREPARED Checklist Process for Informed Communication Safety in theOffice Setting an ethical right, it is a therapeutic necessity, according to Leape. Several programsare under way to test the assertion that disclosure and apology can decrease the likelihood oflitigation. COPIC, a Colorado medical insurance company, found that full disclosure resultsin small early settlements and dramatically reduced law suits and payouts (59). or lead sucha discussion in the absence of those skills. Disclosure and apology cause apprehension forphysiciansparticularly in the discipline of obstetrics and gynecology where litigation adverselyaffected practice patterns (defensive medicine) and heightened a reluctance to disclose medicalerrors for fear of litigation (7). It is interesting to note that open disclosure overall generatedless litigation than failing to disclose, and the growth of compensation with disclosure seemsto add to this decrease (8 12). Apology raises particular anxiety about implying culpabilityand inciting litigation, so help with framing an apology is always appropriate. The obligationof trust (fiduciary relationship) that we have with our patients is part of the healing aspects ofmedicineand we owe it to our patients and to ourselves to develop the robust curricula andsupport at all levels of medicine to make disclosure the step toward solution and healing that itcan be for both physician a lack of empathy and understanding for the patient, whereas concernor anxiety in the surgeons voice is often positively related to expressing concern and empathy.General and orthopedic surgeons whose tone of voice was judged to be more dominant weremore likely to have been sued than those who sounded less dominant. . . .Output: {score: 1, feedback: \"The query is highly relevant to the context. The contextdiscusses the importance of disclosure and apology in reducing the likelihood of litigation. Itmentions that full disclosure results in small early settlements and reduced lawsuits and payouts.It also highlights the fear of litigation as a barrier to error disclosure. Therefore, a solicitor couldplay a crucial role in warning of upcoming litigation by advising healthcare professionals onthe importance of disclosure and apology, and providing guidance on how to handle errors andcommunicate with patients.\"}",
  "GPT-4 Example 1": "Query: What can you use hear other people and be heard yourself?Document: In many situations, including lectures and the theater, hearing-impaired personsbenefit from assistive devices that are based on the principle of having the speaker closer to the mi-crophone than any source of noise. Assistive devices include infrared and frequency-modulated(FM) transmission as well as an electromagnetic loop around the room for transmission to theindividuals hearing aid. Hearing aids with telecoils can also be used with properly equippedtelephones in the same way. Adapted and updated from Weiss CE, Lillywhite HE: Communi-cation Disorders: a handbook for prevention and early detection, St Louis, 1976, Mosby. theresults of testing or initiation of speech-language therapy, parents should be advised to speakslowly and clearly to the child (and avoid baby talk). Parents and older siblings should readfrequently to the speech-delayed child. Speech disorders include articulation, fluency, andresonance disorders. Articulation disorders include difficulties producing sounds in syllablesor saying words incorrectly tothe point that other people cannot understand what is beingsaid.Fluency disorders include problems such as stuttering,the condition in which the flow of speechis interrupted byabnormal stoppages, repetitions (st-st-stuttering), or prolonging sounds andsyllables (ssssstuttering). Resonance or voice disorders include problems with the pitch, volume,or quality of achilds voice that distract listeners from what is being said. Empathize with thepatient and/or familys feelings. Explore by asking open-ended questions. Delineate for thepatient and the family the next steps, including additional tests or interventions. . . .Output: {score: 1.0, feedback: \"The context provided discusses various assistive devices andmethods for helping individuals with hearing impairments. It mentions devices such as infraredand FM transmission systems, electromagnetic loops, and hearing aids with telecoils that canbe used in conjunction with telephones. Additionally, it touches on cochlear implants and theirbenefits for speech recognition and voice modulation. The query asks about what can be used tohear others and be heard, which is directly relevant to the assistive devices and methods describedin the context for hearing-impaired individuals. Therefore, the context is highly relevant to thequery.\"}",
  "GPT-4 Example 2": "Query: When a person is living on the streets they likely what?Document: and motor activity are characteristic of the disease. Ultimately, a deteriorated anddilapidated state occurs, which in the extreme results in an unkempt and malnourished statewith which the public unfortunately associates schizophrenia. Individuals of this type roamthe streets and live in appalling conditions on the fringes of society where they are subjectto the criminal behavior of others. V60.0(259.0) Homelessness This category should be usedwhen lack of a regular dwelling or living quarters has an impact on an individuals treatment orprognosis. An individual is considered to be homeless if his or her primary nighttime residenceis a homeless shelter, a warming shelter, a domestic violence shelter, a public space (e.g., tunnel,transportation station, mall), a building not intended for residential use (e.g., abandoned structure,unused factory), a cardboard box or cave, or some other ad hoc housing situation. V60.1 (259.1)Inadequate Housing Intervention is needed for caregivers who disclose IPV. It is appropriateto show concern and to provide available community resources. It is important to assess forthe safety of the victim and the children. In some states, physicians are mandated to reportIPV. Information for families that provides details about community resources and state laws ishelpful. Youth violence is a leading cause of pediatric mortality in the United States. Homicideis the second leading cause of death for all children 1 to 19 years of age. Each year nearly 6000children, primarily adolescents, are victims of homicide, and 4000 How are things at home andat school? Who lives with you? How do you get along with your family members? . . .Output: {score: 1.0, feedback: \"The context provided discusses the conditions associatedwith homelessness, including the lack of a regular dwelling, living in shelters, public spaces, orinadequate housing. It also touches on the impact of homelessness on treatment or prognosisof individuals, and the risks they face, such as being subject to criminal behavior. The queryasks about the likely conditions of a person living on the streets, which is directly relevant tothe context describing the state of homelessness and the associated risks and living conditions.Therefore, the query is highly relevant to the provided context.\"}",
  "Textbooks": "{ \"question\": \"A 45-year-old woman with metastatic breast cancer presentswith acute-onset dyspnea and chest pain. She has been receiving paclitaxelchemotherapy for the past 3 months. Chest X-ray reveals pleural effusion.Which of the following mechanisms best explains the mode of action of pacli-taxel?\", \"options\": { \"A\": \"Inhibition of proteasome\", \"B\": \"Hyperstabilizationof microtubules\", \"C\": \"Generation of free radicals\", \"D\": \"Cross-linking ofDNA\" }, \"answer\": \"B\", }{ \"question\": \"A 25-year-old woman presents to her gynecologist for birthcontrol counseling. She has no significant past medical history. She expressesinterest in using an intrauterine device (IUD) as her preferred method. Hervital signs are: blood pressure 120/80 mm Hg, pulse 70/min, and respiratoryrate 16/min. She is afebrile. Physical examination is unremarkable. Whichof the following conditions would be a contraindication to the placement ofa levonorgestrel-releasing IUD in this patient?\", \"options\": { \"A\": \"A historyof severe migraines with aura\", \"B\": \"Known uterine fibroids\", \"C\": \"Historyof endometrial cancer\", \"D\": \"Active or recent history of sexually transmittedinfection (STI)\" }, \"answer\": \"C\", }",
  "PubMed": "{ \"question\": \"Is the use of magnetic resonance imaging (MRI) superior tocomputed tomography (CT) in diagnosing soft tissue injuries?\", \"options\": {\"A\": \"yes\", \"B\": \"no\", \"C\": \"maybe\", }, \"answer\": \"B\", }{ \"question\": \"Does the administration of statins correlate with a reduced riskof cardiovascular events in diabetic patients?\", \"options\": { \"A\": \"yes\", \"B\":\"no\", \"C\": \"maybe\", }, \"answer\": \"A\", }{ \"question\": \"Can telemedicine effectively replace in-person consultations forroutine follow-up appointments in managing chronic diseases?\", \"options\": {\"A\": \"yes\", \"B\": \"no\", \"C\": \"maybe\", }, \"answer\": \"C\", }",
  "Synthetic Queries generated from Textbooks Corpus": "(1) A study conducted on hospital resident physicians revealed that working formore than 24 consecutive hours increases the risk of which of the following?(2) During which phase of the menstrual cycle does the corpus luteum producehigh levels of progesterone, estradiol, and inhibin?(3) A 30-year-old female presents with severe headache, visual disturbances,and signs of intracranial or orbital extension. Computed tomography scanningconfirms the diagnosis of a brain abscess. Which of the following is the mostappropriate management approach for this patient?(4) A patient presents with septic shock and hypoperfusion. Which of thefollowing cytokines is one of the earliest to be released in response to injuriousstimuli?(5) A 35-year-old man with a history of multiple sclerosis presents with newneurological symptoms. A CT scan of the brain reveals contrast-enhancedring lesions that simulate abscess or tumor. Which of the following imagingmodalities is preferred for better sensitivity in detecting cerebral lesions inpatients with multiple sclerosis?",
  "Synthetic Queries generated from PubMed Corpus": "(1) Is eugenol known for its anti-inflammatory properties?(2) Do DAT cells in the rat junctional epithelium possess stress fibers composedof actin filaments?(3) Is splenohepatoplasty a viable method for hepatic revascularization in rats?(4) Is there an independent relationship between systemic inflammation andfragmented QRS complexes in patients with stable angina pectoris?(5) What type of conformation do the furanose rings exhibit in the crystalstructure of the compound described?"
}