{
  "ABSTRACT": "Drug repurposing identifies new therapeutic uses for existing drugs,reducing the time and costs compared to traditional de novo drugdiscovery. Most existing drug repurposing studies using real-worldpatient data often treat the entire population as homogeneous, ig-noring the heterogeneity of treatment responses across patientsubgroups. This approach may overlook promising drugs that ben-efit specific subgroups but lack notable treatment effects acrossthe entire population, potentially limiting the number of repurpos-able candidates identified. To address this, we introduce STEDR, anovel drug repurposing framework that integrates subgroup analy-sis with treatment effect estimation. Our approach first identifiesrepurposing candidates by emulating multiple clinical trials on real-world patient data and then characterizes patient subgroups bylearning subgroup-specific treatment effects. We deploy STEDR toAlzheimers Disease (AD), a condition with few approved drugs andknown heterogeneity in treatment responses. We emulate trials forover one thousand medications on a large-scale real-world databasecovering over 8 million patients, identifying 14 drug candidates withbeneficial effects to AD in characterized subgroups. Experimentsdemonstrate STEDRs superior capability in identifying repurpos-ing candidates compared to existing approaches. Additionally, ourmethod can characterize clinically relevant patient subgroups asso-ciated with important AD-related risk factors, paving the way forprecision drug repurposing.",
  "Corresponding Author": "Permission to make digital or hard copies of part or all of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for third-party components of this work must be honored.For all other uses, contact the owner/author(s).KDD 25, August 37, 2025, Toronto, ON, Canada. 2025 Copyright held by the owner/author(s).ACM ISBN 979-8-4007-1245-6/25/08. : Flowchart of a deep subgrouping framework forprecision drug repurposing via emulating clinical trials onreal-world data. First, eligible drugs and cohorts are ex-tracted from an EHR database. Second, STEDR estimates thesubgroup-specific treatment effects of each drug. Third, re-purposable drugs with beneficial effects in patient subgroupswill be identified.",
  "INTRODUCTION": "Drug repurposing, the process of identifying new therapeutic usesfor existing drugs, has emerged as a promising strategy to accel-erate drug development and reduce costs compared to traditionalde novo drug discovery methods . Recent advancements incomputational methods have significantly enhanced drug repur-posing efforts. These methods utilize various data types, includingstructural features of compounds or proteins , genome-wideassociation studies (GWAS) , and gene expression data .However, a significant challenge persists in translating pre-clinicaloutcomes to actual clinical therapeutic effects in humans .Real-world data (RWD), such as medical claims and electronichealth records (EHRs), contains valuable information about patienthealth outcomes, treatment patterns, and patient characteristics.This makes RWD a vital resource for comparing the treatmenteffects of drugs and identifying those with beneficial effects as re-purposing drug candidates . Despite this, existing studies often treat the entire population as homogeneous, over-looking the heterogeneity of treatment responses across patientsubgroups. This approach may miss promising drugs that benefit",
  "KDD 25, August 37, 2025, Toronto, ON, Canada.Lee, et al": ": Drug selection and screening criteria. From 1,134drugs in the dataset, STEDR filters out 19 trial drugs thatmet our study design and balancing criteria. Among them,STEDR identifies 14 drug candidates that are significant insubgroups. patient inclusion criteria. Patients are excluded if they had a historyof AD/ADRD before the index date or had an age < 50 at the timeof the MCI diagnosis. To prevent overlap between the case andcontrol cohorts, patients in the control cohort are excluded if theyhave been prescribed the trial drug. All patients are followed upto 2 years, until they are diagnosed with AD, or loss to follow-up,whichever occurs first.Covariates and Outcomes. The baseline period is leveraged toconstruct the pre-treatment covariates, while the follow-up pe-riod is used to evaluate the drug effect: patients diagnosed withAD/ADRD during this period are labeled as positive ( = 1), oth-erwise negative ( = 0). A negative value of the TE indicates anenhanced effect of the drug, potentially effective in reducing theincidence of AD/ADRD. Target Trial Emulations. We emulate high-throughput trials toevaluate the effect of each trial drug, with various control cohorts:(1) prescribed a random alternative drug, and (2) prescribed a similardrug classified under the same ATC-L2 (second-level AnatomicalTherapeutic Chemical classification codes) as the trial drug .We emulate 100 trials for each drug, of which 50 trials are randomcontrols and the others are ATC-L2 controls. The number of patientsin the control cohort is set to a maximum of 3 times the case cohort. Drug Selection Criteria. We conduct large-scale drug screening ofrepurposing drugs for AD using RWD via a high-throughput clinicaltrial emulation. Given the initial set of all drugs under consideration,STEDR filters out eligible drugs, as described in . Balanced : Comparison of drug repurposing approaches basedon model type, measure (ATE: average treatment effect; HR:hazard ratio; HTE: heterogeneous treatment effect), and con-sideration of time-varying covariate information (Time) andsubgrouping (Group).",
  "RELATED WORK": "Drug repurposing on EHRs. EHRs have emerged as a promisingresource for drug repurposing as being direct observations frompatients, . Several works leverage EHRs for drug repurposing.These methods rely on the treatment effects estimated from theentire population to identify repurposable drug candidates. Specif-ically, Zang et al. propose a framework that leverages high-throughput emulations for AD drug repurposing. The frameworkreweights individuals using the stabilized IPTW derived from aregularized logistic regression-based PS model, and it estimates thetreatment effects by adjusted 2-year survival difference and HR.Similarly, studies employ PS models for IPTW but estimatethe treatment effects by directly comparing the outcomes of treatedand control groups. Yan et al. leverage ChatGPT to recommenddrugs by expediting the literature review process and evaluatingthe potential effects of using HR with PS-Matching. Treatment Effect Estimation. Many studies have leveraged thepower of neural networks for estimating treatment effects . To apply neural networks for causal inference, several pre-vious works employ a strategy where covariates from differenttreatment groups are assigned to separate branches. For example,DrangonNet consists of a shared feature network and threeauxiliary networks that predict propensity score, and treated andcontrol outcomes, respectively. DR-CRF learns disentangledrepresentations of the covariates to separately predict the potentialoutcomes and the propensity score. TransTEE leverages theTransformer to model the interaction between the input covariateand treatment.",
  "PRELIMINARY": "Longitudinal Patient Data. A patient health record is representedas a sequence of multiple visits in the order of their occurrence,denoted as x = {x1, , x }. Each visit is characterized by a seriesof varying numbers of diagnosis codes, 1, , , where is the number of unique diagnosis codes. The -th visit of the-th patient is expressed as a binary vector x, {0, 1}, wherea value of 1 for the -th coordinate (i.e. ,, = 1) indicates thatthe -th diagnosis code is recorded at that patients visit. The datais presented as (x,,)=1, where x is pre-treatment covari-ates, is the number of observed samples. {0, 1} indicates atreatment variable when binary treatment setting, and R is theobserved outcome.Treatment Effect Estimation and Subgrouping Given a dataset (x,,)=1, a unit x has two potential outcomes, 1(x) givenit is treated and 0(x) otherwise, following the potential outcomeframework . The individual treatment effect (ITE) is expressedas () = E( = 1, E( = 0,. Given an hypothesis , such that (x,) = ((x)), we aim to estimate thetreatment effect of the hypothesis for unit x as (x) = (x, 1)",
  "A Deep Subgrouping Framework for Precision Drug Repurposingvia Emulating Clinical Trials on Real-world Patient DataKDD 25, August 37, 2025, Toronto, ON, Canada": "visualizes the local features of patient subgroups ex-tracted by STEDR for Trazodone, categorized by their treatment as-signments and outcomes, using t-SNE algorithm . We randomlysampled 30 examples for each category to show the treatment andoutcome distributions by subgroup and compare them. Notably, thesubgroups are distinctly separated, indicating the model capturessubgroup-specific differences. Subgroup 1 includes more treatedpatients with non-adverse outcomes (T=1, Y=0) and control patientswith adverse outcomes (T=0, Y=1), indicating a positive response tothe treatment. In contrast, Subgroup 3 shows a higher proportionof treated patients with adverse outcomes, suggesting a diminishedeffect of Trazodone for this group.",
  "METHOD": "TEE allows for a quantification of the potential benefits or risksof the drug, which enables the accurate assessment of the exist-ing drugs effects in new therapeutic uses. We leverage TEE as afoundational component of our framework for drug repurposing.Our method, STEDR, innovatively combines TEE with subgroupidentification to estimate subgroup-specific treatment effects fortargeted drug repurposing. shows an illustration of STEDR.",
  "Patient-level Representation": "Covariate-level Attention. We investigate the impact of each co-variate by covariate-level attention. We assume that each subgrouphas distinct characteristics, so the attentions affect both subgroupassignment and the potential outcome.To preserve differences between covariates from being lost, themethod learns a different embedding for each covariate. Each co-variate is expressed as a sequence of its occurrences across all visits.This sequence is denoted as , = {,1,, ,,,} for the -th code of the -th patient. This vector not only reflects how often thecode appears but also preserves the order of its occurrences. Theembedding for each covariate is denoted as , = emb (,),where , R.Patient data poses unique challenges due to irregular temporal-ity, meaning variation in time intervals between visits. Since theseintervals often play a crucial role in the outcome, we also incor-porate temporal information in covariate embeddings. The timeinformation is measured as the relative time to the time of interestfor each visit and is expressed as = 1, , . The embedding fortime information is expressed as = emb(), where R. Thefinal covariate embedding for the -th code is then obtained asfollows: = + (1)",
  "exp()(2)": "Visit-level Attention. Each patients data is represented as a seriesof all visits. We also examine the importance of each visit. Theembedding for each visit is obtained as , = emb(x,). Note thatvisit embeddings for all visits are derived from a single embeddinglayer. We also introduce a learnable vector and calculate attentionscores R1 as follows:",
  "Subgroup Representation Learning": "Subgroup representation learning aims to identify potential sub-groups by capturing the heterogeneous data distributions and learn-ing subgroup-specific representations. We rely on the followingassumptions. First, we assume that heterogeneous subgroups ex-ist within the data, where each subgroup follows a distinct localdistribution that captures the specific attributes of that subgroup.The entire population follows a single global distribution reflect-ing the characteristics of the entire population. Second, the globaldistribution can be estimated as a mixture Gaussian of the localdistributions.The entire population follows the global distribution, with -dimensional global parameter vectors {,}.",
  "(z) (z, )(7)": "We infer (z) using (x;), which is the -th local encoder.Note that the global parameters and the local parameters are dis-tinctly extracted from different one-layer encoders.Given a sample x, the global distribution can be estimated as amixture Gaussian distribution of the local distributions with proba-bilities of the sample assigned to the subgroups:",
  "exp (sim ((x;), (x;))(10)": "where sim() indicates the similarity score, which is calculatedusing the Euclidean distance.The local distributions are learned by KL Divergence betweenthe mixture Gaussian distribution and the global distribution. Itensures that the local representations are finely tuned to reflectthe unique attributes of each subgroup, and the global distributionreflects the diverse characteristics of all subgroups.",
  "Treatment Effect Estimation for DrugRepurposing": "Outcome Prediction. Given the representation of the assignedsubgroup, the prediction network estimates both treated and con-trol outcomes. To preserve treatment information within the high-dimensional latent representation, the network assigns featuresfrom distinct treatment groups to separate branches. Furthermore,we design additional modules to predict treatment assignment tobalance the distributions of treated and control groups and to pre-dict the subgroup assignment to ensure that the latent representa-tions effectively distinguish the unique characteristics of subgroups.The prediction network (; ) is composed of four separatefeedforward networks: { (,;) R R} for predicting po-tential outcomes (two heads for {0, 1}); (;) R Rfor the treatment assignment ; (;) R R for subgroupassignment . The prediction network is optimized as follows:",
  "where CE() is the cross-entropy loss and () represents the meansquared error for continuous outcomes or the cross-entropy lossfor binary outcomes. The term refers to individual weights": "Propensity Score Weighting. The weights aim to reweight thepopulation for confounder adjustment, ensuring that the treatedand control groups are comparable and mitigating the influence ofconfounding variables. They are computed using inverse probabilityof treatment weighting (IPTW), with the predicted probability ofreceiving treatment and the probability of being in the treatedgroup (), expressed as = () + (1 ())(1 ). Loss Function and Optimization. To identify subgroups withdifferent treatment effects, we introduce an additional loss functionaimed at reducing the overlap between confidence intervals (CIs)of estimated treatment effects across subgroups, which forces thedistinct separation of subgroups. The overlap for two intervals is de-fined as (CI, CI) = max(0, min(up, up) max(low, low)),where CI, up, and low represent the CI, upper bound, and lowerbound of subgroup , respectively.The total overlap penalty given a batch is computed by summingthese overlaps for every pair of subgroups, with a strength factor, which is expressed as:",
  "= + + (17)": "Drug Repurposing with Patient Subgroups. Given an eligiblepatient cohort for each drug, our framework first estimates thesubgroup-specific treatment effects. We then calculate the 95% con-fidence intervals (CIs) and evaluate the statistical significance ofthe averages of estimated treatment effects for each subgroup over100 trials. The framework identifies repurposable drugs that haveenhanced effects with < 0.05 across all or specific subgroups. : Study design. The baseline and follow-up periodsencompass all dates before and after the index date, respec-tively. Patients in the study cohort: (1) were diagnosed withMCI before the index date; (2) had no history of AD or ADRDbefore the index date; (3) had at least one year of medicalrecords before the index date.",
  "DEPLOYMENT OF DRUG REPURPOSINGFOR ALZHEIMERS DISEASE": "This study conducts large-scale drug screening of repurposing drugsfor Alzheimers disease (AD) treatment via high-throughput clinicaltrial emulation on RWD containing over 8 million patients. AD is ahighly heterogeneous neurodegenerative disorder, and drug effectsmay vary based on genetic risk factors and subtypes . In thisstudy, we evaluate the subgroup-based heterogeneous effects of trialdrugs on the progression of patients with mild cognitive impairment(MCI) to AD and AD-related dementias (ADRD) . Froma total of 1,134 drugs, STEDR emulates 100 trials of each eligibledrug to identify new repurposable drug candidates for AD. Thefollowing sections detail our data and study design.",
  "Data": "We used a large-scale real-world longitudinal patient-level health-care warehouse, MarketScan3 Medicare Supplemental and Coordi-nation of Benefits Database (MDCR) from 2012 to 2018, which is aclaims database that represents health records for over 8 million re-tirees (aged 65 or older) in the USA. The MarketScan data containsindividual-level and de-identified healthcare claims information,including diagnoses, procedures, prescriptions, and demographiccharacteristics. We identify 155K distinct MCI patients, amongwhom 40K are diagnosed with AD. MCI and AD patients are iden-tified using the diagnosis codes. The diagnosis codes are definedby the International Classification of Diseases (ICD) 9/10 codes.We map the ICD codes to Clinical Classifications Software (CCS),including a total of 286 codes. For drugs, we match national drugcodes (NDCs) to ingredient levels. We use diagnosis codes and theirtime information to construct input variables for our method.",
  "STEDR (ours)TransformerHTE": "trial drugs are evaluated by standardized mean differences (SMD) and the weighted propensity area under the curve (AUC) usingIPTW . STEDR identifies repurposable drug candidates withenhanced ATE in the population or HTE in specific subgroups,with -values 0.05 measured as the difference from zero. We usean adjusted -value .In our framework, we assume three potential subgroups: en-hanced, neutral, and diminished groups. Additional information,including data, definitions of MCI and AD/ADRD, metrics, andimplementation details are provided in Section A.3 of the Supple-mental material.6RESULTS We demonstrate the performance of our model, focusing on an-swering the following research questions: Q1: How accurate is STEDR on TEE? Q2: How effective is STEDR on drug repurposing? Q3: How does STEDR enhance precision drug repurposing?",
  "Q1: How accurate is the method on TEE?": "TEE is an effective approach in drug repurposing, as it quantifiesthe magnitude of the drug effect. The accuracy and reliability ofTEE models, therefore, are directly linked to the success of drugrepurposing efforts. We conduct a quantitative analysis of TEEusing synthetic and semi-synthetic datasets, comparing the pro-posed method against state-of-the-art neural network-based TEEmodels . Additionally, we compare with tworepresentative subgrouping models to further evaluate theeffectiveness of the proposed method in subgroup identification.Our method outperforms the baselines on both subgrouping andTEE tasks across all datasets, especially representing a significantreduction in error on TEE performance. Specifically, it achieves35.3%, 5.6%, and 35.1% lower error than the second-best model, asmeasured by the precision in the estimation of heterogeneous effect(PEHE). The datasets, baselines, evaluation metrics, experimentalsetting, and results are detailed in Section A.2 of the Supplementalmaterial.",
  "STEDR (ours)Acetaminophen, Amoxicillin, Bupropion, Citalopram,Fluticasone, Gabapentin, Lisinopril, Losartan, Metformin,Nystatin, Pantoprazole, Pravastatin, Rosuvastatin, Trazodone14": ": Visualization of 95% confidence intervals of estimated treatment effects across different patient subgroups from 100trials. C1 to C3 represents Subgroups 1 to 3. We show the results of four drugs, which represent four categories of identifiedrepurposing candidates: (a) significant in all three subgroups, (b) significant in two of three subgroups, (c) significant in one ofthree subgroups, and (d) not significant in any subgroups. Results of the full list of 14 drugs are presented in and of the Supplemental material. (). To identify significant repurposable drug candidates,we first estimated the ATE of these drugs. Among the 19 drugs,6 drugs showed enhanced effects in the entire population, listedin of the Supplemental material without highlights. Addi-tionally, we identified 8 more subgroup-targeted drug candidateswith enhanced HTE in specific subgroups, with -values 0.05(highlighted in the table), suggesting these drugs are beneficial tocertain subpopulations.We compare our method with representative drug repurposingapproaches based on model type, measure, and consideration oftime-to-event information (Time) and subgrouping (Group) in . The ATE-based approaches by directly estimate the ATEto provide an overall effect of the drug after confounding adjust-ment via the propensity score (PS)-based IPTW (PS-IPTW) usinglong short-term memory (LSTM) that incorporates time-varyingcovariates and logistic regression (LR) networks. The methods by estimate hazard ratio (HR) after confounding adjustment viaPS-IPTW using LR. These approaches, while useful and straight-forward, have limitations. They focus on identifying repurposabledrugs with beneficial effects across the entire population, poten-tially overlooking variations in treatment responses without sub-grouping. This may result in ignoring the risks of the drug for somesubpopulations or missing drugs that may be highly effective forspecific subgroups, ultimately leading to missed opportunities foreffective treatment strategies. Our method, STEDR, employs Trans-former for TEE and heterogeneous treatment effect (HTE) analysisfor subgrouping. We compare the PS-IPTW methods on the numberof identified candidates in . Our method, STEDR, identified14 candidates, with 8 additional drugs that have enhanced effects in specific subpopulations, whereas the PS-IPTW (LSTM) and PS-IPTW (LR) methods identified 4 and 3 drug candidates, respectively.Our approach addresses limitations in existing approaches by in-corporating subgroup-specific treatment effects into clinical decision-making, rather than focusing on the entire population. STEDR identi-fies additional potential drugs that are not discovered from existingmethods, by accounting for variability of drug effects in the popula-tion. This enables us to expand opportunities for drug repurposingby finding potential drugs that meet the specific needs of eachsubgroup.",
  "Solifenacin: This drug showed diminished effects across both theentire population and all subgroups, suggesting limited utilityfor repurposing in the context of AD": "These observations underscore the complexity and variability intreatment responses in the population, which is consistent with thecomplex nature of AD. STEDR effectively addresses this variabilityby capturing a wide range of responses across potential patientsubgroups. The subgroup-targeted treatment strategy advancesprecision drug repurposing, ensuring that treatment strategies arenot just broadly applicable, but finely tuned to the unique char-acteristics and needs of subgroups, thereby reducing the risk ofadverse effects. STEDR is particularly vital in managing diseaseslike AD/ADRD, where responses can vary greatly among patients.Note that the results for all trial drugs are presented in and of the Supplemental material. Comparison of Model Conclusion with Supporting Evidence.We compare the conclusions from our method with the literature tovalidate our findings and potential candidates for drug repurposing.Several observational studies and meta-analyses often reported astrong protective effect of statins . Specifically, Ro-suvastatin has shown potential in reducing the risk of progression todementia in observational studies . However, some randomizedcontrolled trials (RCTs) have reported an absence of positive effectsof statins . The discrepancies between observational studiesand RCTs may arise from factors such as patient heterogeneity andvariations in health conditions. RCTs generally have strict criteria : Projection scatter plot of the local features for pa-tient subgroups extracted by STEDR for Trazodone, catego-rized by their treatment assignments and outcomes. = 1indicates a treated patient, and = 1 represents an adverseoutcome. and controlled conditions. STEDR addresses these discrepancies us-ing large-scale EHRs, capturing a broader range of responses tostatins across diverse populations by considering patient subgroup-specific treatment effects. Notably, our findings show that whileRosuvastatin can be beneficial across all subgroups, Pravastatinappears to be subgroup-specific, suggesting that its effects are notuniversally applicable. Gabapentin , Bupropion , Citalo-pram , and Trazodone have been shown to have possiblebenefit or be repurposable in AD patients. However, our methodhighlights that these drugs may pose risks to certain subgroups,suggesting that they are not beneficial across the entire population. Interpretation of the Enhanced Subgroup. We analyze the keycharacteristics of the subgroup with the most enhanced effects,whose patients may potentially benefit from the trial drug, to furtherdemonstrate the interpretability of our framework. To exemplifythis, we select one case drug candidate, Trazodone. We analyze theattention scores derived from both covariate-level and visit-levelattention, to investigate the impacts of various covariates on sub-group assignment. The attention scores are averaged within eachsubgroup and then normalized across all subgroups. These relativeattention scores are calculated using the formula: , =1 ,,where , represents the average score of the -th covariate forthe -th subgroup patients. visualizes a heatmap showingthe relative scores, with warmer colors (e.g. red) indicating higherscores. We report 15 of covariates with the highest scores on Sub-group 1 (most enhanced group), which are also larger than 13. Forexample, conditions like lymphadenitis, diseases of white bloodcells, and acute myocardial infarction are given more importancein this subgroup. The conditions, reported covariates, likely have amore significant association with the subgroups response to Tra-zodone. Additionally, as the subgroups response diminishes, fromSubgroup 1 to Subgroup 3, the scores also decrease progressively.This trend suggests that the patients with these conditions are moreresponsive to Trazodone. The analysis provides an understandingof the enhanced subgroup and explains why the drug may be moreeffective for this subgroup. Such findings are instrumental in guid-ing more personalized drug strategies, aligning with the goal of ourresearch to enhance the precision of drugs.",
  "CONCLUSION": "In this work, we address the crucial challenges inherent in compu-tational drug repurposing. We introduce a novel framework thatseamlessly integrates patient subgroup identification and TEE forprecision drug repurposing. The real-world study demonstrates theefficiency of our method in identifying potential drug candidatesand enhancing precise treatment selection. Our work representsa useful framework for precision drug repurposing, especially inits application to complex diseases characterized by varied patientresponses.",
  "Ahmed M Alaa and Mihaela Van Der Schaar. 2017. Bayesian inference of indi-vidualized treatment effects using multi-task gaussian processes. Advances inneural information processing systems 30 (2017)": "Peniel N Argaw, Elizabeth Healey, and Isaac S Kohane. 2022. Identifying Hetero-geneous Treatment Effects in Multiple Outcomes using Joint Confidence Intervals.In Machine Learning for Health. PMLR, 141170. Peter C Austin. 2009. Using the standardized difference to compare the prevalenceof a binary variable between two groups in observational research. Communica-tions in statistics-simulation and computation 38, 6 (2009), 12281234. Yoav Benjamini and Yosef Hochberg. 1995. Controlling the false discovery rate: apractical and powerful approach to multiple testing. Journal of the Royal statisticalsociety: series B (Methodological) 57, 1 (1995), 289300. Natalie S Buchan, Deepak K Rajpal, Yue Webster, Carlos Alatorre, Ranga ChandraGudivada, Chengyi Zheng, Philippe Sanseau, and Jacob Koehler. 2011. The roleof translational bioinformatics in drug discovery. Drug discovery today 16, 9-10(2011), 426434. Marie-Laure Charpignon, Bella Vakulenko-Lagun, Bang Zheng, Colin Magdamo,Bowen Su, Kyle Evans, Steve Rodriguez, Artem Sokolov, Sarah Boswell, Yi-HanSheu, et al. 2022. Causal inference in medical records and complementary sys-tems pharmacology for metformin drug repurposing towards dementia. Naturecommunications 13, 1 (2022), 7652. Feixiong Cheng, Fei Wang, Jian Tang, Yadi Zhou, Zhimin Fu, Pengyue Zhang,Jonathan L Haines, James B Leverenz, Li Gan, Jianying Hu, et al. 2024. Artificialintelligence and open science in discovery of disease-modifying medicines forAlzheimers disease. Cell Reports Medicine 5, 2 (2024). Che-Sheng Chu, Ping-Tao Tseng, Brendon Stubbs, Tien-Yu Chen, Chia-HungTang, Dian-Jeng Li, Wei-Cheng Yang, Yen-Wen Chen, Ching-Kuan Wu, NicolaVeronese, et al. 2018. Use of statins and the risk of dementia and mild cognitiveimpairment: A systematic review and meta-analysis. Scientific reports 8, 1 (2018),5804. Alicia Curth and Mihaela van der Schaar. 2021. Nonparametric Estimationof Heterogeneous Treatment Effects: From Theory to Learning Algorithms. InProceedings of The 24th International Conference on Artificial Intelligence andStatistics (Proceedings of Machine Learning Research, Vol. 130), Arindam Banerjeeand Kenji Fukumizu (Eds.). PMLR, 18101818.",
  "Anik Kumar Kumar Das, Divya Sharma, and Lalit Sharma. 2021. Drug repurposingstrategy for treating Alzheimers disease. Alzheimers & Dementia 17 (2021),e058503": "Rui Duan, Zhaoyi Chen, Jiayi Tong, Chongliang Luo, Tianchen Lyu, Cui Tao,Demetrius Maraganore, Jiang Bian, and Yong Chen. 2020. Leverage real-worldlongitudinal data in large clinical research networks for Alzheimers disease andrelated dementia (ADRD). In AMIA Annual Symposium Proceedings, Vol. 2020.American Medical Informatics Association, 393. Nophar Geifman, Roberta Diaz Brinton, Richard E Kennedy, Lon S Schneider,and Atul J Butte. 2017. Evidence for benefit of statins to modify cognitive declineand risk in Alzheimers disease. Alzheimers research & therapy 9 (2017), 110.",
  "Jennifer L Hill. 2011. Bayesian nonparametric modeling for causal inference.Journal of Computational and Graphical Statistics 20, 1 (2011), 217240": "Sren R Knzel, Jasjeet S Sekhon, Peter J Bickel, and Bin Yu. 2019. Metalearners forestimating heterogeneous treatment effects using machine learning. Proceedingsof the national academy of sciences 116, 10 (2019), 41564165. Alice L La, Christine M Walsh, Thomas C Neylan, Keith A Vossel, Kristine Yaffe,Andrew D Krystal, Bruce L Miller, and Elissaios Karageorgiou. 2019. Long-termtrazodone use and cognition: a potential therapeutic role for slow-wave sleepenhancers. Journal of Alzheimers Disease 67, 3 (2019), 911921.",
  "Ruoqi Liu, Lai Wei, and Ping Zhang. 2021. A deep learning framework for drugrepurposing via emulating clinical trials on real-world patient data. Naturemachine intelligence 3, 1 (2021), 6875": "Heng Luo, Ping Zhang, Xi Hang Cao, Dizheng Du, Hao Ye, Hui Huang, Can Li,Shengying Qin, Chunling Wan, Leming Shi, et al. 2016. DPDR-CPI, a server thatpredicts drug positioning and drug repositioning via chemical-protein interac-tome. Scientific reports 6, 1 (2016), 35996. Chirag Nagpal, Dennis Wei, Bhanukiran Vinzamuri, Monica Shekhar, Sara EBerger, Subhro Das, and Kush R Varshney. 2020. Interpretable subgroup discoveryin treatment effect estimation with application to opioid prescribing guidelines.In Proceedings of the ACM Conference on Health, Inference, and Learning. 1929.",
  "Donald B Rubin. 1974. Estimating causal effects of treatments in randomized andnonrandomized studies. Journal of educational Psychology 66, 5 (1974), 688": "M Sano, KL Bell, D Galasko, JE Galvin, RG Thomas, CH Van Dyck, and PS Aisen.2011. A randomized, double-blind, placebo-controlled trial of simvastatin to treatAlzheimer disease. Neurology 77, 6 (2011), 556563. Philippe Sanseau, Pankaj Agarwal, Michael R Barnes, Tomi Pastinen, J BrentRichards, Lon R Cardon, and Vincent Mooser. 2012. Use of genome-wide associa-tion studies for drug repositioning. Nature biotechnology 30, 4 (2012), 317320. Bob G Schultz, Denise K Patten, and Daniel J Berlau. 2018. The role of statinsin both cognitive impairment and protection against dementia: a tale of twomechanisms. Translational neurodegeneration 7 (2018), 111. Patrick Schwab, Lorenz Linhardt, Stefan Bauer, Joachim M Buhmann, and WalterKarlen. 2020. Learning counterfactual representations for estimating individ-ual dose-response curves. In Proceedings of the AAAI Conference on ArtificialIntelligence, Vol. 34. 56125619.",
  "Claudia Shi, David Blei, and Victor Veitch. 2019. Adapting neural networks forthe estimation of treatment effects. Advances in neural information processingsystems 32 (2019)": "Yishai Shimoni, Ehud Karavani, Sivan Ravid, Peter Bak, Tan Hung Ng,Sharon Hensley Alford, Denise Meade, and Yaara Goldschmidt. 2019. An evalua-tion toolkit to guide model selection and cohort definition in causal inference.arXiv preprint arXiv:1906.00442 (2019). Marina Sirota, Joel T Dudley, Jeewon Kim, Annie P Chiang, Alex A Morgan,Alejandro Sweet-Cordero, Julien Sage, and Atul J Butte. 2011. Discovery and pre-clinical validation of drug indications using compendia of public gene expressiondata. Science translational medicine 3, 96 (2011), 96ra7796ra77. Thitiporn Supasitthumrong, Blanca M Bolea-Alamanac, Selim Asmer, Vincent LWoo, Petal S Abdool, and Simon JC Davies. 2019. Gabapentin and pregabalin totreat aggressivity in dementia: a systematic review and illustrative case report.British journal of clinical pharmacology 85, 4 (2019), 690703.",
  "Laurens Van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE.Journal of machine learning research 9, 11 (2008)": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones,Aidan N Gomez, ukasz Kaiser, and Illia Polosukhin. 2017. Attention is allyou need. Advances in neural information processing systems 30 (2017). Yeming Wang, Dingyu Zhang, Guanhua Du, Ronghui Du, Jianping Zhao, YangJin, Shouzhi Fu, Ling Gao, Zhenshun Cheng, Qiaofa Lu, et al. 2020. Remdesivirin adults with severe COVID-19: a randomised, double-blind, placebo-controlled,multicentre trial. The lancet 395, 10236 (2020), 15691578. Wei-Qi Wei, Chao Yan, Monika Grabowska, Alyson Dickson, Bingshan Li, Zhex-ing Wen, Dan Roden, C Stein, Peter Emb, Josh Peterson, et al. 2023. LeveragingGenerative AI to Prioritize Drug Repurposing Candidates: Validating IdentifiedCandidates for Alzheimers Disease in Real-World Clinical Datasets. ResearchSquare (2023).",
  "Junyuan Xie, Ross Girshick, and Ali Farhadi. 2016. Unsupervised deep embeddingfor clustering analysis. In International conference on machine learning. PMLR,478487": "Jie Xu, Fei Wang, Chengxi Zang, Hao Zhang, Kellyann Niotis, Ava L Liberman,Cynthia M Stonnington, Makoto Ishii, Prakash Adekkanattu, Yuan Luo, et al.2023. Comparing the effects of four common drug classes on the progression ofmild cognitive impairment to dementia using electronic health records. Scientificreports 13, 1 (2023), 8102. Chengxi Zang, Hao Zhang, Jie Xu, Hansi Zhang, Sajjad Fouladvand, ShreyasHavaldar, Feixiong Cheng, Kun Chen, Yong Chen, Benjamin S Glicksberg, et al.2022. High-throughput clinical trial emulation with real world data and machinelearning: a case study of drug repurposing for Alzheimers disease. medRxiv(2022), 202201. Chengxi Zang, Hao Zhang, Jie Xu, Hansi Zhang, Sajjad Fouladvand, ShreyasHavaldar, Feixiong Cheng, Kun Chen, Yong Chen, Benjamin S Glicksberg, et al.2023.High-throughput target trial emulation for Alzheimers disease drugrepurposing with real-world data. Nature Communications 14, 1 (2023), 8180.",
  "AAPPENDIXA.1Causal Assumption": "Our study is based on three standard assumptions in causal in-ference , which are as follows: (1) Conditional IndependenceAssumption: The assignment of treatment is independent of theoutcome, given the pre-treatment covariates. (2) Common Sup-port Assumption: There is a nonzero probability of the treatmentassignment for all samples. (3) Stable Unit Treatment Value As-sumption: The observed outcome of each unit remains unaffectedby the assignment of treatments to other units. These assumptionsare essential in treatment effect estimation as they provide the nec-essary conditions for unbiased and consistent estimation of causaleffects. The assumptions form the basis for our methodology.",
  "A.2Simulation study": "Treatment Effect Estimation (TEE) is crucial in drug repurposing, asit predicts how an existing drug might influence outcomes and quan-tifies the magnitude of the drug effect. The accuracy and reliabilityof TEE models, therefore, are directly linked to the success of drugrepurposing efforts, suggesting a strong potential for examiningnew uses for existing drugs.To assess the predictive performance of our framework, we con-duct a quantitative analysis of TEE, comparing it against state-of-the-art neural network-based TEE models .Since treated and control outcomes are not simultaneously observ-able in real-world data, our study employs two synthetic and onesemi-synthetic datasets for the quantitative analysis. We also con-duct comparative experiments with two representative subgroupingmodels to further evaluate the effectiveness of the proposedmethod in subgroup identification. A.2.1Datasets. We use two synthetic and one semi-syntheticdatasets, which have both simulated treated and control outcomesfor quantitative analysis. The synthetic datasets are entirely com-posed of simulated data, whereas the semi-synthetic dataset com-bines real covariates with simulated potential outcomes. The statis-tics of the datasets are presented in . Synthetic Dataset A. We simulate a synthetic dataset, follow-ing existing works . The dataset is inspired by the initialclinical trial results of remdesivir to COVID-19 . The resultsshow that the shorter the time from the onset of symptoms tothe start of clinical trials with Remdesivir, the faster the time toclinical improvement. The dataset comprises 10 covariates, eachderived from a specific normal distribution. The covariates are:age (66, 4), white blood cell count (109 per L) (66, 4),lymphocyte count (109 per L) (0.8, 0.1), platelet count (109 per L) (183, 20.4), serum creatinine (U/L) (68, 6.6), aspar-tate aminotransferase (U/L) (31, 5.1), alanine aminotransferase(U/L) (26, 5.1), lactate dehydrogenase (U/L) (339, 51), cre-atine kinase (U/L) (76, 21), and time from symptom onset to",
  "( = 1) (X0 + 5 (1 + (09))1, 0.1)(19)": "where X0 indicates standardized covariate values excluding thetime covariate0. Coefficients are selected from (0, 0.1, 0.2, 0.3, 0.4)with respective probabilities of (0.6, 0.1, 0.1, 0.1, 0.1). In total, thedataset consists of 1,000 samples, evenly divided into 500 cases and500 controls. Synthetic Dataset B. The data is generated using an autore-gressive simulation model with 25 covariates. The time-dependentcoefficients on five sequences are simulated from normal distri-butions, where their means are different for each sequence. Foreach patient, initial covariates are drawn from a normal distribu-tion (0 (0, 10)). Subsequent covariates are generated usingweighted sums of the five previous covariates with the correspond-ing time-dependent coefficients, and Gaussian noise is added tothese covariates. Outcomes are calculated based on the final covari-ate vectors, following the Response Surface from . The numberof sequences (timesteps) is randomly selected from a discrete uni-form distribution for each patient within the range {10, 20}, and thetreatment assignment is determined by a binomial distribution. Thefinal dataset includes covariate histories, treatment assignments,and treated and control outcomes. Semi-synthetic Dataset. For the semi-synthetic dataset, we uti-lize the Infant Health and Development Program (IHDP) dataset, which was originally collected from a randomized experimentaimed at evaluating the impact of early intervention on reducingdevelopmental and health problems among low birth weight, pre-mature infants. The dataset consists of 608 control patients and139 treated patients, totaling 747 individuals, with 25 covariates.The outcomes are simulated based on the real covariates using thestandard non-linear mean outcomes of Response Surface B .",
  "VCNet uses separate prediction heads for treatmentmapping to preserve and utilize treatment information": "TransTEE leverages the Transformer to model the in-teraction between the input covariate and treatment.We also conduct comparative experiments with two representa-tive existing subgrouping models to further evaluate the effective-ness of the proposed method in subgroup identification. R2P is a tree-based recursive partitioning method. HEMM utilizes Gaussian mixture distributions to learnsubgroup probabilities.R2P and HEMM use the CMGP model and a neural network-based model, respectively, to pre-estimate treatment effects forsubgroup identification.",
  "ATE = E(1(x) 0(x) E(1 0(21)": "To evaluate the performance for subgroup identification, weanalyze the variance of treatment effects within and across sub-groups. The variance across the subgroups evaluates the varianceof the mean of the treatment effects in each subgroup, while thevariance within subgroups measures the mean of the variance ofthe treatment effects in each subgroup. They are expressed as:",
  "where indicates a set of estimated treatment effects in subgroup, such that = {E( = 1, x E( = 0, x for all x }": "A.2.4Implementation Details. All neural network-based modelsare implemented using PyTorch. We use the SGD/Adam optimizer,with a learning rate set to 0.001 and a batch size of 128. The hyper-parameters for the baseline models follow the implementationsprovided by the respective authors. For our proposed model, weset the hidden nodes from the set {50, 100, 200, 300}, the number ofhidden layers in the Transformer and the prediction network fromthe set {1,2,3}, the number of subgroups from the range of ,and coefficient from the range of [0.1, 0.5]. The data is randomlydivided into training, validation, and test sets, with a split ratio of6:2:2. We train the model on the training set and employ a stoppingrule based on the performance on the validation set. All results arereported on the test set.",
  "PEHE ATE PEHE ATE PEHE ATE": "TNet 0.090 0.0110.011 0.0080.167 0.0180.043 0.021SNet 0.084 0.0140.059 0.0240.057 0.0010.028 0.0050.073 0.0130.027 0.016DragonNet 0.081 0.0130.016 0.0130.057 0.0020.035 0.0140.105 0.0370.040 0.010TARNet 0.068 0.0100.023 0.0030.054 0.0010.024 0.0010.092 0.0190.039 0.010DR-CRF 0.079 0.0120.022 0.0200.056 0.0010.027 0.0120.070 0.0120.021 0.012DRNet 0.076 0.0120.024 0.0020.054 0.0010.024 0.0010.057 0.0130.026 0.011VCNet 0.034 0.0050.018 0.0100.056 0.0030.038 0.0110.080 0.0310.065 0.049TransTEE 0.045 0.0460.026 0.0550.057 0.0030.038 0.0280.099 0.0710.153 0.046 STEDR (ours)0.022 0.0030.010 0.0080.051 0.0020.011 0.0060.037 0.0040.024 0.018w/o GMM0.031 0.0020.025 0.0040.056 0.0010.020 0.0030.043 0.0030.026 0.012w/o Attention0.029 0.0030.020 0.0060.054 0.0020.018 0.0050.041 0.0040.028 0.0015",
  "STEDR (ours)0.235 0.022.327 0.050.022 0.0030.486 0.050.698 0.080.037 0.004": "Treatment Effect Estimation. shows predictive perfor-mances, PEHE and ATE, on three synthetic and semi-syntheticdatasets. Our proposed method shows superior performance, out-performing the baseline models. Specifically, our model exhibitsPEHE values of 0.022 and 0.051 on the synthetic datasets and 0.037on the IHDP dataset. These results are not merely numerically su-perior but represent a significant reduction in error 35.3%, 5.6%,and 35.1% lower than the second-best model. This enhancementunderscores the efficiency of our approach, which estimates thesubgroup-specific treatment effect by identifying heterogeneoussubgroups. We also conduct an ablation study to assess the con-tribution of specific components to the overall performance. Thisincludes two variations: (1) w/o GMM, STEDR without the mixtureGaussian model of the local distribution (i.e., without subgrouping);(2) w/o Attention, STEDR without both covariate-level and visit-levelattention mechanisms (without the patient-level representation).The results indicate that each component plays an important roleas the performance decreases when removed. Subgroup Identification. A critical dimension of our researchis the identification of subgroups. The ideal subgrouping strategywould maximize heterogeneity across different subgroups whileensuring homogeneity within each subgroup. presents thesubgrouping performance, and , as well as PEHE onthe Synthetic A and IHDP datasets. The Synthetic Dataset B is notused since it is not applicable for the baselines (timeseries data). Ourmethod outperforms the baselines on both the subgrouping andTEE metrics across all datasets, except for on the Syntheticdataset. Specifically, the baseline models exhibit lower performance in PEHE. This suggests that the baseline models, which rely on fixedpre-trained TEE models to identify subgroups, may not be optimalfor this task. Consequently, the subgroup performance metrics ofthese models are also shown to be lower. This observation high-lights a fundamental limitation in existing subgrouping methods.In contrast, our approach improves performance in both subgroupidentification and TEE by simultaneously optimizing subgroupingand TEE.",
  "A.3Drug Repurposing for Alzheimers Disease": "A.3.1Dataset. We used a large-scale real-world longitudinal patient-level healthcare warehouse, MarketScan4 Medicare Supplemen-tal and Coordination of Benefits Database (MDCR) from 2012 to2018, which contains individual-level and de-identified healthcareclaims information. The MarketScan MDCR database is createdfor Medicare-eligible retirees with employer-sponsored MedicareSupplemental plans. The MarketScan data are primarily used toevaluate health utilization and services, containing administrative,including patients longitudinal information, including diagnoses,procedures, prescriptions, and demographic characteristics. Weidentify 155K distinct MCI patients, among whom 40K are diag-nosed with AD. The distribution of gender and age at MCI initi-ation date and patients distribution of total time in the databaseare shown in . MCI and AD patients are identified usingthe diagnosis codes, as shown in . We consider diagnosisand prescription codes for study variables. The diagnosis codes aredefined by the International Classification of Diseases (ICD) 9/10",
  "ADRD": "ICD-9:294.10 Dementia in conditions classified elsewhere without behavioral disturbance294.11 Dementia in conditions classified elsewhere with behavioral disturbance294.20 Dementia, unspecified, without behavioral disturbance.294.21 Dementia, unspecified, with behavioral disturbance290.* DementiasICD-10:F01.* Vascular dementiaF02.* Dementia in other diseases classified elsewhereF03.* Unspecified dementia codes. We map the ICD codes to Clinical Classifications Software(CCS), including a total of 286 codes. For the drugs, we match na-tional drug codes (NDCs) to ingredient levels, resulting in a totalof 1,353 unique drugs in our dataset. We use diagnosis codes andtheir time information to construct input variables for our method. A.3.2Experimental Setup. In our study, we set the number of clus-ters to three for all trial drugs. For each drug trial emulation, thedata is randomly divided into training, validation, and test sets,with a split ratio of 6:2:2. We train the model on the training set andemploy a stopping rule based on the performance on the validationset. The hyperparameters of our model include which is a penaltystrength factor for , the number of layers and hidden nodesin the Transformer encoder, the number of hidden nodes in both thelocal/global distribution in the subgroup representation network,and the number of layers of the prediction network. Notably, thenumber of hidden nodes in the prediction network is the same asthat in the subgroup representation network. We evaluated ourmodel across several trials to determine the optimal hyperparam-eters and applied these parameters consistently across all drug"
}