{
  "Abstract": "Large-scale human mobility exhibits spatial and temporal patternsthat can assist policymakers in decision making. Although tradi-tional prediction models attempt to capture these patterns, theyoften interfered by non-periodic public events, such as disastersand occasional celebrations. Since regular human mobility patternsare affected by these events, estimating their causal effects is criticalto accurate mobility predictions. News articles provide unique per-spectives on these events, though processing is a challenge. In thisstudy, we propose a causality based prediction model, CausalMob,to analyze the causal effects of public events. We first utilize largelanguage models (LLMs) to extract human intentions from newsand transform them into features that act as causal treatments. Next,the model learns representations of spatio-temporal regional covari-ates from multiple data sources to serve as confounders for causalinference. Finally, we present a causal effect estimation frameworkto ensure that event features remain independent of confoundersduring prediction. Based on large-scale real-world data, the exper-imental results show that the proposed model excels in humanmobility prediction, outperforming state-of-the-art models.",
  "Corresponding author. First affiliation": "Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than theauthor(s) must be honored. Abstracting with credit is permitted. To copy otherwise, orrepublish, to post on servers or to redistribute to lists, requires prior specific permissionand/or a fee. Request permissions from 25, August 37, 2025, Toronto, ON, Canada 2025 Copyright held by the owner/author(s). Publication rights licensed to ACM.ACM ISBN 979-8-4007-1245-6/25/08",
  "Human Mobility Prediction, Causal Inference, LLMs": "ACM Reference Format:Xiaojie Yang, Hangli Ge, Jiawei Wang, Zipei Fan, Renhe Jiang, RyosukeShibasaki, and Noboru Koshizuka. 2025. CausalMob: Causal Human MobilityPrediction with LLMs-derived Human Intentions toward Public Events. InProceedings of the 31st ACM SIGKDD Conference on Knowledge Discovery andData Mining V.1 (KDD 25), August 37, 2025, Toronto, ON, Canada. ACM,New York, NY, USA, 12 pages.",
  "Introduction": "Human mobility exhibits spatio-temporal patterns that can aidpolicy-makers in urban management and decision-making. How-ever, large-scale public events complicate the capture of these mo-bility patterns, resulting in less robust predictions . Thesepublic events change human mobility in various ways, driven bycorresponding human intentions . For example, as shownin the \"Public Event Categorization\" of , typhoons can bepredicted through weather reports, causing people to stay home.In contrast, emergencies like earthquakes have similar effects butare harder to forecast. Additionally, live concerts and traffic con-gestion can increase human volumes in specific regions, with thelatter often links to unexpected traffic accidents.Based on theabove cases, our research categorizes public events based on theirpredictability and their impact on human mobility (positive or neg-ative to count increases), as shown in . Understandingand analyzing human mobility and intentions toward public eventsusing this categorization criteria can help decision-makers betterprepare for potential opportunities and risks. However, current re-search often captures the statistical dependencies between humanmobility and public events without analyzing the causal relationshipbetween them . This limitation is significant because human in-tentions play a crucial role in how people respond to public events.To support our point, we provide an example of an earthquakeoccurring on January 1, 2024, along with the corresponding hu-man mobility in . Therefore, to address this limitation, we",
  ": Conceptual graph of this research": "leverage LLMs to simulate human intentions toward public events,enabling an explainable exploration of the causal relationship inhuman mobility .However, traditional causal inference methods that use random-ized controlled trials to study causal effects face difficulties inabstracting public event features and controlling their occurrence.Instead, researchers overcome this challenge by leveraging coun-terfactual analysis to study causal effects in different scenarios. Given this background, we present a causal graph to discussthe causal relationships among variables in this research, as illus-trated in . We aim to analyze the causal effect of publicevents (treatment) on human mobility (outcomes) by distin-guishing the inference of spatio-temporal regional confounders (re-ferred to as confounders in the following content) that we learnfrom observation data, including spatio-temporal covariates andOrigin-Destination (OD) matrix adjacency .Benefiting",
  ": Causal graph of this research": "from the developed media industry, we can obtain high-qualityreports on public events through news articles and extract struc-tured information from them . This is illustrated in ,which includes translated news articles and corresponding humanmobility data that fluctuated significantly due to an earthquake.Furthermore, based on previous research, with the help of LLMs,we can extract structured information more efficiently from articlesand simulate human intentions toward public events as featuresthrough prompt engineering . Accurate estimations of causal effects rely on the unconfound-edness assumption, which requires learning confounders with allfeatures independent of treatments . As a weak assumption, ourresearch employs a causal effect calculation framework to removedependencies between public events and confounders. We beginby extracting structured information from news articles and simu-lating mobility-related human intentions based on prompted LLMs.Next, we learn the representations of the confounders from obser-vational data. In the causal inference part, an inference networkpredicts future human mobility, and a re-weighting network helpsto remove event bias for each region . Finally, we estimate thecausal effect of public events on human mobility. We evaluated ourproposed method on real-world data, including human mobilitydata and news articles, covering most major administrative regionsin Japan. Our contributions are as follows:",
  "Related Work": "Human Mobility Prediction. In recent years, the developmentof geolocated datasets and data mining technologies has madehuman mobility increasingly important for urban management,transportation and disaster response . Benefiting from high-performance computational power, large-scale human mobility pre-diction based on deep learning has achieved good performance .Researchers have focused on capturing periodical and semantic in-formation to represent regional features for prediction. For example,STGCN captured long-term periodical spatio-temporal patternsbased on graph structures for traffic prediction, while DeepSTN+ modeled long-range spatial dependence of different regions us-ing POI features as semantic information. These models effectivelycapture regular patterns in human mobility. However, for irregularsituations with low periodicity, such as disasters or festivals, pre-vious research tends to model mobility under specific conditions,making predictions less generalizable .Causal Analysis for Human Mobility. Causal analysis aims toreveal cause-effect relationships among variables . Many previ-ous studies have separated treatments from traditional inputs toanalyze their effects on outcomes. These treatments are usuallysingle variables, including discrete and continuous variables .However, in the real world, treatment variables affecting humanmobility are much more complex. Previously, causal analysis forhuman mobility has focused on specific situations. For example,Ma introduced causal inference to assess the effectiveness ofCOVID-19-related policies by learning confounders from humanmobility data and residents vigilance from Google Trends. Simi-larly, Zhang used these data to assess the effect of typhoons,represented by wind speed and precipitation, on human mobility.",
  "Observational Data": "This research aims to causally analyze the relationship betweenpublic events (treatment) and human mobility (outcomes) in Japan.We select 490 administrative regions (referred to as regions in thefollowing content) across Japan, as shown in (a). Someareas were exclude due to insufficient human mobility data (ag-gregated from GPS records provided by BlogWatcher Inc. ). Wecontinuously filter these data within the time range of 2023/04/01to 2024/03/31, corresponding to the official fiscal year in Japan.Treatment E: Public events features extracted from news articles.We collaborate with Kyodo News, one of the largest internationalnews agencies, which distributes news to almost all newspapers,radio, and television networks in Japan, reaching over 50 millionsubscribers . With the same time range as the human mobilitydata, we filter out unrelated articles as data-cleaning process. Wethen align the news articles with the corresponding regions usingmanually labeled region codes. To further analyze the effects on hu-man mobility, we introduce LLMs to extract structured informationand human intentions as features from these filtered news articles.More details will be provided in the methodologies section.Outcome Y: Future human mobility in selected regions. This studyfocuses on human mobility affected by the causal effects of pub-lic events. We aggregate human mobility data (GPS records) inselected regions as our prediction target. During this process, allusers remain anonymous, and we take the hourly samples of uidsaggregation within mentioned time ranges.Covariates X: Spatio-temporal regional covariates. We introduceproxy variables as region covariates to capture the unobserved con-founders . We collect Points of Interest (POI) from OpenStreetMap(OSM) and categorize them to represent region features . Be-fore calculating confounders , we concatenate POI features, timeembeddings, region embeddings, and historical human mobilitydata. More details will be provided in the methodologies section.Networks A: Re-normalized Mobility network. We use a humanmobility network to model the inter-regional interactions and cap-ture unobserved confounders in the selected regions. We aggregatethe hourly Origin-Destination (OD) matrix adjacency within theregional network to represent the strength of each regions rela-tionship. Each edge in this network contains a time-varying weightcomputed based on mobility volumes between two regions in theOD matrix. We re-normalize this mobility network, resulting in aweighted adjacency matrix for each timestamp .",
  "Preliminary Data Analysis": "To explore the mentioned causal relationship, we conduct prelim-inary data visualization analysis to illustrate the dependence be-tween changes in human mobility and the occurrence of publicevents. We manually select two cases including a firework and atyphoon from our datasets and visualize them, respectively.As illustrated in , public events are divided into four",
  "(c) Typhoon Khanun (Okinawa, Naha)": ": Public events examples along with changes of dailyhuman mobility. We calculate mean values and standarddeviations of daily human mobility records ( markers referto the dates when public events happened). types based on their positive or negative effects on human mobilityand predictability. While most cases are simple and straightforward,positive unpredictable events are much harder to capture. We as-sume some might be accompanied by negative unpredictable eventsor side effects of policies, such as the behavior of moving to low-cost areas due to remote working policies during COVID-19. Publicevents of this type require more complex reasoning processes, sowe do not focus on them in this research. Furthermore, news arti-cles are sometimes not temporally synchronized with public events,which is one of the main reasons we introduce LLMs to correctthe exact occurrence time of public events, as part of structuredinformation. Here, we provide cases as follows and related regionsare marked in (a) with daily human mobility patterns:Sumidagawa Firework Festival. Held at 19:00 on June 29, 2023,the Sumidagawa Firework Festival was the largest fireworks fes-tival in Japan, attracting over one million people including localsand visitors to the related regions in 2023. As shown in (b),",
  "KDD 25, August 37, 2025, Toronto, ON, CanadaXiaojie Yang et al": "Q10, indicates the duration of the public events. With Prompt 4 inAppendix E, we expect LLMs to judge the predictability of publicevents. Combined with scores in danger and interest, we categorizenews articles into four quadrants based on public events catego-rization in . Finally, public events in news articles labeledwith \"Yes\" are treated as unpredictable cases.In , we show the relationships between categorizations",
  "Problem Definition": "In this research, we investigate the causal effects of public events onhuman mobility. Our methodology leverages large language models(LLMs) with chain-of-thought prompting to extract structured in-formation, including human intentions, denoted as = (1,2,...,from news articles. Additionally, we process aggregated humanmobility data, represented as X, and mobility networks, denotedas , to predict future human mobility patterns, Y, in selected re-gions over fixed time steps. In particular, we focus on crowd flow,measured as human volume in each region, treating it as the mainmobility feature for analysis.",
  "Human Intentions Extraction withSemantic-Aware LLMs": "In most situations, news articles report public events objectively,allowing us to estimate mobility-related human intentions. Ourdataset contains over 130,000 news articles of one year, coveringmultiple genres as shown in , making manual processingimpractical. Taking advantage of the development of open sourceLLMs, we can extract the necessary structured information and simulate human intentions related to human mobility usingprompt engineering, starting with simple manual filtering .To enable LLMs to reason about human mobility-related inten-",
  "tions, we design a step-by-step dialog framework as shown in inspired by chain of thought . With carefully designedprompts, we aim for LLMs to extract necessary information from": "news articles on the following aspects: 1) Most influential events, 2)Time of the event, 3) Four basic questions related to human mobility,i.e., where, when, who, and how (3W1H), 4) Predictability of events,and 5) Human intentions of the public events with scores. Due tospace limitations, prompt details can be found in the Appendix E.Historical answers will inform LLMs future reasoning. To ensurethe robustness of the generated answers for each prompt, we useone of the most powerful open-source LLMs, Llama3-70b basedon a library called Ollama . Finally, we obtain structured in-formation of public events as shown in the top-right of .Specifically, human intentions toward public events will be usedas causal treatments on human mobility in our prediction model.Furthermore, news cases are listed in Appendix C.",
  "Causal Effect Inference throughCounterfactual Estimation": "For features of selected regions, we collect POI information anddivide them into specific categories according to their labels. Wedenote this feature as = { }=1, where refers to the -thcategory of the -th region. Using human mobility data consist-ing of GPS coordinate records, we aggregate anonymous uids inone region with a fixed time interval. This can be represented as = { ,}=1. Furthermore, considering that human mobil-ity is highly dependent on regional interactions, we used a normalization adjacency matrix at timestamp to representtime-varying relations between regions. In , we calculateconfounder = {,}=1 with observation data, where refersto natural region representations, is the embedded timestamp,and , is temporally re-weighted POI feature.As for treatments for causal inference, we obtain structured in-formation including information about time, location and humanintentions toward public events of each region , at time step with prompted LLMs, and we conclude observed events in the inputwindow and scheduled or predictable ones in the output window,as the flow chart in . When it comes to evaluating treatmenteffects, one of the challenges is that previous studies focused onbinary or continuous covariates in one dimension, while in ourresearch we are facing complicated event features depicted by newsarticles over multiple time steps, and we need to convert themto a single feature ,. To calculate the causal effect of differentpublic events on human mobility, we need to calculate the averagetreatment effect (ATE) at timestamp of -th selected region in ourresearch area:",
  ", = E [1, 0,,,,,(1)": "where 1, and 0, refer to potential outcomes of human mobilitywith and without causal effects of public events under the samespatio-temporal condition, corresponding to the outcomes Y.Generally, it is impossible to observe the effects of differentpublic events in one region simultaneously. Furthermore, in ourobservation data, public events show biases because of confounderimbalance and non-randomized treatments among regions. It meansthat some events tend to happen in certain regions, which will leadto unreliable inference. Processing public event features into a one-dimensional feature will result in significant information loss. For-tunately, we can quantify the similarity or strength of public events",
  "CausalMob: Causal Human Mobility Prediction with LLMs-derived Human Intentions toward Public EventsKDD 25, August 37, 2025, Toronto, ON, Canada": ": Framework of CausalMob: We first process news articles to obtain structured information of public events in part(a). Then in part (b) we use ST-ResNET to learn the representation of the confounder . Finally, an inference network and are-weighting network are built to calculate factual loss and counterfactual loss as causal inference. at a semantic level. Therefore, we introduce the concept of averagedose-response function (ADRF) , denoted as E(, = ), toapply causal effect evaluation with multidimensional treatments.Previous research stressed that ADRF loss is bounded by the mar-ginal loss comprising factual loss and counterfactual loss. As wecannot easily observe and define a counterfactual, we alternativelyuse a re-weighting schema to reduce confounder imbalance andcalculate the upper bound of ADRF loss with Integral ProbabilityMetrics (IPM) distance as our counterfactual loss (also an auxiliaryloss) . As IPM distance represents a group of metrics to measuredistribution differences between re-weighted fact and counterfac-tual, optimizing the upper bound allows us to encompass mostADRF estimation methods used in previous research.Based on the above formulations, we propose a causal effectscalculation framework, as shown in part (b) of , to eval-uate the causal effect of public events on human mobility usingLLMs-derived human intentions. In our framework, we processnews articles with LLMs to extract structured information, includ-ing human intentions. We then calculate spatio-temporal regionalconfounders using observation data within a certain input win-dow. After aggregating the characteristics of the public event at thepredicted timestamp as , for each region, we develop a causalinference module to calculate the reweighted factual loss and theupper bound of the counterfactual loss using the IPM distance. Fi-nally, we output regional human mobility within an output window.More details will be provided in the following section.",
  "Confounder Representation Learning bySpatio-Temporal Data Modeling": "In , to learn spatio-temporal regional confounders, we useST-ResNET based on Graph Convolution Networks (GCNs) tocapture hidden states independent of treatments from historicalobservation data. First, we capture time-varying regional covariatesusing POI features and time information . For each region,we collect POI data with categories, represented as R.After normalization, we fuse POI features with embedded timeinformation W within a fixed input window. Finally, were-weight the static POI features with average time embedding andcalculate the mean value as time-varying regional features:",
  "Human Mobility Prediction Enhanced byCausality Modeling": "With the confounder z,, the model starts calculating the factualloss and counterfactual loss. We encode the treatment , withhuman intentions , in structured information. Considering thatthe impact of events diminishes over time, we chose GRU to pro-cess these features and use the output , as representations oftreatments. As mentioned in .2, we need to calculate re-weighted factual loss and use the upper bound of IPM distanceas counterfactual loss. We use two multilayer perceptron (MLP)layers, denoted as the inference network and the re-weightingnetwork , to realize the causal inference process:",
  "=1[(, (, ,)2) .(8)": "On the other hand, as we aim to calculate IPM distance, weneed to adjust the representations of treatments and confoundersto ensure their original distributions and conditional distributions,denoted as z and z , are independent of each other . To calculatereasonable IPM distance, we create a manually created baseline (i.e.,all zero scores for human intentions) and input it into the sameGRU modules to get a baseline treatment , simulating regularpatterns without any events. We then calculate cosine similaritiesbetween the baseline treatment and all other treatments, sortingall treatments according to the results. We use () and ()to represent original distributions and conditional distributions forthe -th similarity interval after dividing (1, 1 into intervals.Therefore, we can calculate the upper bound of IPM distance withmaximum inter-interval as counterfactual loss:",
  "In this section, we conduct experiments to introduce different anal-yses of our model based on . In .2, we show overallperformance by comparing with baseline models and present the": "results of the ablation study. In .3, we provide distribu-tions of LLMs output for human intentions toward public eventsin news articles. In Sections 5.5 and 5.6, we provide analyses ofaverage treatment effects estimation and the causal response ofhuman mobility to two public events as counterfactuals. As a casestudy in .7, we show prediction results in our test processcomparing predictions without human intentions.",
  "Experimental Settings": "Our model is developed using PyTorch 1.8.2 and Python 3.8, and istrained on a server equipped with four NVIDIA RTX A6000 GPUs(48GB memory) running the Ubuntu 20.04 operating system. Theraw GPS data is interpolated at 15-minute intervals and aggregatedinto one-hour intervals. For training, we randomly select 80% of thedata for training, 10% for validation, and 10% for testing. For POIdata categorization, we aggregate the data into 17 categories basedon their labels. The input and output windows for the experimentsare configured differently, as discussed in the following section.We use the Adam optimizer with an initial learning rate of 0.001and select the model with the best validation performance usingan early stopping strategy before testing. The weight is set to1, and we repeat our experiments five times with fixed randomseeds. For LLMs, we used LLama3-70b with Ollama, benefitingfrom its optimizations. This configuration allows the LLM to runwith approximately 44GB of GPU memory usage, evenly distributedacross the four graphics cards.",
  "Overall Performance": "To evaluate the prediction performance of our proposed model, weselect several state-of-the-art models in human mobility prediction.Its important to note that it is difficult to implement the event-based treatments into traditional causal-based models, as they arenot one-dimensional and cannot be easily classified into binarytreatments as in previous studies. Therefore, we mainly focus onthe following human mobility prediction models:3DGCN : A crowd flow prediction model based on a three-dimensional GCN to capture spatio-temporal dependencies.GTS : A time-series prediction model that explores correlationand causation among variables based on GNNs by learning a prob-abilistic graph by optimizing performance over graph distribution.PromptST : A spatio-temporal prediction model combiningtransformers and spatio-temporal prompts to balance commonknowledge learning with efficient adaptation to specific tasks.STGNN : A traffic flow prediction model based on GCN, GRU,and transformer structure to learn the latent patterns and capturespatial dependency in traffic nodes of transportation networks.DeepST : A crowd flow prediction model based on ST-ResNETby simulating close, period and trend properties of crowd trafficand further combined with external factors during prediction.DeepSTN+ : A crowd flow prediction model by modeling thelong-range spatial dependence among crowd flows in different re-gions and fusing POI semantic features simultaneously.STID : A simple MLP-based baseline model for multivariatetime series forecasting using spatial and temporal identity embed-dings to improve efficiency and accuracy.",
  "Improvements10.43%13.25%10.00%5.80%7.28%9.41%3.65%3.76%7.25%": "CIDER : A causal effect estimation framework for COVID-19policy in the US based on GRU and GCN. Also, Zhang usedthe same backbone model for assessing causal effects of typhoons.For prediction settings, we assume that public events have differ-ent potential effects at multiple time scales, so we design three taskswith different input (In) and output window (Out). We choose RootMean Square Error (RMSE), Mean Absolute Error (MAE), and MeanAbsolute Percentage Error (MAPE) as metrics for comparison. illustrates the prediction performance of baseline modelsand our proposed CausalMob. Overall, our model achieves the bestperformance in three prediction tasks with repeated experimentsusing different random seed initializations (see Appendix B). As theprediction window increases, there is a slight decrease in robust-ness in standard deviation, but this is acceptable given the excellentprediction accuracy. Specifically, for prediction performances oflong-term prediction tasks, although the results show the weaknessof our model in both the MAE and MAPE metrics, we believe thatthe strength of the RMSE is more representative of the outperform-ing of our model since we use weighted MSE, denoted as in ourtarget function. Additionally, compared with the CIDER which hasa different backbone, the results show that our method improvesthe prediction performances by effectively learning confounders.Ablation study is shown in in the last five lines. We eval-uate the performances of the nave model (Nave) with simply out-put , the model that replaces all LLMs-derived human intentionswith all-zero scores (wo ), the model without reweightingmechanism (wo ), the model without counterfactual (wo ) loss.We prove that 1) combining public event-based causal inferencefor human mobility prediction improves prediction performance,and 2) a loss function based on counterfactual inference can fur-ther optimize this performance. Similarly, we conduct this ablation",
  ": Distribution of LLMs-derived human intentionsbased on scores with prompt engineering. Q1-Q10 refer to 10questions listed in Prompt 5 of Appendix E": "In this section, we analyze LLMs-derived human intentions ex-tracted from structured information. In the previous sections, weset multiple scores to evaluate news articles with Prompt 5 in Ap-pendix E. In , we show the distributions of scores for allnews articles. The score of Q1 describes the degree of danger ofpublic events, with almost 60% having no negative impact on hu-man mobility. The third score for Q3 refers to the level of interest,with almost half of the events not attracting people to certain areas.The concepts of danger and interest are not mutually exclusive,allowing an event to receive non-zero scores in both dimensionssimultaneously. The remaining scores represent different aspectssuch as staying in Q2, impact on daily life in Q4, impact on businessactivities in Q5, transportation in Q6, public health in Q7, govern-ment intervention in Q8, and public services in Q9. The last score,",
  ": Count of news articles labels with public eventscategorization based on LLMs-derived human intentions": "based on LLM-derived intentions and labels that the original ar-ticles carried. We find that positive unpredictable public eventsare difficult to extract from our dataset, which is consistent withour considerations for not considering them. Second, positive pre-dictable events comprise the majority of our dataset, especiallySports, Crime/Justice and Cultural related events. Negative eventsare less represented but dominate the category of Disaster/Accidentand are mostly unpredictable. Additionally, negative predictableevents are also found in the Crime/Justice. Overall, LLMs can ef-fectively summarize human intentions toward public events fromnews articles, which is helpful in the analysis of causal inference.",
  "In this section, we present the results of encoded human inten-tions. In our CausalMob, human intentions toward public events": "in the input and output window are considered simultaneously.All intentions in the input window are included, but only those ofpredictable events are considered and put into the encoder duringtraining. Here, we choose the encoder in the long-term predictiontask to process features obtained from LLMs. In , we visu-alize encoded features of different public events using t-SNE .In Figure. 8, human intentions features related to Sports aregenerally distinguished from events with other labels, and the cor-responding points in the right figure are categorized into positivepredictable events. In contrast, Crime/Justice, Disaster/Accidentevents have similar distributions. Besides, those correspondingpoints are always classified into negative events in the right figure.The above conclusions are consistent with the information revealedin , which also demonstrates the ability of the treatment en-coder to identify and learn the characteristics of human intentions.",
  "Analysis of Regional Average TreatmentEffects": "In this section, we analyze the average treatment effects of differentpublic events under the same spatio-temporal conditions. We col-lect all treatment representations of human intentions during thetraining process and sorted them according to their cosine similari-ties to the treatment baseline . We use 0.1 as the interval to splitsimilarities, resulting in 14 intervals of treatment similarities. In, we visualize the distributions of the original news labels ineach interval, and we can see that public events related to Sport andCrime/Justice occupy the majority of all treatments intervals. In themost dissimilar treatment interval of (0.4, 0.3, Weather sharesa higher proportion, which is quite different from other intervals.",
  ": Distribution of news articles labels based on treat-ment similarity compared with treatment baseline": "Then, we choose a specific weekday in the test dataset to eval-uate the performance with different treatments. In , wepresent the prediction results in selected regions along with thetreatment similarity intervals. When treatment is in the most dis-similar interval, as mentioned in .5, the results show asignificant decline in predicted human mobility. As treatment simi-larity increases towards 1, the change in human mobility graduallydecreases (in West Tokyo City, it slightly increases to 0). As we showa similar distribution that constantly changes in from -0.3to 1.0, we also observe a continuous change in human mobility in. This demonstrates that our model can control predictionresults according to the similarity between encoded treatments ofpublic events and treatment baseline (regular patterns).",
  "Analysis of Causal Response withCounterfactual": "In this section, we provide an analysis of the causal response ofhuman mobility to different public events as counterfactuals. We se-lect news articles about a firework and an earthquake, then extractstructured information to get human intentions as treatments andinput them into the long-term prediction process as a predictableevent and an unpredictable one, respectively, for one region (Aichi,Matsuyama). In , the event feature of the firework festi-val presents a positive effect on human mobility at all predictiontimestamps. On the contrary, the feature of the earthquake tends tocontrol the increase of human mobility compared to the firework,with our results presenting negative effects on human mobility atseveral timestamps in the mid-noon and night. This demonstratesthat our proposed model can simulate the positive and negativeeffects of different public events on human mobility prediction.",
  "In this section, we provide a case study in test dataset to show theeffect of our model. In , a predictable public event of severe": "weather is reported on 2024-03-12 08:25:00, and in the structured in-formation processed with LLMs, the event time is reset to noon thenext day. We use LLMs-derived human intentions, as shown in thetitle of , to predict human mobility on the day followingthe 12th. For comparison, we use all-zero intentions to mask thisevent and also predict future human mobility. Then, we calculatethe prediction errors for each timestamp and the improvement ofour model with the green line, along with the occurrence of thesevere weather at noon, indicated by the orange line.In , we can see that the prediction results are similar in : Human mobility prediction errors with and with-out human intentions. The title of the news is as follows:Strong winds and heavy rain expected on the Pacific side. Un-stable atmospheric conditions due to low pressure system.Human Intentions: the morning hours of the day. However, as the predictable severeweather approaches, our model starts to show more accurate predic-tions, which is evident from the change in the Improvement line. Inthis case, our model achieved the best results around the predictablepublic event (i.e., 12:00 p.m.). The improved performance of predic-tions with and without the causal influence of human intentionsdecreases gradually after that point. Overall, our model consis-tently maintained more accurate predictions. This result shows thatour model can use structured information and human intentionsfrom news articles to enhance human mobility prediction duringpredictable non-periodical public events.",
  "Conclusion": "In this research, we predict human mobility based on LLM-derivedhuman intentions toward public events using a causal inferenceframework and evaluate the response of human mobility to dif-ferent public events. We utilize news articles to extract structuredinformation about public events and generate human intentionswith LLMs through prompt engineering. We propose a predictionmodel called CausalMob to predict human mobility and estimatethe causal effect of public events using multiple data sources (includ-ing POI data and human mobility data from GPS trajectories) in themain administrative regions of Japan. Compared with several state-of-the-art models, our proposed model performs better on multipleprediction tasks. Furthermore, our approach provides interpretableresults for investigating the relationship between human mobilityand public events. Our findings can help decision-makers estimatemobility changes in different regions and make informed decisionsin advance when faced with various public events.",
  "Blogwatcher. 2024. Blogwatcher, Inc. (JapaneseOnly)": "Quanjun Chen, Renhe Jiang, Chuang Yang, Zekun Cai, Zipei Fan, Kota Tsubouchi,Ryosuke Shibasaki, and Xuan Song. 2020. Dualsin: Dual sequential interactionnetwork for human intentional mobility prediction. In Proceedings of the 28thInternational Conference on Advances in Geographic Information Systems. 283292. Zipei Fan, Xuan Song, Tianqi Xia, Renhe Jiang, Ryosuke Shibasaki, and RitsuSakuramachi. 2018. Online deep ensemble learning for predicting citywidehuman mobility. Proceedings of the ACM on Interactive, Mobile, Wearable andUbiquitous Technologies 2, 3 (2018), 121. Ruth E Farmer, Daphne Kounali, A Sarah Walker, Jelena Savovi, Alison Richards,Margaret T May, and Deborah Ford. 2018. Application of causal inference methodsin the analyses of randomised controlled trials: a systematic review. Trials 19(2018), 114.",
  "Arthur Gretton, Karsten M Borgwardt, Malte J Rasch, Bernhard Schlkopf, andAlexander Smola. 2012. A kernel two-sample test. The Journal of MachineLearning Research 13, 1 (2012), 723773": "Ge Hangli, Lifeng Lin, Renhe Jiang, Takashi Michikata, and Noboru Koshizuka.2022. Multi-Weighted Graphs Learning for Passenger Count Prediction on Rail-way Network. In 2022 IEEE 46th Annual Computers, Software, and ApplicationsConference (COMPSAC). IEEE, 374382. Md Rakibul Hasan, Md Zakir Hossain, Tom Gedeon, and Shafin Rahman. 2024.LLM-GEm: Large language model-guided prediction of peoples empathy lev-els towards newspaper article. In Findings of the Association for ComputationalLinguistics: EACL 2024. 22152231.",
  "Guido W Imbens. 2000. The role of the propensity score in estimating dose-response functions. Biometrika 87, 3 (2000), 706710": "Jinhao Jiang, Kun Zhou, Zican Dong, Keming Ye, Wayne Xin Zhao, and Ji-RongWen. 2023. Structgpt: A general framework for large language model to reasonover structured data. arXiv preprint arXiv:2305.09645 (2023). Renhe Jiang, Quanjun Chen, Zekun Cai, Zipei Fan, Xuan Song, Kota Tsubouchi,and Ryosuke Shibasaki. 2022. Will you go where you search? A deep learningframework for estimating user search-and-go behavior. Neurocomputing 472(2022), 338348. Renhe Jiang, Xuan Song, Dou Huang, Xiaoya Song, Tianqi Xia, Zekun Cai, Zhao-nan Wang, Kyoung-Sook Kim, and Ryosuke Shibasaki. 2019. Deepurbanevent: Asystem for predicting citywide crowd dynamics at big events. In Proceedings ofthe 25th ACM SIGKDD international conference on knowledge discovery & datamining. 21142122. Renhe Jiang, Zhaonan Wang, Yudong Tao, Chuang Yang, Xuan Song, RyosukeShibasaki, Shu-Ching Chen, and Mei-Ling Shyu. 2023. Learning social meta-knowledge for nowcasting human mobility in disaster. In Proceedings of the ACMWeb Conference 2023. 26552665. Hanlei Jin, Yang Zhang, Dan Meng, Jun Wang, and Jinghua Tan. 2024. A compre-hensive survey on process-oriented automatic text summarization with explo-ration of llm-based methods. arXiv preprint arXiv:2403.02901 (2024).",
  "Thomas N Kipf and Max Welling. 2016. Semi-supervised classification with graphconvolutional networks. arXiv preprint arXiv:1609.02907 (2016)": "Shuqi Li, Yuebo Sun, Yuxin Lin, Xin Gao, Shuo Shang, and Rui Yan. 2024. Causal-Stock: Deep End-to-end Causal Discovery for News-driven Stock MovementPrediction. arXiv preprint arXiv:2411.06391 (2024). Yuan Li, Yixuan Zhang, and Lichao Sun. 2023. Metaagents: Simulating interactionsof human behaviors for llm-based task-oriented coordination via collaborativegenerative agents. arXiv preprint arXiv:2310.06500 (2023). Ziqian Lin, Jie Feng, Ziyang Lu, Yong Li, and Depeng Jin. 2019. Deepstn+: Context-aware spatial-temporal neural network for crowd flow prediction in metropolis.In Proceedings of the AAAI conference on artificial intelligence, Vol. 33. 10201027. Jing Ma, Yushun Dong, Zheng Huang, Daniel Mietchen, and Jundong Li. 2022.Assessing the causal impact of COVID-19 related policies on outbreak dynamics:A case study in the US. In Proceedings of the ACM Web Conference 2022. 26782686.",
  "Stephen L Morgan and Christopher Winship. 2015. Counterfactuals and causalinference. Cambridge University Press": "ollama. 2024. ollama. Judea Pearl. 2009. Causal inference in statistics: An overview. (2009). Xie Runfeng, Cui Xiangyang, Yan Zhou, Wang Xin, Xuan Zhanwei, Zhang Kai,et al. 2023. Lkpnr: Llm and kg for personalized news recommendation framework.arXiv preprint arXiv:2308.12028 (2023). Patrick Schwab, Lorenz Linhardt, Stefan Bauer, Joachim M Buhmann, and WalterKarlen. 2020. Learning counterfactual representations for estimating individ-ual dose-response curves. In Proceedings of the AAAI Conference on Artificial",
  "Chaoming Song, Zehui Qu, Nicholas Blumm, and Albert-Lszl Barabsi. 2010.Limits of predictability in human mobility. Science 327, 5968 (2010), 10181021": "Xuan Song, Quanshi Zhang, Yoshihide Sekimoto, Ryosuke Shibasaki,Nicholas Jing Yuan, and Xing Xie. 2016. Prediction and simulation of humanmobility following natural disasters. ACM Transactions on Intelligent Systemsand Technology (TIST) 8, 2 (2016), 123. Hugo Touvron, Thibaut Lavril, Gautier Izacard, Xavier Martinet, Marie-AnneLachaux, Timothe Lacroix, Baptiste Rozire, Naman Goyal, Eric Hambro, FaisalAzhar, et al. 2023. Llama: Open and efficient foundation language models. arXivpreprint arXiv:2302.13971 (2023).",
  "Xinglei Wang, Meng Fang, Zichao Zeng, and Tao Cheng. 2023. Where would igo next? large language models as human mobility predictors. arXiv preprintarXiv:2308.15197 (2023)": "Xinlei Wang, Maike Feng, Jing Qiu, Jinjin Gu, and Junhua Zhao. 2024. From newsto forecast: Integrating event analysis in llm-based time series forecasting withreflection. arXiv preprint arXiv:2409.17515 (2024). Xin Wang, Shengfei Lyu, Xingyu Wu, Tianhao Wu, and Huanhuan Chen. 2022.Generalization bounds for estimating causal effects of continuous treatments.Advances in Neural Information Processing Systems 35 (2022), 86058617. Xiaoyang Wang, Yao Ma, Yiqi Wang, Wei Jin, Xin Wang, Jiliang Tang, CaiyanJia, and Jian Yu. 2020. Traffic flow prediction via spatial temporal graph neuralnetwork. In Proceedings of the web conference 2020. 10821092. Yingzi Wang, Nicholas Jing Yuan, Defu Lian, Linli Xu, Xing Xie, Enhong Chen,and Yong Rui. 2015. Regularity and conformity: Location prediction using het-erogeneous mobility data. In Proceedings of the 21th ACM SIGKDD internationalconference on knowledge discovery and data mining. 12751284. Zhaonan Wang, Renhe Jiang, Hao Xue, Flora D Salim, Xuan Song, and RyosukeShibasaki. 2022. Event-aware multimodal mobility nowcasting. In Proceedings ofthe AAAI Conference on Artificial Intelligence, Vol. 36. 42284236. Jason Wei, Xuezhi Wang, Dale Schuurmans, Maarten Bosma, Fei Xia, Ed Chi,Quoc V Le, Denny Zhou, et al. 2022. Chain-of-thought prompting elicits reasoningin large language models. Advances in neural information processing systems 35(2022), 2482424837.",
  "CNews Articles with LLMs Generated Answers": "In this section, we provide some cases of news articles and theirstructured information generated with LLMs. Due to copyrightand other policies, we cannot share original articles, but we canprovide links to the corresponding news articles (English version,not original Japanese news article).Typhoon Khanun:Answer 1: Ive identified the most influential events in the newscontent: Typhoon No. 6 is expected to approach Okinawa on Au-gust 3, (predicted closest approach). Answer 2: 2023-08-03 06:00:00Answer 3: Here are my evaluations:Where: People in Okinawa and Amami regions may need tomove to safer areas or evacuation centers, away from coastal areasprone to storm surges and flooding.Who: Residents, commuters, and tourists in Okinawa and Amamiregions, especially those living in low-lying areas or near the coast,will be affected by the typhoon.When: The event is ongoing, with the typhoon expected to ap-proach Okinawa on August 3. (Note: The news release time wasAugust 2, 07:17:28)How: If necessary, people should move to safer areas or evacua-tion centers using safe routes and modes of transportation, such asofficial evacuation buses or private vehicles, while following instruc-tions from local authorities and staying informed about weatherupdates.Answer 4: No.Answer 5: Sumidagawa Firework:Answer 1: The most influential event identified is the resumptionof the \"Sumida River Fireworks Festival\" after a 4-year hiatus dueto the COVID-19 pandemic. This event will take place on July 29thand is expected to attract approximately 950,000 people.Answer 2: 2023-07-29 19:07:04Answer 3: Here are my evaluations:Where: If necessary, people may need to move away from theSumida River area in Tokyo to avoid congestion and large crowds.Who: People who plan to travel or move around in the SumidaRiver area in Tokyo, particularly those who live or work nearby,tourists, and festival-goers will be affected by the event.When: The event happened on July 29th (the day of the newsrelease).How: If necessary, people should consider using public trans-portation, rescheduling their travel plans, and planning alternativeroutes to avoid congested roads and traffic jams.Answer 4: No.Answer 5:",
  "DAbout publicity of source code and data": "We have already open-sourced the code for this research on GitHub,which can be accessed at this github repository. However, due todata privacy policies, we cannot share human mobility data and theoriginal text-based news articles (though the news articles are pub-licly available). To ensure that our source code can be implementedsmoothly, we synthesized a portion of the data with additionalnoise, enabling our source code to be run without issues.",
  "EPrompts for LLMs": "In this section, we list all the prompts used to extract structuredinformation and human intentions from news articles. Specifically,we first input the release time of the news (to assist LLMs in infer-ring the timing of public events), along with the title and content ofthe news. We then engage the LLMs in a dialogue-based chain-of-thought paradigm by sequentially asking the following questions.This process ultimately generates human intentions, which serveas treatment variables in our causal inference framework.",
  "Prompt 5: Human Intentions": "Background: Most news related to economic, politics, culture,and history issues usually have no effect on human mobilitybecause they do not relate to peoples daily life.- Slight disasters, such as light earthquakes and tsunamis,or some local events (like political events) may also have noeffect on human mobility in Japan.- Only events that happened close to the release time (withinseveral hours) may have an influence on human mobility.Task: Score the news text based on the following aspects (0-100, where a higher number means higher agreement):Q1. To what extent do the events described in the news makepeople leave the area because they are dangerous?Q2. To what extent do the events described in the news makepeople stay in the area because it is better not to move?Q3. To what extent do the events described in the news makepeople visit the area because they are interesting events?Q4. To what extent do the events described in the news makepeople keep their daily routine as these events are not impor-tant to daily life?Q5. To what extent do the events described in the news lead tointerruption of economic activities, such as business closuresor work stoppages?Q6. To what extent do the events described in the news affecttransportation conditions, such as traffic congestion or roadclosures?Q7. To what extent do the events described in the news impactpublic health and safety, leading to decisions to leave or avoidcertain areas?Q8. To what extent do the events described in the news involvegovernment or official instructions that influence peoplesmovements?Q9. To what extent do the events described in the news affectthe availability of public services, such as school closures orinterruptions in medical services?Q10. To what extent do the events described in the news lasta long time (like one day)?Expected response: A list of 10 numbers between 0 and 100."
}