{
  "Instituto de Fsica, Universidade de So Paulo, C.P. 66318, 05389-970 So Paulo, So Paulo, Brazil": "In view of the recent discovery of Tcc, which can be described as a DD molecular state, we perform astudy of the KDD system, and its extension to studying KDD, where DD is bound as a spin 1 Tcc-likestate, to search for the possible existence of exotic mesons with the open flavors ccs being part of their quarkconfiguration. Considering the additional attractive interactions present in the KD and KD subsystems, wherethe states Ds0(2317) and Ds1(2460) are generated, we solve the Faddeev equations considering the fixed-centerapproximation for the mentioned three-body systems and find the existence of two doubly charmed K-likemesons, Kcc(4309) and Kcc(4449), with quantum numbers I(JP ) = 1/2 (1). Considering the respectivethree-body thresholds of the two systems, both Kcc-states are bound by around 60 MeV. An experimentalconfirmation will bring evidence for the existence of a degree of exoticity beyond charm +2.",
  "I.INTRODUCTION": "The search for the existence of exotic hadrons is at theforefront of hadron physics, deepening our understanding ofquantum chromodynamics (QCD). A major breakthrough oc-curred in 2003 when the charmonium-like meson c1(3872)was discovered by the Belle Collaboration . After onedecade, the charged charmonium meson Zc(3900), the firstconfirmed hadron with a minimal four-quark content, wasobserved by the BESIII and Belle experiments . Most re-cently, the LHCb Collaboration reported the observation of theT +cc state , which is the first doubly charmed exotic mesonobserved. Along with a series of XYZ states, other resonancessuch as the lightest positive parity charmed states Ds0(2317)and Ds1(2460) , the fully charmed tetraquark candidateX(6900) and the Pc pentaquarks , the existence ofexotic hadrons has expanded our knowledge of the workingof strong interactions between heavy quarks, as well as be-tween heavy and light quarks,but particularly in the charmsector .From the theoretical side, there are tremendous efforts inthe hadron physics community to explain the nature of exoticcharm hadrons (we refer the interested readers to the mostrecent reviews for more details ). Here we would liketo emphasize the relevance of the hadronic molecule picture,which provides a natural explanation of the properties observedfor many of the exotic states found as two-hadron molecules.For instance, c1(3872) and Zc(3900) are expected to be s-wave D D + c.c. molecules, and T +cc can be interpreted as abound state of the DD system . As a natural extensionof the existence of hadron molecules of a two-body nature, onecan expect the existence of three-body molecules or multi-body",
  "states in the charm sector, likewise the deuteron, triton, andnucleus in nuclear physics. Such kind of research tendency hasbeen highlighted in the last years, for instance, in Refs.": "Recently, the interest in the existence of exotic mesons withstrangeness seems to grow increasingly, and several theoreti-cal studies have been made investigating the interactions be-tween mesons with strangeness, like K, and charm mesonslike D/ D, D/ D . These investigations are moti-vated by the strong s-wave attractive interactions present in theKD and KD systems, which give rise to the Ds0(2317)and Ds1(2460) resonances, respectively . Havingstrange and charm quarks, different super-exotic structures,non-compatible with the quantum numbers obtained from thetraditional quark model, can emerge in these systems, likeheavy K hexaquarks with hidden charm (ccsqqq) or doublycharmed states with strangeness (ccsqqq). The KD D and KD D systems belong to the former men-tioned case, i.e., hidden charm and open strangeness. As shownin Refs. , considering s-wave interactions, two hiddencharm Kcc mesons are found. In particular, a state about 50-80 MeV below the three-body threshold is obtained in theKD D system with quantum numbers of isospin I and spin-parity JP given by I(JP ) = 1/2(1). In the case of theKD D system, a state with binding energy around 50 MeVand I(JP ) = 1/2(0) is found as a consequence of the three-body dynamics involved in these systems. In the case of theeven more exotic quantum numbers of open strangeness anddouble charm, the existence of such states has been claimedin Refs. from the dynamics involved in the KDDsystem by using different approaches . In both thestudies, a doubly charmed Kcc bound state is predicted with abinding energy around 65 90 MeV . Such a systemhas also been studied in a finite volume and exper-imental searches for such a state have already started ,although better statistics are necessary to reach to any con-clusion. The KDD has been investigated in Ref. by",
  "arXiv:2409.16281v2 [hep-ph] 5 Dec 2024": "solving the Schrdinger equation with the Born-Oppenheimerapproximation, and, after the discovery of T +cc, the interest insuch a system has grown. Most recently, the former system hasbeen investigated by using the chiral quark model and thelattice effective field theory . The result of Ref. con-firmed the existence of a bound state as claimed in Ref. ,with a binding energy around 44 84 MeV. Furthermore, theKDD system has been investigated in Ref. by usingthe Ds1D quasi-two body scattering, finding loosely boundstates with spin-parity JP = 0, 2. Similarly, other three-body systems, such as those involving the vector meson K",
  "instead of the pseudoscalar K meson, and/or their extension tothe bottom sector, with the B/ B, B/ B pairs instead of theD/ D, D/ D mesons have been investigated in Refs.": "It is in order here to mention that despite having experimen-tal access to energies 4000 MeV, finding of no new K orK mesons have been claimed. A quick look at the reviewof the Particle Data Book (PDG), shows an inactivity in thespectroscopy of strange mesons, with K(1680) being the lat-est JP = 1 state with strangeness observed. Observation ofsome of the aforementioned exotic mesons with strangenesshas been claimed in the J/K invariant mass distributionobtained from weak decays of the B meson , and it issimply a matter of time before experimental investigations ofsuch mesons will be carried out. Inspired by the growing interest in the spectroscopy of exoticmesons with strangeness, we extend our previous investiga-tion of the KD D system to analyze the formation ofthree-body states in the KDD system. This is done by usingthe fixed-center approximation (FCA) to solve the Faddeevequations , an approximation which is valid for study-ing the formation of states below the three-body threshold ofa system where its dynamics can be considered as that of aparticle interacting with a heavier cluster (for detailed discus-sions, see the review in Ref. and for applicability limits seeRefs. ). Having this in mind, we consider in this casethat the heavy DD system clusters as Tcc , and the lightK-meson scatters off the D and D mesons forming Tcc. Dueto the description of Ds0(2317), Ds1(2460) and Tcc as statesgenerated from the KD, KD and DD (coupled-channel)interactions, respectively, a doubly charmed bound state withpositive strangeness is obtained. Besides, we consider thatthe generation of a Tcc-like state is also predicted from theinteraction of DD with JP = 1+ in Ref. by solvingthe Bethe-Salpeter equation with a coupled channels approach.Thus, we find it interesting to extend our FCA study to theKDD system and explore the possible existence of a boundstate. The paper is organized as follows. In Sec. II, we outlinethe main aspects of the formalism employed to investigate thethree-body systems. The results obtained for the KDD andKDD systems, along with the corresponding discussion,are presented in Sec. III. Finally, we summarize the mainconclusions obtained in Sec. IV.",
  "II.FIXED-CENTER APPROXIMATION TO FADDEEVEQUATIONS": "Generally, three-hadron systems can be studied by solvingthe three-coupled integral Faddeev equations , which al-lows to determine the T-matrix of the system as a sum of threepartitions T1, T2 and T3, each of them containing the infor-mation of the scattering where particle i = 1, 2, 3 starts beinga spectator in the lowest order contribution to the scatteringseries in Ti. However, solving such equations is not an easytask, especially, when coupled channels are involved, and, inmany occasions, approximate methods are often implementedto simplify the Faddeev equations. In this context, the rele-vance of the use of effective Lagrangians to determine the inputtwo-body t-matrices by considering the on-shell factorizationof the Bethe-Salpeter equation and the use of these t-matricesas input for the Faddeev equations, have allowed studying alarge variety of three-body systems with a large number ofcoupled channels .Within the different approximate methods to solve the Fad-deev equations, there is one which is especially suitable forstudying the scattering between a cluster (R12) composedof two particles, which we denote as particles P1 and P2,whose mass is larger than the other particle of the system,which we denote as particle P3 (e.g., the K meson in thecurrent work), which is known as the fixed center approxima-tion . In this case, the scattering between thethree particles resembles that of a particle with a fixed, heavier,scattering center formed by the other two particles and sucha description is a rather good approximation when studyingthe formation of three-body states below the three-body thresh-old . For the technical details of FCA, we refer thereader to Refs. . Here, we summarize the mainaspects of the formalism. Within the fixed-center approxima-tion, the scattering consists of a series of contributions whereparticle 3 scatters off particles 1 and 2 forming the cluster, hav-ing then two series of contributions (see ): those whereparticle 3 interacts first with particle 1 of the cluster and startsrescattering with the two particles forming the cluster (T31partition); Those contributions in which particle 3 starts inter-acting first with particle 2 of the cluster and keeps rescatteringwith the particles of the cluster (T32 partition). Then, the totalscattering amplitude Ttol is given as follows:",
  "(1)": "As illustrated in Figs. 1-(a1) and -(b1), the amplitudes t31 andt32 represent the single scattering of the K meson with theR12 cluster: t31 denoting the K-P1 interaction and P2 as aspectator, and t32 for the K-P2 interaction with P1 as a spec-tator. Through the rescattering procedure, K can propagatethrough the cluster to trigger the double scattering (t31 G0 t32and t32 G0 t31), the triple scattering, etc. The loop function G0in Eq. (1) represents the Green function of the K meson prop- t31 K P1 P2 G0 t31 t32 K P1 P2 K P1 P2 t31t31 t32 K P1 P2t32 K P1 P2G0 t32 t31 K P1 P2t32t32 t31",
  "t31t32G20.(2)": "In Eq. (2), t31 and t32 depend, respectively, on the invariantmasses of the (31) and (32) subsystems, which are functionsof the center-of-mass energy, s, and the mass of the clusterR12, while G0 depends on s and the mass of the cluster R12.The latter is fixed to the mass of the particle obtained from theinteraction of particles 2 and 3 (in this case, Tcc or Tcc likestates). The t31 and t32 amplitudes, at the same time, depend onthe weighted combinations of the different isospin t-matricesdescribing the (31) and (32) subsystems, respectively.In the following, we present the steps followed to find theexpression of t31/32 in terms of the isospin t-matrices relatedto the (31)/(32) subsystems and provide the expression of G0for the specific three-body systems considered in the presentwork, i.e. KDD and KDD.",
  "A.Singe scattering amplitudes": "First, to illustrate the method, we focus on the KDD sys-tem, where DD is considered to form the Tcc state withisospin I = 0 and JP = 1+ . In the isospin basis, Tcc isdescribed by the ket |DD; I = 0, Iz = 0, which, in terms ofthe charged states, can be written as",
  "for a certain isospin I of the system. In Eq. (10), g is a diagonalmatrix in the coupled-channel space whose elements gi arethe two-hadron loop functions for the channels i. These gi": "are regularized by introducing subtraction constants and weconsider the same values as those used in Refs. . Thekernel vI in Eq. (10) is a matrix whose elements vIij describethe transition amplitude i j and they are obtained from aLagrangian based on the chiral and heavy quark symmetries.Here we follow the approach of Refs. , where the KDand KD interaction kernels are determined from the lowestorder chiral Lagrangian based on heavy-quark spin symmetry.In the case of total isospin I = 0, the KD() system, to-gether with D()s , are considered as couple channels whensolving the Bethe-Salpeter equations. At leading order, vI=0",
  "4f 2 . (15)": "After projecting the aforementioned amplitudes in the s-wave, they are plug into Eq. (10), obtaining in this way thetwo-body t-matrices tI=0,1KDand tI=0,1KD in Eqs. (8) and (9).As a consequence of the dynamics considered, poles in thet-matrices for the KD and KD coupled-channel systemsin the isospin 0 sector are found at 2312 MeV and 2452MeV, respectively, which can be associated with Ds0(2317)and Ds1(2460). The dominant molecular nature obtained forDs0(2317) and Ds1(2460) has been confirmed from latticeQCD studies .Furthermore, as a consequence of the different normaliza-tions between the scattering matrix of a three-body system andthat of a particle+cluster system, with the cluster arising fromthe interaction of two particles, we need to normalize the t31",
  "m2t32,(16)": "where MR represents the mass of the cluster, and mi, i = 1, 2,the mass of the particle Pi in the cluster.As a final comment in this section, we would like to mentionthat the arguments of t31 and t32 are s31 and s32, which arethe invariant masses of the KP1 and KP2 systems. The lattercan be related to the center-of-mass energy of the three-bodysystem, s, via the following equations :",
  "m21 + p2,2(p) =": "m22 + p2. Since the form factor FR(q) is relatedto the wave function of the R12 cluster, the upper integrationlimit R in Eq. (20) corresponds to the value of the momentumcutoff considered in the study where the generation of thecluster from the interaction of particles P1 and P2 is foundwhen solving the Bethe-Salpeter equation, where two-hadronloop functions need to be regularized . For the presentsystems under study, i.e., KDD and KDD, we list inTable I the values considered for the cluster masses MR ofDD and DD and the corresponding cutoff R, valueswhich are based on the results found in Refs. . Theresulting form factors FR(q) are shown in for the DDand DD clusters. As can be seen, they start from 1 andgradually decrease to 0 as q increases. Also, for q 2R,both form factors are exactly zero due to the integral bound|p q| < R present in Eq. (20). Furthermore, in we present the real and imaginaryparts of the Green function G0(s) for the case of the KDDand KDD systems. As can be seen, it presents the typicalfeature of a two-particle loop function, i.e., a cusp at the m3 +MR threshold for its real part and a non-zero imaginary part forenergies above that threshold, which is s = 4370.5 MeV forthe KDD system, and s = 4511.2 MeV for the KDD",
  "III.RESULTS AND DISCUSSION": "In this section, we present the three-body scattering ampli-tudes for the KDD and KDD systems for the total isospinI = 1/2 and spin-parity JP = 1. Using the expressions fort31 and t32 in Eqs. (8), (9), along with the weight factors inEq. (16), we can determine Ttol from Eq. (2) for the K(DD)and K(DD) systems, as a function of s.In , we present the modulus squared |Ttot|2 for thetransition KTcc KTcc as a function of s. A narrow peakaround 4309 MeV is observed, indicating the existence ofa KDD bound state with a binding energy BKDD 62MeV. This state is dynamically generated through the non-perturbative iteration of the single scattering amplitudes t31 andt32, as given in Eq. (2). To show this explicitly, we also presentin the result obtained from |t31 + t32|2, where t31 + t32represents the input for Eq. (2). As can be seen, two nearbypeaks are observed at s = 4312.7 MeV and 4313.6 MeV,which are a reflection of the two-body resonances Ds0(2317)and Ds1(2460) generated in the two-body systems. These twopeaks, by summing all the rescattering contributions of particle3 with particles 1 and 2, ultimately lead to the formation of theKDD bound state at s = 4309 MeV.For a better understanding of the dynamics involved in thegeneration of the aforementioned three-body state, we showthe modulus squared of the two-body scattering amplitudestKD and tKD with I = 0, 1 as a function of the correspond-ing two-body invariant masses on the right panel of .At the energy of the three-body bound state, i.e., s = 4309MeV, the corresponding energies of the KD and KD sub-systems are sKD = 2307 MeV and sKD = 2448 MeV[see Eq. (17)]. As can be seen in , this is precisely theenergy region in which Ds0(2317) and Ds1(2460) are gen-erated from, the KD and KD interactions, respectively, inisospin I = 0 and the latter amplitudes are much bigger thantheir I = 1 counterparts. In this way, we can conclude that theDs0(2317) and the Ds1(2460) are generated in the (31) and(32) subsystems, while Tcc is formed in the DD subsystems.All these attractive interactions produce a state which is 4MeV away from the position of the peaks seen in |t31 + t32|2.Next, we focus on the K(DD) system, for which we showthe modulus squared of the T-matrix in the isospin I = 1/2and spin-parity JP = 1 as a function of the center-of-massenergy in . As can be seen, there exists a bound state witha mass of 4449 MeV, which is 64 MeV below the three-bodythreshold mK + 2mD. By considering |t31 + t32|2 alone, wesimply find the reflection of the Ds1(2460) state originatedfrom the KD interaction, whose mass has a related s valueof 4454 MeV. It should be recalled that the two-body states aregenerated in the presence of a third particle, and are expectedto appear at a total energy which depends on the mass of thethird particle and the peak position in the invariant mass of theresonating pair. Only when all contributions represented in are implemented via the resolution of Eq. (1), a three-body state, which is 5 MeV away from the position of thepeaks in |t31 + t32|2, is observed. Furthermore, we present|tKD|2 for I = 0, 1 in the right panel of as a functionof the invariant mass of the system. Similarly to the KDD",
  "tI=1KD": ". Left panel: Modulus squared of the total scattering amplitude for the KDD system with isospin I = 1/2. The thresholds related tothe KTcc and KDD systems are indicated by vertical lines. Right panel: Modulus squared of the two-body scattering amplitudes for theKD system with isospin I = 0, 1. The (blue) vertical line marks the position sKD = 2448 MeV, which is the value of that invariant massfor a center-of-mass energy of s = 4449 MeV, i.e., the mass associated with the KDD bound state formed. system, the KD interaction with I = 0 is much strongerthan that with I = 1 as a consequence of the generation ofDs1(2460). As can be also seen, for the s value at whichthe three-body state is found, the KD interaction generatesDs1(2460), which together with the formation of a Tcc likestate with spin 1 in the DD system , it produces such astrong attraction which binds the three-body system.",
  "We summarize our results for the masses and binding ener-": "gies of the states obtained in the KDD and KDD systemsin Table II, and compare them with the previous calculationsavailable for the KDD system with the same quantum num-bers . Our result for Kcc(4309) is located in betweenthe two previous estimations. Such uncertainties in the massesare common among hadronic models based on different meth-ods to study the interactions between the particles constitutingthe system. To be more specific, in Ref. , the one-pion-",
  "Ref. 4318(4)54(4)": "exchange potentials among the two-body subsystems presentin the KDD system are used within the Born-Oppenheimerapproximation to determine the wave function of the systemand find the corresponding binding energies. In Ref. , theauthors consider chiral interactions for KD and KD beyondthe leading order, along with the lowest order DD poten-tial. They obtain a KDD bound state with a binding energyranging from 44 to 84 MeV by solving the three-body systemwithin the lattice effective field theory framework .In spite of the uncertainties inherent to the considerationof different inputs and methods employed to determine thethree-body T-matrix, there is no doubt that the generation ofa three-body state with a mass 4300 MeV is obtained withexotic quantum numbers of strangeness +1 and charm +2,and JP = 1. We also predict the existence of a JP = 1state with strangeness +1, charm +2, and a higher mass asa consequence of the KDD dynamics. It should be notedhere that the KDD dynamics produces a state slightly morebound than the one in KDD, a result which is mainly dueto the fact that the input KD interaction is slightly moreattractive than the KD interaction. This can be deduced fromthe binding energy of the bound states obtained ( 52 MeVin the case of the KD system and 50 MeV for the KDsystem). Furthermore, the DD interaction considered is alsomore attractive than that of DD, as can be deduced from theresults shown in Table I. We should, however, mention that adifference of the order of 2 MeV in the binding energies ofthe states is compatible with the expected uncertainties in theinputs, making it difficult to affirm with certainty that KDD interaction is more attractive than that of KDD.Future experimental searches will be relevant for the confir-mation of these states. Considering the internal structures ob-tained for the aforementioned states, Kcc(4309) can decay, forexample, into two particle final states like DDs and DDs viaa mechanism involving triangular loops. Similarly, Kcc(4449)can decay into two-body channels like DDs and DDs. The corresponding calculation of these partial decay widths is cur-rently in progress. Feasible experimental searches of theseKcc states could involve the reconstruction of the D()D()sinvariant mass distribution from their production in (1S, 2S)inclusive decays or from direct production in e+e collisions,similar to the study in Refs. . The recent progress inthe studies of doubly heavy-flavored hadrons within latticeQCD shows that the exploration of the existence ofKcc is also plausible in such a framework.IV.SUMMARY In this work, we have investigated the three-body systemsKDD and KDD to search for potential exotic states withopen strange and double charm flavor. Inspired by the recentobservation of the Tcc state by the LHCb Collaboration, weconsider the scattering of a Kaon with the DD and DD systems, where DD clusters as Tcc, while DD forms a Tcclike state, as shown in Refs. , with both clusters havingI = 0 and JP = 1+. Besides this, the two-body KD andKD amplitudes in the I = 0, 1 sectors are well constrainedfrom the heavy-quark and chiral symmetries, giving rise tothe generation of the Ds0(2317) and Ds1(2460) resonances.Through repeatedly scattering of the light K meson off theparticles forming the heavy clusters, we evaluated the three-body amplitudes by using the fixed-center approximation tothe Faddeev equations. We find two bound states, namedKcc(4309) and Kcc(4449), with quantum numbers I(JP ) =1/2(1) for the KDD and KDD systems, respectively.The corresponding binding energies are of the order of 60 MeV.We hope this work encourages future experimental searchesfor these hexaquark mesons containing ccs open flavors. This work was partly supported by the Deutsche Forschungs-gemeinschaft (DFG, German Research Foundation), throughthe Research Unit (Projektnummer 458854507FOR 5327),and the Cluster of Excellence (PRISMA+ EXC 2118/1)within the German Excellence Strategy (Projektnummer39083149), CNPq ( K.P.K: Grants No. 407437/ 2023-1 andNo. 306461/2023-4; A.M.T: Grant No. 304510/2023-8), andFAPESP (K.P.K.: Grant Number 2022/08347-9; A. M. T.:Grant number 2023/01182-7)."
}