{
  "ABSTRACT": "Split Learning has been recently introduced to facilitate applica-tions where user data privacy is a requirement. However, it hasnot been thoroughly studied in the context of Privacy-PreservingRecord Linkage, a problem in which the same real-world entityshould be identied among databases from dierent dataholders,but without disclosing any additional information. In this paper,we investigate the potentials of Split Learning for Privacy-PreservingRecord Matching, by introducing a novel training method throughthe utilization of Reference Sets, which are publicly available datacorpora, showcasing minimal matching impact against a traditionalcentralized SVM-based technique.",
  "INTRODUCTION": "The entity resolution problem boils down to identifying the samereal world entity in distinct datasets. When these entities are struc-tured in relational records, we refer to the record linkage problem.As these datasets originate from databases of dierent dataholders,common unique identiers are not usually available. In this case,combinations of attributes forming a candidate key may be em-ployed. When combined, these attributes, called quasi-identiers,can uniquely identify an entity.A basic problem with quasi-identiers is that they are usuallythe result of manual input. As such, they suer from problems asmisspellings and typos. To this end, in the case of strings, to be ableto compare possibly misspelled attributes from dierent recordsdistance or similarity measures are used with certain thresh-olds. When a pair of records agrees within these thresholds foreach of its corresponding attributes, then this pair of records isconsidered as matched and these two records are linked.What has been described so far is the classical version of therecord linkage problem. However, in the recent years, the situa-tion has become even more complicated, including a variety of rea-sons, ranging from emerging privacy-oriented legislation aroundthe world, such as GDPR or HIPAA, business condentiality interms of competition, and so on. To this end, the direct plaintextcomparison of record attributes becomes problematic as it revealssensitive or classied information. A typical example of such a case is linking patients records from datasets of dierent organizations,e.g. in terms of medical research.To address these problems, privacy-preserving techniques haveemerged where, instead of revealing the entire dataset (e.g. throughtransferring), only the linkage results are revealed to the datahold-ers participating in the process. This problem is called Privacy-Preserving Record Linkage (PPRL) and it aims at identifying recordsdescribing the same real world entities, i.e. individuals, across dif-ferent databases while not revealing any other information.In this work, we showcase our eorts for employing a SplitLearn-ing (SL) approach for PPRL. The proposed methodology is ver-satile and able to accommodate a variety of Machine Learning al-gorithms. To demonstrate its operation, we employ Support VectorMachines, used in the past for the classical version of the RecordLinkage problem . Split Learning is a fairly recently introducedtechnique aimed at training AI models without the need for directdata interchanges. Instead, intermediate representations, coinedas smashed data in the SL terminology are used. To utilize thismethodology we created these representations employing Refer-ence Sets (RS), i.e. publicly available corpora that can be used asan intermediate point of reference for data obfuscation .The proposed technique oers a series of advantages, comparedto state-of-the-art approaches . First, it does not require a thirdparty playing the role of linkage unit. Second, it maintains privacyas, through the use of Reference Sets, no encoded data are trans-ferred, but tensors of distances. Third, it manages to achieve a verylow loss in terms of matching accuracy. To this end, in this paper: We introduce a protocolfor Privacy-Preserving Record Match-ing utilizing SVMs for enabling Split Learning. We provide a methodology for training individual SVM mod-els at the dataholders without the need of data interchange. We provide empirical evidence of the performance of ourmethod. The rest of this manuscript is organized as follows. contains related work. In we formally present the prob-lem we address and provide the necessary prerequisites for thiswork. We present our method in and its evaluation in. Finally, we conclude and lay out our next steps in Sec-tion 6.",
  "RELATED WORK": "A recent survey on PPRL may be found in . One of the most pop-ular approaches to this problem regards the use of Bloom lters, which are combined with n-grams and the resulting bitvectors are ANDed for assessing matching status. For this purpose,a separate server referred to as the Linkage Unit is used. Our ap-proach does not require such an external entity. Furthermore, such",
  "Conference17, July 2017, Washington, DC, USAZervas and Karakasidis": "solutions have certain vulnerabilities, requiring additional harden-ing measures .Beyond Bloom Filters, bit vectors and Locality Sensitive Hash-ing have been combined , at an increased computational cost. A two-step hash method with quasi-identiers converted inton-grams is proposed in , requiring, however, a Linkage Unitand a threshold to perform approximate matching. Dierential pri-vacy has also been used for PPRL, with current solutions focusingon categorical and numerical attributes , while this work fo-cuses on strings.Cryptography-based methods have been also proposed, exhibit-ing, nevertheless, high computational cost. Homomorphic encryp-tion is also susceptible to certain types of attacks. Garbled cir-cuits , need further investigation regarding size and reusabil-ity . Fuzzy Vaults relying on polynomial reconstructionthrough interpolation, should also be further investigated in termsof matching performance.Finally, the rise of capabilities of Large Language Models (LLMs)provided a new perspective to the classical Entity Resolution prob-lem oering novel approaches (e.g. ) with LLMs used to en-hance performance. Nevertheless, to the best of our knowledge,there has not been, up to now, an approach that utilizes LLMs andpreserving privacy, at the same time.",
  "Without harming the general case, two data sources are consid-ered, called Alice () and Bob (), who respectively hold and": "records each. We denote as and the -th record of Alice andBob, respectively. We represent the -th attribute of these recordsas . and ..Privacy-Preserving Record Matching is the problem of matchingall pairs of and records referring to the same real world entity,so that no further information is revealed to , or any other partyinvolved except for the identiers of the linked s and s.As Alice and Bobsdatabases are expected to have dierent schemas,their records have dierent attributes and do not share any com-mon candidate keys. Let be Alices schema and be Bobsschema and let us assume that in these schemas of the attributesare common between the two sources forming a composite key.These attributes are quasi-identiers being names, surnames, ad-dresses, birth dates and so on, being unable each on its own touniquely identify a record. We refer to these attributes as matchingattributes or matching elds. The composite key is used to uniquelyidentify a record and as such, to determine when two records match,i.e., when they refer to the same entity, by comparing the respec-tive attributes. Considering that these data are often dirty, match-ing should rely on a similarity or distance function.Let us consider D as the domain of each matching attribute, asimilarity function () : D D [0..1] and a threshold > 0.Given records and with matching attributes .1, . . . ,. forboth Alice and Bob, we dene the following matching function",
  "Support Vector Machines": "Support-vector machines (SVMs) are machine learning mod-els that build optimal separation hyperplanes utilizable in classi-cation problems, by trying to maximize a margin, i.e. the dis-tance between this hyperplane and each of the classes to be sep-arated. For this to happen, a labeled training set is required. Fornon-linearly separable datasets, SVMs use a transformation to anew coordinate space described as the kernel trick, where similar-ity may be computed into the transformed space using the originaldataset. This is performed using certain similarity functions calledkernel functions. The Gaussian RBF kernel function is such afunction.",
  "A Split Learning-based Protocol": "To be able to perform Privacy-Preserving Matching using SplitLearning, we devised a protocol which is illustrated in Algorithm1. Initially, the matching parties agree on a common RS and the at-tributes that will be used (line 1). It is important for the RS to eitheroriginate from a totally dierent domain from the datasets or to bepreprocessed so as not to contain data that may be found withinthe matching datasets. Then, data to be matched at each dataholderare mapped to the RS to create a smashed representation, as illus-trated in line 2. Then, each dataholder separately builds its featurevectors to be used for local training (line 3). Line 4 stands for the",
  "Towards Split Learning-based Privacy-Preserving Record LinkageConference17, July 2017, Washington, DC, USA": "fourth step which is split training separately taking place at eachdataholder. After training, smashed data are exchanged (line 5). Us-ing these representations, each dataholder performs matching in-dividually (line 6). Then, the process concludes with each partydelivering matched data identiers to the other (line 7). The pro-posed protocol assumes that all communications take place usingsecure channels."
}