{
  "ABSTRACT": "The increasing interest in international travel has raised the demandof retrieving point of interests (POIs) in multiple languages. This iseven superior to find local venues such as restaurants and scenicspots in unfamiliar languages when traveling abroad. MultilingualPOI retrieval, enabling users to find desired POIs in a demandedlanguage using queries in numerous languages, has become an in-dispensable feature of todays global map applications such as BaiduMaps. This task is non-trivial because of two key challenges: (1) vis-iting sparsity and (2) multilingual query-POI matching. To this end,we propose a Heterogeneous Graph Attention Matching Network(HGAMN) to concurrently address both challenges. Specifically,we construct a heterogeneous graph that contains two types ofnodes: POI node and query node using the search logs of BaiduMaps. First, to alleviate challenge #1, we construct edges betweendifferent POI nodes to link the low-frequency POIs with the high-frequency ones, which enables the transfer of knowledge from thelatter to the former. Second, to mitigate challenge #2, we constructedges between POI and query nodes based on the co-occurrencesbetween queries and POIs, where queries in different languagesand formulations can be aggregated for individual POIs. More-over, we develop an attention-based network to jointly learn noderepresentations of the heterogeneous graph and further design across-attention module to fuse the representations of both types ofnodes for query-POI relevance scoring. In this way, the relevanceranking between multilingual queries and POIs with different pop-ularity can be better handled. Extensive experiments conductedon large-scale real-world datasets from Baidu Maps demonstratethe superiority and effectiveness of HGAMN. In addition, HGAMNhas already been deployed in production at Baidu Maps, and itsuccessfully keeps serving hundreds of millions of requests ev-ery day. Compared with the previously deployed model, HGAMNachieves significant performance improvement, which confirmsthat HGAMN is a practical and robust solution for large-scale real-world multilingual POI retrieval service. Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than ACMmust be honored. Abstracting with credit is permitted. To copy otherwise, or republish,to post on servers or to redistribute to lists, requires prior specific permission and/or afee. Request permissions from 21, August 1418, 2021, Virtual Event, Singapore 2021 Association for Computing Machinery.ACM ISBN 978-1-4503-8332-5/21/08...$15.00",
  "Multilingual POI retrieval, POI search, heterogeneous graph, graphneural network, Baidu Maps": "ACM Reference Format:Jizhou Huang, Haifeng Wang, Yibo Sun, Miao Fan, Zhengjie Huang, Chun-yuan Yuan, Yawen Li . 2021. HGAMN: Heterogeneous Graph AttentionMatching Network for Multilingual POI Retrieval at Baidu Maps. In Pro-ceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery andData Mining (KDD 21), August 1418, 2021, Virtual Event, Singapore. ACM,New York, NY, USA, 9 pages.",
  "INTRODUCTION": "As one of the key components of the search engines in almost allglobal map applications, such as Baidu Maps, multilingual POI re-trieval plays a significant role in providing on-demand map servicesas the retrieved results directly influence the success or failure ofrouting and navigation, and hence impact the long-term user expe-rience. For the 169 million Chinese tourists who traveled abroad in2019 , Baidu Maps, which covers more than 150 million POIs",
  "KDD 21, August 1418, 2021, Virtual Event, SingaporeJizhou Huang et al": "The probability from the classifier, taking the vector as input, is areliable indicator to decide the rank order of candidate POIs in themodel. The significance of this indicator has already been provedby the experimental results of both offline and online evaluations,which are reported by and , respectively.Moreover, we are curious about how much this probability fromthe intermediate vector, as a feature, can contribute to the GBRank-based multilingual POI retrieval model LTR, which has kept servingonline in the search engine of international service at Baidu Maps.From the perspective of industrial practice, we need to figure outthe relative importance of a proposed feature among all featuresleveraged by the GBRank model for multilingual POI retrieval. LTR",
  "HGAMN": "HGAMN consists of three modules: multi-source information learn-ing module, heterogeneous graph learning module, and POI rankermodule. First, we feed a query, the candidate POIs, and the historicalqueries to the multi-source information learning module to learnthe text and location representations of them. Then, we constructthe heterogeneous graph of different POIs and historical queries.The constructed graph enables us to learn the POI representationsfrom it by the heterogeneous graph learning module. Finally, wecalculate the relevance score between the representations of thequery and the candidate POIs by the POI ranker module. shows the architecture of HGAMN. Subsequently, we introducethem in detail.",
  ": The architecture of HGAMN": "text. Besides its name, a typical POI also contains other multi-sourced and heterogeneous information such as the address, cate-gory, and GPS coordinates. Utilizing such information can facilitateretrieving more relevant POIs. Here we mainly introduce the loca-tion and text representations of a query Q and a POI P,where Q and P denote a set of query and POI, respectively. 2.1.1GPS Encoding. POIs GPS coordinates are numerical pairsconsisting of longitude and latitude. However, in the online system,the coordinates are usually stored as a Geohash string for its betterproperties: (1) it is easy to be used to index the POI and (2) it isconvenient to be used to calculate the distance of two POIs.Instead of directly taking this numerical pair as a 2-dimensionalfeature vector, we use the Geohash algorithm to encode thegeographic coordinates into a short string of letters and digits.Specifically, given the latitude and longitude of a POI, theGeohash algorithm is performed as follows:",
  "= Geohash((,)) ,(1)": "where the length | | .Given the Geohash string =wx4g09np9p, we split thestring to character sequence and add [PAD] at the beginning ofthe sequence if its length is less than 12, i.e., = [[PAD], [PAD],w, x, 4, g, 0, 9, n, p, 9, p ]. Then, we transform them intocharacter embeddings X R12 , where = 64 is the dimensionof the character embedding.An essential property of Geohash string is that POIs with a longercommon prefix are closer to each other in geographic distance.Thus, the Geohash string is order-sensitive. To encode this kind ofproperty, we utilize the bidirectional gated recurrent unit to encode",
  "h = [GRU(X); GRU(X)] .(2)": "The last state h12 is used as the representation of the POIs GPS.We use this module to transform each POIs GPS coordinates intoan embedding, and obtain an embedding matrix G R| P|, where|P| denotes the size of P.We regard a querys location as the place where the user istyping in the query. Similarly, we can obtain the querys locationrepresentation G according to the users GPS coordinates. 2.1.2Text Encoding. For multilingual POI retrieval in map services,the text data such as queries, POI names, and POI addresses arecritical for improving the retrieval performance.To better handle the multilingual matching problem, we take asequence (such as a query or POI name) consisting of multilingualcharacters and alphabets as input and adopt a pre-trained languagemodel to obtain its representation.Specifically, we use the pre-trained language model ERNIE as the basic component, which shows better performance on extract-ing multilingual features and semantic information. We directlyutilize ERNIE to obtain s text representation q by:",
  "q = ERNIE([1,2, . . . ,]) ,(3)": "where [1,2, . . . ,] is the character sequence of the query.After analyzing the query logs, we found that a querys loca-tion helps retrieve the desired POI because users usually demandthe nearest target. To utilize such location features, we combine aquerys location representation with its text representation. Thus,the final representation of a query is represented as: q = q + G.",
  ": The process of constructing the heterogeneous graph G": "For each POI , we use Q to denote the matrix of the rep-resentations of the top-4 queries associated with it, i.e., Q =[q1,q2,q3,q4].For each POI , we concatenate its name and address as a longcharacter sequence and apply ERNIE to extract its text representa-tion. Similarly, we combine s location and text representationsto obtain its final representation P R1 by:",
  "Here, we introduce how to construct the heterogeneous graphfrom search logs and how to learn POI representations from theheterogeneous graph": "2.2.1Graph Construction. Multilingual POI retrieval faces the vis-iting sparsity and multilingual matching problems. To alleviate thevisiting sparsity problem, we construct edges between differentPOI nodes to link the low-frequency POIs with the high-frequencyones, which enables the transfer of knowledge from the latter tothe former. Furthermore, to mitigate the multilingual matchingproblem, we construct edges between POI and query nodes basedon the co-occurrences between queries and POIs. Thus, the graphcan aggregate queries in different languages and formulations foreach POI. As shown by , both types of nodes and edgesconstitute a heterogeneous graph G(V, E).The construction of the heterogeneous graph is as follows. Ausers search behaviors produce a visited POI sequence in searchlogs. We extract relations of POI-POI from the historical searchsequences. A search sequence is a period of time that consists ofa sequence of interactions for the similar information need ,which can reflect the similarities of successive POIs. To capture thesimilarity between two POIs, we define the co-occurrence frequencyof them in the search sequences as the graphs edge. To extract thiskind of relation, a 2-gram sliding window is perform on the searchsequences. We apply the pointwise mutual information (PMI) to",
  "(5)": "where # (, ) is the number of sliding windows that containboth and . # denotes the number of sliding windows, and# () is the number of sliding windows that contain .After typing in a query, a user would click on the desired POIfrom a list of ranked POIs that the POI search engine suggested. Thisprocess produces a large-scale query-POI pairs where the multilin-gual expressions of each POI can not only effectively mitigate themultilingual matching problem, but also bridge the semantic gapbetween queries and POIs. For example, users usually make spellingerrors or use abbreviations, which would lead to poor results whendirectly matching query and POI text information. Motivated bythis observation, we try to model the relations between historicalqueries and POIs.Specifically, we select the top-4 searched queries for each POIand connect an edge for every POI and its historical query nodesfor POI-Query relations. In this way, we can build connectionsbetween POIs and Queries. Formally, the adjacency matrix can beformulated as follows:",
  "where , is the frequency of query-POI pair (, ), Q": "2.2.2Heterogeneous Graph Learning. To learn representations ofPOIs and queries from the heterogeneous graph, we use attention-based graph neural network to aggregate neighbors for generating adistributed representation of each node based on the heterogeneousgraph, which enables us to learn a high-level hidden representationfor each vertex.As shown by , there are two types of nodes (POI nodeand query node) and two types of edges (POI-POI correlation andPOI-Query semantic relation) in the graph. For a certain node , its",
  "POI Ranker": "The POI ranker module calculates the relevance between a query and a candidate POI based on the learned representations. Thismodule also considers s historical queries Q when predictingthe relevance since Q conveys substantial evidence to bridge thesemantic gap between and . Both and Q contain essentialinformation for calculating the relevance, but their importance isdifferent. How to automatically determine the importance of themfor measuring the relevance is still a challenge.In this paper, we apply an attention module to automatically de-termine their importance and fuse them as a feature vector. Specifi-cally, we regard the representation of as the key, while regard therepresentations of and Q as the value. We stack the representa-tions of and Q as a new matrix M = [P, Q ]. Each attentionweight is defined as follows:",
  "=1log ( |, , G) ,(14)": "where |P| denotes the amount of total training POIs, and is thelabel of the instance POI .To increase the number of training instances inside each batchand improve the computing efficiency, we apply an in-batch nega-tive sampling strategy . Specifically, assuming that we have queries in a mini-batch, each one is associated with a relevant POI.Let Q and P be the ( ) matrix of query and POI embeddings ina batch of size . S = QP is a ( ) matrix of similarity scores,where each row corresponds to a query, paired with POIs. In thisway, we reuse computation and effectively train on 2 (, )query-POI pairs in each batch. Any (, ) pair is a positive ex-ample when = , and negative otherwise. This procedure creates training instances in each batch, where there are 1 negativePOIs for each query.",
  "HGAMN is the complete model defined in . In thissetting, we use it independently as a POI retriever to returnthe desired POIs": "HGAMN w/o POI-POI Graph. In this setting, we removethe edges between different POIs in the graph learning mod-ule described in .2.2. The removed part is designedto mitigate the visiting sparsity problem. HGAMN w/o POI-Query Graph. In this setting, we removethe edges between different POIs and queries in the graphlearning module described in .2.2. The removed partis designed to mitigate the multilingual matching problem. HGAMN w/o Heterogeneous Graph. In this setting, weremove the entire graph learning module described in Sec-tion 2.2.2 and directly use the query and POIs representa-tions described in section 2.1 for calculation.",
  "Online Model Group": "LTR is the basic model for online multilingual POI retrievalsystem at Baidu Maps . It adopts GBRank asthe specific learning-to-rank model. This model mainly usesheuristic features, including the popularity of POIs, the de-mographic information on users, and the spatial-temporalfeatures of each POI, such as the frequency of search onspecific types of POIs at different times and locations. LTR + HGAMN is trained with all the features employedby LTR and the similarity feature computed by HGAMN.It is expensive to directly deploy HGAMN online to servehundreds of millions of requests every day. For this reason,we instead use the feature generated by HGAMN offline asone of the features fed to the LTR model.",
  "Offline Evaluation": "3.2.1Dataset. The services of Baidu Maps cover over 200 coun-tries and territories worldwide, where the sessions on POI searchdominate about 80% search traffic. A POI search session refers to asequence of interactions between a user and the POI search engine.We collect a large number of POI search sessions from the searchlogs of international services at Baidu Maps for offline evaluation.Each example of the dataset consists of the query typed by theuser, the POI list that the POI search engine suggested, and theexact POI that the user clicked. shows the statistics of thelarge-scale dataset sampled from one-month search logs for model",
  "Total12,190,5742.8": "3.2.2Evaluation Metrics. We use several widely-used metrics ininformation retrieval for offline performance evaluation.The first group of metrics, Success Rate (SR) at Top-K (SR@K),is the coarse metric that denotes the average percentage of ground-truth POIs ranked at or above the position K in the ranked listprovided by a POI retriever. Because of the limited space for displayon mobile phones, Baidu Maps can mostly display 3 POIs on thefirst screen when the input keyboard is launched and at most 10POIs when the input keyboard is closed. Therefore, we considerSR@1, SR@3, and SR@10 for offline evaluation.Another group of fine-grained metrics, including Mean Recip-rocal Rank (MRR) and normalized Discounted Cumulative Gain atTop-K (nDCG@K), concerns more about the exact position where aPOI retriever arranges the ground-truth POI in the returned list. Weconsider nDCG@1, nDCG@3, and nDCG@10 for offline evaluationdue to the display limitations on mobile phones. 3.2.3Model Configuration. The dimensionality of POI and queryembeddings is set to 128. The sequence length of query text, POIname, and POI address is set to 30. The POI graph learning moduleconsists of two graph attention layers with output dimensionalityof = 128 and = 256, respectively. The number of heads in themulti-head attention is chosen from {1, 2, . . . , 10}, and finally, setto 4.During training, we use Adam optimizer , with the learningrate initialized to 0.001 and gradually decreased during the processof training. To prevent overfitting, we use the dropout strategy witha dropout rate of 0.5. The maximum training epoch is set to 40, andthe batch size of the training set is set to 64. 3.2.4Experimental Results. In this section, we evaluate the effec-tiveness of HGAMN for the multilingual POI retrieval task. shows the performance of offline assessments on the models men-tioned in .1. From the results, we can see that the proposedmodel HGAMN significantly outperforms all baseline methods onthe large-scale real-world dataset. Specifically, we have the follow-ing observations.(1) HGAMN significantly outperforms all conventional text re-trieval methods (i.e., DSSM, ARC-I, and Conv-DSSM). Furthermore,the HGAMN w/o POI-POI Graph model also achieves better per-formance compared with these methods. The main reason is thatthe POI-Query graph is able to model multilingual features betweena POI and its historical queries, which enables us to mitigate thegap between a query and the candidate POIs.",
  "LTR0.82530.73230.82940.85820.73230.90300.9721LTR + HGAMN0.83070.73930.83470.86270.73930.90720.9743": "(2) Compared with recently proposed neural-based POI retrievalmethods (i.e., DPSM and PALM), HGAMN achieves better perfor-mance. Although these methods combine geographic or spatial-temporal features with text representations for POI retrieval, theydo not take the POI visiting sparsity problem into account, whichis a critical problem in industrial map services. The POI-POI graphbuilds connections between low-frequency POIs and their similarhigh-frequency ones, which is able to transfer the abundant super-visory signals from high-frequency POIs to facilitate learning betterrepresentations of the low-frequency POIs. The results verify thatHGAMN is able to effectively relieve this problem.(3) After removing the POI-POI graph and POI-Query graphseparately (HGAMN w/o POI-POI Graph and HGAMN w/o POI-Query Graph), the performance of HGAMN decays considerablycompared with the complete model. This indicates that both com-ponents in HGAMN are essential for multilingual POI retrieval, andthey are complementary to each other.(4) In the last section of , we observe that the LTR modeloutperforms the single HGAMN model. The reason is that the LTRmodel is one of the typical industrial ranking models based on alarge set of time-proven high-quality features . However, afteradding the feature computed by HGAMN into the LTR model, theLTR + HGAMN model achieves significant improvements. Sinceit is challenging to create a new feature that is able to significantlyimprove the overall performance of industrial ranking models, theimprovements made by LTR + HGAMN further confirm the effec-tiveness of HGAMN. This shows that HGAMN can not only be usedas an individual ranking model, but also be used to obtain a singlestrong feature that is robust to an industrial ranking framework.",
  "Online A/B Testing": "3.3.1Traffic of Data. Before being launched in production, wewould routinely deploy the new model online and make it randomlyserve 5% traffic of the POI search. During the A/B testing period,we monitor the performance of the new model and compare it withthe previously deployed models. This period conventionally lastsfor at least one week. 3.3.2Experimental Results. We use SR@1, SR@3, and SR@10 asthe metrics for online evaluation, which are also adopted by offlineevaluation. shows the experimental results of the online A/Btesting on different models mentioned in .1. All modelswere selected by the test set for offline evaluations, and we launchedthe best-performed ones. They are tested by 5% search traffic ofBaidu Maps.",
  "LTR + HGAMN0.71730.88070.9437": "Compared with the offline evaluation results, we gain lowerresults on SR@1, SR@3, and SR@10 in the online A/B testing.The main reason is that the POI lists returned by our POI searchengine might be ignored entirely by a small proportion of users,mainly because they prefer directly typing in the full names of theirdesired POIs and then click the search button. In this interactivemode, Baidu Maps will directly provide users with the relevant POIs.This results in a phenomenon that none of the returned POIs wereclicked, which may lead to much lower performance on SuccessRate (SR). However, the relative improvements of these models areconsistent with those obtained by the offline evaluation.",
  ": Histogram of the feature importance": "GBRank can provide a score that indicates how useful a featurewas in constructing the boosted decision trees within the model,which can help investigate the impact of different features (e.g.,). The more a feature is used to make critical decisions fordecision trees, the higher its relative importance is allocated. Fig-ure 4 illustrates the weights of the top-10 most important featuresin LTR + HGAMN, and the total weight of them is 71.67%. Amongall features, the importance of the graph-based representation (i.e., 1, colored in green) ranks 1 with the weight of 16.89%. Thisfurther demonstrates that HGAMN is able to significantly improvethe effectiveness of multilingual POI retrieval.",
  "Text Retrieval": "Text retrieval aims to provide the most relevant documents for aquery . There are three conventional categories of methods fortext retrieval: pointwise (such as logistic regression ), pairwise(such as RankSVM and RankBoost ), and listwise (such asListNet and AdaRank ). The major difference between themlies in the input document space, output space, and loss function.These methods require manually designed features. However, suchfeatures may be sparse and insufficient to effectively encode thesemantic information of queries and documents. Moreover, design-ing effective features is usually time-consuming and heavily relieson expert knowledge in particular areas .With the rapid development of deep learning, researchers adoptneural networks to automatically learn representations for text retrieval. For example, Huang et al. propose a DSSM modelto map the query and the document into a semantic space andtreat the similarity between two embeddings as the relevance score.Subsequently, Conv-DSSM and LSTM-DSSM are proposedto improve the ability of semantic feature extraction of DSSM. Panget al. propose to model text matching as the problem of imagerecognition and employ a convolutional neural network to extractmatching features. DeepRank further simulates the humanjudgment process to capture important features.Multilingual POI retrieval task is different from text retrieval taskin that it requires not only capturing semantic similarities betweentext data but also addressing the cross-language matching problemand textual-geographic matching problem (i.e., computing the rel-evance between a query and a POI by taking both text data andgeolocations into consideration), which are generally not requiredin text retrieval task.",
  "POI Retrieval": "There is a growing body of work that explores and assesses POIretrieval . Here, we briefly review recent attemptson applying neural networks to address this task. To address themistyping or an alias inquiry problem, Zhao et al. proposea POI latent semantic model based on deep learning, which caneffectively extract query and POI features for similarity calculation.Fan et al. propose a personalized POI retrieval model whichalso has the ability to provide time- and geography-aware results.Furthermore, geographic information and spatial-temporalfactors have been considered in recent work.However, little work has considered the problems of visitingsparsity and multilingual query-POI matching, which are two mainchallenges that must be tackled for POI retrieval in global mapapplications such as Baidu Maps. To address both problems, we firstencode a POIs multi-source information to enrich its representation.Then, we establish the relations among different POIs and queries byconstructing a heterogeneous graph. Finally, we produce enhancedrepresentations of queries and POIs via the heterogeneous graph,which has a significant effect on POI retrieval performance.",
  "Heterogeneous Graph Neural Network": "The heterogeneous graph, which constitutes multiple types of nodesor edges, is ubiquitous in real-world applications. Previous stud-ies focus on different aspects of the heterogeneousgraph to learn node representations. For example, Sun et al. propose a meta-graph-based network embedding model, whichsimultaneously considers the hidden relations of all meta informa-tion of a meta-graph. Wang et al. propose a heterogeneousgraph neural network, which utilizes hierarchical attention, in-cluding node-level and semantic-level attentions, to learn noderepresentations from meta-path based neighbors. Cen et al. propose a unified attributed multiplex heterogeneous network tosolve the multiplex heterogeneous graph embedding problem withboth transductive and inductive settings. Zhu et al. proposea heterogeneous graph convolution network to directly learn thecomplex relational hierarchy, potential incompatible semantics, andnode-context relational semantics.",
  "HGAMN: Heterogeneous Graph Attention Matching Network for Multilingual POI Retrieval at Baidu MapsKDD 21, August 1418, 2021, Virtual Event, Singapore": "Inspired by the recent success in heterogeneous graph represen-tation learning, we build a heterogeneous graph from search logs,which links the low-frequency POIs with the high-frequency onesand aggregates queries in different languages and formulations forindividual POIs. As a result, the visiting sparsity and multilingualmatching problem can be effectively alleviated by enhancing therepresentations of queries and POIs via the heterogeneous graph.",
  "CONCLUSIONS AND FUTURE WORK": "This paper presents an industrial solution to the multilingual POIsearch for international services at Baidu Maps. We propose a het-erogeneous graph attention matching network (HGAMN) to ad-dress the visiting sparsity and multilingual query-POI matchingproblems. HGAMN is composed of three modules: (1) a multi-sourceinformation learning module, which learns the text and locationrepresentations of the multilingual query, POI name, and POI ad-dress; (2) a heterogeneous graph learning module, which constructsthe connections of different POIs and historical queries, and learnsthe node representations from the heterogeneous graph; and (3)a POI ranker module, which calculates the relevance between aquery and candidate POIs. We conduct both offline and online eval-uations using large-scale real-world datasets. The experimentalresults show that HGAMN achieves significant improvements overseveral mainstream approaches, which demonstrates the effective-ness of enhancing the representations of queries and POIs via theheterogeneous graph to improve multilingual POI retrieval.The user input habits and preferences are not taken into accountin this paper. In the future, we intend to utilize these kinds of vitalinformation for personalized POI searches. In addition, previousstudies have shown that context and explanation can bring significant improvements in recommendation effective-ness and increase user satisfaction. As future work, we plan toinvestigate whether multilingual POI retrieval could benefit fromthe adoption of such factors."
}