{
  "Abstract": "Reciprocal recommender systems (RRS), conducting bilateral recom-mendations between two involved parties, have gained increasingattention for enhancing matching efficiency. However, the major-ity of existing methods in the literature still reuse conventionalranking metrics to separately assess the performance on each sideof the recommendation process. These methods overlook the factthat the ranking outcomes of both sides collectively influence theeffectiveness of the RRS, neglecting the necessity of a more holisticevaluation and a capable systemic solution.In this paper, we systemically revisit the task of reciprocal rec-ommendation, by introducing the new metrics, formulation, andmethod. Firstly, we propose five new evaluation metrics that com-prehensively and accurately assess the performance of RRS fromthree distinct perspectives: overall coverage, bilateral stability, andbalanced ranking. These metrics provide a more holistic under-standing of the systems effectiveness and enable a comprehen-sive evaluation. Furthermore, we formulate the RRS from a causal",
  "Corresponding author": "Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than theauthor(s) must be honored. Abstracting with credit is permitted. To copy otherwise, orrepublish, to post on servers or to redistribute to lists, requires prior specific permissionand/or a fee. Request permissions from 24, August 2529, 2024, Barcelona, Spain. 2024 Copyright held by the owner/author(s). Publication rights licensed to ACM.ACM ISBN 979-8-4007-0490-1/24/08 perspective, formulating recommendations as bilateral interven-tions, which can better model the decoupled effects of potentialinfluencing factors. By utilizing the potential outcome framework,we further develop a model-agnostic causal reciprocal recommen-dation method that considers the causal effects of recommenda-tions. Additionally, we introduce a reranking strategy to maxi-mize matching outcomes, as measured by the proposed metrics.Extensive experiments on two real-world datasets from recruit-ment and dating scenarios demonstrate the effectiveness of ourproposed metrics and approach. The code and dataset are availableat:",
  "Reciprocal Recommendation, Evaluation Metrics, Causal Inference": "ACM Reference Format:Chen Yang, Sunhao Dai, Yupeng Hou, Wayne Xin Zhao, Jun Xu, YangSong, Hengshu Zhu. 2024. Revisiting Reciprocal Recommender Systems:Metrics, Formulation, and Method. In Proceedings of the 30th ACM SIGKDDConference on Knowledge Discovery and Data Mining (KDD 24), August2529, 2024, Barcelona, Spain. ACM, New York, NY, USA, 10 pages.",
  "(a) Conventional RS(b) Reciprocal RS": ": Causal graph for (a) recommendation as treatmentin convention RS; (b) reciprocal recommendation as bilateraltreatments in RRS. U: user, I: item, R: recommendation, RAand RB: recommendations made for each side, Y: rankingscore (e.g., the probability of matching). For simplicity, weignore all confounding factors. Distinct from conventional user-item recommender systems , RRS typically involves two parties of users and aims to generatemutually beneficial recommendations. Each party within the sys-tem exhibits unique preferences, requirements, and responses to therecommendations provided. Despite different task settings, moststudies on RRS typically follow existing evaluation paradigms (especially similar evaluation metrics), except that the evaluationprocess is conducted for each party independently.Despite the simplicity and popularity, we argue that such anevaluation approach is inherently problematic since the recommen-dation results of both parties are coupled while the single-sidedevaluation process is independent. Take online recruitment as an ex-ample and assume that a candidate sees the recruitment ad and therecruiter interviews and accepts him. When a match already occursbetween the candidate and recruiter incurred by a recommendationto the candidate, there is no need to make another recommendationfor the recruiter, which actually becomes redundant. However, insuch a case, independent evaluations would consider both-sidedrecommendations as two successful recommendations, even thoughit doesnt increase the total number of matches made by the system.In the reciprocal scenario, an ideal goal should be the total num-ber of matched pairs . Thus, a more comprehensive evaluationperspective taking into account the overall number of matches andthe degree of recommendation redundancy is needed for accuratelymeasuring RRS performance.In this work, we aim to evaluate the effectiveness of RRS modelsfrom a holistic perspective. We propose to consider three additionalaspects for evaluation: the coverage of the overall matching rela-tionship, the duplication degree of the recommendations, and theranking performance with population imbalance of the two sides,which we define as overall coverage, bilateral stability, and balancedranking, respectively. The underlying purpose of the overall cover-age and bilateral stability metrics is to identify and filter redundantrecommendations, i.e., pairs of users that are recommended to eachother on both sides. The balanced ranking aims to evaluate theperformance of ranking lists while ensuring equal treatment ofusers on both sides, thereby mitigating bilateral imbalances.In addition to evaluating RRS from a holistic perspective, it isessential to study how recommendations in this scenario will affectthe overall effectiveness when designing RRS models. Compared with conventional recommender systems, it becomes more intri-cate to model the effects of potential recommendations in RRSs.For example, when a matching relationship occurs with bilateralrecommendations, it can be attributed to the recommendationsmade on either side or both sides. Without deeply understandingthe underlying mechanism, it isnt easy to accurately model thetwo-sided matching process. To better understand the differencesbetween conventional and reciprocal recommender systems, weillustrate RRS from a causal perspective in . Comparedto the conventional setting, the recommendations in RRS for bothsides may collaboratively influence the matching outcome, offeringincreased likelihood for a match. This combined effect of bilateralrecommendations can be viewed as an effect of mixed treatments onthe outcomes, which would affect the final results in an integratedmanner. It motivates us to consider such a causal effect of bilateralrecommendations for improving RRS.To address the above issues, we propose a model-agnostic learn-ing approach, namely Causal Reciprocal Recommender System(CRRS), formulated under the potential outcome framework .The core idea is to estimate the matching probability under differenttreatment assignments, which are termed the potential outcomes.There are two major technical contributions in our approach. Firstly,we propose an adaptable framework for fine-grained modeling ofcausal effects. This approach can be extended to existing typicalrecommendation system models, capturing the impact of differentrecommendation strategies on the outcomes. Secondly, we designan effective reranking strategy for refining the ranking score forboth sides. This strategy comprehensively considers the recom-mendation mechanism within the reciprocal scenario, aiming toenhance the overall performance of the RRS. The contributions of this paper can be summarized as follows: We introduce a comprehensive set of metrics designed to eval-uate RRS holistically, addressing aspects traditionally neglected bystandard metrics in existing recommender systems. We take a causal perspective to model the matching effect inRRS and develop a model-agnostic framework, enabling improvedprediction and user ranking by viewing reciprocal recommenda-tions as bilateral treatments. We conduct extensive experiments to demonstrate the effective-ness of our proposed metrics and methods compared with reciprocalrecommendation models on two real-world datasets.",
  "Related Work": "Reciprocal Recommender System. Reciprocal RecommenderSystems (RRS) have been widely studied for two-sided markets , recommending users to other users rather than items.RRS are frequently employed in domains where both sides of themarket have their preferences and interactions, such as online dat-ing , recruitment and socialnetworks . Since the reciprocal recommendation task can beregarded as two separate tasks, most RRS evaluate their methodsindividually for each task , with widely usedtop- recommendation metrics such as Recall, Precision, and Nor-malized Discounted Cumulative Gain (NDCG). However, thesetwo tasks are two sides of a coin and the final result is determinedby both sides of the market. For a better evaluation of the whole",
  "Revisiting Reciprocal Recommender Systems: Metrics, Formulation, and MethodKDD 24, August 2529, 2024, Barcelona, Spain": "system, studies have been conducted that build upon the economicand social science literature , referring to this scenarioas a matching market. However, these methods heavily rely on theground truth of relevance, often unavailable in real-world datasets.In this work, we propose to evaluate RRS methods from an overallperspective, addressing overall performance across three aspects:overall coverage, bilateral stability, and balanced ranking. Causal Inference in Recommendation. Recently, causal infer-ence has gained significant attention in recommender sys-tems research . The current works have explored theapplication of causal inference to address various challenges inrecommender systems, including bias , fairness ,and explainability . Generally, causal inference encompassestwo primary directions: causal discovery and causal estimation .Causal discovery aims to learn causal relationships from data, iden-tifying causal graphs that reveal interdependencies among fac-tors . Causal estimation seeks to estimate the treatmenteffect, especially evaluating how interventions or treatments influ-ence user outcomes in recommender systems . Inspiredby advances in causal effect estimation, our work concentrates onapplying this approach to the domain of reciprocal recommenda-tion. In this paper, we attempt to estimate the causal effects fromboth sides of RRS to enhance recommendation quality.",
  "Problem Definition": "In reciprocal recommender systems (RRS), there are two involvedparties (typically two sets of users) with mutual selection relation-ship, denoted as A = {1,2, . . . ,} and B = {1,2, . . . ,},where and denote the numbers of candidates on each side.The two parties are associated with a set of directed user-to-userinteractions represented by I = {,,,}. Each tuple rep-resents an interaction between a user A and a user B,where the binary variable {0, 1} indicates the direction ofthe interaction (1 for and 0 for ) and {0, 1}represents whether a final match is achieved.In the scenario of reciprocal recommendation, we perform per-sonalized recommendations for users of both sides. Specifically, fora given user , the system generates a ranked list of recommen-dations from B. The other side is similar, where users from A areranked when recommending to user . Most existing works followconventional evaluation paradigms to assess the ranking perfor-mance of each side individually. However, in a reciprocal scenario,the primary goal should be the overall count of matching pairs.This work focuses on evaluating the recommendations from bothsides from an overall system perspective. This includes how manyactual match pairs are covered by the recommendations (coverage)and whether they are recommended to each other (stability).",
  "Revisiting the Evaluation Metrics": "As discussed in , to evaluate the performance of RRS, exist-ing methods mainly focus on either single-sided metrics or solelythe overall quantity of matches, which lack consideration of morerobust two-sided measurements, such as coverage and stability.To ensure a more holistic and robust evaluation, we propose toconsider three new evaluation aspects, namely overall coverage,bilateral stability, and balanced ranking.",
  "Proposed Metrics": "Measures of Overall Coverage. Overall coverage refers to theextent to which a recommender system covers potential matchingrelationships from an overall perspective. To achieve a more ac-curate evaluation of the coverage in RRS, the successful matchingled by the bilateral recommendation, where the two users involvedare recommended to each other simultaneously, should be treatedas a single successful recommendation, rather than being countedtwice. Considering this, we propose two metrics, namely Coverage-adjusted Recall (CRecall) and Coverage-adjusted Precision (CPreci-sion). The corresponding formulas are given as follows:",
  "( + ),(2)": "where M denotes the total count of the matching pairs and de-notes the length of the recommendation list. TP = A TP andTP = B TP denote the sum of true positives for side andside , where TP and TP are the true positives of the single userof the two sides. TP denotes the true positives where both sideshave recommendations simultaneously. As we can see, CRecall andCPrecision refine the positive pairs generated by the RRS by avoid-ing duplicate counting of redundant successful recommendations. Measures of Bilateral Stability. Bilateral stability refers to the ex-tent to which a recommender system simultaneously recommendsa pair of users to each other. Stability is mainly related to the num-ber of mutual recommendations, which potentially increases thelikelihood of successful matching for the involved pairs. To effec-tively evaluate the bilateral stability of RRS, we propose two metrics,namely Stability-adjusted Recall (SRecall) and Stability-adjusted Pre-cision (SPrecision). The formulas are given as:",
  "SRecall and SPrecision directly show how well the system simul-taneously offers recommendations for the two sides of the givenpair, effectively capturing the essence of bilateral stability": "Measures of Balanced Ranking. Balanced ranking refers to theranking performance of the recommendation list ensuring equityacross different group sizes. An essential characteristic of the RRSis the bilateral imbalances and crowding . For instance, in arecruitment scenario, there might be 1000 candidates and merely100 jobs, resulting in a significant disparity in the number of users.To fairly evaluate the ranking performance of each user in theRRS, we propose Reciprocal NDCG (RNDCG) based on the widely-used ranking metric NDCG . It offers a more comprehensiveevaluation of overall ranking performance, considering weightdisparities between different sides. The formula is presented as:",
  "Case": ": Three distinct recommendation cases with identicalmatching relationships. In this scenario, we make a top-1recommendation for four users (1, 2, 1, and 2) and thenreport the average Recall, CRecall, SRecall, and the count ofsuccessful matching pairs. fairness and effectiveness in the recommendations, making thesystem more responsive to the actual distribution of users and theirpotential impact on the market dynamics.Summary. In the above, we have presented the metrics of overallcoverage (CRecall/CPrecision), bilateral stability (SRecall/SPrecision),and balanced ranking (RNDCG). Among these proposed metrics,CRecall/CPrecision along with SRecall/SPrecision aim to enhancethe evaluation of RRS, aiming to promote more balanced and mu-tually beneficial RRS models. Furthermore, RNDCG allows us toassess the ranking performance of unbalanced groups while ac-counting for the crowding, ultimately leading to more informedand equitable recommendations for all users.",
  "Effectiveness of the Proposed Metrics": "To better understand the advantage of the proposed metrics, weconstruct three illustrative scenarios as depicted in . Forclarity, we consider a top-1 recommendation scenario, where eachuser receives just one recommendation (indicated by arrows). Here,matches cannot be realized without recommendations (namelypotential matching, indicated by black dashed lines).The three scenarios represent distinct recommendation strate-gies. In case 1, four separate recommendations each successfullyestablished a matched relation. In case 2, two mutual recommen-dations resulted in two matched relations while in case 3, threematched relations were successfully established. We calculate bothtraditional and proposed metrics for these cases. For simplicity, wetake Recall, CRecall, and SRecall for comparisons, and the othermetrics can be conducted similarly. It is evident that traditionalmetrics fail to capture the differences among the three cases (all hav-ing Recall=0.5), whereas our proposed metrics CRecall and SRecallcan capture such a distinction (e.g., CRecall=1 in case 1 and CRe-call=0.5 in case 2). Thus, these proposed metrics can provide a morecomprehensive evaluation of the RRS, surpassing the limitations oftraditional metrics.In traditional RRS, when a pair is recommended by both sides andachieves a match, it is unclear through which mechanism the match",
  "Proposed Method": "In the above, we have introduced several new evaluation metricsfor improving the evaluation of RRS. Next, we study how to de-velop more effective reciprocal recommendation models, so as toachieve better performance on RRS. Compared with conventionalrecommendation tasks, reciprocal recommendation becomes moreintricate in the matching mechanism, due to the potential effects oftwo-sided recommendation. In order to achieve a better recommen-dation performance, it is key to effectively model and analyze theeffects of the potential factors in deriving a matching relationship.For this purpose, we formulate the reciprocal recommendation sce-nario from a causal perspective and then introduce the proposedCausal Reciprocal Recommender System (named CRRS) underthe potential outcome framework . The overall architecture ofthe proposed approach is shown in .",
  "Recommendations as Bilateral Treatments": "As previously mentioned, the primary goal of an RRS is to opti-mize the coverage of successful matching relationships. This goal ishighly affected by the recommendation process, either single-sidedor two-sided recommendations. Given a successful matching withbilateral recommendations, it is intricate to infer which recommen-dation actually leads to the matching. To better capture the under-lying effects of potential factors, we view the recommendations astreatments from a causal perspective . In this scenario, treat-ments consist of two parts: recommendations for side (denotedas ) and recommendations for side (). Formally, we definebilateral treatment as follows:",
  "Causal Reciprocal Recommender System": "To decouple these treatments and model them separately at a finergranularity, we leverage the potential outcome framework toanalyze and estimate the causal effect. The core idea is to estimatethe causal effect of recommendation in a collaborative way, underthe assumption that similar users have similar treatment effectsunder recommendations . By developing a collaborative causalsolution, our approach is model-agnostic, ensuring adaptability andversatility. After the causal effect is estimated, we need to determinethe final ranking list presented to both sides users. To improve theoverall effectiveness of the system, we further propose a reranking",
  "For": ": An illustration of the proposed framework CRRS. We represent three treatment assignments with red, purple, andblue. Each assignment signifies a distinct dataset and outcome obtained under the treatment conditions. : An illustration of the expectation of matching withthe bilateral treatments. Each unit comprises two parts: theexpected outcome of the intervention and the expected out-come of other recommendations in the vacant slots.",
  "strategy aimed at enhancing overall performance and choosing thebest recommendation strategy": "5.2.1Potential Outcome Framework. In causal inference, potentialoutcome framework is a method that directly calculates theeffect of certain treatments for outcomes. In recommendation sce-narios, outcome is often defined as either implicit or explicit userfeedback, such as click or rating . When considering a reciprocalrecommendation scenario, we define outcomes as matching rela-tionships, as this is the most effective feedback observed. Formally,we give the definition of potential outcome in RRS as follows: Definition 5.2 (Potential Outcome for RRS). Given the treatmentassignment = (,), the potential outcome denotes match-ing relationship under the specific recommendation strategy where = {10, 11, 01, 00} for instance user pair (,). The potentialoutcomes can be instantiated as a function = (, ), whichtakes user features and as input, i.e., = (, ). We present the correspondence of to treatment in .Specifically, an estimation of 10 = 1 indicates that a match is ex-pected when the treatment combination is assigned as = 1 and = 0. Conversely, the estimation of 00 consistently remains at 0because no match is expected when neither side receives a recom-mendation. To model these bilateral treatments, a major challengeis that there is only one intervention per sample in RRS. We cannotobserve the final results of different treatments for the same pair of users at the same time, which is a counterfactual problem .Therefore, it is challenging to estimate counterfactual outcomes andcalculate the matching probability for reciprocal recommendations.However, based on the intuition that similar users correspond tosimilar treatment effects , we can estimate the causal effect ofthree different treatment assignments with typical RS models. 5.2.2Causal Effect Modeling and Ranking. As discussed before, wereformulate the RRS scenario with the potential outcome frameworkand regard bilateral recommendations as treatments. Under thefour treatment assignments mentioned above, the cases that wehave to consider that are likely to be successful are those with {10, 11, 01}. As shown in , = 10 is to recommend to, = 01 is to recommend to , and = 11 is to recommendboth users to each other. When = 00, the pair cannot be matchedbecause neither side is recommended to the other. To support thisfine-grained modeling and predict the potential outcomes underthe three treatments, we construct three functions:",
  "= 10(,), 11 = 11(,), 01 = 01(,),(8)": "where each () represents a specific recommender model back-bone and each predicted value ranges from 0 to 1. The three back-bone models essentially have few restrictions and can be imple-mented by typical recommendation models (e.g., BPRMF orLightGCN ). Nonetheless, they possess unique parameters,which allow them to outperform a single model in effectively pre-dicting outcomes for different treatments. Our proposed method ismodel-agnostic and can be naturally applied to typical recommenda-tion models. Following this paradigm, the expectations of matchingunder different recommendation strategies can be estimated.After the three outcomes have been predicted, we need to rankthe candidates for each user on both sides. For a given user pair(,), the scores for ranking can be simply calculated using thefollowing formula:",
  "under the treatment for which the recommendation is provided,either as a direct sum or alternatively, as a weighted sum": "5.2.3Reranking Strategy with Vacant Slots. Although the afore-mentioned approach facilitates ranking, it still falls short of fullyaddressing the recommendation mechanism of this scenario.In practice, if one side of a pair (e.g., and ) lacks recommen-dations (e.g., = 0), there will be an empty spot for the recommen-dation and we term this a vacant slot. Another user (say ) willbe recommended to at this vacant slot. Such a recommendationof introduces a new possibility of matching denoted as (),which is the matching expectation of the pair (,). Consequently,the global expectation of matching becomes 01 + (). The resultsunder other treatments are shown in . With the potentialoutcome predictions and matching expectations brought by thevacant slots, we need to choose and refine the scores for rankingusers for the two sides. The formula for ranking scores for the twosides is set as follows:",
  "1if = max(S),0otherwise.(12)": "The aim of IsMax is to ensure that the final recommendationmethod is targeted at maximizing overall matching performance. Toestimate () and (), we sample a certain number of users fromthe opposite side and then calculate their relevance scores using thebackbone model. This estimation serves as an approximation of the() and () based on the sampled users. By considering bothrelevance and direction, the reranking process ensures rankingswith the most matching expectations, taking into consideration thereciprocal nature of the RRS.",
  "Optimization": "Our proposed CRRS approach consists of two learning stages: pre-training and counterfactual learning. In the pre-training stage, weuse real matching labels to train a backbone recommender model.In the counterfactual learning stage, we finetune the recommendermodel with direction labels to better predict outcomes, taking intoaccount the causal effects of various recommendation strategies.The full algorithm is described in Algorithm 1. 5.3.1First Stage: Pre-training. We optimize the backbone modelusing the Bayesian Personalized Ranking (BPR) loss , whicheffectively captures the relative preferences between positive andnegative samples. To describe the pre-training process, we take side for illustration when it is symmetric for side , we define thepre-training loss L as follows:",
  "Backpropagate each L and update the parameters": "where () is the sigmoid function, D denotes the training data,(,) is a positive sample for matching, and denotes the nega-tive sample for user. This stage aims to learn a basic recommendermodel for subsequent causal finetuning. 5.3.2Second Stage: Counterfactual Learning. At this stage, we fur-ther finetune the recommendation model using data under differenttreatment assignments. Similar to the first stage, the counterfactuallearning loss also employs the BPR ranking loss. For each backbonemodel, the loss function is expressed as follows:",
  "(, )Dlog (,) (,),(14)": "where D represents the training data specific to each treatment.To ensure training stability, we combine the counterfactual learningloss with the pre-training loss. The treatment-specific data providesimportant guidance that instructs the models to refine their per-formance under specific conditions. In this way, the models canmore effectively discern the causal effects between treatments andoutcomes, thus better achieving better performance for RRS.",
  "Recruitment32, 16125, 665790, 725224, 63699.90%Dating6, 3916, 516605, 28851, 47498.55%": "only start communicating if they both recommend each other andclick the like button. In this paper, we adopt a negative stance to-wards redundant recommendations, prioritizing the enhancementof overall coverage and achieving higher quantities as fundamentalobjectives (measured by CRecall and CPrecision), despite poten-tial trade-offs in stability (SRecall and SPrecision), as evidenced insubsequent experiments.",
  "Experimental Setup": "Dataset. To evaluate the effectiveness of our method, we conductexperiments on two large real-world datasets from different recip-rocal recommendation domains: recruitment and online dating. Recruitment : This dataset contains two weeks of reallogs collected from a large and popular online recruitment plat-form, which records dynamic interactions between job-seekingcandidates and proactive recruiters. Dating3: This dataset is collected from the popular onlinedating service Libimseti. It encompasses ratings between users, andwe only keep ratings between opposite-sex pairs (i.e., female-to-male and male-to-female). Pairs with mutual ratings of 8 or aboveare viewed as a successful match, given the increased likelihood ofa match with bilateral exposure.Following the standard practice , we only keep the 5-coreinteractions for both datasets. After preprocessing, we randomlysplit both datasets into training, validation, and test sets with ratiosof 8 : 1 : 1. The statistics of both datasets are summarized in . Baseline models. As our proposed CRRS is model-agnostic, wecan apply it to various recommendation models. We choose thefollowing two popular models as our backbone models: BPRMF : This model designs Bayesian Personalized Rank-ing (BPR) loss to optimize the Matrix Factorization (MF), which isrepresentative in the collaborative filtering recommendation. LightGCN : This model designs a simple but competitiveGCN architecture for the graph-based recommendation.We also compare our proposed CRRS with the following recip-rocal recommendation models: D-BPRMF: This method leverages two same BPRMF but withdifferent parameters to make recommendations for each side. LFRR : LFRR is a latent factor model designed specificallyfor reciprocal recommendation scenarios, which aggregates twoMFs to model the preferences of both sides involved. D-LightGCN: This method is similar to D-BPRMF, but it uti-lizes LightGCN as the backbone model. DPGNN : DPGNN is a graph-based method to model thetwo-way selection preference through a dual-perspective graphrepresentation learning approach.Note that these baseline models fall into two categories: MF-based Models and graph-based Models, where the backbone modelsused are BPRMF and LightGCN, respectively. The models with theD- prefix employ two identical backbone models to train and makepredictions independently for each side. LFRR and DPGNN can beviewed as extensions of BPRMF and LightGCN to reciprocal rec-ommendation scenarios, respectively. To be more inclusive, we justopted for models in the general setting rather than those designedspecifically for sequences , which have more complex dataand model requirements. Evaluation settings. To evaluate the performance of the top-recommendation of RRS, we employ both traditional metrics Recall,Precision, NDCG, and metrics we proposed in . For eachdataset, we employ a full-ranking evaluation where every candidateuser is ranked based on its relevance for the target user. We firstreport on single-sided metrics, treating RRS as two independentranking tasks: ranking all users from side for each user A andvice versa. Meanwhile, we record the average values of the single-sided metrics. Following this, we record the five proposed metrics:CRecall, CPrecision, SRecall, SPrecision, and RNDCG, to measurethe comprehensive capability of the models. Additionally, we reportthe number of matching pairs under recommendations (denoted asTrue Positive Pairs). Implementation details. We implement baseline models using apopular open-source recommendation library RecBole . Fora fair comparison, the dimension of user embedding is standardizedto 128 across all models. is set to 50 empirically. Moreover, weoptimize all methods using the Adam optimizer and conduct a thor-ough search for the hyper-parameters of all baselines. The learningrate is tuned from {0.001, 0.0001, 0.00001} for optimal performance.To prevent overfitting, we employ early stopping with patienceof 30 epochs. To facilitate evaluations in offline experiments, weconsider that all positive instances can be successfully matchedwhen recommendations are made exclusively on one side duringboth the training and evaluation phases.",
  "Overall Performance. We conduct a comprehensive compar-ison of different methods across various evaluation metrics. Theresults on two datasets are reported in": "Performance comparison between models. As we can see, inRecruitment, reciprocal methods LFRR and DPGNN demonstratesuperior performance across most single-sided evaluation metrics,due to their ability to effectively capture the underlying interac-tions. Our proposed CRRS is not necessarily better than a well-designed reciprocal recommendation model in single-sided metricsbut achieves the highest performance in overall coverage metrics",
  "*0.25490.29860.30070.3387**True Positive Pairs1,4391,0581,5671,588*1,3121,5371,5481,743*": "CRecall and CPrecision and the count of matching pairs. For the dat-ing, owing to the behavioral direction characteristics in the data andthere being relatively more user interactions, the proposed methodoutperforms others across all metrics. This can be attributed tothe continued training stage, which enables the model to bettercapture the correlations between users on both sides. Moreover, theD-BPRMF and D-LightGCN exhibit almost the worst performanceacross all metrics, largely due to their insufficient training data. Trade-off between coverage and stability. In Recruitment dataset,a phenomenon emerges when comparing CRRS with the best base-line model DPGNN: there is a rise in CRecall (0.4670 v.s. 0.4555),contrasted by a fall in SRecall (0.1248 v.s. 0.1535), similar to CPre-cision and SPrecision. This phenomenon is normal when tryingto reduce redundant recommendations as analyzed in .2.However, this phenomenon does not occur in dating dataset, possi-bly because there is a significant difference in sparsity between thetwo datasets on #Match (99.90% v.s. 98.55%), with even greatersparsity differences on #Interactions. The inherent conflict be-tween coverage and stability exists due to the different stances",
  "towards redundant recommendations, suggesting that trade-offsmay be required in certain situations": "6.2.2Metric Comparative Analysis. We conduct experiments tocompare traditional metrics and the proposed metrics under differ-ent recommendation strategies on dating. For the same model, wemanually adjust the redundant recommendations and consider thefollowing two adjustments: (A) BPRMF-Uni: Convert the redun-dant recommendations with another matching pair that does notappear on both sides. (B) BPRMF-Rep: Convert the non-redundantpairs with other matching pairs that have appeared on one side.The original model is named as BPRMF-Ori. As shown in ,We depict a rectangular interaction diagram with users from bothsides represented along the horizontal and vertical axes. Blue pointsare true positives for just one side and the green ones are true pos-itives for the two sides. Recommendations on three cases havecompletely identical traditional ranking metrics (Recall, Precision,and NDCG). However, significant differences exist in the proposedmetrics, which directly influence the count of matching pairs. Thus,it is critical to take the proposed metrics into account in RRS.",
  "Dating": "CRRS (BPRMF)0.30860.00680.09930.00220.0751w/o finetune0.29270.00650.06960.00150.0692w/o pre-train0.29860.00660.08260.00180.0669w/o rerank0.30110.00670.11230.00250.0748BPRMF0.27950.00620.08300.00180.066 6.2.3Ablation Study. The major technical contribution of our ap-proach lies in the potential outcome framework training algorithm,as well as the proposed reranking strategy. We now analyze howeach part contributes to the final performance. We consider thefollowing three variants of CRRS: (A) CRRS w/o finetuning (Equa-tion (14)); (B) CRRS w/o pre-training (Equation (13)); (C) CRRS w/oreranking (Equation (10));In , we can observe that the absence of any componentwill lead to performance degradation, with varying impacts acrossdifferent datasets. In recruitment, the reranking strategy contributessignificantly to the overall coverage improvement as its objective isto avoid redundant recommendations. At the same time, we can ob-serve that the result of the model without reranking demonstratessuperior performance in bilateral stability. In dating, pre-trainingand finetuning play more vital roles in enhancing the model per-formance across various metrics. While the benefits brought by thereranking strategy are relatively modest. These results highlightthe usefulness of all components in CRRS. 6.2.4Ranking Analysis of Redundant Recommendations. We con-duct experiments here to analyze the distribution of redundantrecommendations in the ranking list. We employ the same BPRMFmodel to generate top-50 recommendations for both sides andrecord the ranking of all redundant recommendations. As discussed",
  ": Distribution of ranking positions for redundantrecommendations within the top 50 positions": "above, an effective way to enhance coverage involves reducingduplication between the bilateral ranking lists. However, as Fig-ure 5 shows, the majority of redundant recommendations are foundin the advanced positions, so an objective of directly optimizingthe discrepancy between both sides may be ineffective. This sug-gests that innovative approaches like reranking are essential forachieving more effective and balanced outcomes.",
  "Conclusion": "This paper revisited the study of reciprocal recommender systemsby introducing new metrics, formulation, and method. Firstly, weproposed five metrics for evaluating RRS from three new aspects.Then we formulated reciprocal recommendation tasks from a causalperspective, considering the recommendations as bilateral inter-ventions. Furthermore, we proposed a causal reciprocal recommen-dation model using a potential outcome framework. To optimizeoverall performance, we further designed a reranking strategy toenhance the overall performance. Extensive experiments on twodatasets indicate that the proposed approach can achieve superiorperformance on overall performance. This work was partially supported by National Natural ScienceFoundation of China under Grant No. 62222215, and Beijing NaturalScience Foundation under Grant No. L233008 and 4222027. Xin Zhaois the corresponding author.",
  "Stephen Bonner and Flavian Vasile. 2018. Causal embeddings for recommendation.In Proceedings of the 12th ACM conference on recommender systems. 104112": "Jiawei Chen, Hande Dong, Xiang Wang, Fuli Feng, Meng Wang, and XiangnanHe. 2023. Bias and debias in recommender system: A survey and future directions.ACM Transactions on Information Systems 41, 3 (2023), 139. Jiaxing Chen, Hongzhi Liu, Hongrui Guo, Yingpeng Du, Zekai Wang, Yang Song,and Zhonghai Wu. 2023. Bilateral Sequential Hypergraph Convolution Networkfor Reciprocal Recommendation. In 2023 IEEE International Conference on DataMining (ICDM). IEEE, 974979.",
  "Donald B Rubin. 1980. Randomization analysis of experimental data: The Fisherrandomization test comment. Journal of the American statistical association 75,371 (1980), 591593": "Masahiro Sato, Hidetaka Izumo, and Takashi Sonoda. 2016. Modeling IndividualUsers Responsiveness to Maximize Recommendation Impact. In Proceedings ofthe 2016 Conference on User Modeling Adaptation and Personalization. 259267. Tobias Schnabel, Adith Swaminathan, Ashudeep Singh, Navin Chandak, andThorsten Joachims. 2016. Recommendations as treatments: Debiasing learningand evaluation. In international conference on machine learning. PMLR, 16701679. Amit Sharma, Jake M Hofman, and Duncan J Watts. 2015. Estimating the causalimpact of recommendation systems from observational data. In Proceedings ofthe Sixteenth ACM Conference on Economics and Computation. 453470.",
  "Peng Xia, Benyuan Liu, Yizhou Sun, and Cindy Chen. 2015. Reciprocal recom-mendation system for online dating. In ASONAM": "Xu Xie, Zhaoyang Liu, Shiwen Wu, Fei Sun, Cihang Liu, Jiawei Chen, JinyangGao, Bin Cui, and Bolin Ding. 2021. CausCF: Causal Collaborative Filtering forRecommendation Effect Estimation. In Proceedings of the 30th ACM InternationalConference on Information & Knowledge Management. 42534263. Shuyuan Xu, Jianchao Ji, Yunqi Li, Yingqiang Ge, Juntao Tan, and YongfengZhang. 2023. Causal Inference for Recommendation: Foundations, Methods andApplications. arXiv preprint arXiv:2301.04016 (2023). Shuyuan Xu, Yunqi Li, Shuchang Liu, Zuohui Fu, Yingqiang Ge, Xu Chen, andYongfeng Zhang. 2021. Learning causal explanations for recommendation. InThe 1st International Workshop on Causality in Search and Recommendation. Chen Yang, Yupeng Hou, Yang Song, Tao Zhang, Ji-Rong Wen, and Wayne XinZhao. 2022. Modeling Two-Way Selection Preference for Person-Job Fit. InProceedings of the 16th ACM Conference on Recommender Systems. 102112.",
  "Hongtao Yu, Chaoran Liu, and Fuzhi Zhang. 2011. Reciprocal recommendationalgorithm for the field of recruitment. JICS (2011)": "Wayne Xin Zhao, Yupeng Hou, Xingyu Pan, Chen Yang, Zeyu Zhang, Zihan Lin,Jingsen Zhang, Shuqing Bian, Jiakai Tang, Wenqi Sun, et al. 2022. RecBole2.0: Towards a More Up-to-Date Recommendation Library.arXiv preprintarXiv:2206.07351 (2022). Wayne Xin Zhao, Shanlei Mu, Yupeng Hou, Zihan Lin, Yushuo Chen, Xingyu Pan,Kaiyuan Li, Yujie Lu, Hui Wang, Changxin Tian, et al. 2021. Recbole: Towards aunified, comprehensive and efficient framework for recommendation algorithms.In CIKM.",
  "Bowen Zheng, Yupeng Hou, Wayne Xin Zhao, Yang Song, and Hengshu Zhu.2023. Reciprocal Sequential Recommendation. arXiv preprint arXiv:2306.14712(2023)": "Zhi Zheng, Xiao Hu, Zhaopeng Qiu, Yuan Cheng, Shanshan Gao, Yang Song,Hengshu Zhu, and Hui Xiong. 2024. Bilateral Multi-Behavior Modeling for Recip-rocal Recommendation in Online Recruitment. IEEE Transactions on Knowledgeand Data Engineering (2024). Kun Zhou, Hui Wang, Wayne Xin Zhao, Yutao Zhu, Sirui Wang, Fuzheng Zhang,Zhongyuan Wang, and Ji-Rong Wen. 2020. S3-Rec: Self-Supervised Learning forSequential Recommendation with Mutual Information Maximization. In CIKM. Yaochen Zhu, Jing Ma, and Jundong Li. 2023. Causal Inference in RecommenderSystems: A Survey of Strategies for Bias Mitigation, Explanation, and General-ization. arXiv preprint arXiv:2301.00910 (2023)."
}