{
  "ABSTRACT": "This paper describes the development of a causal diagnosis ap-proach for troubleshooting an industrial environment on the ba-sis of the technical language expressed in Return on Experiencerecords. The proposed method leverages the vectorized linguisticknowledge contained in the distributed representation of a LargeLanguage Model, and the causal associations entailed by the em-bedded failure modes and mechanisms of the industrial assets. Thepaper presents the elementary but essential concepts of the solu-tion, which is conceived as a causality-aware retrieval augmentedgeneration system, and illustrates them experimentally on a real-world Predictive Maintenance setting. Finally, it discusses avenuesof improvement for the maturity of the utilized causal technologyto meet the robustness challenges of increasingly complex scenar-ios in the industry. ACM Reference Format:AlexandreTrilla,Ossee Yiboe, Nenad Mijatovic, and Jordi Vitri. 2024. Industrial-Grade Smart Troubleshooting through Causal Technical Language Process-ing: a Proof of Concept. In Proceedings of Causal Inference and MachineLearning in Practice (KDD 2024 Workshop). ACM, New York, NY, USA, 7 pages.",
  "INTRODUCTION": "The degradation of industrial assets is a complex multifaceted prob-lem that can be explained by dierent factors. As the componentswear and deteriorate, the systems exhibit a series of changes thatincrease in severity until they eventually fail. In this case, failurepatterns may also emerge. For instance, in the Reliability Engineer-ing eld, assets are most expected to fail either prematurely (early)during their break-in period, or late by the end of their remaininguseful life (wear-out) . These failure types can be anticipatedbecause their modes, mechanisms, and eects, are well known and Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor prot or commercial advantage and that copies bear this notice and the full cita-tion on the rst page. Copyrights for components of this work owned by others thanthe author(s) must be honored. Abstracting with credit is permitted. To copy other-wise, or republish, to post on servers or to redistribute to lists, requires prior specicpermission and/or a fee. Request permissions from 2024 Workshop, August 26, 2024, Barcelona, Spain 2024 Copyright held by the owner/author(s). Publication rights licensed to ACM.ACM ISBN 978-1-4503-XXXX-X/18/06...$15.00 documented. In consequence, engineers introduce quality checksin the manufacturing process and inspection actions in their (more-or-less conservative) preventive maintenance schedule to mitigatetheir impact. However, for as long as the machines operate, fail-ures may seem to appear randomly at any point in time. Thisis especially challenging for dependable assets while they transitthe middle risky region, when the failure rate is relatively low, butuniform/constant.In this uncertain setting, the eld of Predictive Maintenancetackles the problem by introducing the data as a means to closelyfollow the actual evolution of each asset and make better informedand timely decisions . In this sense, the detection of incipientanomalous behaviors and the capacity to diagnose their root causesand predict their solutions towards a more favorable prognosis be-come increasingly important to guarantee the availability of themachines.To succeed in these multiple objectives, the required informa-tion and knowledge, which displays a clear causal character, is typi-cally described and compiled in textual form through two dierent(linguistic) environments . On the one hand, an ontological refer-ence framework based on a Failure Mode, Mechanism, and EectAnalysis (FMMEA) , which provides a scholarly structure ofcausality driven by degradation. On the other hand, a methodolog-ical/epistemological approach via an actual record on Return OnExperience (RoX), the data of which have been explicitly writtenfor the purpose of explaining both the root causes and solutions ofthe reported failures. In both environments, several experts inher-ently identify which properties of the observations describe spu-rious correlations unrelated to the causal explanation of interest,and which properties represent the phenomenon of interest, i.e.,the stable invariant associations.Traditional approaches for processing language in PredictiveMaintenance settings have initially considered the idiosyncrasiesof technical environments , and have evolved into exploitingLarge Language Models , ontologies , and extracting re-current problems and frequently suggested solutions . Almostconcurrently, the community of natural language processing andcomputational linguistics identied causal challenges in textual",
  "KDD 2024 Workshop, August 26, 2024, Barcelona, SpainTrilla et al": "Note that this estimand operates on the Interventional rung ofthe Hierarchy of Causality, see .2.2. Its computational bur-den can be somewhat alleviated if the single most likely Cause isalready determined by the former RCA procedure.Once the representation of the most likely Solution category (S)is reliably determined, the associated text needs to be generated. Tothis end, its related textual records S are retrieved from the datasetand used to prompt a pretrained Llama2 Large Language Model(LLM) to obtain a natural language explanation .Prompt design and engineering have rapidly become essentialfor maximizing the potential and utility of a LLM . A prompt isconstructed by combining instructions, questions, input data, andexamples. Prompt engineering requires a blend of domain knowl-edge, understanding of the AI model, and a methodical approachto tailor queries to dierent contexts. For Smart Troubleshooting,the following query text Q is used:Given Observation: O, with possible root Cause(s):C, the indications for Solution used in previoussimilar cases using the predicted category are: S.Beyond asking a simple question, possibly the next level of so-phistication in a prompt is to include some instructions on how theLLM should answer the question:You are an advanced smart troubleshooter assistantdesigned to advise experts in diagnosing and solvingproblems by answering questions about the possiblesolutions the expert should consider to fix thefailure described by the Observation and Cause inthe query. The smart troubleshooter should providesolutions to diagnose and solve problems.Additionally, the troubleshooter should provide anexplanation for the role of each proposal and shoulduse appropriate forms for verbs and sentences.The smart troubleshooter should also refrain fromredundancy or repetition of steps. The smarttroubleshooter always answers as helpfully aspossible. It is crucial that all the propositionsshould always be presented using:\" - Option/Solution \"or any other listing format like this example layout:\" - Option 1 : here the text- Option 2 : here the text... \"Additionally, the eld of Causality has a priviledged position indeveloping trustworthy intelligent systems . For that reason,given that the pretrained LLM has learned from a large collectionof (possibly uncontrolled) documents, it is advised to include somewarning considerations (e.g., using safe bias-free language) regard-ing the integrity of the generated outcomes:The smart troubleshooter should avoid harmful,unethical, racist, sexist, toxic, dangerous, orillegal content, and ensure that the responses aresafe, socially unbiased, and genuinely positive. Ifthe smart troubleshooter doesn't know the answer,they should say so. It is crucial that the smarttroubleshooter never provides too specific detailsin their generated statements. Finally, thetroubleshooter should follow the layout mentioned",
  "Structural Causal Model": "The causal links among the variables that build the model ofa system are assumed to be most eectively represented using thetools from the eld of Causality. In this sense, the Structural CausalModel (SCM) is the framework that can most generally capturesuch directed associations . The SCM denes a set of assign-ments governing their specic functional associations , along withsome independent exogenous noise that accounts for everythingthat is not explicitly included in the model:",
  ":= (, ) ,(1)": "where represents the direct causes of the variable.If enough knowledge and experience from the eld is availablefrom the subject matter experts, e.g., through the FMMEA or RoXstructures, then a complete SCM graph may be developed rightfrom the start. Otherwise, the data need to be carefully leveragedto drive the discovery of the causal model. 2.1.1Causal Bayesian Network. Once the structural graph thatbinds the variables is determined, the functional associations ofthe SCM may be learned, and this work specically adopts a sto-chastic interpretation of the world. Therefore, it treats all as ran-dom variables, and the resulting SCM statistically describes their(conditional) probability distributions.Considering random variables1,2, ..., and a directed acyclicgraph that relates them causally, a Causal Bayesian Network (CBN)is a generative model that has the following factorized joint prob-ability distribution:",
  "Causal Inference": "Beyond probabilistic inference, Causal Inference provides the toolsthat allow estimating causal conclusions from observational data,i.e., in the absence of a true experiment, given that certain assump-tions are fullled. These assumptions increase in strength as is de-ned in Pearls Causal Hierarchy (PCH) abstraction , which issummarized as follows for the purposes of this paper. 2.2.1PCH Rung 1: Associational. Describes the observational dis-tribution of the factual data through their joint probability func-tion (). From this point forward, interesting quantities, i.e., thequeries , can be directly computed given some evidence through their conditional probability, which is computed as a ratioof marginals:",
  "().(3)": "This level of analysis displays a degree sophistication akin toclassical (un)supervised Machine Learning techniques. As such, itis subject to confounding bias, where common causes may inducespurious statistical associations/correlations . 2.2.2PCH Rung 2: Interventional. Describes an actionable distri-bution, which endows causal information at the population level.This level of analysis can be achieved through actual experimenta-tion via Randomized Control Trials, or through statistical adjust-ments that smartly combine the observed conditional probabilitiesto reduce the spurious associations in the estimation. Pearls -calculus is likely to be the most eective approach to determinethe identiability of causal eects by applying the following threerules: 1) insertion/deletion of observations, 2) action/observationexchange, and 3) insertion/deletion of actions .",
  "Language Model": "Finally, to operate with textual data, there is the need to numeri-cally represent linguistic information in the former generic vari-ables . To this end, Probabilistic Language Models are functionsthat assign a probability to a sentence, to eventually build up awhole piece of text. Traditionally, in such statistical models thesentences have been broken down, i.e., tokenized, into sequencesof words, and the goal has been to predict the probability of anupcoming word :",
  "Industrial-Grade Smart Troubleshooting through Causal Technical Language Processing: a Proof of ConceptKDD 2024 Workshop, August 26, 2024, Barcelona, Spain": "environment belongs to the area of Predictive Maintenance, theconsideration of a common development standard such as the ISO13374 is recommended . This specication breaks down thecomplexity of a problem into small modules that may be developedin isolation, thus increasing the chances of project success whilealso improving the interpretability and explainability of the tech-nical solution, and help to reduce the technical debt. What followsis a description of the Data Manipulation and Health Assessmentprocessing blocks.",
  "Data Manipulation": "Causality is an emergent property of complex industrial systems .In this setting, linguistic variables constitute high level qualitativedescriptions that group functions into categories and hierarchies,as is established by the FMMEA documentation. 3.1.1Return On Experience Records. In the Smart Troubleshoot-ing setting, the RoX text data are collected as a means to captureand describe the factual ontological relationships observed in theeld . They display the following variable type structure:",
  "(C) is the root cause of the observed problem (O). (S) is both the eect of the observed problem (O) and its rootcause (C). (Z) is a general confounder, i.e., a common cause": "Once the text data for (O,S) is available in raw format it must becleaned before doing any further processing. This involves lower-casing, punctuation removal, lemmatization/stemming, stop wordltering, etc. 3.1.3Text Embeddings and Large Language Models. Probably oneof the most challenging parts of this environment is the embeddednumerical representation of the text, which is typically consideredas unstructured data. The approach described in this method has been implemented using a discrete categorical representation ob-tained with a BERTopic Large Language Model . The pro-posed strategy integrates: 1) MiniLM , which is a compressedversion of Sentence-BERT (i.e., a Transformer-based language modelat the sentence level), 2) UMAP , which reduces the dimension-ality of the embedded vector space, and 3) HDBSCAN , whichclusters and quantizes the resulting low-dimensional representa-tion.",
  "Health Assessment": "In the Smart Troubleshooting environment, one of the main chal-lenges is dealing with the confounding bias introduced by the di-versity of subsystems and components. To this end, Causal Infer-ence techniques are utilized in the technical language processingscenario to extract relevant linguistic features from the text .This module exploits the probabilistic SCM, which has been de-signed as a discrete category based Bayesian network followingthe structure of the RoX data, and conducts a ne-grained diagno-sis of the observed input anomaly description by determining itsroot cause, and also by providing an unbiased estimation of the(most likely) potential solution. 3.2.1Root Cause Analysis. Root Cause Analysis (RCA) is a trou-bleshooting method of problem solving used for identifying thesources of the failures . RCA is a form of deductive inferencesince it requires an understanding of the underlying causal mech-anisms for the potential faults and the problem, i.e., what is typi-cally found in the context of Predictive Maintenance through theFMMEA documentation.The discrete causal Bayesian Network is suitable for exploitingthe categorized description of an observed problem (i.e., the eect)and predicting the likelihood of the several possible known causes.Thus, estimating the likely root causes amounts to computing theconditional probability diagnosis function (|). Note that thisestimand operates on the Observational rung of the Hierarchy ofCausality, see .2.1. Eventually, RCA yields a ordered list ofpotential root cause variables along with their probabilities, whichaligns with the way complex systems fail . The variables thatcomprise the data are required to be representative enough to helpthe developers and engineers pinpoint the source of the observedproblems through the root causes and their eects . 3.2.2Solution Generation. Predicting the solution is especially chal-lenging due to the large cardinality of the Observation and Solu-tion spaces (O,S). To obtain an unbiased result, an (atomic) inter-vention shall be performed. This represents an action () that isconducted on a system to set (not lter via conditioning) its vari-ables to known values and then evaluate their impact/eecton other variables , i.e., (|( = )). This constitutes anadvanced level of analysis that is not attainable with the observeddata alone: it also needs to account for the assumptions encoded inthe causal model in the form of variable dependencies. As a result,the aforementioned confounding bias in the estimation is reducedthrough the following adjustment formula:",
  "The specic exemplifying instance displays the following RoX datadescriptions:": "Subsystem: Suspension Root Cause: Part physically damaged Observation: failure mechanical brake trailer and use elec-trical release kph brake Solution: download showed only one instance of failureon trailer with loss of comms with bcu this fault clearedwhen tram was put i nto to remove brake isolation howeveron tram being put back into s axle failed to apply downloadshowed w at fault cor re ct reporting checked end switchdisconnected and found verdigris on pins new loom madeup and tted fault still present so ch anged proximity switchtram te ran to bulwell and back with tct all probes alignedthroughcoasting all trailer proximity swi tches and looms cleanedand checked The data for this record are shown for qualitative comparativepurposes. In a live real-world Smart Troubleshooting setting, themaintainer or engineer shall provide the description of the observedproblem only, and the system shall add value by producing the di-agnosis results in terms of the root cause(s) and the likely solu-tion(s).",
  "Prompt-based Generation": "Finally, based on the given problem Observation text, on the mostlikely Root Cause, and on the text retrieved from the most likelyunbiased Solution, the LLM can now synthesize the following en-hanced advisory: Solution 1: Check and Replace Bolts. As the possible causesuggested is failure of handover from the o-coming shift,which resulted in torquing the hangar bolts using old bolts,it is possible that the bolts may have been loose or damaged.Therefore, check and replace the bolts to ensure they aretightened properly to secure the suspension. Solution2: Address Oil Leakage. Another possible cause men-tioned is oil leakage from the axles, which can cause damageto the suspension and aect the braking system. Check foroil leakage around the axle and replace any damaged sealsto prevent further damage. Solution 3: Replace Snapped Earth Cable. Previous observa-tion mentions that a snapped earth cable was found, whichcan cause electrical issues in the braking system. Replacethe snapped earth cable to ensure proper electrical connec-tion and prevent any further failures. Solution 4: Address Corrosion. Corrosion can aect the sus-pension and braking system, leading to safety issues. Checkfor any signs of corrosion in the suspension and braking components and address them accordingly. Apply anti-corrosionmeasures, such as applying Loctite corrosion inhibitor, toprevent further damage. Solution 5: Adjust or Replace Fixings. Previous observationmentions that some xings were found to be below spec,which can aect the suspension. Adjust or replace any x-ings that are found to be damaged or not secure enough toensure proper suspension. Solution 6: Inspect Sanding Compressor. Previous observa-tion mentions that the sanding compressor was rebuilt, butfaults were still present after testing. Inspect the compres-sor and its components to identify any potential issues andaddress them to prevent any further failures. Solution 7: Address Worn Cable Insulation. Previous obser-vation mentions that the cable insulation was found wornthrough, which can cause electrical issues in the brakingsystem. Address any worn-out cable insulation to ensureproper electrical connection and prevent any further fail-ures. Solution 8: Replace Damaged Component. Previous obser-vation mentions that a damaged mudap was found, whichcan aect the suspension and braking performance. Replaceany damaged components to ensure proper operation of thesuspension and braking system. It is important to note that these proposed solutions are basedon the given information and any previous records, and they maynot be exhaustive. However, most of them correctly advise a re-placement action (for a part that is physically damaged).Finally, while the way to quantitatively (i.e., objectively) eval-uate the LLM-generated outcomes is still an open research ques-tion driven by correlational (i.e., not necessarily causal) scores ,these qualitative (i.e., subjective) results suggest a reasonably promis-ing future to help the subject matter experts troubleshoot the fail-ures in challenging industrial settings.",
  "DISCUSSION": "Apparently, the quality of the text generated by the LLM seemshigher than what the sta write on the RoX records: it shows moreclarity, better diction, and better spelling. Nevertheless, there areno safety guarantees against hallucinations, and state-of-the-artLLMs are also subject to irrational behavior and reasoning break-down even on simple tasks .Up to this point, the approach presented in this workshop paperhas described the basic principles of its causal RCA and SolutionGeneration technology, and an initial experimental proof of con-cept has been shown. This early stage of maturity corresponds toa standard ISO 16290 Technology Readiness Level (TRL) between4 and 5, because it has been validated in some real-world relevantenvironments . This section brainstorms some avenues of im-provement to increase this robustness indicator up to higher qual-ity standards, considering the specic challenges of complex indus-trial environments, and to eventually demonstrate the technologyin an operational environment (TRL 67).",
  "Vector Database": "One rst idea could be to improve the granularity of the (currentlydiscrete categorical) linguistic representation in the Causal BayesianNetwork. The approach presented in .1.1 rst embeds theunstructured text data into a large vector space, then it reducesthe dimensionality of this real-valued numerical description, andnally it quantizes the resulting low-dimensional representation toobtain a categorical random variable. At each step, though, someinformation is lost due to compression, and while this is especiallyadvantageous to decrease the complexity of the ensuing (discrete)probabilistic model, maybe it also introduces some unnecessarylimitations. Therefore, to potentially improve this situation, Hy-brid Bayesian Networks may be helpful to represent the Observa-tion and Solution texts with their original vectors (note that theSubsystem and the Root Cause variables shall retain their categor-ical nature). Hybrid Bayesian approaches, which are able to simul-taneously model both discrete and continuous variables , havealready enjoyed success in multivariate domains for predicting de-lays in operations , and also in the reliability assessment oflarge infrastructure networks .In this new modeling scenario, the text may exploit the largerdistributed representation of the LLM embedding, which is char-acterized by a set of independent real-valued dimensions. For re-trieval purposes, the most likely vector in the embedded linguis-tic space = (0, 1, ...) could rst be obtained as:",
  "() ,(6)": "and then the matching with the RoX records could be conductedusing the cosine distance metric that has traditionally been sup-ported by the statistical language processing eld. However, it re-mains to be seen how the curse of dimensionality will aect thetechnical setting. In any case, this realignment with the well estab-lished techniques may be of help to increase the TRL.",
  "Transportability": "Generalizing empirical ndings to new environments or popula-tions is necessary in the Smart Troubleshooting setting becausethere are dierent projects and eets considered, and each envi-ronment exhibits particularities in the written form of the text data.The concept of transportability is dened as a license to transferinformation learned in one environment or domain to a dierentenvironment , and thus reduce the covariate shift problem.Transportabilityanalysis assumes that enough structuralknowl-edge about both domains is known in order to substantiate the pro-duction of their respective causal diagrams. To formally articulatethis transfer procedure, a selection variable must be introducedto represent the dierences between the deployments. In the RoX-based Smart Troubleshooting setting for the industry, the assump-tion is that the only relevant dierence among the environmentsis driven by the population of subsystems, thus (in fact,some components are only present in specic platforms and assets,so this premise is well founded). The resulting transport formulato generate solutions from a source environment to a target en-vironment is shown as follows:",
  ",(|) (|,,) () .(7)": "If one particular environment is found to be especially lack-ing in some aspect, then the rest of the environments can beused to estimate the desired probabilistic distribution. This smartworkaround to a direct data shortage problem that leverages theindirect data from multiple settings is expected to increase the ro-bustness of the predicition, which in turn may help to increase theTRL of the nal solution.",
  "Counterfactual Analysis": "So far, the main focus of the analysis has been put on the observedfactual data at the population level. However, these data representonly one of the many potential outcomes the system could have ex-perienced: had things been dierent, an alternative outcome mayhave been observed. In this sense, a counterfactual describes a po-tential distribution at the individual level driven by hypotheticalspeculations over data that may contradict the facts. This level ofanalysis constitutes an additional third rung in the Hierarchy ofCausality described in .2. Conducting this estimation re-quires the following three steps : (1) Abduction: Beliefs about the world are initially updated bytaking into account all the evidence given in the context ofa single instance/unit. Formally, the exogenous noise prob-ability distributions ( ) are updated to ( |).(2) Action: Interventions are then conductedto reect the coun-terfactual assumptions, and a new causal model is thereforecreated.(3) Prediction: Finally, counterfactual reasoning occurs overthe new model using the updated knowledge.",
  "Gaining access to such involved analysis creates a new area ofresearch to enhance Predictive Maintenance": "5.3.1Algorithmic Recourse. Algorithmic Recourse is an approachthat systematically explores these counterfactual worlds . Suchenvironments are simulated via inference through (atomic) inter-ventions in the form of alternative problem descriptions. Thisis expected to help in the recognition and understanding of thegeneral root causes that lead to the system failure , and thesolution advisory that leads to greater availability.Formally, the specic retrospective reasoning that these coun-terfactuals explore on the reported anomaly, i.e., the full descrip-tion of the solved problem, can be stated as:",
  "(|( = ), ,,,) .(8)": "Given that the solution of a problem was factually implementedand recorded in the RoX data, i.e., through observing all of the vari-ables (Z,C,O,S), Equation (8) estimates the probability distributionof the textual representation of the hypothetical Solution hadthe problem been described (and represented) by , instead of thenumerical representation it actually had when it was written. Thissophisticated degree of surgical detail enbales driving investiga-tions to a deeper level, and this is regarded to help in the advanceof the TRL.",
  "CONCLUSION": "This workshop paper has developed a complete top-down trou-bleshooting approach from rst Causal Inference principles thatis also compliant with industrial development guidelines. On thebasis of processing technical language, the focus of this learningchallenge has been put on creating a distributed representation oflinguistic features, and exploiting it for the purpose of obtainingunbiased causal diagnostics and solutions. This approach has beenillustrated through a relevant example in the Predictive Mainte-nance domain, and the results arguably suggest a promising lineof future research toward a method to evaluate generative modelsin other industrial settings. Alaeddini, A., and Dogan, I. 2011. Using Bayesian networks for root cause anal-ysis in statistical process control. Expert Systems with Applications 38 (2011),1123011243. Amatriain, X. 2024. Prompt Designand Engineering: Introduction and AdvancedMethods. arXiv:2401.14423 [cs.SE] (2024). Atienza, D., Larraaga, P., and Bielza, C. 2022. Hybrid semiparametric Bayesiannetworks. TEST 31 (2022), 299327. Bareinboim, E., and Pearl, J. 2013. A General Algorithm for Deciding Transporta-bility of Experimental Results. Journal of Causal Inference 1, 1 (2013), 107134. Bareinboim, E., Correa, J. D., Ibeling, D., and Icard, T. 2022. On Pearls Hierarchyand the Foundations of Causal Inference. Probabilistic and Causal Inference: TheWorks of Judea Pearl (2022), 507556. Brundage, M. P., Sexton, T., Hodkiewicz, M., Dima, A., and Lukens, S. 2021. Tech-nical language processing: Unlocking maintenance knowledge. ManufacturingLetters 27 (2021), 4246. Bunge, M. 2008. Causality and Modern Science. Routledge. Chen, B., Zhang, Z., Langren, N., and Zhu, S. 2023. Unleashing the potential ofprompt engineering: a comprehensive review. arXiv:2310.14735 [cs.CL] (2023). Cook, R. I. 2000. How Complex Systems Fail. Cognitive Technologies Labratory,University of Chicago (2000). Dersin, P. 2023. Modeling Remaining Useful Life Dynamics in Reliability Engi-neering. CRC Press. Feder, A., Keith, K. A., et al. 2022. Causal Inference in Natural Language Pro-cessing: Estimation, Prediction, Interpretation and Beyond. Transactions of theAssociation for Computational Linguistics 10 (2022), 11381158. Fink, O., Wang, Q., Svensn, M., Dersin, P., Lee, W.-J., and Ducoe, M. 2020. Po-tential, challenges and future directions for deep learning in prognostics andhealth management applications. Engineering Applications of Articial Intelli-gence 92, 103678 (2020), 115. Ganguly, N., Fazlija, D., Badar, M., et al. 2023. A Review of the Role of Causalityin Developing Trustworthy AI Systems. arXiv:2302.06975 [cs.AI] (2023). Grootendorst, M. 2022. BERTopic: Neural topic modeling with a class-basedTF-IDF procedure. arXiv:2203.05794 [cs.CL] (2022). IEC. 2006. Analysis techniques for system reliability - Procedure for failure modeand eects analysis (FMEA). Technical Report 60812:2006. International Elec-trotechnical Commission. ISO. 2003. Condition monitoring and diagnostics of machine systems: Data pro-cessing, communication and presentation. Technical Report 13374-1:2003. Inter-national Organization for Standardization. ISO. 2013. Space systems - Denition of the Technology Readiness Levels (TRLs)and their criteria of assessment. Technical Report 16290:2013. International Or-ganization for Standardization. Jurafsky, D., and Martin, J. H. 2024. Speech and Language Processing. PearsonEducation Inc. Karimi, A.-H., Barthe, G., Schlkopf, B., and Valera, I. 2022. A Survey of Algorith-mic Recourse: Contrastive Explanations and Consequential Recommendations.ACM Computing Surveys 55, 5 (2022), 95. Kim, S., Suk, J., Cho, J. Y., et al. 2024. The BiGGen Bench: A Principled Bench-mark for Fine-grained Evaluation of Language Models with Language Models.arXiv:2406.05761 [cs.CL] (2024). Lessan, J., Fu, L., and Wen, C. 2019. A hybrid Bayesian network model for pre-dicting delays in train operations. Computers & Industrial Engineering 127 (2019),12141222. Li, M., Li, Z., Yin, K., Nie, X., Zhang, W., Sui, K., Pei, D. 2022. Causal Inference-Based Root Cause Analysis for Online Service Systems with Intervention Recog-nition. Proc. of the 28th ACM SIGKDD Conference on Knowledge Discovery andData Mining (2022), 32303240. Lukens, S., and Ali, A. 2023. Evaluating the Performance of ChatGPT in the Au-tomation of Maintenance Recommendations for Prognostics and Health Man-agement. Proc. of the Annual Conference of the PHM Society 15, 1 (2023). Macmillan-Scott O, and Musolesi M. 2024. (Ir)rationality and cognitive biases inlarge language models. Royal Society Open Science 11, 240255 (2024). Malzer, C., and Baum, M. 2020. A Hybrid Approach To Hierarchical Density-based Cluster Selection. Proc. of the IEEE International Conference on MultisensorFusion and Integration for Intelligent Systems (2020), 223228. Manning, C., and Schtze, H. 1999. Foundations of Statistical Natural LanguageProcessing. The MIT Press. McInnes, L., Healy, J., and Melville, J. 2018. UMAP: Uniform Manifold Approx-imation and Projection for Dimension Reduction.arXiv:1802.03426 [stat.ML](2018). Mikolov, T., Sutskever, I., Chen, K., Corrado, G., and Dean, J. 2013. Distributedrepresentations of words and phrases and their compositionality. Proc. of the26th Conference on Neural Information Processing Systems - Volume 2 (2013). Nezhurina, M., Cipolina-Kun, L., Cherti, M., and Jitsev, J. 2024. Alice in Wonder-land: Simple Tasks Showing Complete Reasoning Breakdown in State-Of-the-Art Large Language Models. arXiv:2406.02061 [cs.LG] (2024). Pearl, J. 2012. The Do-Calculus Revisited. Proc. of the 28th Conference on Uncer-tainty in Articial Intelligence (2012), 411. Pearl, J. 2019. The seven tools of causal inference, with reections on machinelearning. Communications of the ACM 62, 3 (2019), 5460. Pearl, J., Glymour, M., and Jewell, N. P. 2016. Causal Inference in Statistics: APrimer. John Wiley and Sons Ltd. Pourret, O. 2008. Introduction to Bayesian networks. Bayesian Networks: APractical Guide to Applications (2008), 113. Reichenbach, H. 1956. The Direction of Time. University of California Press, LosAngeles. Sala, R., Pirola, F., Pezzotta, G., and Cavalieri, S. 2024. Leveraging Natural Lan-guage Processing for enhanced remote troubleshooting in Product-Service Sys-tems: A case study. Procedia Computer Science 232 (2024), 12591268. Touvron, H., Martin, L., et al. 2023. Llama 2: Open Foundation and Fine-TunedChat Models. arXiv:2307.09288 [cs.CL] (2023). Trilla, A., Mijatovic, N., and Vilasis-Cardona, X. 2022. Towards Learning CausalRepresentations of Technical Word Embeddings for Smart Troubleshooting. In-ternational Journal of Prognostics and Health Management 13, 22 (2022), 117. Valcamonico, D., Baraldi, P., Zio, E., Decarli, L., Crivellari, A., and La Rosa, A.2024. Combining natural language processing and bayesian networks for theprobabilistic estimation of the severity of process safety events in hydrocarbonproduction assets. Reliability Engineering & System Safety 241, 109638 (2024). Vaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. M., Kaiser,L., and Polosukhin, I. 2017. Attention Is All You Need. Proc. of the 31st Conferenceon Neural Information Processing Systems (2017), 115. Wang, W., Wei, F., Dong, L., Bao, H., Yang, N., and Zhou, M. 2020. MiniLM:Deep Self-Attention Distillation for Task-Agnostic Compression of Pre-TrainedTransformers. arXiv:2002.10957 [cs.CL] (2020). Weidl, G., Madsen, A. L., and Dahlquist, E. 2008. Decision support on complex in-dustrial process operation. Bayesian Networks: A Practical Guide to Applications(2008), 313328. Wilson, P. F., Dell, L. D., and Anderson, G. F. 1993. Root Cause Analysis: A Toolfor Total Quality Management. ASQ Quality Press. Woods, C., Selway, M., Bikaun, T., Stumptner, M., and Hodkiewicz, M. 2024. Anontology for maintenance activities and its application to data quality. SemanticWeb 15, 2 (2024), 319352. Yuan, B., Zhang, J., et al. 2024. Emergence and Causality in Complex Systems:A Survey of Causal Emergence and Related Quantitative Studies. Entropy 26, 2(2024). Zwirglmaier, K., Chan, J., Papaioannou, I., Song, J., and Straub, D. 2024. HybridBayesian Networks for Reliability Assessment of Infrastructure Systems. ASCE-ASME Journal of Risk and Uncertainty in Engineering Systems, Part A: Civil Engi-neering 10, 2 (2024)."
}