{
  "Binggui Zhou, Xi Yang, Shaodan Ma, Feifei Gao, and Guanghua Yang": "AbstractIn time division duplexing (TDD) millimeter wave(mmWave) massive multiple-input multiple-output (MIMO) sys-tems, downlink channel state information (CSI) can be obtainedfrom uplink channel estimation thanks to channel reciprocity.However, under high-mobility scenarios, frequent uplink channelestimation is needed due to channel aging. Additionally, largeamounts of antennas and subcarriers result in high-dimensionalCSI matrices, aggravating pilot training overhead. To addressthis, we propose a three-domain (3D) channel extrapolationframework across spatial, frequency, and temporal domains.First, considering the effectiveness of traditional knowledge-driven channel estimation methods and the marginal effectsof pilots in the spatial and frequency domains, a knowledge-and-data driven spatial-frequency channel extrapolation network(KDD-SFCEN) is proposed for uplink channel estimation viajoint spatial-frequency channel extrapolation to reduce spatial-frequency domain pilot overhead. Then, leveraging channelreciprocity and temporal dependencies, we propose a tempo-ral uplink-downlink channel extrapolation network (TUDCEN)powered by generative artificial intelligence for slot-level channelextrapolation, aiming to reduce the tremendous temporal domainpilot overhead caused by high mobility. Numerical results demon-strate the superiority of the proposed framework in significantlyreducing the pilot training overhead by 16 times and improvingthe systems spectral efficiency under high-mobility scenarioscompared with state-of-the-art channel estimation/extrapolationmethods.",
  "I. INTRODUCTION": "This work was supported in part by the National Natural Science Foundationof China under Grants 62261160650, 62171201, and 62301221; in part by theMajor Talent Program of Guangdong Provincial under Grant 2019QN01S103;in part by the open research fund of National Mobile CommunicationsResearch Laboratory, Southeast University (No. 2024D02); in part by theScience and Technology Development Fund, Macau SAR, under Grants0087/2022/AFJ and 001/2024/SKL; and in part by the Research Committee ofUniversity of Macau under Grants MYRG-GRG2023-00116-FST-UMDF andMYRG2020-00095-FST. (Corresponding authors: Xi Yang; Guanghua Yang.)Binggui Zhou is with the School of Intelligent Systems Science andEngineering, Jinan University, Zhuhai 519070, China; and also with the StateKey Laboratory of Internet of Things for Smart City and the Department ofElectrical and Computer Engineering, University of Macau, Macao 999078,China (e-mail: ).Xi Yang is with the Shanghai Key Laboratory of Multidimensional Informa-tion Processing, East China Normal University, Shanghai 200241, China, andis also with the National Mobile Communications Research Laboratory, South-east University, Nanjing 210096, China (e-mail: ).Shaodan Ma is with the State Key Laboratory of Internet of Things forSmart City and the Department of Electrical and Computer Engineering, Uni-versity of Macau, Macao 999078, China (e-mail: ).Feifei Gao is with the Department of Automation, Tsinghua University,Beijing 100084, China (e-mail: ).Guanghua Yang is with the School of Intelligent Systems Science andEngineering, and Guangdong International Cooperation Base of Science andTechnology for GBA Smart Logistics, Jinan University, Zhuhai 519070, China(e-mail: ). MILLIMETER wave (mmWave) massive multi-inputmulti-output (MIMO) has been recognized as a pivotaltechnology for the fifth generation (5G) wireless communi-cation systems and beyond . mmWave massive MIMOis anticipated to provide spatial degrees of freedom, diversityor multiplexing gain, and array gain, thereby improving thespectral and energy efficiencies of wireless communicationsystems. To reap the benefits of massive MIMO, accuratechannel state information (CSI) should be attained whetheroperating in the time division duplexing (TDD) or frequencydivision duplexing (FDD) modes , . Specifically, inTDD massive MIMO systems, thanks to the uplink-downlinkchannel reciprocity, the base station (BS) can obtain thedownlink CSI via uplink channel estimation and downlink CSIderivation at the BS side.The uplink-downlink channel reciprocity in the TDD mas-sive MIMO systems holds within the channel coherence time.However, in high-mobility scenarios, the channel is fast time-varying due to the UE movement, resulting in a short channelcoherence time and the consequent channel aging issue, i.e.,the channel varies between when it is acquired at the BSand when it is used for downlink precoding . In addition,compared with sub-6 GHz bands, mmWave bands are morevulnerable to the mobility of the user equipment (UE) sincehigher frequency bands generally lead to a shorter channelcoherence time , deteriorating the channel aging issue inmmWave massive MIMO systems under high-mobility sce-narios. To avoid significant performance degradation causedby channel aging, frequent channel estimation needs to beconducted such that downlink precoding can be conductedbased on up-to-date CSI, leading to huge temporal domainpilot training overhead. Besides, due to the large numberof antennas at the BS and large amounts of subcarriers inorthogonal frequency-division multiplexing (OFDM) systems,the spatial and frequency domain pilot training overheadis also huge and unacceptable. In addition, to reduce thehardware cost and power consumption, a hybrid precodingstructure is usually adopted and only a small number of radiofrequency (RF) chains are deployed at the BS, especially formmWave massive MIMO systems. To obtain the uplink CSIat all receiving antennas at the BS, the BS has to switch theantennas connected to these RF chains several times duringthe uplink channel estimation, leading to substantial time andpower consumption. Therefore, it is of great significance tominimize the pilot training overhead in the spatial, frequency,and temporal domains while estimating the CSI accurately.To circumvent huge frequency domain pilot training over-head, frequency domain channel extrapolation has been widely",
  "arXiv:2406.08887v2 [eess.SP] 29 Dec 2024": "investigated in related works. In , a linear interpolationleast square (LS) channel estimation method was proposed forchannel estimation with pilots in partial subcarriers. In , theperformance of various interpolation methods for mmWaveMIMO-OFDM systems, including spline interpolation, dis-crete Fourier transform (DFT) -based interpolation, etc., wasinvestigated. Recently, with the advances in deep learning,many deep learning-based frequency domain channel extrapo-lation methods were proposed to further reduce pilot trainingoverhead and improve channel estimation accuracy from thefrequency domain perspective. In , the super-resolutionconvolutional neural network (SRCNN) was presented to ob-tain full channel responses with the channel responses at pilotpositions via deep image processing techniques. By jointlylearning the spatial-temporal domain features of massiveMIMO channels with a temporal attention module and a spatialattention module, a dual-attention-based channel estimationnetwork (DACEN) was proposed to realize accurate channelestimation via low-density pilots in the frequency domain . The development of deep learning has also led to increasingattention in antenna (spatial) domain channel extrapolationin recent years, aiming at reducing the huge spatial domainpilot training overhead and prohibitive time and power con-sumption. For example, two fully connected neural networks(FCNNs) were proposed to use the CSI of a subset of antennasto extrapolate the CSI of other antennas , . In addition to spatial and frequency domain channel extrapo-lation, channel prediction (i.e., temporal channel extrapolation)is also a convincing method for alleviating the huge pilot train-ing overhead in high-mobility scenarios. Linear extrapolationmethods and statistical prediction models, e.g., autore-gressive (AR) models , , were proposed and havedemonstrated that channel prediction is promising to mitigatethe impacts of channel aging. The advancements of DNNsfurther improve the channel prediction performance and thuswould further reduce the channel estimation frequency in high-mobility scenarios. In , a novel long short-term memory(LSTM) based channel predictor was proposed to learn chan-nel variations and thereby reduce the pilot training overheadfor channel estimation. An attention-based channel predictorwas proposed in to achieve frame-level channel estimatesfor mobile scenarios. However, frame-level channel predictionmethods are unable to achieve high spectral efficiency dueto fast time-varying channels under high-mobility scenarios,posing demands on slot-level channel extrapolation. Moreover,existing channel prediction methods are unable to deal withmassive MIMO-OFDM systems with substantial antennas andsubcarriers due to the high-dimensional CSI matrices and theconsequent tremendous computational complexity. To overcome the limitations of these existing works and tosystematically reduce the pilot overhead, a spatial, frequency,and temporal domain (3D) channel extrapolation frameworkis proposed in this paper to reduce the pilot training overheadfrom these three domains respectively. First, it can be observedthat the number of pilots in one certain domain shows themarginal effect, i.e., as the number of pilots in this domainincreases, the improvement in channel estimation accuracy gradually decreases.1 Second, considering the capability ofdeep neural networks (DNNs) in extracting the spatial andfrequency domain characteristics of massive MIMO channels,it is expected that exploiting DNNs for joint spatial andfrequency domain channel extrapolation will further reducethe pilot training overhead. However, although some workshave pointed out that jointly learning spatial-frequency do-main features is beneficial to channel estimation , ,spatial-frequency channel extrapolation has not yet been wellinvestigated to reduce the pilot training overhead for mmWavemassive MIMO-OFDM systems. In addition, spatial-frequencycorrelations and long-term temporal domain dependencies(i.e., dependencies over multiple slots) of downlink channelsare rarely investigated to reduce computational complexityand facilitate slot-level channel extrapolation. Therefore, wefirst propose a knowledge-and-data driven spatial-frequencychannel extrapolation network (KDD-SFCEN) to reduce thespatial-frequency domain pilot overhead. Specifically, coarselow-dimensional channel estimates are first obtained with aknowledge-driven channel estimator from low-density pilotsin spatial and frequency domains and then extrapolated tothe full-dimensional CSI with the spatial-frequency channelextrapolation network. After that, a temporal uplink-downlinkchannel extrapolation network (TUDCEN) is proposed forslot-level channel extrapolation, aiming to reduce the temporaldomain pilot overhead. To the best of our knowledge, noneof the existing works have investigated such a systematicframework to reduce the pilot training overhead and improvethe spectral efficiency of mmWave massive MIMO-OFDMsystems under high-mobility scenarios. The major contribu-tions of this paper are summarized as follows: 1) We propose the KDD-SFCEN to reduce the spatial-frequency domain pilot overhead effectively via jointspatial-frequency channel extrapolation. In addition, itis worth emphasizing that the substantial time andpower consumption due to antenna switching can beavoided through spatial extrapolation. The proposedKDD-SFCEN consists of a knowledge-driven coarsechannel estimator to provide coarse channel estimatesand accelerate the training of the proposed network.The KDD-SFCEN also comprises a spatial-frequencychannel extrapolator encompassing the attention-basedsub-element extrapolation module (ASEEM) and the pro-gressive extrapolation architecture to exploit spatial andfrequency correlations of wireless channels for spatial andfrequency domain extrapolation. Specifically, based onthe observation that antennas/subcarriers exhibit strongercorrelations when they are closer, the progressive ex-trapolation architecture is designed to first focus oncapturing the correlations between neighboring anten-nas/subcarriers, and then progressively broaden the scopeto capture correlations, while the ASEEM is designedto capture specific spatial/frequency correlations in theprocess.",
  "V-B": "nel extrapolation given the estimated uplink CSI at thefirst slot. Through the proposed TUDCEN-aided pilottraining scheme, channel estimation can be conductedless frequently and more slots can be configured fordata transmission than a general pilot training schemeunder high-mobility scenarios, further reducing the tem-poral domain pilot overhead and improving the systemsspectral efficiency. The TUDCEN is composed of anuplink-downlink channel calibration network (UDCCN)and a downlink channel extrapolation network (DCEN).The UDCCN calibrates the estimated uplink channelto the downlink channel at the first downlink slot tocompensate for the hardware asymmetry in transceivers. The DCEN achieves slot-level channel extrapolationvia spatial-frequency sampling embedding and autore-gressive generation with the generative Transformer .Spatial-frequency sampling embedding is proposed toreduce the tremendous computational complexity due tohigh-dimensional CSI matrices by exploiting spatial andfrequency correlations of wireless channels. We exploitthe generative Transformer for generating downlink chan-nels autoregressive by learning temporal dependenciesof wireless channels over time, which enables slot-leveldownlink channel extrapolation given only the first down-link channel, thereby avoiding heavy slot-level historicaldownlink channel estimation. 3) We use the sounding reference signal (SRS) definedby the 3rd generation partnership project (3GPP) 5Gtechnical specification as the pilot signal for uplinkpilot training. The frame structures and system settings inframework design and numerical simulations also followthe 3GPP 5G technical specification. Numerical resultsdemonstrate the superiority of the proposed framework insignificantly reducing the spatial-frequency domain pilotoverhead by 4 times via spatial-frequency channel extrap-olation compared with state-of-the-art spatial-frequencychannel estimation/extrapolation methods. In addition, byreducing the times of single-slot channel estimations withslot-level channel extrapolation, the proposed frameworkfurther reduces the temporal domain pilot overhead by4 times and significantly improves the mmWave massiveMIMO systems spectral efficiency under high-mobilityscenarios. The remainder of this paper is organized as follows. InSection II, we introduce the system model and formulatethe spatial, frequency, and temporal channel extrapolationproblem. In Section III, we propose the KDD-SFCEN foruplink channel estimation to reduce the spatial-frequencydomain pilot training overhead. In Section IV, we proposethe TUDCEN for slot-level channel extrapolation to reducethe temporal domain pilot overhead. In Section V, simulationresults are presented to demonstrate the superiority of the pro-posed spatial, frequency, and temporal channel extrapolationframework. Finally, we conclude this work in Section VI.",
  "Notation: Underlined bold uppercase letter A, bold upper-case letter A, and bold lowercase letter a represent a tensor, amatrix, and a vector, respectively. Calligraphy uppercase letter": "A represents a set. A{s, t} denotes the representation of A atthe t-th slot of the s-th sub-frame. A:,n and Am,n denote then-th column and the element at the m-th row and n-th columnof the matrix A, respectively. ()T , ()H, and ()1 denotethe transpose, conjugate-transpose, and inverse of a matrix,respectively. , , E{}, and 2 denote the ceiling function,Hadamard product, expectation, and L2 norm, respectively.",
  "A. System Model": "As shown in (a), we consider a mmWave massiveMIMO system working in the TDD mode, where a singleBS equipped with NT 1 antennas and NRF NT RFchains serves a single user equipped with NR antennas. TheBS is realized with a hybrid precoding architecture, as (b) shows. The system operates with the OFDM modulationwith a total of Nc 1 subcarriers. By leveraging theuplink-downlink channel reciprocity in the TDD system, thedownlink CSI can be acquired via uplink channel estimationand downlink channel derivation. A simplified downlink CSIacquisition and data transmission process based on uplink pilottraining is also shown in (a). The process consistsof three phases, i.e., uplink pilot transmission (phase 1), BSsignal processing (phase 2), and downlink data transmission(phase 3). Specifically, the uplink pilot signal is first trans-mitted by the UE to the BS for uplink channel estimation(phase 1). Then the BS estimates the uplink channel giventhe received pilot signal, derives the downlink channel, andconducts downlink precoding (phase 2). After that, the BStransmits data symbols to the UE based on the downlinkprecoder and other transmission parameters (phase 3).2 Due to the limited number of RF chains, only the uplinkCSI at NRF antennas connected to the NRF RF chains canbe obtained in each uplink pilot signaling process. Therefore,to obtain the uplink CSI at all NT antennas, the BS has toswitch the antennas connected to these NRF RF chains forNTNRF times, leading to huge time and power consumption.Specifically, for the i-th subcarrier and the k-th uplink pilotsignaling process, denote the uplink CSI at NRF antennas,the transmitted diagonal pilot signal, the received pilot signal,and the uplink noise as H(k)i CNRF NR, Spi(k) CNRNR,Ypi(k) CNRF NR, and Npi(k) CNRF NR, respectively.The set of antennas connected to RF chains in the k-thuplink pilot signaling process is denoted as A(k)RF , and H(k)icorresponds to the uplink CSI at antennas in A(k)RF . Then,Ypi(k) can be represented as",
  "Ypi(k) = H(k)iSpi(k) + Npi(k),(1)": "2Note that the working modes of the hybrid array in phase 1 and phase 3are different. In phase 1, each RF chain is connected to an antenna at a timeto receive the individual signal from this antenna and switches to connect toother antennas, which enables CSI acquisition for all antennas and facilitatesdownlink precoding. While in phase 3, each RF chain is connected to multipleantennas at the same time and combines the signals received by multipleantennas, achieving a balance between system performance and complexity. . A TDD massive MIMO system with the hybrid precoding architecture at the BS. (a) The TDD massive MIMO system; (b) The hybrid precodingarchitecture at the BS; (c) The 5G frame structure; (d) An exampled TDD slot pattern with a general pilot training scheme; (e) An exampled TDD slot patternwith the SLCE-aided pilot training scheme; (f) An exampled uplink SRS pattern.",
  "yi = Hdi FRFiFBBisi + ni,(6)": "where si CNR1 and ni CNR1 are the transmittedsignal and the downlink noise at the i-th subcarrier, andFRFi CNT NRF and FBBi CNRF NR are the analogand digital precoding matrices, respectively. In addition, FRFican be designed via the discrete Fourier transform (DFT)codebook-based analog precoding algorithm, and FBBican bedesigned via the zero-forcing (ZF) algorithm.",
  "B. Problem Formulation": "To support the measurement of all transmit ports and sub-carriers, the length of the pilot signal is NR Nc. Therefore,the pilot training overhead is (NRF NTNRF ) NR Nc =NT NR Nc, which is extremely high and significantlychallenging to the systems spectral efficiency. In addition, thetime and power consumption due to the switching of antennasconnected to RF chains is also unaffordable. Moreover, thepilot signal should be transmitted for uplink channel estimationevery channel coherence time Tc to avoid significant channelaging. For simplicity, we call this scheme the general pilottraining scheme hereafter. We denote the pilot signal period asTp and for the general pilot training scheme we have Tp Tc.Note that as specified in the 3GPP 5G technical specification, the frame structure in the 5G new radio (NR) is shownin (c). Each frame spans 10 ms and is divided into twohalf-frames. Each half-frame spans 5 ms and contains fivesub-frames, with each sub-frame spanning 1 ms. The numberof slots in one sub-frame, i.e., Nslot, is determined by thenumerology , and Nslot = 2. Here we assume = 3 whichindicates Nslot = 8 in one sub-frame and each slot spans 0.125ms. It should be emphasized that under scenarios with highcarrier frequency and high UE mobility, the channel coherencetime could be very short. For instance, when operating at acarrier frequency of 28 GHz and with the UE velocity of 60km/h, the channel coherence time is approximately 0.32 ms. With the general pilot training scheme, the pilot signalhas to be transmitted every two slots (i.e., Tp = 0.25 ms)to mitigate channel aging with Tc = 0.32 ms as (d) .The overall framework of the proposed spatial, frequency, and temporal channel extrapolation method. The proposed method first realizes uplinkchannel estimation with the KDD-SFCEN to reduce the spatial-frequency domain pilot training overhead Csl, and then conducts accurate slot-level channelextrapolation with the TUDCEN to reduce the times of uplink channel estimationsTTp , thereby systematically reducing the pilot training overhead Co. shows,3 further degrading the systems spectral efficiency.Denote the single-slot pilot training overhead Csl as the pi-lot training overhead for single-slot uplink channel estimation(i.e., the spatial-frequency domain pilot overhead), which canbe mathematically expressed as",
  "Tp Csl.(8)": "To circumvent such huge overall pilot training overhead, weconsider spatial, frequency, and temporal channel extrapolationto systematically reduce the pilot training overhead from twoperspectives: 1) reducing the single-slot pilot training overheadCsl via spatial-frequency channel extrapolation; 2) reducingthe times of single-slot channel estimationsTTp to reduce thetemporal domain pilot overhead via temporal channel extrap-olation. In addition, it is worth noting that through spatialextrapolation, the substantial time and power consumption dueto antenna switching can be avoided. And through slot-levelchannel extrapolation, more slots can be configured for datatransmission to improve the systems spectral efficiency. Theoverall framework of the proposed method is shown in . 3Note that for ease of elaboration, we do not consider uplink data transmis-sion slots in the sub-frame. Our method can be easily extended to sub-frameswith uplink data transmission slots. Additionally, in (d), (e), and (f),we assume the pilot symbol is configured at the last symbol index of eachspecial slot. On the one hand, considering the marginal effects of pilotsin the spatial and frequency domains, spatial channel ex-trapolation and frequency channel extrapolation are combinedto reduce the single-slot pilot training overhead Csl andcircumvent the time and power consumption during single-slotuplink channel estimation (SSUCE). Specifically, the NRF RFchains are connected to NRF uniformly sampled antennas outof all NT antennas without antenna switching in the wholeuplink channel estimation phase, and the pilot symbols areconfigured only on partial subcarriers. Ultimately, only thepartial uplink CSI can be obtained directly from the receivedpilot signal, and then the full uplink CSI is extrapolated fromthe partial uplink CSI. Denote the transmitted diagonal pilotsignal matrix and the corresponding received pilot signal ma-trix by Sp C(NRN c)(NRN c) and Yp CNRF (NRN c),respectively, where N c is the number of subcarriers config-ured with pilot symbols. In addition, by concatenating Hi,i = 1, 2, . . . , Nc, the uplink channel at all subcarriers, denotedby H CNT (NRNc), can be given by:",
  "H = [H1, H2, . . . , HNc].(9)": "Further denoting H{s, t}CNT (NRNc), Sp{s, t}C(NRN c)(NRN c), and Yp{s, t} CNRF (NRN c) as theuplink channel, the transmitted diagonal pilot signal matrix,and the received pilot signal matrix at the t-th slot of the s-thsub-frame, respectively, the uplink channel at the first slot ofthe s-th sub-frame can be estimated based on spatial-frequencychannel extrapolation as",
  "H{s, 0} = Fssuce(Yp{s, 0}, Sp{s, 0}),(10)": "where H{s, 0} is the estimate of H{s, 0}, and Fssuce is aDNN-based SSUCE model.On the other hand, we propose to reduce the times ofsingle-slot channel estimationsTTp by leveraging the uplink-downlink channel reciprocity and temporal dependencies forslot-level channel extrapolation (SLCE). In TDD systems, itis commonly assumed that the uplink and downlink channelsare reciprocal during the channel coherence time, such that thedownlink channel can be derived from the estimated uplinkchannel. Note that due to high UE mobility and short channelcoherence time, the uplink-downlink channel reciprocity onlyholds for the special slot of a sub-frame and a few downlinkdata transmission slots in the same sub-frame. And due to thehardware asymmetry in transceivers, uplink-downlink channelcalibration is required to derive the downlink channel accu-rately from the estimated uplink channel. Moreover, like manyreal-world phenomena, wireless channels exhibit temporaldependencies over time (e.g., explicit patterns like trends,etc). Capturing these temporal dependencies from downlinkchannels allows us to conduct accurate temporal extrapolationfor future slots. However, the temporal dependencies for high-dimensional channels are challenging to capture. Fortunately,with DNNs, it is promising to learn the uplink-downlinkchannel reciprocity and temporal dependencies for SLCE.Then, with SLCE, the pilot signal can be transmitted witha pilot signal period Tp Tc. Taking transmitting the pilotsignal only once per sub-frame and at the first slot of eachsub-frame as an example, the TDD slot pattern with the SLCE-aided pilot training scheme is provided in (e).4 In thisexample, the pilot signal period is Tp = 1 ms, which is muchlarger than the channel coherence time Tc = 0.32 ms. Totackle the channel aging issue caused by high carrier frequencyand high UE mobility, SLCE is thus anticipated to predict thedownlink channels within the pilot signal period accuratelyfor downlink data transmission. Specifically, based on theestimated uplink channel at the special slot, the downlinkchannel at the first downlink data transmission slot can beinitially acquired by exploiting the uplink-downlink channelreciprocity and via channel calibration. Then, by learning thetemporal dependencies among time-varying downlink chan-nels, accurate estimates of the downlink channels at all otherdownlink data transmission slots can be achieved. Therefore,denoting Hd{s, t} CNR(NT Nc) as the downlink channelat the t-th slot of the s-th sub-frame, the SLCE problem canbe formulated as",
  "Note that for ease of elaboration, in the following context, we simply usethis TDD slot pattern and suppose the pilot signal only once per sub-frame.The pilot signal can be set flexibly in practice": "transmission comb number NT C in the frequency domainand with frequency domain code division multiplexing (fd-CDM) for multiple antenna ports. For example, assuming thetransmission comb number NT C = 2 and the UE antennanumber NR = 4, the uplink SRS pattern in one resourceblock (RB) can be illustrated by (f), where the SRSis configured with every other resource element (RE) and hasan fd-CDM length of 4 to support 4 UE antennas. Based onNT C and the number of RBs, i.e., NRB, the received pilotsignal matrix Yp is with the size of NRF (NR N c) =NRF (NR NRB 12 NT C ), where 12 is the number ofconsecutive subcarriers that form a RB as defined in .Therefore, compared with the size of the uplink channel H,i.e., NT (NR Nc) = NT (NR NRB 12), we definethe spatial compression ratio as Rs =NTNRF and the frequencycompression ratio as Rf = NT C.In the following two sections, to reduce the overall pilottraining overhead Co from the aforementioned two perspec-tives, i.e., reducing the single-slot pilot training overhead Csland reducing the times of single-slot channel estimationsTTp ,we propose the KDD-SFCEN for single-slot uplink channelestimation and the TUDCEN for slot-level channel extrapola-tion respectively.",
  "BASED SINGLE-SLOT UPLINK CHANNEL ESTIMATION": "Considering the marginal effects of pilots in the spatialand frequency domains, we propose to conduct joint spatial-frequency channel extrapolation to reduce the pilot trainingoverhead of single-slot uplink channel estimation. Traditionalchannel estimation methods based on domain knowledge havebeen fully validated for decades that they can provide feasiblechannel estimates in time-invariant channels, which can beexploited as initial estimates for deep learning-based channelestimation methods. In addition, to estimate the uplink channelaccurately with only a few pilots in both the spatial andfrequency domains, the spatial and frequency characteristicsof massive MIMO channels must be fully exploited .Therefore, in this section, we propose the KDD-SFCEN forsingle-slot uplink channel estimation in TDD massive MIMOsystems, which benefits from both domain knowledge via thetraditional knowledge-driven channel estimation and data viajoint spatial-frequency channel extrapolation. As shown in , the proposed network consists of a knowledge-driven coarsechannel estimator and a spatial-frequency channel extrapolatorfor coarse channel estimation and spatial-frequency channelextrapolation, respectively.",
  "B. Spatial and Frequency Channel Extrapolation": "To estimate the uplink channel accurately with a fewpilots, we propose the spatial-frequency channel extrapolatorconsisting of ASEEMs and the progressive extrapolation ar-chitecture to exploit spatial and frequency correlations of wire-less channels progressively for spatial and frequency domainextrapolation. The spatial correlation refers to the correlationbetween the signals received at different antennas in theantenna domain, which practically depends on the spatialcharacteristics of the environment (e.g., multipath components,angle of arrival, etc.) and antenna configurations (e.g., antennageometry, antenna spacing, etc). The frequency correlationrefers to the correlation of the channel across different sub-carriers in the frequency domain, which is mainly influ-enced by the channels multipath delay spread and Dopplershift due to mobility. In addition, it can also be observedthat the closer the antennas/subcarriers are, the stronger thecorrelations among them are. Based on these observations,we design the progressive extrapolation architecture to firstfocus on capturing the correlations between neighboring an-tennas/subcarriers, and then progressively broaden the scopeto capture correlations, with the ASEEM designed to capture specific spatial/frequency correlations in the process. As shows, the proposed spatial-frequency channel extrapolatorcomprises a progressive spatial extrapolation block with NSEspatial ASEEMs and a progressive frequency extrapolationblock with NF E frequency ASEEMs for spatial and frequencyextrapolation, respectively. These spatial/frequency ASEEMsprogressively extrapolate partial spatial/frequency CSI to fullspatial/frequency CSI.1) ASEEMs: Partial CSI in either the spatial or frequencydomain can be regarded as downsampled information fromfull CSI in the specific domain, which is similar to animage taken from the real world. Generally, a pixel is thesmallest addressable element of an image. However, a pixelin an image might correspond to many small objects in thereal world. Motivated by this, sub-pixel imaging technologiesemerge by dividing a single pixel into smaller sub-pixels toimprove the resolution of an image. Similarly, learning todivide each element in a partial CSI into smaller sub-elementswill facilitate CSI extrapolation. This motivates us to proposethe ASEEM, which is composed of one positional encodinglayer, one attention-based sub-element generation layer, andone sub-element shuffle layer. To better illustrate the proposedASSEM, the architecture of the ASEEM is provided in .Denote the input to the ASEEM as X RNIdR, whereNI is the number of initial input elements and dR is therepresentation dimension of each input element. The posi-tional encoding layer generates a positional encoding (PE)P RNIdR for all input elements of X as",
  "X = X + P.(15)": "The attention-based sub-element generation layer furtherconsists of one multi-head self-attention (MHSA) sub-layer,one sub-element generation (SEG) sub-layer, and residualconnection (RC) and layer normalization (LN) operations around each of the two sub-layers. By splitting therepresentation of the input elements into several representationsub-spaces, the MHSA mechanism allows the neural networkto capture diverse aspects of the input elements simultane-ously, leading to better representation learning compared tothe single-head self-attention (SHSA) mechanism. The SEGsub-layer ensures the non-linear representation capability ofthe attention-based sub-element generation layer and generatessub-elements for each input element, and the RC and LNoperations stabilize the neural network training. Specifically,X is first projected to query, key, and value matrices, i.e.,Q RNIdR, K RNIdR, and V RNIdR, andthen these three matrices are split into Nh sub-matrices, respectively. For the i-th (i = 1, 2, . . . , Nh) sub-matrix set,i.e., {Qi RNIdQ, Ki RNIdK, Vi RNIdV }, withdQ = dK = dV= dR/Nh, a self-attention score matrixZi RNINI is obtained via the scaled dot-product attention(SDPA) as",
  "i=1(XRC1:,i XRC1)2,(22)": "where XRC1 RNI1 and XRC1 RNI1 denote the meanand standard deviation of XRC1, gLN1 R1dR and bLN1 R1dR are learnable affine transformation parameters, and is the Hadamard product. The output of the SEG sub-layer,i.e., XG RNI(rdR), can be formulated by XG = (Drop(ReLU(XRC1WG1 + bG1); p2))WG2 + bG2,(23)where p2 is a dropout probability, ReLU() is the rectifiedlinear unit (ReLU) activation function, WG1 RdRdG andWG2 RdG(rdR) are learnable weight matrices wheredG = dR, and bG1 R1dG and bG2 R1(rdR) arelearnable bias vectors. r is the number of sub-elements tobe generated, which is also known as the upscale factor. Theoutput of the RC operation around the SEG sub-layer, i.e.,XRC2 RNI(rdR), can be formulated by",
  "where XRC2 RNI1 and XRC2 RNI1 denote themean and standard deviation of XRC2, gLN2 R1(rdR)": "and bLN2 R1(rdR) are learnable affine transformationparameters.After the attention-based sub-element generation layer gen-erates r sub-elements for each input element, the sub-elementshuffle layer shuffles these sub-elements together to form anew input element matrix as XE = [R(XLN2:,1:r ), R(XLN2:,r+1:2r), . . . , R(XLN2:,rdRr+1:rdR)],(28)where XE R(rNI)dR, and R denotes a rearrange operatorthat transforms the size of XLN2:,i:i+r1 RNIr into (rNI)1. Therefore, through the ASEEM, the original input X RNIdR can be extrapolated to XE R(rNI)dR effectivelyvia to sub-element generation.2) Progressive Extrapolation Architecture: Since directlyextrapolating partial CSI to full CSI is significantly challeng-ing, especially when the spatial and frequency compressionratios are large, we propose to conduct spatial and frequencychannel extrapolation progressively with the progressive ex-trapolation architecture. The spatial extrapolation and fre-quency extrapolation are organized in a sequential manner,i.e., the NSE spatial ASEEMs of the progressive spatial ex-trapolation block first progressively extrapolate partial spatialCSI to full spatial CSI, and then the NF E frequency ASEEMsof the progressive frequency extrapolation block progressivelyextrapolate partial frequency CSI to full frequency CSI. Duringthis process, the sizes of the inputs to the i-th spatial ASEEM,i.e., XS(i), and the j-th frequency ASEEM, i.e., XF (i),progressively increase as",
  "XF (j) R(rj1fNF I)dF R, j = 1, 2, . . . , NF E,(30)": "where rs, NSI, and dSR are the spatial upscale factor, thenumber of initial spatial input elements, and the spatial repre-sentation dimension, respectively; and rf, NF I, and dF R arethe frequency upscale factor, the number of initial frequencyinput elements, and the frequency representation dimension,respectively. And NSE and NF E are determined by",
  "C. Model TrainingThe proposed KDD-SFCEN is trained via the mean squarederror (MSE) loss defined as5": "L1 = ENtrainH{s, 0} Fssuce(Yp{s, 0}, Sp{s, 0})22,(37)where ENtrain() denotes the expectation over Ntrain trainingsamples, and 2 denotes the L2 norm.Remark: It can be noticed that many works on mmWavechannel estimation estimate sparse parameters of mmWavechannels exploiting channel sparsity. However, we dont inten-tionally introduce channel sparsity to design our 3D channelextrapolation framework. The reasons are two-fold. On theone hand, exploiting the sparsity would require some priorknowledge of the channels specific sparse representation (e.g.,the angular spread of angle of arrival (AoA) and angle of de-parture (AoD)). Although mmWave channels generally exhibitsparsity, in some indoor mmWave communication scenarioswith rich multipath components, it is difficult to obtain anaccurate sparse representation of the channels, leading todegraded channel estimation performance of channel sparsity-based channel estimation methods. On the other hand, evenin non-mmWave systems without channel sparsity, our 3Dchannel extrapolation framework is expected to work wellto reduce the power consumption of RF chains. Therefore,channel sparsity is not incorporated into the design of the 3Dchannel extrapolation framework to generalize its applicationscenarios. Nonetheless, it is worth noting that for scenarioswith explicit channel sparsity, the 3D channel extrapolationframework can be easily extended to exploit channel sparsityto further reduce the pilot overhead and computational com-plexity. Specifically, the 3D channel extrapolation frameworkis currently trained to estimate the full channel matrix giventhe supervision of the full channel matrix. Suppose priorknowledge of the channels sparse representation is available,the 3D channel extrapolation framework can be trained tofirst estimate sparse parameters and then reconstruct the fullchannel matrix with two-level supervision given labels of bothsparse parameters and the full channel matrix.After obtaining the estimated uplink channel, the slot-levelchannel extrapolation can then be conducted to reduce thetimes of uplink channel estimationsTTp .",
  "IV. CHANNEL RECIPROCITY AND TEMPORALDEPENDENCY AIDED SLOT-LEVEL CHANNELEXTRAPOLATION": "An accurate initial state is essential to temporal channel ex-trapolation. In TDD systems, the downlink channel of the firstdownlink slot of a sub-frame can be accurately derived fromthe uplink channel of the sub-frames special slot via uplink-downlink channel calibration. This provides an accurate initialstate for predicting future downlink channels. Recent advancesin generative artificial intelligence (GAI), such as ChatGPT, have demonstrated the power of autoregressive modelslike generative Transformers in handling sequential data.Given that time-varying channels also form sequential data,generative Transformers are promising on account of theircapabilities in learning complicated temporal dependenciesand autoregressive modeling. Accordingly, we propose theTUDCEN, comprising the UDCCN and the DCEN, for slot-level channel extrapolation. The architecture of the TUDCENis shown in . Specifically, the UDCCN handles uplink-downlink calibration for initialization, while the DCEN usesthe proposed spatial-frequency sampling embedding module toreduce computational complexity and generative Transformersfor temporal dependency learning and autoregressive channelextrapolation.",
  "A. Channel Reciprocity Aided Uplink-Downlink Channel Cal-ibration": "Although the physical uplink-downlink channels withinthe channel coherence time are generally reciprocal, uplink-downlink channel calibration is practically necessary to com-pensate for the hardware asymmetry in transceivers .Specifically, downlink and uplink channels are affected by thetransmit and receive hardware (e.g., amplifiers, filters, mixers),respectively. The hardware impairments, such as amplifiernonlinearities, in-phase (I) / quadrature (Q) imbalances, orphase noise, can make the practical downlink and uplink chan-nel responses non-reciprocal. These hardware impairmentsaffect the ideal reciprocity and thus require uplink-downlinkchannel calibration to adjust for these mismatches. The uplink-downlink channel extrapolation can be formulated by",
  "Hd{s, 1} = Fudcc( H{s, 0}),(38)": "where Fudcc denotes the UDCCN.To calibrate the downlink channel from the estimated uplinkchannel, both the spatial and frequency characteristics ofthe channels should be exploited. Therefore, we propose thetwo-dimensional (2D) convolution-based calibration networkfor uplink-downlink channel calibration. The 2D convolutionoperation can capture spatial and frequency characteristics foraccurate calibration. In addition, the ReLU activation functionand the RC operation are also applied to improve the networksnon-linear representation capability and stabilize the networktraining, respectively. The input to the UDCCN is obtained by",
  "B. Temporal Dependency Learning and Downlink ChannelExtrapolation": "It is worth mentioning that the downlink channel extrapo-lation problem is conducted along the time domain and aimsto predict channels at future slots, which can be regarded as atime series prediction problem. However, different from gen-eral time series prediction problems, historical observations inthe investigated downlink channel extrapolation problem (i.e.,downlink channels at all downlink slots) can not be obtainedunless huge time-frequency resources were spent to conductchannel estimation for all downlink slots. As a result, theperformance of widely adopted non-autoregressive predictionschemes in related works would be significantly degradeddue to the lack of available historical channel information.Note that like many real-world phenomena, wireless channelsexhibit temporal dependencies over time. Then, based on thechain rule in the probability theory, the joint probability of theconcatenated downlink channels can be expressed as",
  "for t = 2, 3, . . . , Nslot 1,(44)": "where Fdce denotes the DCEN, such that (43) can be achievedand the downlink channels from the 2nd slot to the (Nslot1)-th slot can be extrapolated given only Hd{s, 1}. It is worthnoting that (44) actually refers to the autoregressive generationmanner and the DCEN should thus be an autoregressive model. And considering that Hd{s, t}, t = 1, 2, . . . , Nslot 1are dependent, capturing these temporal dependencies amongthem would be beneficial to achieve (44). To this end, wepropose the DCEN constituted by (inverse) spatial-frequencysampling embedding layers to reduce computational com-plexity and generative Transformers for temporal dependencylearning and autoregressive downlink channel extrapolation.The architecture of the DCEN is also shown in .1) Spatial-Frequency Sampling Embedding: Due to thelarge number of antennas and subcarriers, the downlink chan-nels spatial and frequency domain representation must becompressed to reduce the computational complexity of down-link channel extrapolation. Therefore, resorting to spatial andfrequency correlations of wireless channels, we propose thespatial-frequency sampling embedding layer that can reducethe spatial and frequency dimensions of high-dimensional CSImatrices, thereby reducing the computational complexity. Thespatial-frequency sampling embedding layer consists of onerearrangement operation, two LN operations, and one linearlayer, as (a) shows. The rearrangement operation splitsthe NT transmit antennas and Nc subcarriers into N1 transmitantenna groups and N2 subcarrier groups, respectively. Eachtransmit antenna group has NT",
  "N1 antennas and each subcarriergroup has Nc": "N2 subcarriers. Note that since the number of UEantennas, i.e., NR, is generally small, it is not necessary tofurther split UE antennas. Specifically, the rearrangement op-eration rearranges the sample dimension (known as the batchsize Nb), N1, and N2 together to form a new sample dimen-sion, and consequently reforms a representation dimension oflength 2NR NT",
  "N1 Nc": "N2 . Then, the dimension of the reformedrepresentation is normalized by the first LN operation. Follow-ing that, the dimension is further projected to an embeddingdimension demb by the linear layer and normalized by thesecond LN operation. Straightforwardly, the spatial-frequencysampling embedding layer samples the spatial and frequencydomain representation of downlink channels with a spatialsampling factor N1 and a frequency sampling factor N2 toreduce the representation dimension by resorting to the spatialand frequency correlations of downlink channels. Meanwhile,the N1 sampled transmit antenna groups and N2 sampledsubcarrier groups are combined to facilitate model training.It is worth noting that after the generative Transformers, theinverse spatial-frequency sampling embedding layer is appliedto transform the sampled representation dimension back to theoriginal spatial and frequency domain representation. In theinverse spatial-frequency sampling embedding layer, all layersand operations are placed and operated in the inverse directionto the spatial-frequency sampling embedding layer, as (b) shows.2) Generative Transformer and Masked MHSA Mechanism:The generative Transformer is one kind of autoregressivegenerative models that was proposed for text generation andis known as one of the most important driven forces for thetransformative ChatGPT. The core of the generative Trans-former is the masked MHSA mechanism, a pivotal componentenabling the effective processing of input sequences. Themasked MHSA mechanism allows the model to capture long-term dependencies among elements of input sequences and",
  ". The architecture of the (inverse) spatial-frequency sampling embedding layers and the generative Transformer": "selectively attends to these elements while preventing it fromlooking ahead during training by masking future elements. Tolearn temporal dependencies efficiently for downlink channelextrapolation, we propose the generative Transformer-baseddownlink channel extrapolation network. The architectureshown in (c) depicts that the proposed generativeTransformer consists of a temporal positional encoding layerand NG generative Transformer layers. The temporal posi-tional encoding layer is similar to (13) - (14). Each generativeTransformer layer further consists of a masked MHSA sub-layer, a feed-forward (FF) sub-layer, and also RC and LNoperations around each of the two sub-layers. Compared withthe MHSA sub-layer, a masking operation is introduced beforethe query, key, and value projections in the masked MHSAsub-layer. The output of the masking operation, denoted byXM RN IdR with N I being the number of input elementsand dR being the representation dimension of each inputelement, can be expressed by",
  "XM = X + M,(45)": "where X RN IdR is the input matrix to the masked MHSAsub-layer, and M RN IdR is a lower-triangular maskingmatrix whose lower triangular elements are all negative infin-ity. Note that the masked MHSA sub-layer is with N h attentionheads and a dropout probability p3. The FF sub-layer can beformulated by XF F = (Drop(ReLU(XRC1WF F 1+bF F 1); p4))WF F 2+bF F 2,(46)where XF F RN IdR, p4 is a dropout probability, WF F 1 RdRdF Fand WF F 2RdF F dR are learnable weightmatrices, and bF F 1 R1dF F and bF F 2 R1dR arelearnable bias vectors. The two sets of RC and LN operations",
  "NcN2dR).(48)": "The 2D convolution layer is blamed for high time com-plexity and the fully-connected layer is blamed for high spacecomplexity when dealing with high-dimensional inputs. Thetime complexity of the 2D convolution layer can be calculatedasO(2D Conv) = O(2k2NRNT NcdR),(49) where k >= 1 is the convolution kernel size. It is worth em-phasizing that to reduce the spatial and frequency dimensionsof the input, the stride of the 2D convolution layer should beset larger than 1, or a pooling layer should be applied afterthe 2D convolution layer. Generally, it requires a deep con-volutional network consisting of many 2D convolution layers to gradually reduce the spatial and frequency dimensions ofthe input. This thus further increases the time complexity ofusing 2D convolution layers for obtaining the spatial-frequencydomain representation for high-dimensional CSI matrices.While for the spatial-frequency sampling embedding layer,one layer is enough to obtain the spatial-frequency domainrepresentation for high-dimensional CSI matrices. Therefore,the spatial-frequency sampling embedding layer is k2 timesmore efficient than the deep convolutional network.The fully-connected layer has the same time complexity asthe spatial-frequency sampling embedding layer. However, thespace complexity of the fully-connected layer is huge, whichcan be calculated as",
  "D. Model Training": "To train the model efficiently, the sliding window methodis applied to generate windowed temporal channel slices.The window length is lw = Nslot and the sliding stride isls = Nslot. Denoting the number of training samples andthe number of sub-frames as Ntrain and Nsf, respectively,the normalized mean squared error (NMSE) loss function fortraining the UDCCN is defined as",
  "V. SIMULATIONS": "In this section, we first introduce the simulation setupfor numerical evaluations. Then, we compare the proposedKDD-SFCEN with traditional and DNN-based extrapolationmethods under various spatial and frequency compressionratios, SNRs, and UE velocity settings. We then compare theTUDCEN with DNN-based temporal channel extrapolators.Finally, we present and analyze the overall performance ofthe proposed framework in terms of the achievable rate of thesystem.",
  "A. Simulation Setup": "1) Simulation Dataset, Parameters, and Model Training:The simulation dataset is constructed using the MATLAB 5Gtoolbox . We consider a mmWave massive MIMO systemwith one BS and one single user. Uniform linear arrays (ULAs)are employed at the BS and the UE with NT = 32 andNR = 4. The system works in the TDD mode and operates with the OFDM modulation. The system comprises 52 RBs,and each RB is formed by 12 subcarriers and 14 OFDMsymbols according to the 5G specification . In addition, thesystem follows the 5G frame structure shown in (e) with = 3 and Nslot = 8, and note that the SRS period Tp = 1ms (i.e., once per sub-frame). The SRS is configured at thelast symbol index of each special slot. We adopt the clustereddelay line (CDL)-B MIMO channel model to generate channelinstances at various UE mobility settings. The CDL-Bchannel model uses multiple clusters to characterize multipathpropagation and supports a frequency range from 0.5 GHz to100 GHz, which is widely adopted for link-level evaluation.95 channel instances are generated for constructing trainingand validation samples, and the BS transmits the SRS to theUE via these channel instances at the special slot of eachsub-frame in 10 frames (i.e., in total 100 sub-frames / 800slots) at a signal-to-noise ratio (SNR) level of 5 dB (i.e.,SNR = 5 dB) and the UE mobility of 60 km/h (i.e., v = 60km/h). 5 channel instances are generated for constructingtesting samples, and the BS transmits the SRS to the UEvia these channel instances at the special slots of 100 sub-frames at different SNR levels. The SRS pattern is configuredbased on the spatial compression ratio Rs and the frequencycompression level Rf as depicted in Section II-C. As a result,for a given (Rs, Rf) pair, 9, 500 samples are generated fortraining (9, 000 samples) and validation (500 samples); for agiven (Rs, Rf, SNR, v) pair, 500 samples are generated fortesting. The spatial compression ratios, frequency compres-sion ratios, SNR levels, UE mobility, and other key systemparameters are listed in Table I. The hyper-parameter settingsof the proposed KDD-SFCEN and the TUDCEN are shownin Table II and Table III, respectively. The model trainingprocesses are as follows. The KDD-SFCEN for uplink channelestimation is first trained with L1 in (37), followed by trainingthe UDCCN for uplink-downlink calibration with L2 in (51),and finally, the DCEN for downlink channel extrapolation istrained with L3 in (52), all based on the supervised learningparadigm. Specifically, H{s, 0}, Hd{s, 1}, and Hd{s, t} fort = 2, 3, . . . , Nslot 1 are provided as labels for trainingthe three models, respectively. By minimizing the three lossfunctions on the training samples with the Adam optimizer and validating the models on the validation samples, allthree models are effectively trained and validated.2) Evaluation Metrics:For uplink channel estimation,uplink-downlink channel calibration, and also downlink chan-nel extrapolation, the NMSE in dB is adopted to evaluate thechannel estimation performance, which is defined as",
  ",": "(53)where Ntest is the number of testing samples, and {j, s, t}refers to the t-th slot of the s-th sub-frame of the j-th testingsample. Specifically, for uplink channel estimation, H refersto H and t = 0; for uplink-downlink channel calibration, Hrefers to Hd and t = 1; for downlink channel extrapolation,H refers to Hd, and t = 2, 3, . . . , Nslot 1.",
  "Initial learning rate6e 5": "method , and the SRCNN-based method . It can beseen from that the proposed KDD-SFCEN outperformsall baselines at the same Rf. In addition, the proposed KDD-SFCEN can achieve a better NMSE performance at Rf = 16than traditional baselines at Rf = 2, which indicates thatthe proposed KDD-SFCEN can reduce the pilot trainingoverhead up to 8 times from the frequency domain perspectivecompared with traditional baselines. Similarly, the proposedKDD-SFCEN can reduce the pilot training overhead up to 4times from the frequency domain perspective compared withthe SRCNN-based method.We then compare the proposed KDD-SFCEN with tra-ditional and DNN-based extrapolation methods for spatialdomain channel extrapolation, including the linear spline inter-polation method , the DFT-interpolation method , and theFCNN-based method . As shown in , the proposedKDD-SFCEN achieves better NMSE performance than allthese baselines at the same Rs. Moreover, the proposed KDD-SFCEN at Rs = 8 surpasses the FCNN-based method andachieves a similar NMSE performance as traditional baselinesat Rs = 1, indicating that the proposed KDD-SFCEN canreduce the pilot training overhead around 8 times from thespatial domain perspective compared with existing baselines.It can be seen from and that when Rf = 8/ Rs = 4 (corresponding to a 4-fold reduction in pilot train-ing overhead compared to the minimum frequency / spatialcompression ratio Rf = 2 / Rs = 1 according to Table I),the NMSE performance of uplink channel estimation withthe proposed KDD-SFCEN is around 9 dB / 10 dB atSNR = 20 dB, which is already good enough for uplinkchannel estimation. However, since the downlink CSI at futureslots has to be extrapolated based on the estimated uplinkCSI, it would be better to improve the performance of uplinkchannel estimation as much as possible. From and , increasing Rf from 2 to 4 or increasing Rs from 1 to2 leads to a minimum performance degradation compared toother increasing cases in Rf or Rs.7 These actually reflect themarginal effects of pilots in either the frequency domain orthe spatial domain. Therefore, it is promising that we combineRf = 4 and Rs = 2 for joint spatial and frequency domainchannel extrapolation to improve the uplink channel estimationperformance and restrict the performance degradation due tothe reduction of pilot symbols in the frequency domain andthe spatial domain. shows the NMSE performance ofuplink channel estimation versus SNR at Rf = 4 and Rs = 2(solid lines), which can also reduce 4 times of pilot trainingoverhead. The proposed KDD-SFCEN obtains an NMSE of12 dB at SNR = 20 dB, indicating that joint spatial-frequency domain channel extrapolation can obtain a 3 / 2dB of performance gain compared with individual frequency/ spatial domain channel extrapolation. In addition, we furthercompare the proposed KDD-SFCEN with the DRCN ,the SF-CNN , the linear spline interpolation method ,and the DFT-interpolation method when Rf = 4 andRs = 2 (solid lines) / Rf = 2 and Rs = 1 (dotted lines).",
  "B. Performance Evaluation of Proposed KDD-SFCEN": "We first compare the performance of the proposed KDD-SFCEN and traditional and DNN-based extrapolation methodsfor frequency domain channel extrapolation, including thelinear spline interpolation method , the DFT-interpolation 6Note that since the analog precoder can only control the phase of thesignals and are typically frequency-independent, the same analog precoderwill be applied to all subcarriers in practice when designing FRFi.",
  ".The NMSE performance of uplink channel estimation versus thespatial compression ratio Rs at Rf = 2, v = 60 km/h, and SNR = 20 dB": "The simulation results show that when Rf = 4 and Rs = 2,the KDD-SFCEN outperforms the DNN-based baselines (i.e.,the DRCN and the SF-CNN) around 4 dB and the traditionalbaselines around 9 dB at SNR 0 dB; even with a lowSNR, i.e., SNR = 5 dB, the KDD-SFCEN can achieve aperformance enhancement more than 3 dB and 5 dB comparedwith the DNN-based and traditional baselines, respectively.When Rf = 2 and Rs = 1, the KDD-SFCEN outperforms theDNN-based and traditional baselines more than 5 dB and 11dB respectively at the high SNR regime, and about 3 dB and 5dB respectively at the low SNR regime. Particularly, it can befound from that the NMSE performance of the proposed KDD-SFCEN with Rf = 4 and Rs = 2 is even better thanexisting methods with Rf = 2 and Rs = 1, indicating that theKDD-SFCEN can reduce the pilot training overhead up to 4times compared to existing methods.",
  ". The NMSE performance of uplink channel estimation versus the UEvelocity v at Rf = 4, Rs = 2, and SNR = 20 dB": "We further examine the robustness of the proposed KDD-SFCEN to the UE velocity. As depicted in , DNN-basedmethods (including the proposed KDD-SFCEN, the DRCN,and the SF-CNN) achieve the best performance when thetesting UE velocity is equal to the training UE velocity (i.e.,v = 60 km/h), showing their capability in capturing spatial-frequency domain features and improving channel estimationaccuracy. When the testing UE velocity decreases or increases, the performance of the DNN-based methods degrades. More-over, the greater the deviation of the testing UE velocity fromthe training UE velocity, the more significant the performancedegradation will be. Nonetheless, the proposed KDD-SFCENachieves sufficient channel estimation accuracy ( 8 dB)and outperforms all baselines with v 90 km/h at Rf = 4and Rs = 2, showing its outstanding robustness to the UEvelocity.",
  "C. Performance Evaluation of Proposed TUDCEN": "Since uplink-downlink channel calibration is simple butnecessary, we do not compare the proposed UDCCN withother methods. Instead, we apply the UDCCN to the aforemen-tioned spatial-frequency channel extrapolation methods andpresent their performance on estimating the channel at the firstdownlink slot with or without calibration. As shown in ,all methods generally benefit from the uplink-downlink chan-nel calibration, demonstrating that uplink-downlink channelcalibration is necessary and the proposed UDCCN is simplebut effective to conduct uplink-downlink channel calibration.",
  ". The NMSE performance of uplink-downlink channel calibration versusthe SNR SNR at Rf = 4, Rs = 2, and v = 60 km/h": "We then evaluate the performance of slot-level channelextrapolation with the proposed TUDCEN and two temporalchannel extrapolation methods, i.e., the TPreNet and theLSTM-based channel predictor . Note that the uplink-downlink channel calibration is applied to all methods. TheNMSE performance and the achievable rate performance atRf = 4, Rs = 2, SNR = 20 dB, and v = 60 km/h from thefirst downlink slot to the seventh slot are shown in and, respectively. For better comparison, the upper boundachievable rate obtained with the perfect CSI and the upperbound slot-average achievable rate with a small SRS periodTp = 0.25 ms (i.e., only 4 slots are available for downlinktransmission) are also shown in .It can be seen from that without slot-level channelextrapolation (dotted lines), there are significant estimation er-rors for downlink channels at slots following the first downlinkslot. Therefore, slot-level channel extrapolation is essential to",
  ". The achievable rate performance of slot-level channel extrapolationversus the index of a slot in a sub-frame at Rf = 4, Rs = 2, SNR = 20dB, and v = 60 km/h": "reduce the channel estimation errors for these downlink chan-nels. From and , compared with the proposedKDD-SFCEN + TUDCEN, the performance of the KDD-SFCEN + TPreNet and KDD-SFCEN + LSTM, in terms ofeither NMSE or achievable rate, degrades sharply to a poorregime at the second slot, indicating that these channel predic-tors are unable to deal with high-dimensional CSI matrices andprovide accurate slot-level channel estimates. As depicted in, the proposed KDD-SFCEN + TUDCEN can achievenear 80% of the upper bound achievable rate even after 5slots from channel estimation. In addition, the achievable rateperformance of the proposed KDD-SFCEN + TUDCEN isalways better than the upper bound slot-average achievable ratewith a small SRS period Tp = 0.25 ms, demonstrating thatwith the proposed 3D channel extrapolation framework, thepilot signal can be sent less frequently (i.e., Tp = 1 ms) whilemaintaining a satisfying achievable rate performance, thereby",
  "VI. CONCLUSION": "This paper proposed a spatial, frequency, and temporalchannel extrapolation framework for TDD mmWave massiveMIMO-OFDM systems to systematically reduce the pilottraining overhead under high-mobility scenarios. Specifically,two neural networks, namely the KDD-SFCEN and the TUD-CEN, were proposed to reduce the spatial-frequency domainpilot training overhead and to reduce the temporal domainpilot training overhead, respectively. Extensive numerical re-sults demonstrated that the proposed 3D channel extrapolationframework can effectively reduce the spatial-frequency do-main pilot training overhead by 4 times via spatial-frequencychannel extrapolation and further reduce the temporal domainpilot training overhead by additional 4 times via reducing thetimes of single-slot channel estimations with slot-level channelextrapolation.",
  "J. Feng, S. Ma, G. Yang, and H. V. Poor, Impact of Antenna Correlationon Full-Duplex Two-Way Massive MIMO Relaying Systems, IEEETrans. Wireless Commun., vol. 17, no. 6, pp. 35723587, Jun. 2018": "B. Zhou, X. Yang, J. Wang, S. Ma, F. Gao, and G. Yang, Alow-overhead incorporation-extrapolation based few-shot CSI feedbackframework for massive MIMO systems, IEEE Trans. Wireless Com-mun., vol. 23, no. 10, pp. 14 74314 758, Oct. 2024. X. Chen, C. Deng, B. Zhou, H. Zhang, G. Yang, and S. Ma, High-accuracy CSI feedback with super-resolution network for massiveMIMO systems, IEEE Wireless Commun. Lett., vol. 11, no. 1, pp. 141145, Jan. 2022.",
  "M. Soltani, V. Pourahmadi, A. Mirzaei, and H. Sheikhzadeh, Deeplearning-based channel estimation, IEEE Commun. Lett., vol. 23, no. 4,pp. 652655, Apr. 2019": "B. Zhou, X. Yang, S. Ma, F. Gao, and G. Yang, Pay less but get more: Adual-attention-based channel estimation network for massive MIMO sys-tems with low-density pilots, IEEE Trans. Wireless Commun., vol. 23,no. 6, pp. 60616076, Jun. 2024. B. Lin, F. Gao, S. Zhang, T. Zhou, and A. Alkhateeb, Deep learning-based antenna selection and CSI extrapolation in massive MIMO sys-tems, IEEE Trans. Wireless Commun., vol. 20, no. 11, pp. 76697681,Nov. 2021.",
  "X. Jiang and F. Kaltenberger, Channel reciprocity calibration in TDDhybrid beamforming massive MIMO systems, IEEE J. Sel. Top. SignalProcess., vol. 12, no. 3, pp. 422431, Jun. 2018": "T. B. Brown, B. Mann, N. Ryder, M. Subbiah, J. Kaplan, P. Dhari-wal, A. Neelakantan, P. Shyam, G. Sastry, A. Askell, S. Agarwal,A. Herbert-Voss, G. Krueger, T. Henighan, R. Child, A. Ramesh, D. M.Ziegler, J. Wu, C. Winter, C. Hesse, M. Chen, E. Sigler, M. Litwin,S. Gray, B. Chess, J. Clark, C. Berner, S. McCandlish, A. Radford,I. Sutskever, and D. Amodei, Language models are few-shot learners,arXiv:2005.14165, Jul. 2020.",
  "C. Liu, W. Jiang, and X. Yuan, Learning-based block-wise planarchannel estimation for time-varying MIMO OFDM, IEEE WirelessCommun. Lett., vol. 13, no. 8, pp. 21252129, Aug. 2024": "T. Gong, S. Zhang, M. Xu, Z. Li, and O. A. Dobre, Lightweight TCN-based spatial-temporal channel extrapolation for RIS-aided communica-tion, IEEE Trans. Veh. Technol., vol. 73, no. 8, pp. 12 21912 224, Aug.2024. Binggui Zhou received his B.Eng. degree in Elec-trical Engineering from Jinan University, Zhuhai,China, in 2018, and his M.Sc. degree and Ph.D.degree in Electrical and Computer Engineering fromthe University of Macau, Macao SAR, China, in2021 and 2024, respectively. He is currently a Post-doctoral Research Associate with the Departmentof Electrical and Electronic Engineering, ImperialCollege London, London, United Kingdom. He isalso a Visiting Researcher with the School of In-telligent Systems Science and Engineering, JinanUniversity, Zhuhai, China. His research interests include machine learning,wireless communications, data mining, and smart healthcare. Xi Yang received the B.S., M.Eng. and Ph.D. de-grees from Southeast University, Nanjing, China,in 2013, 2016 and 2019, respectively. From July2020 to July 2022, she was a postdoctoral fellowwith the State Key Laboratory of Internet of Thingsfor Smart City, University of Macau, China. She iscurrently a Zijiang Young Scholar with the Schoolof Communication and Electronic Engineering, EastChina Normal University, Shanghai, China. Hercurrent research interests include extremely largeaperture array (ELAA) massive MIMO communica-tions, millimeter wave communications, and wireless communication systemprototyping. Shaodan Ma (Senior Member, IEEE) received thedouble Bachelors degrees in science and economicsand the M.Eng. degree in electronic engineeringfrom Nankai University, Tianjin, China, in 1999 and2002, respectively, and the Ph.D. degree in electricaland electronic engineering from The University ofHong Kong, Hong Kong, in 2006. From 2006 to2011, she was a post-doctoral fellow at The Uni-versity of Hong Kong. Since August 2011, she hasbeen with the University of Macau, where she iscurrently a Professor. Her research interests includearray signal processing, transceiver design, localization, integrated sensingand communication, mmWave/THz communications, massive MIMO, andmachine learning for communications. She was a symposium co-chair forvarious conferences including IEEE VTC2024-Spring, IEEE ICC 2021, 2019& 2016, IEEE GLOBECOM 2016, IEEE/CIC ICCC 2019, etc. She is an IEEEComSoc Distinguished Lecturer in 2024-2025 and has served as an Editorfor IEEE Wireless Communications (2024-present), IEEE CommunicationsLetters (2023), Journal of Communications and Information Networks (2021-present), IEEE Transactions on Wireless Communications (2018-2023), IEEETransactions on Communications (2018-2023), and IEEE Wireless Commu-nications Letters (2017-2022). Feifei Gao (Fellow, IEEE) received the B.Eng. de-gree from Xian Jiaotong University, Xian, China in2002, the M.Sc. degree from McMaster University,Hamilton, ON, Canada in 2004, and the Ph.D. degreefrom National University of Singapore, Singaporein 2007. Since 2011, he joined the Department ofAutomation, Tsinghua University, Beijing, China,where he is currently a tenured full professor.Prof. Gaos research interests include signal pro-cessing for communications, array signal processing,convex optimizations, and artificial intelligence as-sisted communications. He has authored/coauthored more than 200 refereedIEEE journal papers and more than 150 IEEE conference proceeding papersthat are cited more than 20000 times in Google Scholar. Prof. Gao hasserved as an Editor of IEEE Transactions on Wireless Communications, IEEEJournal of Selected Topics in Signal Processing (Lead Guest Editor), IEEETransactions on Cognitive Communications and Networking, IEEE SignalProcessing Letters (Senior Editor), IEEE Communications Letters (SeniorEditor), IEEE Wireless Communications Letters, and China Communications.He has also served as the symposium co-chair for 2019 IEEE Conferenceon Communications (ICC), 2018 IEEE Vehicular Technology ConferenceSpring (VTC), 2015 IEEE Conference on Communications (ICC), 2014 IEEEGlobal Communications Conference (GLOBECOM), 2014 IEEE VehicularTechnology Conference Fall (VTC), as well as Technical Committee Membersfor more than 50 IEEE conferences. Guanghua Yang (Senior Member, IEEE) receivedhis Ph.D. degree in electrical and electronic en-gineering from the University of Hong Kong in2006. From 2006 to 2013, he served as post-doctoralfellow, research associate at the University of HongKong. Since April 2017, he has been with JinanUniversity, where he is currently a Full Professorin the School of Intelligent Systems Science andEngineering. His research interests are in the generalareas of communications and networking."
}