{
  "Corresponding author.Cen Chen is also affiliated with The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China": "Authors Contact Information: Yiping Wang, East China Normal University, Shanghai, China, ; Yanhao Wang, East ChinaNormal University, Shanghai, China, ; Cen Chen, East China Normal University, Shanghai, China, . Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are notmade or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for third-partycomponents of this work must be honored. For all other uses, contact the owner/author(s).",
  "SymbolDefinition": "; Data stream; size of the stream, i.e., = | |E; Domain of items; domain size, i.e., = | E|Prefix of until the arrival of at time ; Sliding window at time ; window size,Frequency of item E in H,Set of -heavy hitters in for a threshold (0, 1),Privacy parameters in DPPrivacy parameters in zCDP,Error and confidence parameters in CMS and PCMS,; H,Approximations of , and H, with DPError parameter in the approximations of , and H,C; C(Non-private) CMS; PCMS",
  "Joel Daniel Andersson and Rasmus Pagh. 2023. A Smooth Binary Mechanism for Efficient Private Continual Observation. Advances in NeuralInformation Processing Systems 36 (2023), 4913349145": "Arvind Arasu and Gurmeet Singh Manku. 2004. Approximate Counts and Quantiles over Sliding Windows. In Proceedings of the Twenty-Third ACMSIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems (PODS 04). Association for Computing Machinery, New York, NY, USA,286296. Ran Ben-Basat, Gil Einziger, Roy Friedman, and Yaron Kassner. 2016. Heavy hitters in streams and sliding windows. In IEEE INFOCOM 2016 - The35th Annual IEEE International Conference on Computer Communications. IEEE, 19. Omri Ben-Eliezer, Dan Mikulincer, and Ilias Zadik. 2022. Archimedes Meets Privacy: On Privately Estimating Quantiles in High Dimensions UnderMinimal Assumptions. Advances in Neural Information Processing Systems 35 (2022), 3245032464. Jeremiah Blocki, Seunghoon Lee, Tamalika Mukherjee, and Samson Zhou. 2023. Differentially Private 2-Heavy Hitters in the Sliding WindowModel. In The Eleventh International Conference on Learning Representations. OpenReview.net.",
  "Vladimir Braverman and Rafail Ostrovsky. 2007. Smooth Histograms for Sliding Windows. In 48th Annual IEEE Symposium on Foundations ofComputer Science. IEEE, 283293": "Mark Bun and Thomas Steinke. 2016. Concentrated Differential Privacy: Simplifications, Extensions, and Lower Bounds. In Theory of Cryptography -14th International Conference, TCC 2016-B, Beijing, China, October 31-November 3, 2016, Proceedings, Part I. Springer, Berlin, Heidelberg, 635658. T.-H. Hubert Chan, Mingfei Li, Elaine Shi, and Wenchang Xu. 2012. Differentially Private Continual Monitoring of Heavy Hitters from DistributedStreams. In Privacy Enhancing Technologies - 12th International Symposium, PETS 2012, Vigo, Spain, July 11-13, 2012, Proceedings. Springer, Berlin,Heidelberg, 140159.",
  "Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam D. Smith. 2006. Calibrating Noise to Sensitivity in Private Data Analysis. In Theory ofCryptography. Springer, Berlin, Heidelberg, 265284": "Cynthia Dwork, Moni Naor, Toniann Pitassi, and Guy N. Rothblum. 2010. Differential privacy under continual observation. In Proceedings of the42nd ACM Symposium on Theory of Computing (STOC 10). Association for Computing Machinery, New York, NY, USA, 715724. Alessandro Epasto, Jieming Mao, Andres Munoz Medina, Vahab Mirrokni, Sergei Vassilvitskii, and Peilin Zhong. 2023. Differentially PrivateContinual Releases of Streaming Frequency Moment Estimations. In 14th Innovations in Theoretical Computer Science Conference (ITCS 2023). SchlossDagstuhl Leibniz-Zentrum fr Informatik, Dagstuhl, Germany, 48:148:24.",
  "Yiping Wang, Yanhao Wang, and Cen Chen": "Cristian Estan and George Varghese. 2002. New directions in traffic measurement and accounting. In Proceedings of the 2002 Conference onApplications, Technologies, Architectures, and Protocols for Computer Communications (SIGCOMM 02). Association for Computing Machinery, NewYork, NY, USA, 323336. Hendrik Fichtenberger, Monika Henzinger, and Jalaj Upadhyay. 2023. Constant Matters: Fine-grained Error Bound on Differentially Private ContinualObservation. In Proceedings of the 40th International Conference on Machine Learning. PMLR, 1007210092. Badih Ghazi, Ravi Kumar, Jelani Nelson, and Pasin Manurangsi. 2023. Private Counting of Distinct and k-Occurring Items in Time Windows. In14th Innovations in Theoretical Computer Science Conference (ITCS 2023). Schloss Dagstuhl Leibniz-Zentrum fr Informatik, Dagstuhl, Germany,55:155:24.",
  "Jennifer Gillenwater, Matthew Joseph, and Alex Kulesza. 2021. Differentially Private Quantiles. In Proceedings of the 38th International Conference onMachine Learning. PMLR, 37133722": "Google. 2024. How Google retains data we collect. Xiangyang Gou, Long He, Yinda Zhang, Ke Wang, Xilai Liu, Tong Yang, Yi Wang, and Bin Cui. 2020. Sliding Sketches: A Framework using TimeZones for Data Stream Processing in Sliding Windows. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery &Data Mining (KDD 20). Association for Computing Machinery, New York, NY, USA, 10151025. Johannes Haug, Alexander Braun, Stefan Zrn, and Gjergji Kasneci. 2022. Change Detection for Local Explainability in Evolving Data Streams. InProceedings of the 31st ACM International Conference on Information & Knowledge Management (CIKM 22). Association for Computing Machinery,New York, NY, USA, 706716. Jonathan Hehir, Daniel Ting, and Graham Cormode. 2023. Sketch-Flip-Merge: Mergeable Sketches for Private Distinct Counting. In Proceedings ofthe 40th International Conference on Machine Learning. PMLR, 1284612865.",
  "Haim Kaplan, Shachar Schnapp, and Uri Stemmer. 2022. Differentially Private Approximate Quantiles. In Proceedings of the 39th InternationalConference on Machine Learning. PMLR, 1075110761": "Christian Janos Lebeda and Jakub Tetek. 2023. Better Differentially Private Approximate Histograms and Heavy Hitters using the Misra-GriesSketch. In Proceedings of the 42nd ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems (PODS 23). Association for ComputingMachinery, New York, NY, USA, 7988. Luca Melis, George Danezis, and Emiliano De Cristofaro. 2016. Efficient Private Statistics with Succinct Sketches. In 23rd Annual Network andDistributed System Security Symposium (NDSS 16). The Internet Society, 15 pages. Darakhshan J. Mir, S. Muthukrishnan, Aleksandar Nikolov, and Rebecca N. Wright. 2011. Pan-private algorithms via statistics on sketches. InProceedings of the Thirtieth ACM SIGMOD-SIGACT-SIGART Symposium on Principles of Database Systems (PODS 11). Association for ComputingMachinery, New York, NY, USA, 3748. Jayadev Misra and David Gries. 1982. Finding Repeated Elements. Science of Computer Programming 2, 2 (1982), 143152. S. Muthukrishnan. 2005. Data Streams: Algorithms and Applications. Foundations and Trends in Theoretical Computer Science 1, 2 (2005), 117236. Rasmus Pagh and Mikkel Thorup. 2022. Improved Utility Analysis of Private CountSketch. Advances in Neural Information Processing Systems 35(2022), 2563125643.",
  "Odysseas Papapetrou, Minos N. Garofalakis, and Antonios Deligiannakis. 2012. Sketch-based Querying of Distributed Sliding-Window Data Streams.Proceedings of the VLDB Endowment 5, 10 (2012), 9921003": "Victor Perrier, Hassan Jameel Asghar, and Dali Kaafar. 2019. Private Continual Release of Real-Valued Data Streams. In 26th Annual Network andDistributed System Security Symposium (NDSS 19). The Internet Society, 13 pages. Nicolo Rivetti, Yann Busnel, and Achour Mostfaoui. 2015. Efficiently Summarizing Data Streams over Sliding Windows. In 2015 IEEE 14thInternational Symposium on Network Computing and Applications. IEEE, 151158. Adam D. Smith, Shuang Song, and Abhradeep Thakurta. 2020. The Flajolet-Martin Sketch Itself Preserves Differential Privacy: Private Countingwith Minimal Space. Advances in Neural Information Processing Systems 33 (2020), 1956119572.",
  "Jalaj Upadhyay. 2019. Sublinear Space Private Algorithms Under the Sliding Window Model. In Proceedings of the 36th International Conference onMachine Learning. PMLR, 63636372": "Lun Wang, Iosif Pinelis, and Dawn Song. 2022. Differentially Private Fractional Frequency Moments Estimation with Polylogarithmic Space. In TheTenth International Conference on Learning Representations. OpenReview.net. Yuhan Wu, Shiqi Jiang, Siyuan Dong, Zheng Zhong, Jiale Chen, Yutong Hu, Tong Yang, Steve Uhlig, and Bin Cui. 2023. MicroscopeSketch: AccurateSliding Estimation Using Adaptive Zooming. In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 23).Association for Computing Machinery, New York, NY, USA, 26602671. Sinan Yildirim, Kamer Kaya, Soner Aydin, and Hakan Bugra Erentug. 2020. Differentially Private Frequency Sketches for Intermittent Queries onLarge Data Streams. In 2020 IEEE International Conference on Big Data. IEEE, 40834092. Fuheng Zhao, Dan Qiao, Rachel Redberg, Divyakant Agrawal, Amr El Abbadi, and Yu-Xiang Wang. 2022. Differentially Private Linear Sketches:Efficient Implementations and Applications. Advances in Neural Information Processing Systems 35 (2022), 1269112704. Zheng Zhong, Shen Yan, Zikun Li, Decheng Tan, Tong Yang, and Bin Cui. 2021. BurstSketch: Finding Bursts in Data Streams. In Proceedings of the2021 International Conference on Management of Data (SIGMOD 21). Association for Computing Machinery, New York, NY, USA, 23752383."
}