{
  "Abstract": "This paper proposes an Intrusion Detection System (IDS) employing the Harris Hawks Optimization algorithm (HHO) to optimize Multilayer Percep- tron learning by optimizing bias and weight parameters. HHO-MLP aims to select optimal parameters in its learning process to minimize intrusion de- tection errors in networks. HHO-MLP has been implemented using EvoloPy NN framework, an open-source Python tool specialized for training MLPs using evolutionary algorithms. For purposes of comparing the HHO model against other evolutionary methodologies currently available, specificity and sensitivity measures, accuracy measures, and mse and rmse measures have been calculated using KDD datasets. Experiments have demonstrated the HHO MLP method is effective at identifying malicious patterns. HHO-MLP has been tested against evolutionary algorithms like Butterfly Optimization Algorithm (BOA), Grasshopper Optimization Algorithms (GOA), and Black Widow Optimizations (BOW), with validation by Random Forest (RF), XG- Boost. HHO-MLP showed superior performance by attaining top scores with",
  "Computer networks are a group of interconnected nodes that are dis-": "tributed within a local or wide geographic area to allow end-users to trans- mit and receive data over a communication medium (wired or wireless). The primary goals of building a computer network are to share resources (hard- ware, software, or data), to communicate between remote users using (digital audio, digital video, or text), and to provide various types of services such as web services (the World Wide Web) and application services (databases), and communication services (social networks). Recently, there has been re- markable progress in the networking field by designing different types of networks that differ based on several criteria such as typologies, protocols, architectures, and size .",
  "One of the serious problems that may arise in computer networks is se-": "curity and privacy breaches . Digitization facilitates the work of hackers to carry out their criminal missions and cause security disasters. Cyber at- tackers take advantage of weaknesses within a network to infiltrate and cause disruptions or even bring it down altogether. A distributed denial-of-service (DDoS) attacks are a common security threat. They involve flooding a server with fake requests to clog up network channels and block legitimate requests . Other security problems may occur by running malicious code on a server that changes or disrupts the functionality of the network .",
  "Intrusion or unauthorized access takes place when network users exceed": "the privileges assigned to them . Therefore there are a set of rules and practices that prevent any illegal access to the network. Intrusion detection systems (IDS) are typically implemented using a software-driven method. They identify abnormal behavior in a network and pinpoint evidence of se- curity breaches. This system is crucial in protecting digital environments against potential threats and unauthorized entry. Signature and anomaly detection methods are the two main categories of IDS . Both methods rely on analyzing network traffic to detect malicious patterns. However, the main difference is in the detection process. Signature-based methods detect mali-",
  "Anomaly detection methods typically use machine learning algorithms": "to increase network security . This depends on some features that help the algorithm distinguish regular traffic from malicious ones. Recent investigations have utilized various machine learning techniques to create efficient network intrusion detection systems . Meta-heuristic techniques are often used in network IDS design to reduce the discrepancy between malicious and legitimate traffic detection. .",
  "Swarm-based algorithms are meta-heuristic algorithms that simulate the": "natural survival of animals in nature . They are based on solid math- ematical methodologies that reflect the social relations of animals that live in groups such as the colonies of bees, flocks of birds, and swarms of wolves. Swarm-based algorithms have proved their efficiency in solving various opti- mization problems. HHO is a swarming algorithm that inspires the hunting mechanism of Harriss Hawks when they find and pounce on their prey.",
  "HHO has been used in different applications for solving several optimiza-": "tion problems . The main reason behind selecting HHO in this work is that it has a suitable opportunity to utilize its features to build a reliable secure network IDS. The main features of HHO that encouraged us- ing it for optimizing network security are: that it can effectively balance between exploring the search regions and exploiting them using a single pa- rameter that controls the energy of the Hawks. It also uses an adaptive update strategy, which changes the position of the solutions in the search area in a time-varying fashion . This allows the number of best solutions to decrease relative to increasing the number of iterations. HHO also has four stages of exploitation which enhance the local search and help the optimizer overcome some search problems such as premature convergence.",
  "The suggested solution makes use of the HHO to enhance network-based": "IDSs ability to detect malicious traffic by choosing the best multi-layer per- ceptron parameters . The selection of MLP over other classification meth- ods is because MLP is a simple structure neural network. This means that it can produce accurate detection results within a promising running time compared with other complex deep-learning methods. Detection time is an important factor that a researcher must consider when designing a network IDS.",
  "Pozi et al. (2016) introduced an innovative technique for detecting": "rare attacks by combining Support Vector Machines (SVMs) and Genetic Programming (GP). Their proposed GPSVM method demonstrated its re- markable capability of accurately detecting rare and anomalous attacks with increased precision. The studys findings showed that GPSVM maintained comparable levels of accuracy while achieving a greater detection rate for un- common attacks. More specifically, GPSVM detected DoS attacks with an outstanding 94.56% geometric mean detection rate. Notably, this study did not employ feature selection or resampling techniques; its findings demon- strate the efficiency of the GPSVM approach in rare attack detection. Fur- thermore, this method could potentially enhance the accuracy and reliability of intrusion detection systems while strengthening overall network security.",
  "Ali developed a PSO FLN IDS model, which is based on the principles": "and techniques of Particle Swarm Optimization (PSOs) and Fast Learning Networks. This models primary objective is to optimize values for neurons in hidden layers. The PSO FLN model, which achieved an impressive accuracy of 99.68% during testing was developed to combat the problem of decreased precision for certain categories due to a lack of training data.",
  "The authors in conducted an innovative network intrusion detection": "system by employing the Firefly algorithm (FA) to improve K-means clus- tering efficiency. Their proposed approach was tested against six other clus- tering methodologies such as K-Means enhanced by Cuckoo, K-Means with Bat, K-Means++, Canopy, and Farthest First; with its results showing it outperforming traditional classification techniques by attaining an outstand- ing recall rate of 72.6%.",
  "Ren et al. conducted an innovative IDS by combining SVM, DT,": "and Genetic Algorithm (GA). SVM served as the learning mechanism, while DT provided feature selection functionality, and GA provided optimization techniques to improve FS processes. Comparable with existing algorithms, this integrated model showed remarkable proficiency at identifying infrequent anomalous behaviors with an impressive accuracy rate of 93.55%. This ad- vanced system could potentially have applications in other areas of anomaly detection such as fraudulent activities; however, the training process for clas- sifiers may be time-consuming, suggesting there could be additional optimiza- tion of search strategies.",
  "Elhag , designed a fuzzy network IDS approach that was based on us-": "ing a multi-objective evolutionary algorithm which allowed the users to select the solutions that are best suited for the network features. It achieved (accu- racy=98.10%). Comparing the proposed method with FARC-HDclassifiers, FARCHD with OVO, and C4.5 decision trees, the high quality of this method- ology was demonstrated. The proposed method achieved a good balance between Precision and interpretability in all cases.",
  "Naik , proposed a technique based on Teaching-Learning Based Op-": "timization (TLBO), the Functional Link Neural Nets (FLANN), mutation operation, and elitism to build a reliable IDS that can deliver accurate secu- rity results. Mutation operations provide an efficient solution for handling redundant parameters, avoiding palindrome occurrences while also dramat- ically increasing the efficiency of the method. By decreasing computational load, the proposed technique shows an impressive 96.30% detection rate.",
  "Almomani et al. (2020) , presented a feature-based technique for net-": "work IDS. This study incorporated four meta-heuristic advanced techniques: Grey Wolf Optimization (GWO), Particle Swarm Optimization (PSO), Fire- fly Algorithm (FA), and Genetic Algorithm (GA). These strategies were used to improve the performance of IDS. This multi-faceted approach, which har- nessed the strengths of every algorithm, aimed to enhance the IDSs capa- bilities in identifying potential security threats and mitigating them. By employing wrapper methods in combination with MI filter methods, this system was able to select features effectively for intrusion detection. With using the J48 classifier as part of its proposed methodology, classification accuracy rates reached between 79.175% and 90.484% when employing clas- sification accuracy rates between 80.1750%-90.5484%. Applying SVM classi- fiers yielded classification accuracy rates ranging from 79.077% to 90.119%. These results demonstrate the success of feature selection processes by show- ing that most feature reduction rules in proposed models outperformed those that utilized all available features, demonstrating their efficacy as part of a selection process. They advise that, despite positive results obtained, fur- ther advanced learning structures like Recurrent Neural Nets (RNNs) and Convolutional Neuronal Networks be explored for comprehensive evaluation of model performance and efficiency.",
  "In a new approach was proposed based on enhancing the MFO by": "adopting new operators besides the embedded spiral operator to balance the exploration and exploitation alleviating the local minima problem. The main contribution of this work is the adoption of the cosine similarity measure to binarize the continuous MFO into a binary problem. Cosine similarity overcomes the limitations of the commonly used sigmoid function that de- pends on using a threshold value for conversion. However, cosine similarity computes the similarity ratio between the current solution and the optimal solution. The augmented MFO wrapper framework was applied as an IDS to detect anomalous traffic in the network. The proposed method was com- pared against several well-known state-of-the-art algorithms on three network datasets (KDDCUPP9, NSL-KDD, and UNSW-NB15), using IDSACC, ID- STPR, IDSFPR, IDSF-score, and convergence evaluation measures to assess the performance of the proposed method. The experimental results demon- strated the superiority of the proposed cosine similarity method compared to other algorithms with an accuracy of 97.8%, F-score of 99%, TPR of 99.6%, and FPR of 8.1% using only five selected features from the KDDCUPP99 dataset. It achieved the accuracy of 89.7%, TPR of 89.1%, FPR of 2.9%, when four selected features from the NSL-KDD dataset are used. And finally, it achieved an accuracy of 92.4%, TPR of 92.3%, FPR of 3%, and F-score 94.2% when the UNSW-NB15 dataset is used.",
  "In , the authors proposed a hybridization of modified binary GWO and": "PSO. The proposed solution used two benchmarking datasets, NSL KDD99 and UNSW-NB15, and the results revealed that the proposed solution out- performed the existing solutions, as the proposed approach improved the detection accuracy by approximately 0.3% to 12%, and the detection rate by 2% to 12%. In addition, it reduces false alarm rates by 4% to 43%, and reduced the number of features by approximately 31% to 75%. Last, the proposed approach reduced processing time by approximately 14% to 22% compared to state-of-that-art approaches.",
  "Overall, machine learning techniques have a major impact on designing": "IDS that are capable of improving the security of different types of net- works. This idea can be used by researchers to continue this line of research by proposing different optimization algorithms, new enhancement operators, and novel updates to be evaluated and tested on different network datasets and in different processing platforms. This opens the opportunity for cy- bersecurity researchers to be up to date and provide state-of-the-art solu- tions capable of addressing new challenging security breaches emerging in",
  "Introduction and implementation of the novel HHO-MLP approach. In": "this approach, HHO serves as an initial preprocessing step which helps accelerate the FS process and ensures MLP learns about relevant and informative network traffic features. HHO can also optimally assign weight and bias values for improved model performance. MLP uses multiple layers of hidden nodes instead of relying on just one or two to obtain more accurate results compared to traditional methods. This innovative architecture is intended to produce more precise outcomes compared to their counterparts.",
  "(1)": "where the location of the Hawks in the following cycle is H(iter + 1) Preys location is iter, Hprey(iter), and the solutions current location is H(iter). In the range of (0,1), r1, r2, r3, r4, and q are all random values. The variables highest and lowest values are shown by LoBo and UpBo, respectively. The random solution is called Hrandom(iter), and the average position of the cur- rent swarm of solutions is called Hm. The average hawk location is calculated using Eq. (2):",
  "The Artificial neural network (ANN) has been commonly used as a learn-": "ing algorithm to perform a training process on a given data instance and generate a pattern (data model) that is used then to predict the output of another hidden part of the dataset in the testing process. The MLP connects the neurons in the hidden layer with n weights and one bias . Each hidden neuron performs two primary functions: the summation as illustrated in Eq. (14) and the activation as illustrated in Eq. (15). Neuron j that per- forms a summation operation then uses its activation function to transform its output, producing results which are further used for computation within its neural network. Each neurons functionality in a neural network depends",
  "Normalizing the network traffic helps increase the classification accuracy": "The next preprocessing step is dimensionality reduction which is based on implementing the feature selection process. The feature selection is carried out using the HHO algorithm. To represent the feature vector, a solution in the HHO algorithms population is employed. The value of 0 for the feature vector means that the associated feature is not chosen whereas the value 1 means that the associated feature is chosen. Eq. (21) shows the feature vector of the network traffic that represents a Harris hawk or a solution in the population of the HHO algorithm.",
  "HHOi is a Harris hawk or a solution in the swarm of the HHO algorithm": "This represents a feature vector in the network traffic. Frj is the jth element of the feature array i and D is the dimensionality of the problem. As men- tioned previously, the values of the feature vector are either 1 or 0 means whether or not the feature is chosen. A set of feature vectors composes the population of candidate solutions which are initiated randomly as several harris hawks. The proposed methodology seeks to reduce both the number of attributes derived from network traffic as well as reduce error rates asso- ciated with intrusion detection. The basic goal is to use the fewest network traffic attributes possible to reduce intrusion detection. Therefore, Eq. (22)",
  "The Cost-IDS is the value associated with each Harris hawk during the": "optimization process. The aim is to find a solution with minimum Cost-IDS value. Err is the error rate of intrusion detection. fr is the chosen feature and Fr is the set of all features. By applying the Hybrid Harmony Optimiza- tion and Multi-Layer Perceptron (HHO-MLP) approach to feature vectors, we can efficiently identify an optimal feature vector with minimum features while still maintaining an acceptable error rate for intrusion detection sys- tems. These streamline feature selection while decreasing false alarm rates. This process further strengthens their performance and is an invaluable asset when applied correctly. The reduced features set is used then to train the MLP. Furthermore, the HHO-MLP can be used to enhance the weights and biases to minimize the intrusion error rate.",
  "where Ei and Ei are the actual and the detected classes of the ith network": "traffic respectively. The next step is to update the weights and biases in each vector of the HHO population. The update mechanism is applied in each iteration to select the optimal weights and biases and minimize the intrusion detection error by MLP. In algorithm 2, The algorithms pseudo-code for the HHO-MLP is displayed.",
  "The HHO-MLP method is evaluated using the KDD dataset. It is a": "collection of network traffic from a single host and every other node in the network. The KDD dataset is comprised of 42 features (34 numerical and 8 non-numerical), and the IDS is evaluated using a specific portion of its oc- currences. . This is because it compromises normal and suspicious traffic which makes it promising for evaluating intrusion detection. Furthermore, it doesnt limit network traffic in real-time and it compromises four types of intrusions: U2R, R2L, DOS, and Prob. The KDDCUP99 training dataset distribution is done as in the following (#instances, ratio): Normal (97277, 19.69%), DOS (391458, 79.24%), Probe (4107,0.83%), R2L (1126, 0.23%), U2L(52, 0.01%), so that the total (494,019, 100%). Regarding the UNSW- NB15 dataset, it simulates nine different types of attacks. The attacks include DOS, ShellCode, Worms, Fuzzers, Backdoors, Exploits, Analysis, Generic, and Reconnaissance.",
  "Algorithm 2 HHO-MLP pseudo-code": "Inputs: The swarm size N and the number of all cycles T Coding: Each harris hawk population: S1(i) = w1, w2, .., wm, b1, b2, b3, .., bk Outputs: The position of prey and its fitness value Initialize the random swarm Solutioni(i = 1, 2, . . . , N) while (the number of cycles is less than T) do",
  "i=1": "(TN-ID), and False Negative intrusion detection (FN-ID) are needed for these calculations. As shown by the equations Eq. (29) and Eq. (30), other metrics used include mean average-error-index and squared-error when distinguishing legitimate from anomalous traffic detection errors are employed. Eq. (26) shows the accuracy of the intrusion detection system.",
  "shows the results of different experiments when 30 iterations and": "initial swarm sizes of 5, 10, 15, 20, and 30 are considered. The results prove the effect of swarm size on reducing the network IDS error rate. As it is clearly shown that the MSE decreases dramatically from 0.205 to 0.086. The error rate decreases in ascending order relative to the swarm size. This means that the minimum error rate is achieved for the largest swarm size. In addition, regardless of the starting swarm size, the increased iteration count helps the MLP converge to the best weights and biases, which in turn lowers the error rate.",
  "Notice that in this comparison we try to study the efficiency of the new": "model against other hybrid methods in which other evolutionary algorithms are integrated with the MLP algorithm. Furthermore, it is compared with other learning algorithms implemented without hybridization with evolution- ary algorithms. Comparative analysis indicates that the Hybrid HHO-MLP outshone other methods when assessed using selected evaluation metrics. HHO-MLP showed superior performance by attaining top scores in accu- racy, sensitivity, and specificity measurements; specifically, an accuracy rate of 93.17%, sensitivity level of 89.25%, and specificity percentage of 95.41% were recorded by this approach. It appears that the hybridization of the HHO algorithm with MLP enhances the intrusion detection rate. The HHO- MLP achieved higher accuracy, sensitivity, and specificity compared with the standard MLP by 4.77%, 6.89%, and 7.49%, respectively. In Fig 5, we ob- serve a comparative analysis between the suggested Hybrid HHO-MLP tech- nique and other well-established algorithms, such as Binary Particle Swarm Optimization (Bi-PSO), Binary Bat Algorithm incorporating Levy Flights (Bi-BA-LF), Binary Firefly Algorithm (Bi-FA), and the Naive Bayes (NB)",
  ": Comparison of HHO-MLP against other methods in the literature based on accuracy": "The next experiments conduct comparisons between the proposed HHO- MLP and other hybrid evolutionary algorithms that are integrated with the MLP learning algorithm. They used evolutionary algorithms including BOA, GOA, and BOW. Furthermore, RF and XGBoost are considered for the validation of the proposed approach. Evaluations of these algorithms were carried out utilizing two widely recognized datasets, KDD Cup 1999 and UNSW-NB15, with the primary goal of gauging their ability to detect cy- ber intrusions. This approach provides a comprehensive comparison between techniques in terms of their detection performance. Tables 1 and 2, show these algorithm. The results show that HHO-MLP has achieved the highest accuracy in detecting intrusions in networks. Then, the GOA-MLP comes in the next place. XGBoost has the third order in terms of accuracy. Further- more, the proposed HHO-MLP has the highest specificity, while GOA-MLP and BWO-MLP are in third place.",
  "It is worth this regard to point to the essential criteria of the network": "IDS which is the intrusion detection speed. An additional benefit of the proposed HHO-MLP is that it performs the training process on a small part of the network traffic. Then, a feature selection is applied by filtering some significant features of the network traffic. This reduced the size of the dataset from 42 to 15 feature subsets. Conducting a training process on a smaller size of features helped to speed up the process so implementing the HHO-MLP takes less time than the standard MLP. The main limitation of the proposed HHO-MLP is that it was not validated under real network environment to check the robustness of the approach and to check its capability to detect unkown types of threats"
}