{
  "ABSTRACT": "The fintech PicPay offers a wide range of financial services toits 30 million monthly active users, with more than 50 thousanditems recommended in the PicPay mobile app. In this scenario,promoting specific items that are strategic to the company canbe very challenging. In this work, we present a Switching HybridRecommender System that combines two algorithms to effectivelypromote items without negatively impacting the users experience.The results of our A/B tests show an uplift of up to 3.2% whencompared to a default recommendation strategy.",
  "With 30 million monthly active users, PicPay is one of the largestfintechs in Brazil. The company offers a large catalog of products": "Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than ACMmust be honored. Abstracting with credit is permitted. To copy otherwise, or republish,to post on servers or to redistribute to lists, requires prior specific permission and/or afee. Request permissions from 23, August 06-10, 2023, Long Beach, CA, USA 2023 Association for Computing Machinery.ACM ISBN 978-1-4503-XXXX-X/23/08...$15.00 and services through its mobile app, totaling more than 50 thou-sand distinct items. Similarly to super-apps like WeChat inChina and Gojek in Indonesia, the PicPay app addresses mul-tiple customer necessities, such as tax payments, loans, gift cards,coupons, instant money transfers, investments, and cryptocurrencytransactions.Such an extensive and diverse catalog favors the adoption ofRecommender Systems. Along with some shortcut buttons andbasic account information, the PicPay apps home screen containsa unique UI element that is customized for each user. The Sug-gestions for You component consists of a list of 15 items that arerecommended based on multiple consumer features, such as creditprofile, purchase history, and behavior profile. shows theUI of the mobile app, with the Suggestions for You (in Portuguese,Sugestes pra voc) component displayed at the bottom.",
  "KDD 23, August 06-10, 2023, Long Beach, CA, USAMendona, et al": "The Suggestions for You component is often used as an instru-ment in awareness campaigns to highlight specific products andservices that are strategic for the company (e.g., encouraging up-selling or cross-selling). With limited available space, we need tocarefully choose the items that will be shown to each user to avoidthe pitfalls of low recommendation diversity and excessiveadvertising . As an additional challenge, we need to be able tohandle cold-start scenarios when promoting new products.In this paper, we present the hybrid recommender system usedby PicPay to efficiently recommend strategic items to millions ofusers every day.",
  "RELATED WORK": "Falk and Karako discuss the problem of choosing between mul-tiple recommendation models for Shopify merchants dependingon how much historical data are available for each store. UnlikeShopify, items recommended at PicPay are not equally important.For example, we may want to promote products that are new, gen-erate more revenue, or increase user engagement. Therefore, ourrecommendation models must be tailored according to our businessstrategies.Other authors propose to weight prediction errors inRecommender Systems based on expected revenue. At PicPay, wecannot establish an item priority based on a simple metric likeproduct price or profit margin since recommending enablers (e.g.,adding a credit card to our digital wallet) can lead to future rewardsthat are not easily measured.",
  "SUGGESTIONS FOR YOU": "One of the main elements on the PicPay apps home screen, theSuggestions for You component displays a list of 15 items recom-mended by a hybrid recommender system . Each item acts as acall to action (CTA), with alternatives such as transfering moneyto a friend, buying credits for a prepaid SIM card or applying for apersonal loan. Due to their strategic value to the company, a smallsubset of items is regarded as promoted items. Promoted itemsmay be associated with new products, profitable financial services,or enablers (e.g., adding a credit card to your digital wallet, con-senting to an Open Banking API). The remaining recommendeditems in the Suggestions for You component are regarded as regularitems.The size of the phone screen typically restricts the exhibitionto four items (the fifth item is cropped). Viewing the latter itemsin the list requires the user to perform a swipe gesture. shows a sample recommendation. On the left, two promoted itemsare presented, followed by three regular items. As we can see, thepromoted items in the Suggestions for You component are alwaysdisplayed before the regular items.We confirm the hypothesis of increased exposure at the firstpositions of the component through an online experiment. Withoutaltering what was recommended to each user, we shuffled each listof recommendations, displaying the items in random order. As aconsequence, users who participated in the experiment were able toobserve some regular items taking precedence over promoted items.With all promoted and regular items having the same probability",
  ": Suggestions for You UI component": "of being displayed in each position, we estimate the intrinsic click-through rate (CTR) of each of the 15 positions.During a period of 10 days, we displayed the shuffled version ofthe Suggestions for You component for a random sample of 28,235users. shows the results of the experiment with a 95%Confidence Interval. We can see that positions immediately visiblewhen the app is opened (in blue) tend to receive more clicks thanthose that require a swipe gesture from the user to be seen (inorange). We cannot clearly identify whether users follow a CascadeModel , scanning recommendations from left to right. However,we can see that the first four positions can receive, on average, upto five times more clicks than the latter positions. 12345678910 11 12 13 14 15 Item position 0.0% 0.2% 0.4% 0.6% 0.8% 1.0% 1.2% Click-through rate",
  "RECOMMENDING PROMOTED ITEMS": "Conventional collaborative filtering and content-based approachesdo not bode well for the recommendation of financial services .Contrary to content such as videos, books, and news, financialservices typically have scarse metadata and user feedback. Forexample, services like loans are not contracted very often. In thiscontext, knowledge-based approaches, which employ deep domain-specific knowledge, are preferable .In our mobile app, we recommend promoted items in the Sug-gestions for You component using a constraint-based approach. Pic-Pays domain experts are responsible for building a recommenderknowledge base , that is, a set of variables and constraints that",
  "Rethinking Financial Service Promotion With Hybrid Recommender Systems at PicPayKDD 23, August 06-10, 2023, Long Beach, CA, USA": "explicitly represent the criteria needed for the recommendation ofa promoted item to a given user. In this process, multiple informa-tion sources are taken into account. The offer of credit cards, forexample, depends on the users credit profile, their risk analysis,and other features1.For some users, there may be multiple promoted items that satisfythe constraints. Therefore, we need to further refine the recommen-dations to increase the number of relevant items in the first (andmost noticeable) positions, as well as achieve a good balance be-tween regular and promoted items. We apply two post-filteringmethods that operate in tandem, composing the Switching HybridRecommender System illustrated in . Using this architecture,we benefit from the strengths of two different techniques, switchingbetween two recommendation techniques according to a chosencriterion . Constraint-based recommender system",
  ": Switching Hybrid Recommender System for pro-moted items": "The first method, the Probabilistic Filter algorithm, can be ap-plied to any item and does not require training. Therefore, it isbetter suited for items with a very low number of conversions (e.g.,new products). The Gradient Boosting Filter uses an ML classifierto improve the relevance of recommended items and thus maygive varying results depending on the available data. As shown in, the switch criterion is based on the fraction of positivesamples available for each promoted item. We use the ProbabilisticFilter when the dataset is highly imbalanced, that is, less than 1%of the samples represent a conversion.In the following, we describe the two methods in detail.",
  "Probabilistic Filter": "Ideally, the promoted items recommended by our knowledge-basedsystem should be filtered according to the users interest. However,when promoting new products or services in the Suggestions for Youcomponent, it is impractical to leverage past user interactions topredict if an item is useful to a given customer. In this situation, weneed a filtering algorithm that: (1) does not require training withhistorical data; (2) is efficient, since the app receives millions ofaccesses every day; and (3) avoids starvation, i.e., given a threshold, an item should be seen by the customer with high probabilityafter opening the app times. Although a round-robin algorithmwould lead to a fair allocation , it would not be very efficientbecause we would need to keep track of the promoted items viewedby each user.Inspired by random scheduling policies in queue systems , wepropose a Probabilistic Filter algorithm. When a customer opens",
  "Further details are ommited due to the strategic value of the information": "the application, each recommended promoted item is sampled inde-pendently with display probability . This parameter allows forthe adjustment of the (expected) number of promoted items seenby the user. While a low value of leads to more space availablefor regular items, a high value decreases the odds of starvation ofpromoted items.As an additional benefit, reducing the frequency of exhibitioncan have positive impacts on the item, since a product exposed inan exaggerated way may arouse less user interest compared to aproduct with limited exposure .Let be the number of times the app has to be opened until theitem appears for the first time for a given user. Since the item has aprobability of appearing and each attempt is independent, willfollow a geometric distribution. Then we define the probability ofstarvation as",
  "= 1 1/": "As a result, we can choose the display probability of eachpromoted item as a function of the desired probability of starvation and visualization threshold .Since items are sampled independently, the number of itemsthat are displayed will follow a Poisson binomial distribution withparameters 1, 2, . . . , , where is the display probability ofthe th item. As a consequence, the expected number of promoteditems will be given by =1 . In the special case where all displayprobabilities are the same, the number of promoted items will followa binomial distribution.",
  "Gradient Boosting Filter": "When a promoted item has a record of user feedback (e.g., purchases,conversions, or clicks), we can develop an ML classifier to predictfuture user interest and use the classifiers output to filter itemswith low probability of conversion.We train one LightGBM classifier per promoted item. Eachsample in the dataset corresponds to a customer, and the labelindicates whether the user converted at least once during a 90-dayperiod. We use a total of 25 features, including: credit score, deviceOS, age, income, address region, and RFM (Recency, Frequency,Monetary value) features. Since gradient-boosted trees models haveproblems with calibration , we fit a nonparametric isotonicregressor to adjust the probability values output by the model.Given a classifier trained to predict conversions for a promoteditem i, the Gradient Boosting Filter displays the item iff the clas-sifiers output is above a threshold . We choose each thresholdvalue based on the analysis of the cumulative gains curve, which isoften used in direct marketing campaigns . By evaluating theclassifier at different threshold values, the cumulative gains curveprovides an estimate of the number of users we need to impactin order to reach a certain fraction of the users interested in theproduct.",
  "RESULTS": "We evaluate our algorithms through two A/B tests. Both experi-ments were carried out for 14 days and the main metric was the Sug-gestions for You components overall conversion rate. As guardrailmetrics, we also measured the individual conversion rate of eachpromoted item. Probabilistic Filter. In the first experiment, we selected a randomsample of 1.5M users, who were divided into two groups. Users inthe control group received the direct output of the constraint-basedrecommender system (see ), while users in the treatmentgroup received the recommended promoted items with the Prob-abilistic Filter. For the four items considered, we set = 5 and = 0.1, leading to = 0.37. Given the previous behavior, we ex-pected users to see each item in up to 7 days with a probability of0.9. On average, each user in the treatment group saw 4 = 1.48promoted items when opening the app.Comparing the average conversion rate of the two groups, weobserved a statistically significant uplift of 3.2% ( < 0.0001). Fur-thermore, there was no statistically significant evidence of a de-crease in the conversion rate of the promoted items. The resultssuggest that it is possible to improve the customer experience byreducing the frequency of exhibition of promoted items withoutnegative impacts on the conversion rate of promoted items. Gradient Boosting Filter. A total of 4.4M users participated inthe second A/B test, considering 3 promoted items. For users inthe control group, the promoted items were recommended usingthe Probabilistic Filter. The users in the treatment group receivedrecommendations using the Gradient Boosting Filter. When selectingthe Gradient Boosting Filters threshold value, we considered theclassifiers recall, the expected fraction of customers impacted bythe recommendation, and the relevance of the promoted item to thebusiness. We show the chosen threshold values in .As in the first experiment, the results were positive, with anincrease of 1.1% in the conversion rate ( = 0.02). We can see that,when data from previous conversions are available, the GradientBoosting Filter can further improve the effectiveness of the recom-mendation of promoted items.",
  "CONCLUSION": "Every day, PicPay serves a vast catalog of financial services tomillions of users through its Recommender Systems. In this context,promoting strategic products and services is not easy, as thesepromoted items may not be as relevant to the consumer as theones commonly consumed. In this paper, we present our solution topromote financial services using a Switching Hybrid RecommenderSystem. Our system employs two algorithms: a Probabilistic Filterthat is very scalable and can be easily parameterized; and a Gradient",
  "R. W. Conway, W. L. Maxwell, and L. W. Miller. 1967. Theory of Scheduling.Addison-Wesley": "Nick Craswell, Onno Zoeter, Michael Taylor, and Bill Ramsey. 2008. An ex-perimental comparison of click position-bias models. In Proceedings of the 2008international conference on web search and data mining. 8794. Steven Essinger, Dave Huber, and Daniel Tang. 2021. AIR: Personalized ProductRecommender System for Nikes Digital Transformation. In Proceedings of the15th ACM Conference on Recommender Systems (Amsterdam, Netherlands) (RecSys21). Association for Computing Machinery, New York, NY, USA, 530532. Kim Falk and Chen Karako. 2022. Optimizing Product Recommendations forMillions of Merchants. In Proceedings of the 16th ACM Conference on RecommenderSystems (Seattle, WA, USA) (RecSys 22). Association for Computing Machinery,New York, NY, USA, 499501.",
  "Gopalkrishnan R. Iyer, Markus Blut, Sarah Hong Xiao, and Dhruv Grewal. 2020.Impulse buying: a meta-analytic review. Journal of the Academy of MarketingScience 48, 3 (01 May 2020), 384404": "Guolin Ke, Qi Meng, Thomas Finley, Taifeng Wang, Wei Chen, Weidong Ma,Qiwei Ye, and Tie-Yan Liu. 2017. LightGBM: A Highly Efficient Gradient BoostingDecision Tree. In Advances in Neural Information Processing Systems, I. Guyon,U. Von Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett(Eds.), Vol. 30. Curran Associates, Inc. Charles X. Ling and Chenghui Li. 1998. Data Mining for Direct Marketing:Problems and Solutions. In Proceedings of the Fourth International Conference onKnowledge Discovery and Data Mining (New York, NY) (KDD98). AAAI Press,7379.",
  "Christian Montag, Benjamin Becker, and Chunmei Gan. 2018. The multipurposeapplication WeChat: a review on recent research. Frontiers in psychology 9 (2018),2247": "Alexandru Niculescu-Mizil and Rich Caruana. 2005. Predicting Good Probabilitieswith Supervised Learning. In Proceedings of the 22nd International Conference onMachine Learning (Bonn, Germany) (ICML 05). Association for Computing Ma-chinery, New York, NY, USA, 625632. Liang Wu, Diane Hu, Liangjie Hong, and Huan Liu. 2018. Turning Clicks intoPurchases: Revenue Optimization for Product Search in E-Commerce. In The 41stInternational ACM SIGIR Conference on Research and Development in InformationRetrieval (Ann Arbor, MI, USA) (SIGIR 18). Association for Computing Machinery,New York, NY, USA, 365374. Bianca Zadrozny and Charles Elkan. 2002. Transforming Classifier Scores into Ac-curate Multiclass Probability Estimates. In Proceedings of the Eighth ACM SIGKDDInternational Conference on Knowledge Discovery and Data Mining (Edmonton,Alberta, Canada) (KDD 02). Association for Computing Machinery, New York,NY, USA, 694699."
}