{
  "Grubhub, New York, USA": "AbstractAccuracy measures such as Recall, Precision, and Hit Rate have been a standard way of evaluatingRecommendation Systems. The assumption is to use a fixed Top-N to represent them. We propose thatmedian impressions viewed from historical sessions per diner be used as a personalized value for N. Wepresent preliminary exploratory results and list future steps to improve upon and evaluate the efficacy ofthese personalized metrics.",
  ". Introduction": "Recommender Systems (RS) are ubiquitous in e-commerce, from serving relevant ads to cus-tomers to helping them pick their favorite food. We have been evaluating these RS in the samemanner for more than a decade using Metric@N; e.g. Recall@N and N takes a numericvalue such as: 1, 5, 100. Evaluating the performance of the system using a static N for allcustomers misses important nuances in their behavior on the platform. Customer A mightonly look at the first 5 results on average but Customer Bs average is 25. The prevailing industryassumption is that displaying best results on top is the optimal solution for an online RS, butthis may not hold universally. Some customers might not click on the first result even if it isthe most relevant, because they want to explore additional results before making a decision. Inline with the goal of EvalRS2023; we propose calculating a personalized evaluation metric atCustomerN instead of a static termed: Metric@CustomerN. One way of calculating CustomerNis to take the median of maximum impression ranks scrolled to in past sessions on the platform.",
  "arXiv:2307.16832v1 [cs.IR] 31 Jul 2023": "agreement\" to account for different user interests on a music streaming platform. Chia et al.introduced RecList, to standardize behavioral metrics testing, and also introduce data slice-basedevaluation. Similarly, Ekstrand et al. break down users by demographic groups to understandif users from different groups obtain the same utility from RS. Kaminskas et al. expandbeyond accuracy measures and study the non-accuracy measures such as Diversity, Serendipity,Novelty, and Coverage and discuss their calculation. Sun and Verachtert et al. detailthe importance of observing a global timeline while evaluating recommender models. Usingimpression data in RS improved the relevance of recommended results in , we proposeincorporating impression data in RS evaluation as well.",
  ". Preliminary Analysis": "a shows significant variation in CustomerN, supporting the need for diner-specific N.In b and c we observe that as the median impressions go up for a customer,so does the variance of their impressions viewed across sessions. Additionally, the CV value ishigher for smaller CustomerN and stabilizes for diners with higher median impression views.",
  "(a)(b)(c)": ": CustomerN variability across customers with 3+ sessions in the last 90 days on Grubhub. AllAxes have been normalized by max CustomerN. Bars represent the inter-quartile range of y-axis valuesin (b) and (c) on e-commerce platforms. As a future undertaking we would first compare the performance ofpopular RS algorithms on public and proprietary datasets using , using median impressions viewed across all sessions as CustomerN has its limitationsbecause it cannot account for additional variability within the same customers sessions as seenin . So we would like to segment customer sessions based on their mindset per sessionusing same-session variables, historical activity, demographics, and geographical variables asdetailed in and subsequently calculate CustomerN as median impressions viewed atthe Customer-Segment level. Lastly, we will monitor long-term KPIs to validate if improvedMetric@CustomerN correlates with customer satisfaction and lifetime value.",
  ". Conclusion": "Recent research has shown us that its extremely valuable to incorporate customerimpression data into an RS. Similarly, we propose using impression data to enhance the ef-fectiveness of accuracy-based metrics. In our opinion, this approach has merit and warrantsadditional work to understand the implication of developing personalized calculations likeMetrics@CustomerN for RS evaluation. The preliminary analysis we did points to the existingvariability in customer behavior and to a need for a customer-centric evaluation of accuracymetrics. The methodology described in this paper is just the first step toward building a morepersonalized evaluation outlook for RS, we look forward to testing it out at EvalRS2023.",
  "P. Cremonesi, Y. Koren, R. Turrin, Performance of recommender algorithms on top-nrecommendation tasks, in: Proceedings of the fourth ACM conference on Recommendersystems, 2010, pp. 3946": "C. Hosey, L. Vujovi, B. St. Thomas, J. Garcia-Gathright, J. Thom, Just give me what i want:How people use and evaluate music search, in: Proceedings of the 2019 chi conference onhuman factors in computing systems, 2019, pp. 112. F. Bianchi, P. J. Chia, C. Greco, C. Pomo, G. Moreira, D. Eynard, F. Husain, J. Tagliabue,Evalrs 2023. well-rounded recommender systems for real-world deployments, arXivpreprint arXiv:2304.07145 (2023).",
  "P. J. Chia, J. Tagliabue, F. Bianchi, C. He, B. Ko, Beyond ndcg: behavioral testing ofrecommender systems with reclist, in: Companion Proceedings of the Web Conference2022, 2022, pp. 99104": "M. D. Ekstrand, M. Tian, I. M. Azpiazu, J. D. Ekstrand, O. Anuyah, D. McNeill, M. S. Pera,All the cool kids, how do they fit in?: Popularity and demographic biases in recommenderevaluation and effectiveness, in: Conference on fairness, accountability and transparency,PMLR, 2018, pp. 172186. M. Kaminskas, D. Bridge, Diversity, serendipity, novelty, and coverage: a survey and empir-ical analysis of beyond-accuracy objectives in recommender systems, ACM Transactionson Interactive Intelligent Systems (TiiS) 7 (2016) 142.",
  "A. Sun, From counter-intuitive observations to a fresh look at recommender system, arXivpreprint arXiv:2210.04149 (2022)": "R. Verachtert, L. Michiels, B. Goethals, Are we forgetting something? correctly evaluate arecommender system with an optimal training window, in: Proceedings of the Perspectiveson the Evaluation of Recommender Systems Workshop (PERSPECTIVES) at RecSys22,Seattle, WA, USA, 2022. F. B. Perez Maurera, M. Ferrari Dacrema, P. Cremonesi, Towards the evaluation of rec-ommender systems with impressions, in: Proceedings of the 16th ACM Conference onRecommender Systems, 2022, pp. 610615. M. Aharon, Y. Kaplan, R. Levy, O. Somekh, A. Blanc, N. Eshel, A. Shahar, A. Singer,A. Zlotnik, Soft frequency capping for improved ad click prediction in yahoo gemininative, in: Proceedings of the 28th ACM International Conference on Information andKnowledge Management, 2019, pp. 27932801. Y. Ji, A. Sun, J. Zhang, C. Li, Do loyal users enjoy better recommendations? understandingrecommender accuracy from a time perspective, in: Proceedings of the 2022 ACM SIGIRInternational Conference on Theory of Information Retrieval, 2022, pp. 9297. F. Wu, Y. Qiao, J.-H. Chen, C. Wu, T. Qi, J. Lian, D. Liu, X. Xie, J. Gao, W. Wu, et al., Mind: Alarge-scale dataset for news recommendation, in: Proceedings of the 58th Annual Meetingof the Association for Computational Linguistics, 2020, pp. 35973606. S. Eide, D. S. Leslie, A. Frigessi, J. Rishaug, H. Jenssen, S. Verrewaere, Finn. no slates dataset:A new sequential dataset logging interactions, all viewed items and click responses/no-click for recommender systems research, in: Proceedings of the 15th ACM Conference onRecommender Systems, 2021, pp. 556558. F. B. Prez Maurera, M. Ferrari Dacrema, L. Saule, M. Scriminaci, P. Cremonesi, Contentwiseimpressions: An industrial dataset with impressions included, in: Proceedings of the 29thACM International Conference on Information & Knowledge Management, 2020, pp.30933100. J. Cheng, C. Lo, J. Leskovec, Predicting intent using activity logs: How goal specificity andtemporal range affect user behavior, in: Proceedings of the 26th International Conferenceon World Wide Web Companion, 2017, pp. 593601. J. Garcia-Gathright, B. St. Thomas, C. Hosey, Z. Nazari, F. Diaz, Understanding andevaluating user satisfaction with music discovery, in: The 41st International ACM SIGIRConference on Research & Development in Information Retrieval, 2018, pp. 5564."
}