{
  "ABSTRACT": "Parkinsons disease (PD) is a slowly progressive, debilitating neu-rodegenerative disease which causes motor symptoms includinggait dysfunction. Motor fluctuations are alterations between peri-ods with a positive response to levodopa therapy (\"on\") and periodsmarked by re-emergency of PD symptoms (\"off\") as the responseto medication wears off. These fluctuations often affect gait speedand they increase in their disabling impact as PD progresses. Toimprove the effectiveness of current indoor localisation methods, atransformer-based approach utilising dual modalities which pro-vide complementary views of movement, Received Signal StrengthIndicator (RSSI) and accelerometer data from wearable devices, isproposed. A sub-objective aims to evaluate whether indoor locali-sation, including its in-home gait speed features (i.e. the time takento walk between rooms), could be used to evaluate motor fluctua-tions by detecting whether the person with PD is taking levodopamedications or withholding them. To properly evaluate our pro-posed method, we use a free-living dataset where the movementsand mobility are greatly varied and unstructured as expected inreal-world conditions. 24 participants lived in pairs (consisting ofone person with PD, one control) for five days in a smart home withvarious sensors. Our evaluation on the resulting dataset demon-strates that our proposed network outperforms other methods forindoor localisation. The sub-objective evaluation shows that preciseroom-level localisation predictions, transformed into in-home gaitspeed features, produce accurate predictions on whether the PDparticipant is taking or withholding their medications.",
  "indoor localisation, parkinson disease, multimodal learning, time-series data, transformer networks": "ACM Reference Format:Ferdian Jovan, Catherine Morgan, Ryan McConville, Emma L. Tonkin,Ian Craddock, and Alan Whone. 2023. Multimodal Indoor Localisationin Parkinsons Disease for Detecting Medication Use: Observational PilotStudy in a Free-Living Setting. In Proceedings of the 29th ACM SIGKDDConference on Knowledge Discovery and Data Mining (KDD 23), August610, 2023, Long Beach, CA, USA. ACM, New York, NY, USA, 11 pages.",
  "INTRODUCTION": "Parkinsons disease (PD) is a debilitating neurodegenerative diseaseaffecting around 6 million people worldwide. It is characterised bya variety of movement-related (motor) symptoms, such as slownessof movement, rigidity and gait dysfunction . A complication ofthe mainstay medication used to treat PD, levodopa, is that patientsstart to experience motor symptom fluctuations related to medica-tion timings. When levodopa is first started, patients experience asmooth and prolonged therapeutic response. As disease progresses(and in a substantial proportion of patients within the first fiveyears), patients start to wear off from their medications beforethe next dose, causing a reemergence of parkinsonian symptomsincluding slowness of gait. These symptom fluctuations impair pa-tients quality of life and often necessitate changes in medicationregime. Motor symptoms can become severe enough to hinder thesubjects gait and movement around their own house . As aresult, the subject may be more likely to stay in one room; oncethey move, they may typically need more time to transition be-tween rooms. Such outcomes could be used to detect ON and OFFmedication motor fluctuations in PD and to inform clinicians andpatients of such symptoms.",
  "KDD 23, August 610, 2023, Long Beach, CA, USAFerdian Jovan et al": "Pierre-Emmanuel Aguera, Karim Jerbi, Anne Caclin, and Olivier Bertrand. 2011.ELAN: a software package for analysis and visualization of MEG, EEG, and LFPsignals. Computational intelligence and neuroscience 2011 (2011). Marc Bachlin, Daniel Roggen, Gerhard Troster, Meir Plotnik, Noit Inbar, In-bal Meidan, Talia Herman, Marina Brozgol, Eliya Shaviv, Nir Giladi, and Jef-frey M. Hausdorff. 2009. Potentials of Enhanced Context Awareness in Wear-able Assistants for Parkinsons Disease Patients with the Freezing of GaitSyndrome. In 2009 International Symposium on Wearable Computers. 123130.",
  "with the RSSI may impair the performance of indoor localisationdue to differing levels of tremor manifesting in the accelerationsignal. In this work, we make two main contributions": "(1) We describe the utilisation of RSSI enriched by the accelerom-eter data to perform room-level localisation. Our proposednetwork1 intelligently chooses accelerometer features whichmay improve the RSSI performance in performing indoorlocalisation. To properly evaluate our proposed method, weuse a free-living (a person living their life freely, without ex-ternal intervention) dataset created by our group, where themovements and mobility are greatly varied and unstructuredas expected in real-world conditions. Our evaluation on sucha unique dataset, which includes subjects with and withoutPD, demonstrates that our proposed network outperformsother approaches in all cross-validation categories. (2) We also demonstrate how the accurate room-level localisa-tion predictions can be transformed into in-home gait speedbiomarkers (e.g. number of room-to-room transition, room-to-room transition duration) which can be used to effectivelyclassify the OFF or ON medication state of a PD patient fromthis pilot study data.",
  "RELATED WORK": "There has been substantial work using home-based passive sensingsystems to assess how the activities and behaviour of people withneurological disease (mainly cognitive dysfunction) change overtime . There is very limited work assessing room use in thehome setting in people with Parkinsons.However, gait quantification using wearables or smartphones isan area where a significant amount of work has been done (withseveral systematic reviews such as these). Cameras can detectalso Parkinsonian gait and some gait features including step lengthand average walking speed . Time of flight devices (which mea-sure distances between the subject and the camera ) have beenused to assess medication adherence through gait analysis .From free-living data, one approach to gait and room use evalua-tion in home settings is by emitting and detecting radio waves tonon-invasively track movement. Gait analysis using radio wavetechnology shows promise to track disease progression, severityand medication response . However, this approach cannot iden-tify who is doing the movement and also suffers from technicalissues when the radio waves are occluded by another object. Muchof the work done so far using video to track PD symptoms has fo-cused on the performance of structured clinical rating scales duringtelemedicine consultations as opposed to naturalistic behaviour, and there have been some privacy concerns around the use ofvideo data at home .RSSI data produced from wearable devices is a type of data withfewer privacy concerns; it can be measured continuously and unob-trusively over long periods of time to capture real-world functionand behavior in a privacy-friendly way. In indoor localisation, fin-gerprinting using RSSI is the typical technique used to estimatethe wearable (user) location by using signal strength data repre-senting a coarse and noisy estimate of the distance access point",
  "Multimodal Indoor Localisation in Parkinsons Disease for Detecting Medication Use:Observational Pilot Study in a Free-Living SettingKDD 23, August 610, 2023, Long Beach, CA, USA": "from the wearable . RSSI signals are not stable, they fluctuaterandomly due to shadowing, fading and multi-path effects. How-ever, many techniques have been proposed in recent years to tacklethese fluctuations, and, indirectly, improve the localisation accu-racy. Some of the works utilise deep neural networks (DNN) togenerate coarse positioning estimates from RSSI signals, which arethen refined by a hidden Markov model (HMM) to produce a finalestimate location. Other works, , try to utilise a time-series ofRSSI data and exploit the temporal connections within each accesspoint to estimate room-level position. A CNN is used to build lo-calisation models to further leverage the temporal dependenciesacross time-series readings.It has been suggested that we cannot rely on RSSI alone forindoor localisation in home environments for PD subjects due toshadowing rooms with tight separation . Sansano et al.combine RSSI signals and inertial measurement unit (IMU) datato test the viability of leveraging other sensors in aiding the posi-tioning system to produce a more accurate location estimate .Classic machine learning approaches such as Random Forest (RF),Artificial Neural Network (ANN), k-Nearest Neighbour (k-NN) aretested, and the result shows that the RF outperforms other methodsin tracking a person in indoor environments. Poulose et al. combinesmartphone IMU sensor data and Wi-Fi received signal strengthindication (RSSI) measurements to estimate the exact location (inEuclidean position X, Y) of a person in indoor environments .The proposed sensor fusion framework uses location fingerprintingin combination with a pedestrian dead reckoning (PDR) algorithmto reduce the positioning errors.Looking at this multi-modality classification / regression problemfrom a timeseries perspective, there has been a lot of explorationsin tackling a problem where each modality can be categorised asmultivariate timeseries data . LSTM and attention layersare often used in parallel to directly transform raw multivariatetime series data into low-dimensional feature representation foreach modality. Later, various processed is done to further extractcorrelations across modalities through the use of various layers(e.g. concatenation, CNN layer, transformer, self-attention) .Our work is inspired by Sansano-Sansano et al. where we onlyutilise accelerometer data to enrich the RSSI, instead of utilising allIMU sensors, in order to reduce battery consumption. In addition,unlike Sansano-Sansano et al. who stop at predicting room locations,we go a step further and use room-to-room transition behaviours,as features for a binary classifier predicting whether people withPD are taking their medications or withholding them.",
  "COHORT AND DATASET": "Dataset. This dataset was collected using wristband wearable sen-sors, one on each wrist of all participants, containing tri-axial ac-celerometers2 and 10 Access Points (APs) placed through the res-idential home (see for house layout and AP location), eachmeasuring the RSSI . The wearable devices wirelessly transmitdata using the Bluetooth Low Energy (BLE) standard which can bereceived by the 10 APs. Each AP records the transmitted packets",
  ": Layout of the residential home setting": "from the wearable sensor which contains the accelerometer read-ings sampled at 30Hz, with each AP recording RSSI values sampledat 5 Hz.The dataset contains 12 spousal/parent-child/friend-friend pairs(24 participants in total) living freely in a smart home for five days.Each pair consists of one person with PD and one person as thehealthy control volunteer (HC). This pairing was chosen to enablePD vs HC comparison, for safety reasons and also to increase thenaturalistic social behaviour (particularly amongst the spousal pairswho already lived together). From the 24 participants, five femalesand seven males have PD. The average age of the participantsis 60.25 (PD 61.25, Control 59.25) and the average time since PDdiagnosis for the person with PD is 11.3 years (range 0.5-19).To measure the accuracy of the machine learning models, wall-mounted cameras are installed in the ground floor of the housewhich capture red-green-blue (RGB) and depth data 2-3 hoursdaily (during daylight hours at times when participants were athome). The videos were then manually annotated to the nearestmillisecond to provide localisation labels. Multiple human labellersused a widely available software called ELAN to watch up to 4simultaneously-captured video files at a time. The resulting labelleddata recorded the kitchen, hallway, dining room, living room, stairs,and porch. The duration of labelled data recorded by the cameras forPD and HC is 72.84 and 75.31 hours, respectively, which providesa relatively balanced label set for our room-level classification3.Finally, to evaluate the ON/OFF medication state, participants withPD were asked to withhold their dopaminergic medications so thatthey were in the practically-defined OFF medications state for atemporary period of several hours during the study. Withholdingmedications removes their mitigation on symptoms, leading tomobility deterioration which can include slowing of gait.Data pre-processing for indoor localisation. The data fromthe two wearable sensors worn by each participant were combinedat each time point, based on their modality, i.e. twenty RSSI values(corresponding to 10 APs for each of the two wearable sensors),and accelerometry traces in six spatial directions (correspondingto the three spatial directions (x, y, z) for each wearable) wererecorded at each time point. The accelerometer data is resampledto 5Hz to synchronise the data with RSSI values. With a 5-second",
  ": MDCSA architecture": "confirmed on 14 January 2020; the research was conducted inaccord with the Helsinki Declaration of 1975; written informedconsent was gained from all study participants. In order to protectparticipant privacy supporting data is not shared openly. It willbe made available to bona fide researchers subject to a data accessagreement. If you wish to apply to access this data, please .",
  "METHODOLOGIES AND FRAMEWORK": "We introduce Multihead Dual Convolutional Self Attention (MD-CSA), a deep neural network that utilises dual modalities for indoorlocalisation in home environments. The network tackles two chal-lenges that arise from multimodality and time-series data: (1) Capturing multivariate features and filtering multi-modal noises. RSSI signals, which are measured at multipleaccess points within a home received from wearable commu-nication, have been widely used for indoor localisation ,typically using a fingerprinting technique that produces aground truth radio map of a home. Naturally, the wearablealso produces acceleration measurements which can be usedto identify typical activities performed in a specific room,and thus we can explore if accelerometer data will enrich theRSSI signals, in particular to help distinguish adjacent rooms,which RSSI-only systems typically struggle with. If it will,how can we incorporate these extra features (and modalities)into the existing features for accurate room predictions, par-ticularly in the context of PD where the acceleration signalmay be significantly impacted by the disease itself? (2) Modelling local and global temporal dynamics. Thetrue correlations between inputs both intra-modality (i.e.RSSI signal among access points) and inter-modality (i.e.RSSI signal against accelerometer fluctuation) are dynamic.",
  "Modality Positional Embedding": "Due to different data dimensionality between RSSI and accelerome-ter, coupled with the missing temporal information, a linear layerwith a positional encoding is added to transform both RSSI andaccelerometer data into their respective embeddings. Suppose wehave a collection of RSSI signals x = [x1, . . . , x ] R , and ac-celerometer data x = [x1, . . . , x ] R within time unit,where x =1 , . . . , represents RSSI signals from accesspoints, and x =1 , . . . , represents accelerometer data from spatial directions at time with . Given feature vectorsx =1 , . . . ,with {,} representing RSSI or accelerome-ter data at time , and representing time index, a positionalembedding h for RSSI or accelerometer can be obtained by:",
  "Locality Enhancement with Self-Attention": "As it is time series data, the importance of an RSSI or accelerometervalue at each point in time can be identified in relation to its sur-rounding values - such as cyclical patterns, trends, or fluctuations.Utilising historical context that can capture local patterns on top ofpoint-wise values, performance improvements in attention-basedarchitectures can be achieved. One straightforward option is toutilise a recurrent neural network such as a long-short term mem-ory (LSTM) approach. However, in LSTM layers, the local contextis summarised based on the previous context and the current input.Two similar patterns separated by a long period of time might havedifferent context if they are processed by the LSTM layers . Weutilise a combination of causal convolution layers and self-attentionlayers which we name Dual Convolutional Self-Attention (DCSA).The DCSA takes in a primary input x1 R and a secondaryinput x2 R and yields:",
  "Multihead Dual ConvolutionalSelf-Attention": "Our approach employs a self-attention mechanism introduced in to capture global dependencies across time steps. It is embeddedas part of the DCSA architecture. Inspired by Vaswani et al. inutilising multihead self-attention, we utilise our DCSA with variouskernel lengths with the same aim: allowing asymmetric long-termlearning. The multihead DCSA, shown as part in , takes intwo inputs x1, x2 R and yields:",
  ",..., (x1, x2) WV(5)": "1,...,x1, x2 =1 (x1, x2), . . . , (x1, x2)(6)where (.) is a 1D-convolutional layer with a kernel size {1,} anda stride , WK R, WQ R , V R are weights forkeys, queries and values of the self-attention layer, and 1,..., (.)concatenates the output of each (.) in temporal order. Forregularisation, a normalisation layer followed by a dropout layer isadded after Equation 4.Following the modality positional embedding layer in subsec-tion 4.1, the positional embeddings of RSSI h = [h1, . . . , h ] andaccelerometer h = [h1, . . . , h ], produced by Eq. 1, are then fedto an MDCSA layer with various kernel sizes [1, . . . ,]:",
  "Final Layer and Loss Calculation": "We apply two different layers to produce two different outputsduring training. The room-level predictions are produced via asingle conditional random field (CRF) layer in combination witha linear layer applied to the output of Eq. 7 to produce the finalpredictions as = ()(8) = W + b(9) where W R, and b R are weight and bias to learn, isthe number of room locations, and =1, . . . , R is therefined embedding produced by Eq. 7. Even though the transformercan take into account neighbour information before generatingthe refined embedding at time step , its decision is independent;it does not take into account the actual decision made by otherrefined embeddings . We use a CRF layer to cover just that, i.e.to maximise the probability of the refined embeddings of all timesteps, so it can better model cases where refined embeddings closestto one another must be compatible (i.e. minimising the possibilityfor impossible room transitions). When finding the best sequenceof room location , the Viterbi Algorithm is used as a standard forthe CRF layer.",
  "duced by Equation 9 prior to prediction outputs) e =1, . . . ,": "are trained to generate the likelihood estimate of room predictions,while the binary classification output = [ 1, . . . , ] is used totrain the probability estimate of a particular room. The final lossfunction can be formulated as a combination of both likelihood andbinary cross entropy loss function described as:",
  "=0 ( ) + (1 ) (1 )(13)": "where L(.) represents the negative log-likelihood and L (.)denotes the binary cross entropy, y = [1, . . . , ] R is theactual room locations, and = [1, . . . , ] R is the binaryvalue whether at time the room is the referenced room or not.( | ) denotes the conditional probability, and ( | 1)denotes the transition matrix cost of having transitioned from 1to .",
  "MDCSA1,4,7 4APS RSSI, as an ablation study, with our pro-posed network using only 4 access points for the RSSI as itsinput features": "For RF, all the time series features of RSSI and accelerometry areflattened and merged into one feature vector for room-level localisa-tion. For TENER, at each time step , RSSI x and accelerometer xfeatures are combined via a linear layer before they are processedby the networks. A grid search on the parameters of each networkis performed to find the best parameter for each model. The parame-ters to tune are: the embedding dimension in {128, 256}, the num-ber of epochs in {200, 300}, and the learning rate in {0.01, 0.0001}.The dropout rate is set to 0.15, and the RAdam optimiser incombination with Look-Ahead algorithm is used for the train-ing with early stopping using the validation performance. For theRF, we perform a cross-validated parameter search for the numberof trees ({200, 250}), the minimum number of samples in a leaf node({1, 5}), and whether a warm start is needed ({, }). TheGini impurity is used to measure splits.Evaluation Metrics. We are interested in developing a systemto monitor PD motor symptoms in home environments. For exam-ple, we will consider if there is any significant difference in theperformance of the system when it is trained with PD data com-pared to being trained with healthy control (HC) data. We tailoredour training procedure to test our hypothesis by performing varia-tions of cross-validation. Apart from training our models on all HCsubjects (ALL-HC), we also perform four different kinds of cross-validation: 1) We train our models on one PD subject (LOO-PD),2) We train our models on one HC subject (LOO-HC), 3) We takeone HC subject and use only roughly four minutes worth of data totrain our models (4m-HC), 4) We take one PD subject and use onlyroughly four minutes worth of data to train our models (4m-PD).For all of our experiments, we test our trained models on all PDsubjects (excluding the one used as training data for LOO-PD and4m-PD). For room-level localisation accuracy, we use precision andweighted F1-score, all averaged and standard deviated across thetest folds.To showcase the importance of in-home gait speed features indifferentiating the medication state of a person with PD, we firstcompare how accurate the Room-to-room Transition durationproduced by each network is to the ground truth (i.e. annotatedlocation). We hypothesise that the more accurate the transitionis compared to the ground truth, the better mobility features arefor medication state classification. For the medication state clas-sification, we then compare two different groups of features withtwo simple binary classifiers: 1) the baseline demographic features",
  "Experimental Results": "Room-level Accuracy. The first part of compares the per-formance of MCDSA network and other approaches for room-levelclassification. For the room-level classification, MDCSA networkoutperforms other networks and RF with a minimum improve-ment of 1.3% for the F1-score over the second-best network (i.e. Alt DTML) in each cross-validation type with the exception of theALL-HC validation. The improvement is more significant on the4m-HC and 4m-PD validations, when the training data are limited,with an average improvement at almost 9% for the F1-score overthe Alt DTML.The LOO-HC and LOO-PD validation show that a model that hasthe ability to capture the temporal dynamics across time steps (e.g.TENER and DTML) will perform better than a standard baselinetechnique such as a Random Forest. TENER and DTML performbetter in those two validations due to their ability to capture asyn-chronous relation across modalities. However, when the trainingdata becomes limited as in 4m-HC and 4m-PD validations, havingextra capabilities is necessary to further extract temporal informa-tion and correlations. Due to being a vanilla transformer requiringconsiderable amount of training data, TENER performs worst inthese two validations. DTML performs quite well due to its abilityto capture local context via LSTM for each modality. However, ingeneral, DTMLs performance suffers in both the LOO-PD and 4m-PD validations as the accelerometer data (and modality) may beerratic due to PD and should be excluded at times from contribut-ing to room classification. MDCSA network has all the capabilitiesthat DTML has with an improvement in suppressing accelerometermodality when needed via GRN layer embedded in DCSA. Suppress-ing the noisy modality seems to have a strong impact in maintainingthe performance of the network when the training data is limited.This is validated by how Alt DTML (i.e. DTML added with GRN andCRF layers) outperforms the standard DTML by an average of 2.2%for the F1-score in in 4m-HC and 4m-PD validations. It is furtherconfirmed by MDCSA1,4,7 4APS against MDCSA1,4,7 4APS RSSIwith the latter model, which does not include the accelerometerdata, outperforming the former for the F1-score by an average of1.6% in the last three cross validations. It is worth pointing outthat the MDCSA1,4,7 4APS RSSI model performed the best in the4m-PD validation. However, the omission of accelerometer dataaffects the model in differentiating rooms that are more likely tohave active movement (i.e. hall) than the rooms that are not (i.e.living room). It can be seen from that the MDCSA1,4,7 4APSRSSI model has low performance in predicting hallway comparedto the full model of MDCSA1,4,7. As a consequence, the MDCSA1,4,74APS RSSI model cannot produce in-home gait speed features ascompetent as the ones produced by the MDCSA1,4,7.Room-to-room Transition and Medication Accuracy. Wehypothesise that during their OFF medication state, the deteriora-tion in mobility of a person with PD is exhibited by how they tran-sition between rooms. To test this hypothesis, a Wilcoxon signedrank test was used on the annotated data from PD participantsundertaking each of the three individual transitions between roomswhilst ON (taking) and OFF (withholding) medications to assesswhether the mean transition duration ON medications was statisti-cally significantly shorter than the mean transition duration for thesame transition OFF medications for all transitions studied (see Ta-ble 4). From this result, we argue that the mean transition durationobtained by each model from that is close to the groundtruth can capture what the ground truth captures. As mentioned in, this transition duration for each model is generated bythe model continuously performing room-level localisation focus-ing on the time a person is predicted to spend in a hallway between",
  "Dining-Living OFF10.4 secDining-Living ON9.0 sec64.01.9610.026": "rooms. We show, in , that the mean transition duration forall transitions studied produced by MDCSA1,4,7 model is the closestto the ground truth improving over the second best by around 1.25seconds across all hall transitions and validations.The second part of the shows the performance of allour networks for medication state classification. The demographicfeatures can be used as a baseline for each type of validation. TheMDCSA network, with the exception of the ALL-HC validation, out-performs any other network by a significant margin for the AUROCscore. By using in-home gait speed features produced by MDCSAnetwork, a minimum of 15% improvement over the baseline demo-graphic features can be obtained with the biggest gained obtainedin the 4m-PD validation data. In 4m-PD validation data, RF, TENER,and DTML could not manage to provide any prediction due to theirinability to capture (partly) hall transitions. Furthermore, TENERhas shown its inability to provide any medication state predictionfrom the 4m-HC data validations. It can be validated by when the TENER failed to capture any transitions between diningroom and living room across all periods that have ground truths.MDCSA networks are able to provide medication state predictionand maintain its performance across all cross-validations thanks tothe addition of Eq. 13 in the loss function.",
  "CONCLUSION": "We have presented the MDCSA model, a new deep learning ap-proach for indoor localisation utilising RSSI and wrist-worn ac-celerometer data. The evaluation on our unique real-world free-living pilot dataset, which includes subjects with and without PD,shows that MDCSA achieves the state-of-the-art accuracy for in-door localisation. The availability of accelerometer data does indeedenrich the RSSI features which, in turn, improves the accuracy ofthe indoor localisation.In naturalistic settings, in-home mobility can be measured throughthe use of indoor localisation models. We have shown, using roomtransition duration results, that our PD cohort take longer on aver-age to perform a room transition when they withhold medications.With accurate in-home gait speed features, a classifier model canthen differentiate accurately if a person with PD is in an ON orOFF medication state. Such changes show the promise of these lo-calisation outputs to detect the dopamine-related gait fluctuationsin PD that impact on patients quality of life and are impor-tant in clinical decision making . We have also demonstratedthat our indoor localisation system provides precise in-home gaitspeed features in PD with a minimal average offset to the groundtruth. The network also outperforms other models in the produc-tion of in-home gait speed features which is used to differentiatethe medication state of a person with PD. Limitations and future research. One limitation of this studyis the relatively small sample size (which was planned as this isan exploratory pilot study). We believe our sample size is ample toshow proof of concept. This is also the first such work with unobtru-sive ground truth validation from embedded cameras. Future workshould validate our approach further on a large cohort of peoplewith PD and consider stratifying for sub-groups within PD (e.g.akinetic-rigid or tremor-dominant phenotypes), which would alsoincrease the generalisability of the results to the wider population.Future work in this matter could also include the construction of asemi-synthetic dataset based on collected data to facilitate a paralleland large-scale evaluation.This smart homes layout and parameters remain constant forall the participants, and we acknowledge that transfer of this deeplearning model to other varied home settings may introduce varia-tions in localisation accuracy. For future ecological validation andbased on our current results, we anticipate the need for pre-training(e.g. a brief walkaround which is labelled) for each home, and alsosuggest that some small amount of ground-truth data will needto be collected (e.g. researcher prompting of study participants toundertake scripted activities such as moving from room to room)to fully validate the performance of our approach in other settings.Accurate room localisation using these data modalities has a widerange of potential applications within healthcare. This could in-clude tracking of gait speed during rehabilitation from orthopaedicsurgery, monitoring wandering behaviour in dementia or triggeringan alert for a possible fall (and long lie on the floor) if someone isin one room for an unusual length of time. Furthermore, accurateroom use and room-to-room transfer statistics could be used inoccupational settings, e.g. to check factory worker location. We are very grateful to the study participants for giving so muchtime and effort to this research. We acknowledge the local Move-ment Disorders Health Integration Team (Patient and Public In-volvement Group) for their assistance at each study design step.This work was supported by the SPHERE Next Steps Project fundedby the UK Engineering and Physical Sciences Research Council(EPSRC), [Grant EP/R005273/1]; the Elizabeth Blackwell Institutefor Health Research, University of Bristol and the Wellcome TrustInstitutional Strategic Support Fund [grant code: 204813/Z/16/Z];by Cure Parkinsons Trust [grant code AW021]; and by IXICO[grant code R101507-101]. Dr and Mrs de Pass made a charitabledonation to the University of Bristol through the Development andAlumni Relations Office to pay the salary of CM, the PhD studentand Clinical Research Fellow.",
  "Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2014. Neural MachineTranslation by Jointly Learning to Align and Translate": "Aishwarya Balakrishnan, Jeevan Medikonda, Pramod Kesavan Namboothiri ,Manik Manik, and an Natarajan. 2022. Role of Wearable Sensors with MachineLearning Approaches in Gait Analysis for Parkinsons Disease Assessment: AReview. Engineered Science 19 (2022), 519. scar Belmonte-Fernndez, Adrian Puertas-Cabedo, Joaqun Torres-Sospedra,Ral Montoliu-Cols, and Sergi Trilles-Oliver. 2017. An Indoor PositioningSystem Based on Wearables for Ambient-Assisted Living. Sensors 17, 1 (2017).",
  "Lorenzo Brognara, Pierpaolo Palumbo, Bernd Grimm, and Luca Palmerini. 2019.Assessing Gait in Parkinsons Disease Using Wearable Motion Sensors: A Sys-tematic Review. Diseases 7, 1 (2019)": "Defu Cao, Yujing Wang, Juanyong Duan, Ce Zhang, Xia Zhu, Congrui Huang,Yunhai Tong, Bixiong Xu, Jing Bai, Jie Tong, and Qi Zhang. 2020. SpectralTemporal Graph Neural Network for Multivariate Time-series Forecasting. InAdvances in Neural Information Processing Systems, H. Larochelle, M. Ranzato,R. Hadsell, M. F. Balcan, and H. Lin (Eds.), Vol. 33. Curran Associates, Inc., 1776617778. Carl E. Clarke, Paul Worth, Donald Grosset, and David Stewart. 2009. Systematicreview of apomorphine infusion, levodopa infusion and deep brain stimulationin advanced Parkinsons disease. Parkinsonism & Related Disorders 15 (12 2009),728741. Issue 10.",
  "David Devos, Etienne Hirsch, and Richard Wyse. 2021. Seven Solutions forNeuroprotection in Parkinsons Disease. Movement Disorders 36, 2 (2021), 306316": "Giulia Di Lazzaro, Mariachiara Ricci, Mohammad Al-Wardat, Tommaso Schirinzi,Simona Scalise, Franco Giannini, Nicola B Mercuri, Giovanni Saggio, and AntonioPisani. 2020. Technology-based objective measures detect subclinical axial signsin untreated, de novo Parkinsons disease. Journal of Parkinsons Disease 10, 1(2020), 113122. Ryan P. Duncan and Gammon M. Earhart. 2011. Measuring participation inindividuals with Parkinson disease: relationships with disease severity, qualityof life, and mobility. Disability and Rehabilitation 33, 15-16 (2011), 14401446. PMID: 21091047. Alberto J. Espay, Paolo Bonato, Fatta B. Nahab, Walter Maetzler, John M. Dean,Jochen Klucken, Bjoern M. Eskofier, Aristide Merola, Fay Horak, Anthony E.Lang, Ralf Reilmann, Joe Giuffrida, Alice Nieuwboer, Malcolm Horne, Max A.Little, Irene Litvan, Tanya Simuni, E. Ray Dorsey, Michelle A. Burack, Ken Kubota,Anita Kamondi, Catarina Godinho, Jean-Francois Daneault, Georgia Mitsi, LotharKrinke, Jeffery M. Hausdorff, Bastiaan R. Bloem, Spyros Papapetropoulos, andon behalf of the Movement Disorders Society Task Force on Technology. 2016.Technology in Parkinsons disease: Challenges and opportunities. MovementDisorders 31, 9 (2016), 12721282. Alberto J. Espay, Jeffrey M. Hausdorff, lvaro Snchez-Ferro, Jochen Klucken,Aristide Merola, Paolo Bonato, Serene S. Paul, Fay B. Horak, Joaquin A. Vizcarra,Tiago A. Mestre, Ralf Reilmann, Alice Nieuwboer, E. Ray Dorsey, Lynn Rochester,Bastiaan R. Bloem, Walter Maetzler, and on behalf of the Movement DisorderSociety Task Force on Technology. 2019. A roadmap for implementation ofpatient-centered digital outcome measures in Parkinsons disease obtained usingmobile health technologies. Movement Disorders 34, 5 (2019), 657663. Luc J.W. Evers, Jesse H. Krijthe, Marjan J. Meinders, Bastiaan R. Bloem, andTom M. Heskes. 2019. Measuring Parkinsons disease over time: The real-worldwithin-subject reliability of the MDS-UPDRS. Movement Disorders 34, 10 (2019),14801487. James M. Fisher, Nils Y. Hammerla, Thomas Ploetz, Peter Andras, Lynn Rochester,and Richard W. Walker. 2016. Unsupervised home monitoring of Parkinsonsdisease motor symptoms using body-worn accelerometers. Parkinsonism &Related Disorders 33 (2016), 4450. N Giladi, TA Treves, ES Simon, H Shabtai, Y Orlov, B Kandinov, D Paleacu, andAD Korczyn. 2001. Freezing of gait in patients with advanced Parkinsons disease.Journal of neural transmission 108, 1 (2001), 5361. Julia C. Greenland, Caroline H. Williams-Gray, and Roger A. Barker. 2019. Theclinical heterogeneity of Parkinsons disease and its therapeutic implications.European Journal of Neuroscience 49, 3 (2019), 328338.",
  "A. Kolb, E. Barth, R. Koch, and R. Larsen. 2010. Time-of-Flight Cameras inComputer Graphics. Computer Graphics Forum 29, 1 (2010), 141159": "Nenad Kostanjsek. 2011. Use of The International Classification of Functioning,Disability and Health (ICF) as a conceptual framework and common language fordisability statistics and health information systems. In BMC public health, Vol. 11.Springer, 16. Michal Kozlowski, Dallan Byrne, Raul Santos-Rodriguez, and Robert Piechocki.2018. Data fusion for robust indoor localisation in digital health. In 2018 IEEEWireless Communications and Networking Conference Workshops (WCNCW). 302307.",
  "Liyuan Liu, Haoming Jiang, Pengcheng He, Weizhu Chen, Xiaodong Liu, JianfengGao, and Jiawei Han. 2019. On the Variance of the Adaptive Learning Rate andBeyond. CoRR abs/1908.03265 (2019)": "Ruichen Liu, Zhelong Wang, Sen Qiu, Hongyu Zhao, Cui Wang, Xin Shi, and FangLin. 2022. A Wearable Gait Analysis and Recognition Method for ParkinsonsDisease Based on Error State Kalman Filter. IEEE Journal of Biomedical and HealthInformatics 26, 8 (2022), 41654175. Connie Marras, Anthony Lang, Murray Krahn, George Tomlinson, and GaryNaglie. 2004. Quality of life in early Parkinsons disease: Impact of dyskinesiaand motor fluctuations. Movement Disorders 19 (1 2004), 2228. Issue 1. Ankur Pandey, Ryan Sequeira, and Sudhir Kumar. 2021. Joint Localization andRadio Map Generation using Transformer Networks with Limited RSS Sam-ples. In 2021 IEEE International Conference on Communications Workshops (ICCWorkshops). 16. Antoine Piau, Katherine Wild, Nora Mattek, and Jeffrey Kaye. 2019. CurrentState of Digital Biomarker Technologies for Real-Life, Home-Based Monitoringof Cognitive Function for Mild Cognitive Impairment to Mild Alzheimer Diseaseand Implications for Clinical Care: Systematic Review. J Med Internet Res 21, 8(30 Aug 2019), e12785.",
  "Alwin Poulose, Jihun Kim, and Dong Seog Han. 2019. A Sensor Fusion Frameworkfor Indoor Localization Using Smartphone Sensors and Wi-Fi RSSI Measurements.Applied Sciences 9, 20 (2019)": "Antoine Regnault, Babak Boroojerdi, Juliette Meunier, Massimo Bani, ThomasMorel, and Stefan Cano. 2019. Does the MDS-UPDRS provide the precision toassess progression in early Parkinsons disease? Learnings from the Parkinsonsprogression marker initiative cohort. Journal of neurology 266, 8 (2019), 19271936. Mariachiara Ricci, Giulia Di Lazzaro, Antonio Pisani, Simona Scalise, MohammadAlwardat, Chiara Salimei, Franco Giannini, and Giovanni Saggio. 2019. WearableElectronics Assess the Effectiveness of Transcranial Direct Current Stimulationon Balance and Gait in Parkinsons Disease Patients. Sensors 19, 24 (2019).",
  "Krista G Sibley, Christine Girges, Ehsan Hoque, and Thomas Foltynie. 2021.Video-based analyses of Parkinsons disease severity: A brief review. Journal ofParkinsons Disease 11, s1 (2021), S83S93": "Diane Stephenson, Reham Badawy, Soania Mathur, Maria Tome, and LynnRochester. 2021. Digital progression biomarkers as novel endpoints in clini-cal trials: A multistakeholder perspective. Journal of Parkinsons Disease 11, s1(2021), S103S109. Thanaphon Suwannaphong, Ryan McConville, and Ian Craddock. 2022. RadioSignal Strength Indication Augmentation for One-Shot Learning in Indoor Locali-sation. In Proceedings of the 1st ACM Workshop on Smart Wearable Systems and Ap-plications (Sydney, NSW, Australia) (SmartWear 22). Association for ComputingMachinery, New York, NY, USA, 712. Nima Toosizadeh, Jane Mohler, Hong Lei, Saman Parvaneh, Scott Sherman, andBijan Najafi. 2015. Motor performance assessment in Parkinsons disease: associa-tion between objective in-clinic, objective in-home, and subjective/semi-objectivemeasures. PloS one 10, 4 (2015), e0124763. Conrad S. Tucker, Ishan Behoora, Harriet Black Nembhard, Mechelle Lewis,Nicholas W. Sterling, and Xuemei Huang. 2015. Machine learning classification ofmedication adherence in patients with movement disorders using non-wearablesensors. Computers in Biology and Medicine 66 (2015), 120134. Jannis van Kersbergen, Karen Otte, Nienke M de Vries, Bastiaan R Bloem,Hanna M Rhling, Sebastian Mansow-Model, Nicolien M van der Kolk, SebastiaanOvereem, Svitlana Zinger, and Merel M van Gilst. 2021. Camera-based objectivemeasures of Parkinsons disease gait features. BMC Research Notes 14, 1 (2021),16. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones,Aidan N Gomez, ukasz Kaiser, and Illia Polosukhin. 2017. Attention is Allyou Need. In Advances in Neural Information Processing Systems, I. Guyon, U. V.Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett (Eds.),Vol. 30. Curran Associates, Inc. N. M. De Vries, K. Smilowska, J. Hummelink, B. Abramiuc, M. M. Van Gilst, B. R.Bloem, P. H.N. De With, and S. Overeem. 2019. Exploring the Parkinson patientsperspective on home-based video recording for movement analysis: A qualitativestudy. BMC Neurology 19 (4 2019). Issue 1. Max Wuehr, A Huppert, F Schenkel, J Decker, K Jahn, and Roman Schniepp.2020. Independent domains of daily mobility in patients with neurological gaitdisorders. Journal of neurology 267, 1 (2020), 292300.",
  "Hang Yan, Bocao Deng, Xiaonan Li, and Xipeng Qiu. 2019. TENER: AdaptingTransformer Encoder for Named Entity Recognition. CoRR abs/1911.04474 (2019). arXiv:1911.04474": "Jaemin Yoo, Yejun Soun, Yong-chan Park, and U Kang. 2021. Accurate Multi-variate Stock Movement Prediction via Data-Axis Transformer with Multi-LevelContexts (KDD 21). Association for Computing Machinery, New York, NY, USA,20372045. Cris Zampieri, Arash Salarian, Patricia Carlson-Kuhta, Kamiar Aminian, John GNutt, and Fay B Horak. 2010. The instrumented timed up and go test: potentialoutcome measure for disease modifying therapies in Parkinsons disease. Journalof Neurology, Neurosurgery & Psychiatry 81, 2 (2010), 171176. Michael Zhang, James Lucas, Jimmy Ba, and Geoffrey E Hinton. 2019. Looka-head Optimizer: k steps forward, 1 step back. In Advances in Neural InformationProcessing Systems, H. Wallach, H. Larochelle, A. Beygelzimer, F. d'Alch-Buc,E. Fox, and R. Garnett (Eds.), Vol. 32. Curran Associates, Inc.",
  "ASTATISTICAL SIGNIFICANCE TEST": "It could be argued that all the localisation models compared in Ta-ble 1 might not be statistically different due to fairly high standarddeviation across all types of cross-validations which is caused by rel-atively small number of participants. In order to compare multiplemodels over cross-validation sets and show statistical significanceof our proposed model, we perform the Friedman test to first rejectthe null hypothesis . We then performed a pairwise statisticalcomparison: the Wilcoxon signed-rank test with Holms alpha cor-rection ( = 5%). Finally, we used a critical difference diagram to visualize the results of these statistical tests projected onto theaverage rank axis, with a thick horizontal line showing a clique oflocalisation mdoels that are not significantly different (see and 4)."
}