{
  "ABSTRACT": "Despite a surge in interest in GNN development, homogeneity inbenchmarking datasets still presents a fundamental issue to GNNresearch. GraphWorld is a recent solution which uses the StochasticBlock Model (SBM) to generate diverse populations of syntheticgraphs for benchmarking any GNN task. Despite its success, theSBM imposed fundamental limitations on the kinds of graph struc-ture GraphWorld could create.In this work we examine how two additional synthetic graphgenerators can improve GraphWorlds evaluation; LFR, a well-established model in the graph clustering literature and CABAM, arecent adaptation of the Barabasi-Albert model tailored for GNNbenchmarking. By integrating these generators, we significantlyexpand the coverage of graph space within the GraphWorld frame-work while preserving key graph properties observed in real-worldnetworks. To demonstrate their effectiveness, we generate 300,000graphs to benchmark 11 GNN models on a node classification task.We find GNN performance variations in response to homophily,degree distribution and feature signal. Based on these findings, weclassify models by their sensitivity to the new generators underthese properties. Additionally, we release the extensions made toGraphWorld on the GitHub repository, offering further evaluationof GNN performance on new graphs.",
  "INTRODUCTION": "Interest in Graph Neural Networks (GNNs) has surged over the lastdecade, with thousands of new GNN variants being introduced .Despite this, a disproportionately small number of datasets fromlimited domains are used to benchmark and evaluate newmodels. The lack of diversity in benchmarking datasets presents amajor issue in evaluating the empirical performance of GNNs.One approach to the problem of dataset variety is through the useof synthetic graph generators. These generators can create diverseyet controllable graph datasets that cover extensive regions of thespace of all possible graphs. By using synthetic graphs, the problem Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than ACMmust be honored. Abstracting with credit is permitted. To copy otherwise, or republish,to post on servers or to redistribute to lists, requires prior specific permission and/or afee. Request permissions from ADS 23, August 0615,2023, Long Beach, NY 2023 Association for Computing Machinery.ACM ISBN 978-x-xxxx-xxxx-x/YY/MM...$15.00 of overfitting can be reduced, as each new dataset collection canbe designed to be as diverse as possible. Furthermore, the fieldof Network Science offers a vast array of synthetic graph models that can approximate important properties observed in real-world networks and serve as realistic benchmarks. This approachis employed by GraphWorld , a novel methodology and systemthat relies on graph generation models to simulate statisticallydiverse graphs of arbitrary sizes for benchmarking purposes.Currently, GraphWorld relies exclusively on the SBM to generatesynthetic graphs. Despite its usefulness, evaluating GNN perfor-mance using results from a single graph generation model posesa limitation that goes against the challenges GraphWorld aims toaddress.In this work, we address this limitation by integrating two ad-ditional graph generation models into the system. We bring anestablished benchmark model with strong clustering properties:LFR, and a class-assortative adaptation of the Barabasi-Albert model:CABAM. By incorporating LFR and CABAM, we aim to (i) approx-imate properties observed in real-world networks that the SBMcannot replicate, and (ii) empirically expand the regions of graphspace that GNNs can be benchmarked on.Additionally, we conduct node classification experiments using11 GNN models. We reveal variations in GNN performance in re-sponse to homophily, degree distribution and feature signal acrossgraph generators. Through these results, we provide a classifica-tion of GNN models with respect to their sensitivity to the newlyintroduced graph generators. Furthermore, we make the extensionsto GraphWorld publicly available in aid of further analysis on GNNperformance.We summarise our contributions as follows: Extending benchmark datasets. We integrate two addi-tional graph generators with GraphWorld that (i) exhibitdesirable properties observed in real-world networks and (ii)cover new regions of graph space for GNN benchmarking. Performance classifications. We run benchmarking exper-iments with 11 GNN models and find performance variationsin response to homophily, degree distribution and featuresignal. We classify models by their sensitivity to the newgenerators under these properties.",
  "GRAPH GENERATION MODELS": "For additional graph generation models, we look to the field ofNetwork Science; where a large number of models have been in-troduced in the aim of producing synthetic graphs that exhibitproperties observed in real world networks. The properties in focusbeing: degree distribution, community structure and homophily.In this section, we detail the relative strengths of each model withrespect to these properties.",
  "Stochastic Block Model": "The SBM serves as the original graph model used in GraphWorld,designed to generate graphs that exhibit communities: densely con-nected and well-separated subsets of nodes. This is accomplishedby introducing a parameterized community distribution and a ma-trix of edge probabilities. The graph generation process begins bypartitioning the node set based on the community distribution.Then, edges are assigned randomly to nodes within and betweencommunities, following the edge probability matrix.The popularity of the SBM in benchmarking community detec-tion algorithms has resulted in the development of several variantsaimed at more accurately modelling real-world networks. One suchvariant, used in GraphWorld, is the Degree Corrected StochasticBlock Model (DC-SBM) . The DC-SBM incorporates hetero-geneity in vertex degrees, making it possible to replicate arbitrarydegree sequences within the model. In GraphWorld, we leveragethis capability by generating artificial degree sequences that followarbitrary power law exponents. This allows us to generate SBMgraphs with user-defined ranges of degree distributions.However, the SBM relies on fixed values defined in its edge prob-ability matrix, making it unable to precisely replicate a given degreesequence and generate graphs that adhere to a true power law. Thislimitation motivates the choice of LFR and CABAM as complimen-tary models. Both LFR and CABAM utilize generative processes tocreate graphs with natural power law degree distributions.",
  "CABAM": "CABAM generates Class-Assortative graphs via the Barabasi-Albert(BA) Model. The BA model represents a significant improvementover traditional graph models by approximating real-world graphproperties through two key concepts of (i) growth and (ii) pref-erential attachment . These account for the observations that(i) real-world networks emerge through the continual addition ofnodes and (ii) newly added nodes exhibit a preference for connect-ing to highly connected nodes.Following this generative process, the BA model generates scale-free networks, which are characterized by degree distributions thatconform to a true power law. This forms a fundamental propertyobserved in numerous real-world networks . CABAM extendsthe BA model by introducing parameterized community generation,whilst preserving the original scale-free property. In GraphWorld,these parameters are used to precisely control the community dis-tribution of a CABAM graph.Moreover, CABAM offers the flexibility to determine edge ho-mophily in various ways: it can be constant, dependent on node de-gree, or follow any arbitrary function. In GraphWorld, we preservethis feature and employ similar methods as described for the SBM : NetworkX plots of 512-node graphs from SBM andthe two new node classification dataset generators CABAMand LFR. We align input parameters to the models, showingsimilarities in some high-level properties such as numberof communities, whereas there are differences in low-levelproperties such as degree distribution and triangle count. to create arbitrarily-diverse graph structures under these properties.Indeed, parameterizing these properties fulfills the requirements ofsynthetic graph benchmarking for GNNs. It is widely observed thatcommunity distribution and homophily exhibit significant varia-tions across real-world networks , and these variations can leadto substantial performance differences among GNNs .The strength of CABAM lies in its ability to generate BA-stylegraphs with tune-able homophily and community structure. How-ever, the degree distributions of CABAM graphs are predeterminedby the described generative process, resulting in a fixed power lawdistribution with an exponent of 3. Considering this limitation,we seek an additional model that can generate scale-free graphs pa-rameterized in both community structure and degree distribution.",
  "LFR": "LFR refers to the LancichinettiFortunatoRadicchi (LFR) bench-mark . The LFR benchmark extends synthetic benchmarkinggraphs by introducing heterogeneity in both: node degree, similarto the DC-SBM, and community size. In particular, it allows for thecreation of graphs whose degree and community size distributionsfollow power laws with distinct, arbitrary exponents. With theinclusion of a mixing parameter that determines edge homophily,LFR provides a complimentary resource to study the effects of ho-mophily, degree distribution and community structure on GNNperformance.The inclusion of heterogeneity in both node degree and com-munity size addresses the need to better approximate real-worldnetworks, where communities and degrees can exhibit arbitrary,non-uniform sizes. Since these properties are also known to influ-ence GNN performance , GraphWorld exposes community anddegree distribution parameters to the user, allowing for the gen-eration of LFR benchmark datasets following arbitrary, randomlysampled power law distributions. To further capture the uniquecommunity structure, we introduce a feature that allows SBM and",
  "Examining the Effects of Degree Distribution and Homophily in Graph Learning ModelsKDD ADS 23, August 0615,2023, Long Beach, NY": "CABAM graphs to replicate the community structure of a givenLFR graph on the same node count.In addition to its graph properties, LFRs well-established popu-larity as a benchmark for community detection algorithms providesfurther motivation. By introducing LFR to the benchmarking ofmodern graph learning algorithms like GNNs, where this bench-mark is unseen, we provide a novel addition to the array of syntheticgraph datasets for GNN benchmarking.",
  "Experimental Design": "Using GraphWorld, we generate 100,000 graph samples from eachgenerator described in the previous section (SBM, CABAM andLFR). Whilst we discussed a subset of the parameters for eachgenerator earlier, in Appendix A, we provide a full description ofall the parameters for each generator along with their respectiveinput values. These tables provide enough information for the sameGraphWorld experiments to be readily reproduced.In order to study the global effects of graph properties such ashomophily and degree distribution on GNN performance, we matchthe inputs of parameters that perform similar functions across gen-erators. This is possible due to the selection of graph models thatshare similar controls over such properties. For example, followingthe discussion on the parameterization of degree distribution onSBM and LFR graphs, we ensure that graph samples across all gener-ators receive random values from similar ranges in their respectivedegree sequence generation parameters. By matching similar pa-rameters across generators, we ensure a fair global comparison ofGNN performance across different graph generators.Furthermore, by varying parameter values across wide ranges,we can conduct local analyses to examine the specific effects ofindividual parameters within each generator on GNN performance.GraphWorld computes metrics of each sampled graph to then quan-tify the effects of such parameters in a unified manner to answerresearch questions 1 and 2. For example, whilst the control of ho-mophily through input parameters may vary across generators,we use the edge homogeneity statistic provided in GraphWorldsoutput to measure the homophily of each graph after the graphgeneration process.Following the experimental framework outlined in the Graph-World paper , we use the generated graph samples to bench-mark 11 GNN models: ARMA , APPNP , FiLM , GAT, GATv2 , GCN , GIN , GraphSAGE , SGC ,SuperGAT , Transformer and 2 baselines: Multi-LayerPerceptron, Personalized PageRank , on a node classificationtask. : Kernel Density Estimates of SBM, CABAM and LFRgraphs on various metrics. Our results show that CABAM andLFR graphs exist in non-overlapping regions of graph spacewhen compared to the SBM on metrics measuring degreesequence and homophily.",
  "Homophily: Edge homogeneity Community Structure: Average clustering coefficient (avg_cc),simpsons community size and the number of triangles": "Insights. Our results in show that CABAM and LFRindeed cover new regions of graph space beyond the SBM. Specifi-cally, CABAM and LFR graphs exhibit degree distributions vastlydifferent from the SBM. For CABAM this is characterized by thelarge non-overlapping spikes in its power law estimate distribu-tions, whilst for LFR we see a much wider range of power lawscompared to either generator.Additionally, the edge homogeneity distributions show thatCABAM and LFR graphs exhibit a wider range of homophily overSBM graphs, particularly in the lower homophily regions. In sum-mary, our results show that CABAM and LFR widen the scope ofgraphs we can generate by introducing unique degree distributionsand wider ranges of homophily.",
  "GNN Benchmarking Results": "To answer research questions 2 and 3, we look at the performanceof GNNs on each of the 300,000 graph samples from the Graph-World benchmarking experiments. We measure the performanceof a given model with the ROC-AUC-One-Vs-Rest score and plotthis against the edge homogeneity, power law estimate and featurecenter distance (feature signal) of each graph. Thus for each GNNmodel we have 3 curves, representing the performance on SBM,CABAM and LFR graphs.In , we take the performance curves of each GNN modeland group them into 2 columns, one for each group of GNN modelsexhibiting similar performance. We have each row correspondingto a graph metric and each column corresponding to a group ofGNN models. Insights. In , our results demonstrate the ability to clas-sify GNN models based on their sensitivity to the generators usedfor benchmarking. We observe that certain groups of GNN modelsexhibit variations in their performance across SBM, CABAM, andLFR graphs, indicating their sensitivity to the specific propertiesintroduced by these generators. These models fall into the para-metric generator-sensitive group, reflecting the larger variation intheir performance across different graph models. This variation arises due to the inclusion of LFR and CABAM graphs, which coverpreviously unexplored regions of the graph space.However, our analysis also reveals the existence of a parametricgenerator-insensitive group of GNN models. These models demon-strate minimal variation in their performance across the SBM,CABAM, and LFR graphs, suggesting that they are robust to thespecific characteristics introduced by these generators. Despite theintroduction of new graph models, these GNN models exhibit con-sistent and stable performance, highlighting their insensitivity tothe variations in graph structure generated by the different models.The observed behavior can be attributed to the characteristics ofthe GNN models within the parametric generator-insensitive group.These models tend to be less sensitive to the local graph structureand instead focus on more global information. For example, modelssuch as APPNP, GraphSAGE, and Transformer employ smoothingtechniques, which allow them to mitigate the influence of specificgraph structures and instead capture more general patterns in thedata.Furthermore, the parametric generator-insensitive models ex-hibit a higher degree of reliance on node features. This is evidentfrom the edge homogeneity plots, which indicate that these modelsachieve significantly better performance than the sensitive groupon graphs with lower levels of homophily. This suggests that thesemodels are more adept at leveraging the available node features tomake accurate predictions. However, it is worth noting that thesemodels also experience a larger drop in performance on graphs withlow feature signal, indicating that the quality and informativenessof the features play a crucial role in their performance.In summary, our findings highlight the presence of new differen-tials between groups of GNN models when exploring the additionalregions of graph space covered by LFR and CABAM.",
  "CONCLUSION": "In this work, we examined how two additional synthetic graph gen-erators, LFR and CABAM, could improve the evaluation of GNNperformance in GraphWorld. We established the unique proper-ties of each generator and generated 300,000 graph samples whichshowed that the newly introduced models cover new regions ofgraph space beyond the SBM. We used these samples to benchmark11 GNN models and found variations in the sensitivity of GNNmodels in response to the new graph generators. We classified mod-els as being either parametric generator-sensitive or parametricgenerator-insensitive. The parametric generator-insensitive mod-els, characterized by their focus on global information and relianceon node features, exhibit distinct performance patterns comparedto the sensitive group. Understanding these differences providesvaluable insights into the behavior and strengths of different GNNmodels across a range of graph structures. Our work addressesthe critical issue of dataset homogeneity in GNN research and of-fers an advancement in generating diverse and realistic syntheticbenchmarks. By making the extensions to GraphWorld publiclyavailable and providing the parameter sets used to conduct these ex-periments, we open doors for further investigation into the factorsaffecting GNN performance.",
  "Parameter NameDescriptionValues": "nvertexNumber of verticesavg. degreeAverage node degreemax degree proportionMinimum degree, as a proportion of the node countmixing paramRatio of total number of inter to intra community edges[0.0,1.0]min community size proportionMinimum size of community, as a proportion of the node count[0.05, 0.0825]max community size proportionMaximum size of community, as a proportion of the node count[0.25,0.33]community exponentValue of the power law exponent used to generate community sizes[1.0,2.0]exponentValue of the power law exponent used to generate node degrees[2.0,3.0]num triesNumber of attempts at simulating an LFR graph until successfeature center distanceVariance of feature cluster centers, generated from a multivariate Normal[0.0,2.0]feature dimDimension of feature vector assigned to every node"
}