{
  "ABSTRACT": "Bipolar disorder (BD) is closely associated with an increased riskof suicide. However, while the prior work has revealed valuableinsight into understanding the behavior of BD patients on socialmedia, little attention has been paid to developing a model thatcan predict the future suicidality of a BD patient. Therefore, thisstudy proposes a multi-task learning model for predicting the futuresuicidality of BD patients by jointly learning current symptoms.We build a novel BD dataset clinically validated by psychiatrists,including 14 years of posts on bipolar-related subreddits written by818 BD patients, along with the annotations of future suicidalityand BD symptoms. We also suggest a temporal symptom-awareattention mechanism to determine which symptoms are the mostinfluential for predicting future suicidality over time through asequence of BD posts. Our experiments demonstrate that the pro-posed model outperforms the state-of-the-art models in both BDsymptom identification and future suicidality prediction tasks. Inaddition, the proposed temporal symptom-aware attention providesinterpretable attention weights, helping clinicians to apprehend BDpatients more comprehensively and to provide timely interventionby tracking mental state progression.",
  "Corresponding author": "Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than theauthor(s) must be honored. Abstracting with credit is permitted. To copy otherwise, orrepublish, to post on servers or to redistribute to lists, requires prior specific permissionand/or a fee. Request permissions from 23, August 610, 2023, Long Beach, CA, USA 2023 Copyright held by the owner/author(s). Publication rights licensed to ACM.ACM ISBN 979-8-4007-0103-0/23/08...$15.00",
  "Temporal sequence learning, Suicide, Bipolar disorder, Multi-tasklearning, Mental health": "ACM Reference Format:Daeun Lee, Sejung Son, Hyolim Jeon, Seungbae Kim, and Jinyoung Han.2023. Towards Suicide Prevention from Bipolar Disorder with TemporalSymptom-Aware Multitask Learning. In Proceedings of the 29th ACM SIGKDDConference on Knowledge Discovery and Data Mining (KDD 23), August610, 2023, Long Beach, CA, USA. ACM, Long Beach, CA, USA, 13 pages.",
  "INTRODUCTION": "Suicide is a severe health concern worldwide. According to theOECD, 14.1 per 100,000 people die yearly from suicide in the UnitedStates1. Unfortunately, most suicides have been committed by in-dividuals with mental illness . Particularly, people living withbipolar disorder (BD) are more vulnerable to suicide than peoplewith other psychiatric disorders . It has been reported thatthe suicide rate for BD patients is up to 30 times higher than that ofthe general population , and suicide fatalities occur in 10-20%of adults who suffer from BD .With increasing importance in understanding and analyzing BDpatients , recently, there has been an effort to analyze distinctbehavioral characteristics of BD patients and assess their mentalstates using social media data where they share theirdaily lives and emotions . However, while the prior workhas revealed valuable insights into understanding the behavior ofBD patients revealed on social media, little attention had been paidto developing a model that can predict the future suicidality of a BDpatient. Although a few studies have proposed methods to identifythe current risk of suicide in a given social media post ,suicidal ideation can often quickly lead to an actual attempt, therebymaking them ineffective in preventing suicide ; hence,exploring the BDs risk factors that can lead to suicide ideation forpredicting future suicidality is crucial. Therefore, this paper aimsto predict the future suicidality of BD patients based on their mood",
  ": An example of a Reddit user who wrote posts abouthis/her mental illness on a bipolar disorder-related subredditand then revealed suicidality 6 months later": "symptoms history revealed in their past social media data, whichhas not been thoroughly investigated.To this end, we first create a novel BD dataset clinically validatedby psychiatrists, including future suicidality and bipolar symptoms.Here, we focus on which bipolar symptoms users have, rather thanwhat diagnosed bipolar types they have, because a transdiagnosticapproach helps improve understanding of comorbidity, enablingproper interventions than a diagnostic approach . BD is a mooddisorder characterized by manic and depressive episodes wheretwo phases show a recurrent pattern that appears and increasesover a while, but the following important attribute is not easilyconsidered; many psychological processes are shared in variousdiagnoses , e.g., anxiety can appear in both depression andmanic episodes of BD . illustrates example posts writtenby an individual with BD gradually leading to suicide. Therefore,timely tracking of mood symptoms that affect future suicidalityis inevitable for early intervention, leading to shorter treatmentperiods and better prognosis in BD patients. However, with therapid mood swings in BD and limited self-reports from patients,there is a significant gap in understanding the actual path of moodchanges between the real world and the conventional clinical settingwhere clinicians can only see patients under limited conditions andrely on the subjective words of the patients . Hence, usingreal-world data derived from patient reports at the nonclinicalscene, such as social media, is helpful to understand better BDsymptoms .Particularly, we collect social media posts from BD communitieson Reddit. We then labeled our dataset, which contains 7,592 postspublished by 818 users, following the guidelines outlined in theColumbia Suicide Severity Rating Scale (C-SSRS) and BipolarInventory of Symptoms Scale (BISS) for annotating suicidalityand bipolar-related symptoms, respectively. Given the significanceof clinical understanding, two psychiatrists validate the annotateddataset with a pairwise annotator agreement of 0.77 and a group-wise agreement of 0.88. Unlike the existing datasets , the proposed dataset both includes (i) future suicidality of BDpatients and (ii) a users mood history that can be important featuresfor diagnosing mood episodes and future suicidality .Based on the developed BD dataset, we propose a novel multi-task learning framework to jointly learn (i) the future suicidalityof a given BD user and (ii) their BD symptoms over time. Sincea BD symptom can contribute to future suicidality differently de-pending on when it occurs, we suggest a temporal symptom-aware attention method to determine which symptoms are the most in-fluential for predicting future suicidality over time. In particular,the proposed multi-task learning model has three components: (i)the contextualized post-encoder, (ii) a temporal symptom-awareattention layer, and (iii) a task-dependent multi-task decoder. Af-ter the model generates post representations using the pre-trainedSentence-BERT (SBERT) in the contextualized post encoder,the bi-LSTM layer encodes a sequential context of post representa-tions considering variable time intervals between posts. The tem-poral symptom-aware attention layer then calculates the attentionweights of posts to give more weight to critical symptoms affect-ing the risk classification decision. Finally, the multi-task decoderestimates the probability of future suicidality levels and BD symp-toms. For effective multi-task learning, we sum up the losses foreach task using the uncertainty weight loss method , evaluatingthe task-dependent uncertainty of each task. The proposed modelcan capture the progressive patterns of BD symptoms and outper-form the state-of-the-art methods for predicting future suicidalityby leveraging the benefits of multi-task learning. Furthermore, in-vestigating the attention weights based on BD symptoms helps tointerpret how they affect the users future suicidality over time. Theprovided interpretability from our model can support clinicians inimproving their understanding of connections between psychiatricconditions and allowing proper interventions for at-risk people.We summarize the contributions of this work as follows. We release our codes and a novel BD dataset2, which containsboth the future suicidality and BD symptoms labels, validated bytwo psychiatrists. The dataset can benefit researchers aiming todevelop methods for suicide prevention. To the best of our knowledge, this is the first study that proposesa multi-task learning model for predicting the future suicidalityof BD patients on social media by leveraging the knowledge ofbipolar symptoms (i.e., manic mood, somatic complaints). Themodel can accurately capture bipolar symptom transition pat-terns and outperform the state-of-the-art methods for detectingfuture suicidality. The proposed temporal symptom-aware attention method pro-vides interpretability, which can help clinicians understand BDpatients more comprehensively, thereby providing timely inter-ventions by tracking mental state progression.",
  "RELATED WORK": "Social Media to Understand Bipolar Disorder. With the prolif-eration of social media, many studies have attempted to addressthe severe social problems of BD using user activity data on socialmedia . For example, najder showed differencesin language use between users with and without BD on Reddit,and this characteristic has been utilized to discover the risk ofBD . Several studies have analyzed (i) the living experi-ence of BD patients and (ii) an understanding of howpeople perceive their mental states and share their experiences using social media data through qualitative studies. However, whilethe prior work on BD analysis has revealed valuable insight into thecharacteristics of individuals with BD, little attention has been paidto predicting the future suicidality of BD patients. Because suicidal",
  "Towards Suicide Prevention from Bipolar Disorder with Temporal Symptom-Aware Multitask LearningKDD 23, August 610, 2023, Long Beach, CA, USA": "ideation can often be developed into an actual attempt ,such a model that predicts future suicidality of BD patients can beused for BD patients who usually have suicidal ideation .Future Suicidality Assessment Using Social Media Data. Whilemost of the work has focused on identifying the current suicidal-ity revealed in a given post from social media ,a few studies have investigated monitoring a transition of userswho have not yet shown suicidality but would potentially revealit in the future. Lekkas et al. strived to predict whether ado-lescents will show suicidal intentions within a month of usingInstagram with an ensemble model. Similarly, De Choudhury et al. attempted to discover the current suicidality of individualswho posted on mental-health-related communities on Reddit byidentifying whether a user would write on SuicideWatch, a suicide-related subreddit. They found that users who show suicidality tendto reveal changes in linguistic structures, interpersonal awareness,and social interactions. Unlike the previous work, we predict futuresuicidality of BD patients by considering the past temporal tran-sition behavior since BD patients suffer from such mood changesymptoms. To the best of our knowledge, this is the first work thatproposes a future suicidality prediction model by jointly learningtwo tasks, predicting (i) future suicidality and (ii) BD symptoms.",
  "Data Collection and Preprocessing": "Collecting Data. We collected posts published between January1st, 2008, and September 30th, 2021, from the three representativebipolar-related subreddits, including r/bipolar (BPL), r/BipolarReddit(BPR), and r/BipolarSOs by using the open-source Reddit API3.To identify individuals who exhibit suicide ideation, we also col-lected all the posts during the same data collection period fromr/SuicideWatch, where people share their suicidal thoughts withothers. Among the collected posts, we used the posts written byusers who have been professionally diagnosed with BD inthis study. For example, users who reported BD diagnosis, e.g., auser who wrote, I was diagnosed with Bipolar type-I last year.,were included in our study. Thus, posts regarding BD symptomsof other individuals, including family members or friends but notthemselves, were excluded. Finally, our dataset contains 7,592 postspublished by 818 users, i.e., BD patients.Preprocessing Data. We first anonymized the collected posts byremoving information that could be used as personal identifiers. Wethen converted the texts to lowercase, removed special characters,striping whitespaces, and stopwords, and lemmatized them.",
  "Annotation Process": "To label the collected Reddit dataset, we recruited four researchers,knowledgeable in psychology and fluent in English, as annotators.With the supervision of a psychiatrist, the four trained annotatorslabeled 818 users and their 7,592 anonymized Reddit posts using theopen-source text annotation tool Doccano . During annotations,we mainly consider two different label categories: (i) BD symp-toms (e.g., manic, anxiety) and (ii) suicidality levels (e.g., ideation,attempt). We further annotate the diagnosed BD type (e.g., BD-I,",
  "Attempt106 (1.3%)": "BD-II) for data analysis. If there is any conflict in the annotatedlabels across the annotators, all the annotators discuss and reachan agreement under the supervision of the psychiatrists. The infor-mation about the final annotated labels in our data is summarizedin . We now briefly describe the definition of each category;more details about each category and the corresponding examplesare described in Appendix A.2.A. Diagnosed Bipolar Disorder Types: We label users intoone of the three BD diagnosis types based on the self-report intheir posts. The BD diagnosis types include Bipolar Disorder-I (BD-I), Bipolar Disorder-II (BD-II), and Not Otherwise Specified BipolarDisorder (NOS) based on the Diagnostic and Statistical Manual ofMental Disorders (DSM-5) and the International Statistical Clas-sification of Diseases and Related Health Problems (ICD-10) .B. Bipolar Disorder Symptoms: We employed the BipolarInventory of Symptoms scale (BISS) to cover mood polarity(i.e., manic, depressed) and the spectrum of BD symptomatology(i.e., psychosis, somatic complaints). Accordingly, we first annotatemood symptoms consisting of Depressed, Manic, Anxiety, Remission,Irritability, and Other. Note that Other covers moods that do notfall into the other five mood symptoms. If we find any BD somaticsymptoms, we annotate an additional somatic symptom label thatincludes Somatic complaint, Psychosis, and Both.C. Levels of Suicidality: We also annotate the posts to cat-egorize them into different suicidality levels. We utilize the ex-isting criteria from that provide common five levels ofsuicidality, including No risk (NR), Suicide Indicator (IN), SuicidalIdeation (ID), Suicidal Behavior (BR), and Actual Attempt (AT), basedon the Columbia Suicide Severity Rating Scale (C-SSRS) . Wemerge No Risk with Suicide Indicator since people with bipolar disor-der are already considered more at risk than the general populationin suicide .",
  "# of posts7,59215,755-21,407,595-": "summarizes the Krippendorffs alpha-reliability andCohens Inter-Annotator Agreement among the experts andannotators. The results suggest that our annotations in the datasetare reliable as the overall Krippendorff scores show high agreement,for example, 0.88 for suicidality and 0.76 for mood symptoms, whichis similar or even higher than previous studies (e.g., =0.69 ).The maximum and minimum pairwise Cohens scores present afair agreement of 0.89 and 0.66, respectively. 3.3.2Comparison with Existing Datasets. We compare our BDdataset with four widely-used datasets from priorstudies on suicide and mental health in . First, we find thatonly two datasets have been released publicly, while the otherdatasets have not been disclosed. More importantly, no existingdataset has both suicidality and BD symptom labels. The existingsuicide datasets do not include BD-specific and future sui-cide information. The prior BD datasets have no suicidalitylabels, and their BD diagnosis labels were generated computation-ally without expert validation. The proposed BD dataset, on theother hand, includes future suicidality and BD symptom labels,which are validated by clinical experts.",
  "Timeline (Post Sequence) Construction": "BD patients tend to have more severe symptom changes over timethan other mental disorders; thus, suicidality constantly changes.Since users posts on different timelines show disparate BD symp-toms and suicidality levels, it is crucial to predict future suicidalityin each timeline and understand how long past posts should belearned to predict future suicidality. Therefore, we construct mul-tiple timelines (i.e., post sequences) for each user, as shown in. We set a timeline by selecting the past months for BD",
  ": Post sequences (timelines) construction by consid-ering temporal sliding windows": "symptom observation and the future months for suicidality iden-tification. We then slide this timeline window within a given usersposts to obtain multiple post sequences from each user. We assignthe future suicidality label as the highest level of the suicidality thatappeared in posts over the next months and exclude sequenceswith less than three posts in the training period (i.e., past posts). Byexperimenting with different sets of and , we set (,) = (6, 1),i.e., using the past 6 months for training and the future 1 monthfor suicidality label extraction, as it shows the best performance.We present the performances of our model with different post-sequence durations in .3. Therefore, we obtain 5,961 postsequences . The distribution of suicidality labels for the sequencesis 5,056 (IN), 591 (ID), 215 (BR), and 99 (AT).",
  "Data Analysis": "In this section, we analyze our BD dataset to understand distinctBD symptom patterns for BD patients who potentially have highsuicidality in the future. We then assess the survival probabilityusing the Kaplan-Meier estimation for each BD type (i.e., BD-I,BD-II, and NOS). 3.5.1BD Symptoms Affecting Future Suicidality. To verify the fac-tors associated with the risk of suicide in the future, we classify thedataset into two groups: i) low-risk group (i.e., IN) and ii) severe-riskgroup (i.e., ID, BR, AT). We then compare the two groups in termsof the LIWC (Linguistic Inquiry and Word Count) results ofthe users posts and the annotation results using the t-test.As shown in , the target group shows a significantlyhigher level of past suicidality than the control group. This revealsthat a history of suicidality is a significant suicide risk factor in BDpatients . Furthermore, we observe that the severe-riskgroup shows more elevated depressed mood, irritability, and psy-chosis than the low-risk group but is less manic. This observationaligns with the clinical studies that identified dominant depressionmood , irritability , and psychotic features as major suicide risk factors in BD patients, but the mania statusis not significantly related . We also find similar results in theLIWC categories, which reveal higher values in negemo, sad, andanger for the severe-risk group. Unlike previous studies ,the ratios of anxiety for the two groups are not statistically differ-ent. This implies that social media posts make it difficult to detectclinical anxiety accompanied by physical symptoms like agitation,raised blood pressure, or sweating .Furthermore, we compare the social characteristics of the twogroups. We discover that the target group uses more family-related",
  "Psychosis2.44*achieve-2.59*": "words. It could link to negative experiences with family, whichoften affect their lives, such as a lack of family support, divorce,or unmarried . We also find that most people who men-tioned work-related words belong to the control group, indicatingthey might be paid employees or students. According to the pre-vious study , unemployment is also associated with highersuicide rates. Overall, the analysis results demonstrate that the di-verse symptom-related factors affecting users future suicidalitiesrevealed in social media data show a similar pattern with a clinicaltrial, which helps understand the living experience of BD patientswhen clinicians make decisions. More details are included in in Appendix. 3.5.2Survival Analysis. We next assess the survival probabilityfor each BD subtype (i.e., BD-I, BD-II, and NOS) using the Kaplan-Meier estimation . Following the estimation method , weobserve 180 days after a certain time to verify whether a user is stillalive in our dataset. Note that we assume a user has not survived ifthe user has never posted within the observation period. shows that BD-II patients have the lowest survival rate, followedby BD-I. This interpretation aligns with the prior clinical studiesthat present BD-II as having higher suicidality than BD-I, and therapid cycling of BD-II is hazardous .",
  "Ethical Concerns": "We carefully consider potential ethical issues in this work: (i) pro-tecting users privacies on Reddit and (ii) avoiding potentially harm-ful uses of the proposed dataset. The Reddit privacy policy explicitlyauthorizes third parties to copy user content through the Reddit API.We follow the widely-accepted social media research ethics policiesthat allow researchers to utilize user data without explicit consent",
  ": The overall architecture of the proposed multi-tasklearning model": "if anonymity is protected . Any metadata that could be usedto specify the author was not collected. In addition, all content ismanually scanned to remove personally identifiable informationand mask all the named entities. More importantly, the BD datasetwill be shared only with other researchers who have agreed to theethical use of the dataset. This study was reviewed and approvedby the Institutional Review Board ((SKKU2022-11-038)).",
  "FUTURE SUICIDALITY PREDICTIONMODEL FOR BIPOLAR DISORDER PATIENTS4.1Problem Statement": "The proposed multi-task learning model aims to (i) predict the fu-ture suicidality {, , , } of through a sequence ofBD posts in the timeline and (ii) classify BD symptoms_ {No mood, Depressed, Manic, Irritability, Anxiety, and Remission orSomatic complaint and Psychosis } that appeared in a post . Wesuppose each post shows one BD mood symptom and, at most, twoBD somatic-related symptoms. To be more specific, assume thatthere is a post sequence = {1,2, ...,}, it can be defined as",
  "represents": "a set of posts ordered by the posting time where denotes the num-ber of posts of and indicates the posting time of the post.Also, _ is a set of BD symptom labels of , and is a futuresuicidality label of. Note that the time interval between and1 iswithin months since we take the past months dataset for featureextraction (See 3.4). illustrates the overall architecture ofthe proposed model. The model includes three main components:a Contextualized Encoder, a Temporal Symptom-aware AttentionLayer, and a Task-dependent Multi-task Decoder.",
  "KDD 23, August 610, 2023, Long Beach, CA, USADaeun Lee, Sejung Son, Hyolim Jeon, Seungbae Kim, & Jinyoung Han": "information for assessing future suicidality . To generate thesemantic representation of each post, we employ the pre-trainedSentence-BERT (SBERT) , which showed promising results indetecting moments of change in the mood and representinghistorical tweets . SBERT is a modification of the pre-trainedBERT network that uses siamese and triplet network structures toderive semantically meaningful sentence embeddings by computingthe mean of output vectors for all tokens to derive a fixed-sizesentence embedding. We encode each post as follows:",
  "Temporal Symptom-aware Attention Layer": "4.3.1Sequential context modeling. To encode a sequential contextof each timeline, we leverage the bidirectional LSTM, a popularmethod for capturing long-term dependency on social media . Specifically, post-encoding is fed into a BidirectionalLSTM to derive text representation . This process is repeatedtwice, each of which processes the post sequence from left to right(i.e., forward) and right to left (i.e., backward). Finally, the hiddenstate vectors from each procedure are concatenated as follows:",
  "IR where is the dimension of the hiddenstate vector": "4.3.2Temporal symptom-aware attention mechanism. We then ap-ply the attention mechanism to pay more attention to a criticalmental state affecting the risk classification decision. However, con-ventional attention mechanisms, such as self-attention , do notconsider the BD characteristics that each symptom can contributedifferently depending on when it occurs. Since the time intervalsbetween posts may vary considerably, identifying these patternscan be essential in interpreting the mood status over time .Therefore, we propose temporal symptom-aware attention (TempSA attention) as follows:",
  "= F( (F ()))(8)": "where F, F are fully-connected layers and is an activationfunction.Inspired by Sawhney et al. , we apply the ordinal regressionloss as an objective function. Rather than employing a one-hotvector representation of the actual labels, a soft encoded vectorrepresentation is used to consider the ordering nature betweensuicidality. Assume that = { = 0, = 1, = 2, = 3} =3=0denotes ground truth labels, then soft labels are computedas probability distributions = of as follows:",
  "where is the batch size, and is the number of risk levels": "4.4.2BD symptom classification. In addition to future suicidalityprediction as the main task, we propose to enhance the model byregarding an auxiliary task, bipolar disorder symptom classifica-tion. If the post features are good predictors for BD symptoms, thederived information from post features in the auxiliary task canalso be leveraged into the main task. By taking the representation, derived from the post encoder layer for each post , the modelcalculates the logits of symptom classification as follows:",
  "Experimental Settings": "To solve the imbalanced data issue, the random oversampling tech-nique is used to generate new train samples by randomlysampling each class independently with the replacement of thecurrently available samples. All experiments are performed withthe stratified 5-fold cross-validation, ensuring that the users in thetest set are entirely disjoint and do not overlap with those in thetraining set. We use 10% of the training set as validation duringtraining to tune our models hyper-parameters. For reproducibility,detailed experimental settings are summarized in Appendix B.",
  "RESULTS6.1Model Performance": "summarizes the weighted average precision, recall, andF1-score of the proposed model and the baselines for the futuresuicidality and the bipolar symptom prediction tasks.Future suicidality task: Since our dataset is disproportionateacross the suicide risk levels as shown in , we conductexperiments over the three classification tasks: (i) 2-level, (ii) 3-level,and (iii) 4-level classifications, as shown in . For example,we combine AT and BR categories to the highest risk level forthe 3-level classification; we merge AT, BR, and ID for the 2-level classification. As shown in , we find that the proposed modeloutperforms all the baseline methods regardless of how the suiciderisk level is structured. We observe that STATENet shows thelowest performance among the baseline methods. That is becauseSTATENet fails to utilize sequential data, while other baselinesconsider users posts over time as input sequences. Although otherbaselines perform better than STATENet by exploiting sequentialdata, our model surpasses them by learning the temporal dynamicsof BD symptoms.BD symptom task: The results show that our proposed model im-proves BD symptom prediction performance compared to UoS .While our model directly utilizes contextualized post embeddingsto predict BD symptoms in each post, UoS considers post sequences.This implies that considering the post sequence may interfere withBD symptom prediction of each post since bipolar patients have acharacteristic of rapidly changing mood.Multi-task learning: To evaluate the performance of multi-tasklearning, we train the proposed model separately for each task (i.e.,Single-task learning (STL)). We find that the proposed multi-tasklearning (MTL) improves prediction performances from single-tasklearning (STL) in both BD symptom identification and future suici-dality prediction tasks by achieving 61.24% and 82.30%, respectively.This suggests that jointly learning BD symptom information helpsforecast future risks of suicidality by sharing informative presenta-tions and parameters.",
  "Ablation Study": "Model Component. We perform an ablation study to examine theeffectiveness of each component. Applying the uncertainty weightloss function is a common technique in multi-task learning thatcan address the challenge of tuning loss coefficients for differenttasks with different prediction levels. In our case, the two tasks,suicidality prediction, and BD symptom classification, show dif-ferent granularities, hence we use the uncertainty parameters tobalance their weights during training. This can prevent one taskfrom dominating the objective function and improve the modelsoverall performance. As shown in , there is a significant dropin performance when the uncertainty weight loss is not used. Over-all, shows that the performance is inferior when the self-attention mechanism is applied instead of the proposed temporalsymptom-aware attention mechanism. By adding symptom-specificinformation, we suppose the model can learn that each symptomcontributes differently to future suicidality over time. This indicatesthat not only understanding time intervals but also mood swingsover time is essential to predict the future suicidal risk of BD users.Bipolar Symptom. We conjecture that the effects of mood and so-matic symptom information of BD for predicting future suicidalitywould differ. To validate this, we train the multi-task model with ei-ther mood or somatic symptoms. Note that w/o somatic refers to acase where only information on the six mood symptoms is included,but any information on the somatic symptoms is excluded. On theother hand, w/o mood refers to a case where only information onthe somatic symptoms is included, but any information on the moodsymptoms is excluded. As shown in , the multi-task modeltrained with only mood symptoms (w/o somatic) achieves a higherperformance (81.77% of F1-score) than the model trained with only",
  "- w/o Moods80.2779.35": "somatic symptoms (w/o mood). Although somatic symptoms areprominent suicidality for BD patients , they appear lessfrequent than mood symptoms. Thus, the improved performancein the final model (MTL All) signifies that both symptoms play acomplementary role in solving the main task. 6.3Observational and Predictable PeriodsAs illustrated in .4, we conduct experiments to find howmany months {1, 3, 6, 12} we should observe in predicting thefuture suicidality on the next period {1, 3, 6, 12}. ashows the weighted average F1 score and recall for predictingsuicidality in 1 month by training {1, 3, 6, 12} months. Wefind that the performance increases as more past days are trained,but no improvement beyond 6 months. This implies that the 12months observation period is too long to capture informative recentpatterns to predict future suicidality. However, the longer the futureperiod to be predicted, the worse the performance is trained for 6months, as shown in b. We interpret that this is becausethe mood swings of individuals with BD tend to be radical andimpulsive , limiting the models ability to predict the fardistant future from historical records. Therefore, the performanceof the proposed model is the best when (,) = (6, 1). Accordingto previous studies, BD patients hospitalized by suicide attemptsare likely to commit suicide again between 3 and 6 months after",
  "Interpretability of the Model": "To demonstrate the interpretability of the proposed model by an-alyzing attention weights related to BD symptoms, we examinetwo example sequences, 1 and 3, extracted from the same user A,where their levels of future suicidality are different. In particular,we compare the proposed model with and without the temporalsymptom-aware attention mechanism (i.e., MTL All vs. MTLw/o Temp att) in . As shown in (a), both modelscorrectly predict BD symptoms for each post, but only MTL allcorrectly identifies future suicidality of 1 and 3. This implies thattemporal tracking is useful since bipolar patients have a charac-teristic of rapid mood swings. We further analyze how the modelassigns the temporal symptom-aware attention (in Equation 6)to each post over time in predicting future suicidality. In the 1sequence, MTL All assigns a lower attention score to 11, whereasgiving more attention to 12 14. It indicates that irritability/somaticand depressed/psychosis are crucial for predicting future suicidal-ity . Also, we find a similar tendency for the BD symptomsattention weights in (b); as the risk of suicide increases,the importance of attention weights to anxiety decreases, while theimportance of depressed and irritability increases significantly.",
  "IrritabilityOtherSomaticPsychosis": ": (a) Two example sequences from a single user on how the proposed model assigns attention weights. Such an analysiscan provide interpretability in using the proposed model. (b) Average BD Symptoms temporal attention weights dependingon the Future Suicidality level. Notably, 3 has identical posts with 1 (i.e., 31 34), but the modeldifferently gives attention weights to them. By focusing on a manicsymptom in 34, the model forecasts lower suicidality than 1, whichimplies user As mental status is shown to be improved. Moreover,we find that our model tends to focus on recent posts, giving moreattention to the manic symptoms of 14, which is a new observationcompared to a previous work that claimed that manic episodes lesscontribute to future suicidality ; a future validation is required.We believe the proposed future suicidality prediction model withan interpretable function, as exemplified in can be used forscreening and identifying individuals with mental illness on socialmedia to prioritize early intervention for clinical support.",
  "CONCLUDING REMARKS": "In this study, we proposed a novel end-to-end multi-task learningmodel to jointly learn (i) the future suicidality and (ii) BD symptomsof individuals with BD over time. The proposed model for predictingthe future suicidality using temporal symptom-aware attention can(i) accurately capture BD transition patterns and (ii) outperformthe state-of-the-art methods for detecting future suicidality for BDpatients. We plan to open our codes and dataset, which containsthe future suicidality and BD symptom labels, validated by twopsychiatrists. The proposed model and dataset have great utility inidentifying the potential suicidality of users in the future, hencepreventing individuals from potential suicidality at an early stage.Clinical Applicability. As an interdisciplinary study, our workcontributes to both machine learning and Psychiatry communities.Most BD applications do not provide a suicide warning functionand rely solely on self-assessment. On the other hand, we proposedan interpretable and automatic model for predicting the futuresuicidality of BD patients by introducing a temporal symptom-aware attention mechanism based on sequential context learning.With the advantage of the proposed model that can help identifycomplex mood changes and future suicidality in a real context, itcan be used for monitoring risks of suicidality for those who areunderrepresented in a clinical setting, such as minorities, uninsuredpeople, or patients with a lack of insight. In addition, more conciseand timely tracking of mood symptoms can reduce the diagnosis duration, leading to shorter treatment periods and better prognosisin BD patients. Our dataset can help to establish a prevention systemfor early detection and immediate intervention of BD patients withhigh-risk suicidality for clinical support. This will enable us toreduce mental health-related social costs and promote public health.Limitation. Assessing future suicidality on social media can besubjective , and the analysis of this paper can be interpreted invarious ways by the researchers. The experiment data may be sen-sitive to demographic, annotators, and media-specific biases .Although we carefully selected the users who have been clinically di-agnosed as BD based on their Reddit posts , possibly noisy datacan be included if the users misunderstood their diagnoses or didnot tell the truth. Moreover, there might be linguistic discrepanciesbetween Reddit and other social media users (e.g., Twitter users)who self-reported BD diagnosis. Lastly, using digital-trace datafrom social media for predicting mental health can cause low per-formance depending on the condition of a clinical setting .Future Work. Unfortunately, BD is often misdiagnosed as a de-pressive disorder since the depressive phase occupies most of themood episodes . It has been reported that 9 years were taken onaverage to clinically diagnose BD , which can potentially delaytreatment opportunities and increase the risk of suicide . Fur-ther research could focus more on comparing similar symptoms indifferent diagnoses to make precise detection (e.g., depressed moodin major depression). We also aim to apply the proposed model todata collected in the clinical field, such as EMR data, to validatethe proposed models effectiveness to determine the potential forpractical applications. We would like thank Dr. Ji Hyun An (M.D., Ph.D.) and Myung HyunKim (M.D.) for their thoughtful advice on experimental design andclinical data validation. We also thank Chaewon Park for helpingdata annotation and statistical analysis. This research was sup-ported by the Ministry of Education of the Republic of Korea and theNational Research Foundation of Korea (NRF-2022S1A5A8054322),and by the National Research Foundation of Korea (NRF) grantfunded by the Korea government (MSIT) (No. 2023R1A2C2007625).",
  "American Psychiatric Association. 2013. Diagnostic and statistical manual ofmental disorders: DSM-5 (5th ed. ed.). Autor, Washington, DC": "Tayyaba Azim, Loitongbam Singh, and Stuart Middleton. 2022. Detecting mo-ments of change and suicidal risks in longitudinal user texts using multi-tasklearning. In Proceedings of the Eighth Workshop on Computational Linguistics andClinical Psychology. 213218. Elizabeth D Ballard, Cristan A Farmer, Bridget Shovestul, Jennifer Vande Voort,Rodrigo Machado-Vieira, Lawrence Park, Kathleen R Merikangas, and Carlos AZarate Jr. 2020. Symptom trajectories in the months before and after a suicideattempt in individuals with bipolar disorder: A STEP-BD study. Bipolar disorders22, 3 (2020), 245254. Jakob E Bardram, Mads Frost, Kroly Sznt, and Gabriela Marcu. 2012. TheMONARCA self-assessment system: a persuasive personal monitoring systemfor bipolar patients. In Proceedings of the 2nd ACM SIGHIT International HealthInformatics Symposium. 2130.",
  "Iz Beltagy, Matthew E Peters, and Arman Cohan. 2020. Longformer: The long-document transformer. arXiv preprint arXiv:2004.05150 (2020)": "Adrian Benton, Glen Coppersmith, and Mark Dredze. 2017. Ethical researchprotocols for social media health research. In Proceedings of the first ACL workshopon ethics in natural language processing. 94102. Charles L Bowden, Vivek Singh, P Thompson, JM Gonzalez, MM Katz, M Dahl,Thomas J Prihoda, and X Chang. 2007. Development of the bipolar inventory ofsymptoms scale. Acta Psychiatrica Scandinavica 116, 3 (2007), 189194. Craig J Bryan, Jonathan E Butner, Sungchoon Sinclair, Anna Belle O Bryan,Christina M Hesse, and Andree E Rose. 2018. Predictors of emerging suicidedeath among military personnel on social media networks. Suicide and Life-Threatening Behavior 48, 4 (2018), 413430.",
  "Craig J Bryan and M David Rudd. 2016. The importance of temporal dynamicsin the transition from suicidal thought to behavior. Clinical Psychology: Scienceand Practice 23, 1 (2016), 2125": "Lei Cao, Huijun Zhang, Ling Feng, Zihan Wei, Xin Wang, Ningyun Li, and XiaohaoHe. 2019. Latent Suicide Risk Detection on Microblog via Suicide-Oriented WordEmbeddings and Layered Attention. In Proceedings of the 2019 Conference onEmpirical Methods in Natural Language Processing and the 9th International JointConference on Natural Language Processing (EMNLP-IJCNLP). 17181728. Arman Cohan, Bart Desmet, Andrew Yates, Luca Soldaini, Sean MacAvaney,and Nazli Goharian. 2018. SMHD: a Large-Scale Resource for Exploring OnlineLanguage Usage for Multiple Mental Health Conditions. In Proceedings of the27th International Conference on Computational Linguistics. 14851497.",
  "Jacob Cohen. 1960. A coefficient of agreement for nominal scales. Educationaland psychological measurement 20, 1 (1960), 3746": "Glen Coppersmith, Mark Dredze, and Craig Harman. 2014. Quantifying men-tal health signals in Twitter. In Proceedings of the workshop on computationallinguistics and clinical psychology: From linguistic signal to clinical reality. 5160. Tim Dalgleish, Melissa Black, David Johnston, and Anna Bevan. 2020. Trans-diagnostic approaches to mental health problems: Current status and futuredirections. Journal of consulting and clinical psychology 88, 3 (2020), 179.",
  "Munmun De Choudhury and Emre Kiciman. 2017. The language of social supportin social media and its effect on suicidal ideation risk. In Eleventh InternationalAAAI Conference on Web and Social Media": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, andMrinal Kumar. 2016. Discovering shifts to suicidal ideation from mental healthcontent in social media. In Proceedings of the 2016 CHI conference on human factorsin computing systems. 20982110. Rani A Desai, David J Dausey, and Robert A Rosenheck. 2005. Mental healthservice delivery and suicide risk: the role of individual patient and facility factors.American Journal of Psychiatry 162, 2 (2005), 311318.",
  "Peter Dome, Zoltan Rihmer, and Xenia Gonda. 2019. Suicide risk in bipolardisorder: a brief review. Medicina 55, 8 (2019), 403": "Sindhu Kiranmai Ernala, Michael L Birnbaum, Kristin A Candan, Asra F Rizvi,William A Sterling, John M Kane, and Munmun De Choudhury. 2019. Method-ological gaps in predicting mental health states from social media: triangulatingdiagnostic signals. In Proceedings of the 2019 chi conference on human factors incomputing systems. 116. Manas Gaur, Amanuel Alambo, Joy Prakash Sain, Ugur Kursuncu, KrishnaprasadThirunarayan, Ramakanth Kavuluru, Amit Sheth, Randy Welton, and JyotishmanPathak. 2019. Knowledge-aware assessment of severity of suicide risk for earlyintervention. In proceedings of the 2019 World Wide Web Conference (San Francisco,CA, USA). 514525.",
  "Daisy Harvey, Fiona Lobban, Paul Rayson, Aaron Warner, Steven Jones, et al.2022. Natural Language Processing Methods and Bipolar Disorder: ScopingReview. JMIR mental health 9, 4 (2022), e35928": "Dirk Hovy and Shannon L Spruit. 2016. The social impact of natural languageprocessing. In Proceedings of the 54th Annual Meeting of the Association for Com-putational Linguistics (Volume 2: Short Papers). 591598. Mark A Ilgen, Amy SB Bohnert, Rosalinda V Ignacio, John F McCarthy, Marcia MValenstein, H Myra Kim, and Frederic C Blow. 2010. Psychiatric diagnoses andrisk of suicide in veterans. Archives of general psychiatry 67, 11 (2010), 11521158. Daniel Izmaylov, Avi Segal, Kobi Gal, Meytal Grimland, and Yossi Levi-Belz.2023. Combining Psychological Theory with Language Models for Suicide RiskDetection. In Findings of the Association for Computational Linguistics: EACL 2023.23852393. Glorianna Jagfeld, Fiona Lobban, Paul Rayson, and Steven JM Jones. 2021. Un-derstanding who uses Reddit: Profiling individuals with a self-reported bipolardisorder diagnosis. In Proceedings of the Seventh Workshop on ComputationalLinguistics and Clinical Psychology: Improving Access. 114.",
  "Sheri L Johnson, Charles S Carver, and Jordan A Tharp. 2017. Suicidality in bipolardisorder: The role of emotion-triggered impulsivity. Suicide and Life-ThreateningBehavior 47, 2 (2017), 177192": "Masoud Kamali, Erika FH Saunders, Alan R Prossin, Christine B Brucksch, Gloria JHarrington, Scott A Langenecker, and Melvin G McInnis. 2012. Associationsbetween suicide attempts and elevated bedtime salivary cortisol levels in bipolardisorder. Journal of affective disorders 136, 3 (2012), 350358. Jiwon Kang, Jieun Kim, Taenyun Kim, Hayeon Song, and Jinyoung Han. 2022. Ex-periencing Stress During COVID-19: A Computational Analysis of Stressors andEmotional Responses to Stress. Cyberpsychology, Behavior, and Social Networking25, 9 (2022), 561570.",
  "Alan E Kazdin, American Psychological Association, et al. 2000. Encyclopedia ofpsychology. Vol. 8. American Psychological Association Washington, DC": "John G Keilp, Michael F Grunebaum, Marianne Gorlyn, Simone LeBlanc, Ainsley KBurke, Hanga Galfalvy, Maria A Oquendo, and J John Mann. 2012. Suicidalideation and the subjective aspects of depression. Journal of affective disorders140, 1 (2012), 7581. Alex Kendall, Yarin Gal, and Roberto Cipolla. 2018. Multi-task learning usinguncertainty to weigh losses for scene geometry and semantics. In Proceedings ofthe IEEE conference on computer vision and pattern recognition. 74827491. Kamyar Keramatian, Jairo V Pinto, Ayal Schaffer, Verinder Sharma, Serge Beaulieu,Sagar V Parikh, and Lakshmi N Yatham. 2022. Clinical and demographic factorsassociated with delayed diagnosis of bipolar disorder: data from Health Outcomesand Patient Evaluations in Bipolar Disorder (HOPE-BD) study. Journal of AffectiveDisorders 296 (2022), 506513.",
  "Klaus Krippendorff. 2018. Content analysis: An introduction to its methodology.Sage publications": "Daeun Lee, Migyeong Kang, Minji Kim, and Jinyoung Han. 2022. DetectingSuicidality with a Contextual Graph Neural Network. In Proceedings of the EighthWorkshop on Computational Linguistics and Clinical Psychology. 116125. Daeun Lee, Soyoung Park, Jiwon Kang, Daejin Choi, and Jinyoung Han. 2020.Cross-Lingual Suicidal-Oriented Word Embedding toward Suicide Prevention.In Proceedings of the 2020 Conference on Empirical Methods in Natural LanguageProcessing: Findings. 22082217.",
  "Hiroki Nakayama, Takahiro Kubo, Junya Kamura, Yasufumi Taniguchi, and XuLiang. 2018. doccano: Text Annotation Tool for Human": "Matthew K Nock, Guilherme Borges, Evelyn J Bromet, Jordi Alonso, MatthiasAngermeyer, Annette Beautrais, Ronny Bruffaerts, Wai Tat Chiu, GiovanniDe Girolamo, Semyon Gluzman, et al. 2008. Cross-national prevalence and riskfactors for suicidal ideation, plans and attempts. The British journal of psychiatry192, 2 (2008), 98105. Lisa A ODonnell, Alissa J Ellis, Margaret M Van de Loo, Jonathan P Stange,David A Axelson, Robert A Kowatch, Christopher D Schneck, and David J Mik-lowitz. 2018. Mood instability as a predictor of clinical and functional outcomesin adolescents with bipolar I and bipolar II disorder. Journal of affective disorders236 (2018), 199206.",
  "Abigail Ortiz, Kamil Bradler, and Arend Hintze. 2018. Episode forecasting inbipolar disorder: Is energy better than mood? Bipolar disorders 20, 5 (2018),470476": "Ives C Passos, Pedro L Ballester, Rodrigo C Barros, Diego Librenza-Garcia, BensonMwangi, Boris Birmaher, Elisa Brietzke, Tomas Hajek, Carlos Lopez Jaramillo,Rodrigo B Mansur, et al. 2019. Machine learning and big data analytics in bipolardisorder: a position paper from the International Society for Bipolar DisordersBig Data Task Force. Bipolar Disorders 21, 7 (2019), 582594.",
  "James W Pennebaker, Martha E Francis, and Roger J Booth. 2001. Linguisticinquiry and word count: LIWC 2001. Mahway: Lawrence Erlbaum Associates 71,2001 (2001), 2001": "Laura Plans, Evaristo Nieto, Antoni Benabarre, and Eduard Vieta. 2019. Completedsuicide in bipolar disorder patients: a cohort study after first hospitalization.Journal of affective disorders 257 (2019), 340344. Maurizio Pompili, Xenia Gonda, Gianluca Serafini, Marco Innamorati, Leo Sher,Mario Amore, Zoltan Rihmer, and Paolo Girardi. 2013. Epidemiology of suicidein bipolar disorders: a systematic review of the literature. Bipolar disorders 15, 5(2013), 457490. Kelly Posner, Gregory K Brown, Barbara Stanley, David A Brent, Kseniya V Yer-shova, Maria A Oquendo, Glenn W Currier, Glenn A Melvin, Laurence Greenhill,Sa Shen, et al. 2011. The ColumbiaSuicide Severity Rating Scale: initial validityand internal consistency findings from three multisite studies with adolescentsand adults. American journal of psychiatry 168, 12 (2011), 12661277. Nils Reimers and Iryna Gurevych. 2019. Sentence-BERT: Sentence Embeddingsusing Siamese BERT-Networks. In Proceedings of the 2019 Conference on EmpiricalMethods in Natural Language Processing and the 9th International Joint Conferenceon Natural Language Processing (EMNLP-IJCNLP). 39823992.",
  "Zoltn Rihmer and Kitty Kiss. 2002. Bipolar disorders and suicidal behaviour.Bipolar Disorders 4 (2002), 2125": "Puneet KC Sahota and Pamela L Sankar. 2020. Bipolar disorder, genetic risk, andreproductive decision-making: A qualitative study of social media discussionboards. Qualitative health research 30, 2 (2020), 293302. Ramit Sawhney, Harshit Joshi, Lucie Flek, and Rajiv Shah. 2021. Phase: Learn-ing emotional phase-aware representations for suicide ideation detection onsocial media. In Proceedings of the 16th conference of the european chapter of theassociation for computational linguistics: main volume. 24152428. Ramit Sawhney, Harshit Joshi, Saumya Gandhi, and Rajiv Shah. 2020. A time-aware transformer based model for suicide ideation detection on social media.In Proceedings of the 2020 conference on empirical methods in natural languageprocessing (EMNLP). 76857697. Ramit Sawhney, Harshit Joshi, Saumya Gandhi, and Rajiv Ratn Shah. 2021. To-wards Ordinal Suicide Ideation Detection on Social Media. In Proceedings of the14th ACM International Conference on Web Search and Data Mining. 2230.",
  "Hajime Sueki. 2015. The association of suicide-related Twitter use with suicidalbehaviour: a cross-sectional study of young internet users in Japan. Journal ofaffective disorders 170 (2015), 155160": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones,Aidan N Gomez, ukasz Kaiser, and Illia Polosukhin. 2017. Attention is allyou need. Advances in neural information processing systems 30 (2017). Matthew L Williams, Pete Burnap, and Luke Sloan. 2017. Towards an ethicalframework for publishing Twitter data in social research: Taking into accountusers views, online context and algorithmic estimation. Sociology 51, 6 (2017),11491168. Siqi Xue, John Hodsoll, Ameer Bukhsh Khoso, Muhammad Omair Husain, Imran BChaudhry, Allan H Young, Juveria Zaheer, Nusrat Husain, Benoit H Mulsant, andMuhammad Ishrat Husain. 2021. Suicidality in patients with bipolar depression:Findings from a lower middle-income country. Journal of affective disorders 289(2021), 16. Minjoo Yoo, Sangwon Lee, and Taehyun Ha. 2019. Semantic network analysis forunderstanding user experiences of bipolar and depressive disorders on Reddit.Information Processing & Management 56, 4 (2019), 15651575. Ayah Zirikly, Philip Resnik, Ozlem Uzuner, and Kristy Hollingshead. 2019.CLPsych 2019 shared task: Predicting the degree of suicide risk in Reddit posts.In Proceedings of the sixth workshop on computational linguistics and clinicalpsychology. 2433.",
  "A.1Annotation Process": "In this study, we aim to develop a model to predict the risks of futuresuicidality of bipolar disorder (BD) patients using past social mediadata. To this end, we create a BD dataset that includes the labelsof future suicidality and bipolar symptoms clinically verified bypsychiatrists. This section briefly states how we create a BD datasetbased on our annotation guideline. As our first step, we collect socialmedia posts published between January 1, 2008, and September 31,2021, from three bipolar-related subreddits using the open-sourceReddit API 4. Among the collected posts, we used posts written byusers who have been diagnosed with BD by professionals andusers who reported BD diagnosis (e.g., I was diagnosed with Bipolartype-I last year.). Based on the criteria, our dataset contains 7,592posts published by 818 users, i.e., BD patients. For the preprocessing,we anonymize the collected posts and convert the texts. Then weconduct annotation with four trained annotators using the open-source text annotation tool Doccano in .",
  "A.2Annotation Guideline": "For our annotation, we consider three different label categories thatinclude the diagnosed BD type (e.g., BD-I, BD-II), the BD symptom(e.g., manic, anxiety), and the level of suicidality (e.g., ideation,attempt). Discussion with the psychiatrist selected the criteria ofthree different label categories. We briefly describe the details ofthe annotation guideline in the following subsections. A.2.1Diagnosed Bipolar Disorder Types. To use only posts of usersdiagnosed with bipolar by medical institutions, we classify userswhose self-reports are bipolar related to diagnoses (e.g., Hey, Imdiagnosed bipolar II posts being diagnosed with schizophrenia.).We label users into three BD diagnosis types, including BipolarDisorder-I (BD-I), Bipolar Disorder-II (BD-II), and Not OtherwiseSpecified Bipolar Disorder (NOS). describes the definition ofthree BD diagnosis types inspired by the Diagnostic and StatisticalManual of Mental Disorders (DSM-5) and the Statistical Clas-sification of Diseases and Related Health Problems (ICD-10) ,which classify bipolar disorder into several sub-types based on the",
  "and intensity of episodes. For example, BD-I requires at": "least one manic episode, while BD-II shows at least one hypomanicand one major depressive episode during their lifetime. Moreover,we annotate NOS when a patient shows some symptoms of BD butdoes not necessarily satisfy all the criteria. A.2.2Bipolar Disorder Symptoms. We can filter out posts withoutBD diagnosis type from Appendix A.2.1. We annotate BD symptomsfor each post that fits the requirement to track users diagnosedas bipolar with time series. Based on the BISS(Bipolar Inventoryof Symptoms Scale) Bowden et al. and discussions with thepsychiatrist, our annotation criteria came out. We annotate usersin case bipolar-related symptoms are exposed. describes thedefinition and the corresponding examples of BD symptoms used inthis study. For more systematic annotation, we consider mood andsomatic symptoms. We first annotate the most prominent moodsymptoms among Depressed, Manic, Anxiety, Remission, Irritabilityand Other. Additionally, we add Other to cover moods that do notfall into the other five mood symptoms. Moreover, simultaneouslywith some posts, we annotate an additional somatic symptom labelin option with Somatic complaint, Psychosis, and Both, which areconsidered vital factors of suicidality . While annotating, wedelete advertising posts that do not fit the purpose. A.2.3Risks of Suicidality. To determine the users different levelsof suicidality while tracking BD symptoms, we also simultaneouslyannotate the risks of suicidality. Based on the post contents, welabel the risk of suicidality, which fits the current situation. Weutilize the existing criteria from that provide five levels ofsuicidality, including No Risk (NR), Suicide Indicator (IN), SuicidalIdeation (ID), Suicidal Behavior (BR), and Actual Attempt (AT), basedon the Columbia Suicide Severity Rating Scale (C-SSRS) . For ourannotation, we merge No Risk with Suicide Indicator since peoplewith bipolar disorder are already considered more at risk than thegeneral population in suicide . In the suicide indicator level,posts reveal risk indicators such as a history of divorce, chronicillness, or suicide of a loved one. Suicidal ideation posts mention thewillingness to take own life (e.g., I still want to die. I still shoulddie.), and suicidal behavior posts contain actions with higher risks,such as planning a suicide attempt. Posts show deliberate actionat the actual attempt level that can lead to death (e.g., I failed tocommit suicide last night, what do I do now?). details eachcategorys descriptions and examples of Risks of Suicidality.",
  "BEXPERIMENT SETTINGS": "We tune hyperparameters based on the highest F1 score obtainedfrom the cross-validation set for the models. We use the grid searchto explore the dimension of hidden state {32, 64, 128, 256, 512},number of LSTM layers {1, 2, 5}, dropout {0.1, 0.2, 0.3, 0.4, 0.5},initial learning rate {1 5, 2 5, 3 5, 5 5}, and controlthe parameter for ordinal regression {0, 0.2, ..., 3.8}. The opti-mal hyperparameters were found to be: = 512, = 2, = 0.1, = 1 5, and = 1.8. We implement all the methods usingPyTorch 1.6 and optimize with the mini-batch AdamW with abatch size of 64. We use the Exponential Learning rate Schedulerwith gamma 0.001. We train the model on a GeForce RTX 2080 TiGPU for 200 epochs and apply early stopping with patience of 20epochs."
}