{
  "ABSTRACT": "Finding multiple temporal relationships among locations can ben-efit a bunch of urban applications, such as dynamic offline adver-tising and smart public transport planning. While some effortshave been made on finding static relationships among locations,little attention is focused on studying time-aware location rela-tionships. Indeed, abundant location-based human activities aretime-varying and the availability of these data enables a new par-adigm for understanding the dynamic relationships in a periodamong connective locations. To this end, we propose to study anew problem, namely multi-Temporal relationship inference amonglocations (Trial for short), where the major challenge is how to inte-grate dynamic and geographical influence under the relationshipsparsity constraint. Specifically, we propose a solution to Trial witha graph learning scheme, which includes a spatially evolving graphneural network (SEENet) with two collaborative components: spa-tially evolving graph convolution module (SEConv) and spatiallyevolving self-supervised learning strategy (SE-SSL). SEConv per-forms the intra-time aggregation and inter-time propagation tocapture the multifaceted spatially evolving contexts from the viewof location message passing. In addition, SE-SSL designs time-awareself-supervised learning tasks in a global-local manner with addi-tional evolving constraint to enhance the location representation",
  "This work was done when the first author was an intern at Baidu Research under thesupervision of Jingbo Zhou.Corresponding authors": "Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than theauthor(s) must be honored. Abstracting with credit is permitted. To copy otherwise, orrepublish, to post on servers or to redistribute to lists, requires prior specific permissionand/or a fee. Request permissions from 23, August 610, 2023, Long Beach, CA, USA 2023 Copyright held by the owner/author(s). Publication rights licensed to ACM.ACM ISBN 979-8-4007-0103-0/23/08...$15.00",
  "INTRODUCTION": "With the widespread availability of human mobility data, discover-ing location relationships in urban areas has received significantresearch interest in recent years . Finding the loca-tion relationship can help to reveal urban patterns, which definitelybenefits intelligent urban management and finally promotesthe urban business economy . However, most existing works fo-cus on analyzing static relationships among locations from a spatialperspective, and few known methods study time-aware locationrelationships from a temporal perspective. Whereas, the humanmobility data is always time-correlated , e.g., visitingrestaurants at noon and visiting bars at night. Hence, here we presentto investigate a new paradigm for understanding such dynamicmultiple relationships between locations in a period, which hasbeen largely overlooked in previous studies.To this end, we propose to study a problem of multi-Temporalrelationship inference among locations (we call Trial for short),which is of great importance in many urban application scenarios.The goal of Trial is to recover plenty of missing relationships acrossmultiple time segments from the constructed location graph in an",
  "\"#": ": An illustration of multi-temporal relationshipsaround the fast-food restaurant location 1. The pair (1, 2)with complementary relationships tend to be visited by com-mon users at night, while another pair (1, 3) with competi-tive relationships provide similar service at the specific time. BeijingTokyoNew YorkChicago Percentage of Relation Number (%) (a) Relationship distribution over time",
  "Time Segment": "03:00-09:0009:00-15:0015:00-21:0021:00-03:00 : Characteristics of multi-temporal relationships.urban area. In other words, we aim at mining location connectionsat different time segments (e.g., morning or evening). Solving Trialcan facilitate urban intelligence in many application domains, suchas dynamic business advertisements, urban resource planning, and knowledge-enhanced location recommendation .Here we further present two examples to demonstrate our moti-vation for Trial. At first, given a target region location (e.g., a resi-dential district), the most relevant regions for this district may bedifferent from morning to evening. After inferring multi-temporalrelationships for this district, the urban manager can adaptivelyplan public transport at different times in a day. Second, let us con-sider another scenario of urban business as illustrated in . On the one hand, the relationship in an urban area may onlyexist at specific times due to the evolving daily activities of users. In this case, focusing on time-specific correlated locations canhelp business owners to dynamically optimize their advertisementstrategy at different times. On the other hand, we find therelationship can be diverse in a day. Taking as an example,the cafe 1 (i.e., Starbucks) is competitive with the restaurant 2(i.e., Taco Bell) since both provide breakfast in the morning, whilethey become complementary at midday due to different services.Therefore, the user experience can be also improved with the dis-covered multi-temporal location pairs to enhance the time-awarelocation recommendation . Hence, it is critical to effec-tively understand multi-temporal relationships among locations.Existing methods for relationship mining cannot handle Trialproblem effectively since the temporal and geographical factors arerarely considered in a unified manner. Extensive studies have beenconducted for relationship mining in other domains, e.g., businessanalysis or e-commerce relationship inference .These methods usually cannot be directly used for location relation-ship mining. Recently, remarkable advancements in graph neuralnetworks (GNNs) have shown the powerful capacity forrelationship graph learning and achieved promising results. TheseGNN-based relationship prediction studies attempt to extend the effective graph message-passing procedure by learning relationalcorrelations or spatial dependencies for location con-text understanding. The most recent method further adoptsattentive aggregation to handle multiple relationships in the urbanarea. However, all previous works do not fully consider unique at-tributes of our Trial, which fail to examine two research challengesin modeling multi-temporal location relationships as follows.",
  "Challenge 1: How to capture the relational dynamics under": "temporal and geographical contexts? According to the statisticalanalysis in (a), the distribution of the location relationshipvaries in a day, indicating the dynamic influence plays a crucialrole. Moreover, further investigation in (b) shows that therelational dynamics is correlated with geography information inthe urban area. The geographical context may have different influ-ences on locations at different times. Although some dynamic GNNs for link prediction are designed for multi-temporal graphstructures, they fail to incorporate the relational and spatial evolv-ing patterns. How to communicate the dynamic correlations withgeographical factors in an effective way remains a unique researchchallenge. Note that spatial-temporal GNN focusing on graph-basedtime series analysis (e.g., traffic forecasting) is another substantiallydifferent research problem , which is not applicable to thelinking problem of Trial focusing on dynamic relationships. Challenge 2: How to deal with the relationship sparsity withspatial and dynamic influences? Since the precious relationshipbetween locations is derived from limited and conditional user be-havior data, the multi-temporal relationship is more scarce .Therefore, the learning process of GNN suffers from data sparsitywith insufficient context information in aggregation. Most exist-ing graph self-supervised learning methods only payattention to learning from the augmented graph structures withoutconsidering spatial and dynamic influences for relational modeling,thus leading to suboptimal performance. How to take advantage ofsparse relationships in the urban area is another notable challenge.In this paper, we propose a Spatially Evolving graph nEuralNetwork (SEENet) tailored for inferring multi-temporal relation-ships among locations. To address the above challenges, we designthe framework from two perspectives: spatially evolving graphconvolution (SEConv) for message passing-level modeling, and 2)spatially evolving self-supervised learning (SE-SSL) for training-level modeling. Firstly, aiming at the first challenge, the proposedgraph learning procedure SEConv is equipped with intra-time ag-gregation and inter-time propagation. The key idea is to identify thespatial and evolving influence from multifaceted locations with con-sidering non-local and cross-time neighbors. Specifically, the intra-time learning process performs the second-order aggregation topreserve non-local geographical and relational dependencies at eachspecific time. On the other hand, the inter-time learning processfurther propagates the multi-temporal information to capture thespatially evolving context across adjacent time segments. Moreover,SE-SSL is devised to deal with the second challenge of relationshipsparsity, which adopts the spatial information maximum strategyfrom a global regional view and the additional evolving constraintfrom a local relational view. By this means, SEENet can enhance therepresentation learning for locations with incorporating both spa-tial distribution and dynamic patterns in a self-supervised manner.The major contributions of this paper are summarized as follows.",
  "In this section, we review the previous literature from two perspec-tives: topic-related relationship mining and inference, and closelytechnology-related graph neural networks": "Relationship Mining and Inference. Mining valuable rela-tionships has attracted increasing attention from both academiaand industry . In the early stage, most of the previous worksaim at inferring the precious relationship from content information (e.g., textual reviews and descriptions on the web), while expertknowledge is required to design linguistic rules or graphicalanalysis models . Another line of work seeks to apply deeplearning-based techniques to analyze various relationships. Someexplore applying the linked auto-encoder and graphlet mining for product-oriented or competitor-oriented applications.Considering the natural inadequacy in learning relational graphstructures of these domain-specific methods, some recent worksfurther propose to develop powerful graph learning approachesfor relationship discovery. From the perspective of relational de-pendency learning, DecGCN designs the graph structural inte-gration mechanism for decoupled representation learning, whichcan detect the mutual influence between different relationships.The recent IRGNN further incorporates the multi-hop com-plex relationships to alleviate the sparsity issue. However, spatialdependencies between nodes are omitted which encourages re-searchers to propose geography-based graph methods. Therefore,from the perspective of spatial context modeling in urban area, thefine-grained distance distribution is captured in DeepR withspatial adaptive graph convolutions. More recently, PRIM com-bines self-attentive spatial context extractor for multiple relationtypes. However, the important relational dynamics is neglected allalong. In this paper, we focus on the challenging multi-temporalrelationship inference among locations to fill the research gap.Graph Neural Networks. Recent years have witnessed therapid growth of graph neural networks (GNNs), which exhibit astrong ability in learning structural relationships . According to the unique challenging properties of locationrelationships as introduced before, the technically correspondingGNN models fall into three mainstreams. Firstly, a number of GNNsperform diverse message-passing schemes to capture rich contextinformation from graph structures, such as considering edge typesfor multiple relational semantics and spatial attributes .Moreover, some efforts have been devoted to studying expressivehigh-order GNN methods, including mixing neighboring features at various distances in Mixhop , distinguishing non-local topologi-cal structures with the random walk or attention-guided sorting. Secondly, graph self-supervised learning methods focus ondesigning augmented strategies to tackle data scarcity, which uti-lizes contrastive learning or meaningful tasks on graphs.The most recent RGRL also leverages the relationship informa-tion with preserving global and local similarity. Nevertheless, thesemethods tend to lose effectiveness without considering the spatialand evolving characteristics of relationships. Finally, integratingrelational dynamics is also important for snapshot-based graphlearning. Along this line, EvolveGCN is proposed to recurrentlyupdates the GNN weights for dynamic link prediction. Althoughthe recent ROLAND takes a further step to involve hierarchicalstates over time, one-sided dynamic information is still not suffi-cient. It is noteworthy that the irrelevant spatial-temporal GNNscan not be applied in location relationship learning for comparison.Because most of them are basically designed for time series fore-casting with specific sequential values (e.g., traffic flow or weatherconditions) , which is intrinsically different from our target ofmulti-time link prediction. Therefore, we aim to develop an adap-tive graph neural network to preserve both spatial and dynamicdependencies simultaneously for location relationship inference.",
  "In this section, we first present the concept of the dynamic locationgraph, and then formalize the problem of multi-temporal relation-ship inference among locations (Trial for short)": "Definition 3.1. (Time-specific Location Relationship). Asstated above, relationships between locations are dynamic in aday. Thus, the complex location relationships should be naturallydecomposed into multi-temporal segments to meet the unique dailydynamic characteristic of locations. Formally, the pre-defined setof time segments is denoted as T = {1,2, ..., }, where all timesegments form a whole day. Accordingly, the location relationshipset R contains multiple time-specific relationships among locations.In the following sections, the mentioned relationship also stands forlocation relationship. We use T to generally represent a certaintime, while R refers to a given relationship. Definition 3.2. (Dynamic Location Graph). In this work, themulti-temporal relationships are organized as a fine-grained dy-namic location graph G = { ( ) | ( ) = (V, E ( ), L), T}, whereV = {1, 2, ..., } is the set of location nodes with the spatialcoordinates L R2 . The dynamic graph G is composed of time-specific graphs and contains different relationship edges atdifferent time segments, which is denoted as E = E (1) ... E ( ).The relational edge ( ),, = (, ,,) represents there exists therelationship R between and at time . Since the relational location graph G is usually sparse and mostvaluable relationships are absent, our target is to learn from G anddiscover all meaningful relationships at different time segments.We formally define the problem as below:",
  ": Illustration of the proposed SEENet framework for dynamic location graphs": "model F ({ (1), , ( )}) to map the location node set V intomultiple embeddings {z(1), , z( )} at multi-temporal segments.Then, given a location pair (, ) V V at the time T, thepossibility score for each relationship can be estimated by theprediction function ( )(z( ), z( )). Therefore, we can discover allpotential location relationships at multiple times.",
  "MODEL FRAMEWORK": "In this section, we present the Spatially Evolving graph nEuralNetwork (SEENet) model, which learns from multi-temporal dy-namic and geographical correlations in an end-to-end manner. Asillustrated in , the overall framework first takes the dynamiclocation graph G in the temporal format as input. Our proposedSEENet is equipped with a spatially evolving graph convolutionmodule (SEConv) to incorporate the evolving context along withthe comprehensive spatial influence. After obtaining the representa-tions of locations by SEConv, the spatially evolving self-supervisedlearning module (SE-SSL) is devised to enhance the models capabil-ity of learning dynamic relational patterns through well-designedtraining tasks on sparse location graphs. Finally, we utilize thepre-trained model after SE-SSL for our problem of Trial.",
  "Spatially Evolving Graph Convolution": "The intrinsic evolving correlations associated with spatial contextsare critical to time-specific location representation learning. In pastyears, GNNs have shown the superiority on processing rela-tional graph structures for Points-of-Interest or items .These GNN methods mainly focus on topological structures withlearning spatial dependencies or relational semantics on the singlestatic graph, which fails to deal with multi-temporal relations. To this end, we develop the Spatially Evolving graph Convolution(SEConv) to capture both spatial location context and dynamic cor-relations across time. The key idea of SEConv derives from twoperspectives for complex context modeling: intra-time non-localrelational interactions and inter-time spatially evolving interactions.Since the geography information plays a crucial role in locationrelationship, before introducing the main components of SEConv,we first manage to project the scalar distances into informative spa-tial representations. In view of the varying spatial distribution of different datasets or cities, we adopt the Adaptive Distance Encoder(ADE) with distribution-aware embedding mechanism . We firstcalculate all distances based on locations coordinate matrix L in therelational graph G, then the statistical distance distribution () isobtained in (c). Since the scalar distance value only has lim-ited one-dimension information without learning ability, we buildthe embedding layer to extract the discrete representations. As illus-trated in (c), the () distribution is uniformly decomposedinto consistent distance-space bins with the constraint of theequal area size under each bins curve. The boundary list ()for distance bins is calculated as:",
  "d, = Embedding()s.t. ||L L || < +1,(2)": "where L is the location coordinate for. The generated distribution-aware distance representations can adaptively imply the overallspatial context from the view of statistical analysis.After that, the spatial distance embedding is integrated intothe Relational Spatial AGGregation (RS-AGG) for time-specific non-local dependencies modeling and the Spatially Evolving contextualPropagation (SE-Prop) for multifaceted context modeling, whichwill be introduced later. As shown in (a), the overall intra-and inter-time convolutional process at time is defined as:",
  "h( ), = Prop(h(),, d,) N (), (),(3)": "where h is the input location embedding, h( ), and h( ), arethe intra- and inter-time embeddings for location , AGG andProp are the aggregation and propagation functions at the time for RS-AGG and SE-Prop, respectively. N ( )is the neighboringset of at time . () represents multiple adjacent time segments(from 1 to 2) around for the inter-time propagation process.",
  ": Two views of second-order dependencies in RS-AGG": "4.1.1Intra-time Interaction: Relational Spatial Aggregation(RS-AGG). In the scenario of location relationships, the abundantsecond-order dependency can potentially imply the undiscoveredrelationships. To meet the needs of such unique location graphlearning, the proposed RS-AGG adopts the second-order messagepassing architecture with considering the non-local environmentin the first stage of intra-time interaction modeling. Different fromprevious GNN-based relationship learning methods aggregatinginformation from 1-hop local neighbors, the basic intuition of RS-AGG derives from both spatial and relational views. From the spatial view. As shown in (a), although the2-hop neighboring locations are not directly connected with the tar-get location , they may be geographically close to . As we haveinvestigated in (b), the stronger geographical connection(i.e., closer distance) indicates the higher possibility of relationshipexistence. However, the ordinary 1-hop message passing processcan only deliver the spatial distance between neighboring locations.If we simply stack two GNN layers with propagating distance infor-mation (,), the model can not capture the real 2-hop distance in the geographical space (usually + unless threenodes (, , ) are spatially collinear).From the relational view. The 2-hop relational path can re-flect the meaningful relationship patterns, which is denoted as , , . As shown in (b), different types of re-lational combinations can imply different potential relationships,where the relational dependence , , is helpful to reveal therelationship ,. Distinguishing such path semantics can greatlyimprove the models ability to discover more hidden relationships.To utilize the above two characteristics among locations, weincorporate the spatial influence and relational dependence into aunified aggregation network RS-AGG. We first define the second-order neighbors with the mixed relational division strategy:",
  ",(4)": "where 1 and 2 denote a certain relation pair, |= means that therelational path determined by the triple nodes (, , ) satisfy the2-hop relational pattern 1 2 (i.e., , = 1 and , = 2). Theneighboring set N2 (,1 2) defines the associated location pair(, ) within the second-order range, where the 2-hop neighbor is reachable via the middle 1-hop neighbor on the graph attime . Only the pairs connected by at least two different relationalpaths are included for efficiency. In this way, we can provide themost crucial evidence for inferring relationships.Then, we further propose the geography-aware relational graphconvolutions to preserve multiple dependencies from the complex intra-time connections. This non-local learning scheme is devisedto handle the second-order correlations for each pattern, which cansimultaneously aggregate the 1-hop and 2-hop interaction featureswith the spatial gating mechanism. In general, the path-specificlocation representation for is generated as follows:",
  "(, ,) = sigmoida,1,2 (s,1,2 + s,1,2),(6)": "where a,1,2 is the trainable parameter for importance weightcalculation. Here we take the 1-hop relation semantics and 2-hopgeographical impact into account. Since the calculated gating scoreis devised to reflect the relative significance between 1-hop and2-hop information, it combines the pairwise relational-based vectors,1,2 and spatial-based vector s,1,2 from two domain spaces:",
  "s,1,2 = W,1,2W( )12h( ) W( )12h( ),(8)": "where W,1,2, W,1,2, and G,1,2 denote learnable weighted ma-trices, represent the concatenation operation. G,1,2 transformsthe spatial distance representation d, in the relational path-specificlatent space. Under the guidance of dual-factor gated mechanism,the informative second-order aggregation process involves bothrelational and spatial signals.After the relational spatial graph convolution scheme is per-formed for all hybrid paired patterns (1,2), we combine all path-specific location representations obtained from Eq. (5) with meanpooling to strengthen the intra-time dependency learning.",
  "where R is the relationship set, |R R| is the number of paths": "4.1.2Inter-time Interaction: Spatially Evolving ContextualPropagation (SE-Prop). The diversified correlations between lo-cations are also heavily dependent on inter-time interactions. Wefurther propose the spatially evolving propagation layer to capturecomplex contextual messages, which complements the intra-timespatial aggregation from a dynamic perspective. After updatingthe location embedding via the inter-time fusion layer, the well-designed SE-Prop explores to integrate the spatially evolving contextamong multi-temporal location neighbors for better location rela-tionship learning, since the spatial dynamics at different times canplay a great role in relationship mining as introduced before.Specifically, for each location in dynamic graphs, the semanticsof embedding at different segments are distinct. Location embed-dings at adjacent time segments () can provide the sequentiallatent information, which has the potential effect on the current",
  "1 Wh(),,1 2,(10)": "where W is the time-specific transformation matrix, the prior time1 and the later time 2 define the duration of aggregated timesegments () (we set 1 and 2 as 1 and + 1 in practice).Then we further simultaneously leverage the spatial and evolv-ing characteristics among locations in the propagation. As illus-trated in , different from the classic message passing schemefocusing on pairwise local interactions, the SE-Prop additionallyconsiders the spatially evolving context when performing the prop-agation from each neighboring location to the target . Therelationship structure is evolving over time, and a location in thetime-specific graph may contain limited connections. Supplyingcross-time neighboring nodes can enrich the relational environ-ment in the propagation of . Therefore, we first utilize thetemporal sampling strategy to gather abundant neighbors, whichprovides the critical evolving information for the message :",
  "N (, ) = {1, ..., | = Sampling(21 N ( )\\{ })}, (11)": "where Sampling stands for the random sampling process acrosstime segments. The set N collects -size nearby neighbors of with the repeated sampling from multi-temporal neighboring views,which builds the bridge between temporal-correlated locations fromtime 1 to 2 for evolving context construction (e.g., picking up{1, 2, 3} from 1 to 3 in ).Moreover, the sampled locations are spatially distributed aroundthe target interactive pair . The geographical knowledgeunder the evolving influence can offer multifaceted contexts from",
  "C( ), = Pooling{G( )d, h( ) , N (, )},(12)": "where G( ) is the matrix for distance transformation, d, denotesthe internal spatial embedding between two neighbors and , is the Hadamard product for element-wise multiplication. Inpractice, we utilize the mean pooling with the all-round distance integration to enable the model to comprehend how far other neigh-bors in N away from the interacted pair . As a result, everymessage from the neighbor to can carry the evolving contextin N together with the spatial context (d,, d,1, ..., d, ), ratherthan only the partial pairwise d,.Finally, we present the contextual propagation module to com-bine each local neighboring location with the spatially evolvingcontext. This procedure both considers a series of dynamic graphstructures and the detailed contexts, which could be formulated inan interactive manner between adjacent time segments:",
  "With the proposed two components RS-AGG and SE-Prop, we finallyobtain the multi-temporal location embeddings {h(1),, ..., h( ), }": "In the following sections, we use symbols {z(1), ..., z( )} to repre-sent these time-specific embeddings for simplicity.As depicted in (b), we intend to design two essentialself-supervised learning tasks to deal with the issue of the sparserelationship labels between locations, which enhances the represen-tation learning process of SEConv beyond spatially intra-time anddynamically inter-time structure modeling. Although it has beenproved that applying the graph Self-Supervised Learning (SSL) strat-egy is effective for the general issue of scarce labeled data ,current SSL frameworks always fail to capture the complicatedevolving patterns among locations under the spatially distributedenvironment. To this end, the learning procedure component, i.e.,SE-SSL, is proposed for multi-temporal location relationships in aself-supervised manner, which contains the global spatial informa-tion maximum L with the additional local evolving constraintL. As a whole, we have the joint learning objective:",
  "where 1 and 2 are the hyper-parameters to balance the contribu-tions of local-global loss functions, ||||22 is the L2 regularization": "4.2.1Global Spatial Information Maximum. Inspired by thesuccess of Deep Graph Infomax (DGI) , we first develop thespatial information maximum objective to capture the global evolv-ing patterns with preserving the gridding spatial dynamics. Fortime-evolving location graphs, the latent semantics of individualnodes do not stay unchanged over time segments. It is reasonableto treat the relational evolution as a generally smooth process sincethe human behaviors are gradually varying between adjacent times,indicating that the global surroundings around locations remainpartially similar and complementary at the next time segment.In practical scenarios, the location graph of a city can be parti-tioned into multiple urban grids . Each urban grid gathers acluster of spatially correlated location nodes { | } and pro-vides the global surrounding information. All nodes located in anurban grid tend to share the similar spatial environment, whichmotivates us to introduce such knowledge into the model training.",
  "Multi-Temporal Relationship Inference in Urban AreasKDD 23, August 610, 2023, Long Beach, CA, USA": "Different from DGI designed for a single graph, we performthe contrastive learning across the successive time-varying graphstructures to fuse the global evolving information into the locationrepresentation. Specifically, we first utilize the grid-level poolingfunction to summarize the location representations to obtain thegridding vector s( )=1 z( ), where is the number oflocations in grid. After that, the goal is to maximize the cross-timemutual information between location-level representations andurban grid-level representations with the following loss function:",
  "SE[log(1 D(z( ), s(1)() ))],(15)": "where () denotes the urban grid where the location belongsto, the bilinear function D(, ) is the discriminator to calculate theprobability scores which estimates whether is located in the grid. Note that the natural positive sample (z( ), s(1)() ) is extractedfrom temporal views, while the negative pairs are generated fromthe gridding sampler S. In particular, the location at the -thtime segment and the corresponding urban grid () at the lastsegment 1 are regarded as a positive pair. The heuristic sampleraims to distinguish effective negative pairs based on geographicalinformation rather than random sampling.",
  "S = { |1 < (),()< 2},(16)": "where the function over the gridding city mapreturns the Manhattan distance between the two urban grids ()and (). For the sake of avoiding inadequate locations which aretoo close or too far away, we use 1 and 2 to define the appropriatesampling scope of spatial areas (we empirically set 1 and 2 as 2and 6 in practice) for high-quality negative samples generation. 4.2.2Local Relational Evolving Constraint. Besides the globalevolving correlations, the relevance among time-specific relation-ships is also evolutionary from a local perspective. We furtherintroduce the edge-level relational evolving constraint to comple-ment the global grid-level evolution in SE-SSL. The key idea of thisconstraint is to explore if the relation R between and still remains at time when this relation exists at the last 1time segment. We observe some specific short-term relations woulddisappear at the subsequent segment , while a bundle of long-terminfluential relations would continue to survive. Therefore, consider-ing the complex evolving pattern is of great importance due to thepotential time continuity for location relationships. We first acquirethe relational edge representation e( )= h( ) h( ). To furtherexplicitly preserve the relation-aware evolving patterns betweenadjacent times, we define the following local objective:",
  "In this section, we conduct extensive experiments to evaluate theproposed SEENet compared against the state-of-the-art methods.The code of SEENet is available at Settings": "5.1.1Datasets. Our experiments are conducted on four real-worldcitywide datasets from two distinct relationship learning domains.The first two urban business-based datasets (Beijing and Tokyo)are derived from commercial behaviors of users, while the othertwo (New York and Chicago) are urban mobility-based datasetsconstructed from trajectory data to ensure the data diversity. Business-based Relational Data. (Business-RD for short) Inthe scene of urban business, it has been studied that there are twosignificant behavior-driven relationships among locations ,i.e., competitive and complementary relationships, which couldbe generated from session-based location query data or check-indata. Therefore, we follow previous works to con-struct the Business-RD (Beijing and Tokyo) from query datasetQueryBJ and check-in dataset Foursquare respectively. Mobility-based Relational Data. (Mobi-RD for short) Sinceurban mobility is another important aspect to reflect the dynamiclocation correlations, we further extend the relationship in themobile trajectory domain. In specific, we utilize the taxi and biketrajectory datasets NYCTaxi 1 and DivvyBike2 to generate theMobi-RD (New York and Chicago), which includes high-flowand low-flow relationships according to the flowing degree. As aforementioned, the special location relationships are influencedby time in reality since the above user behaviors and trajectories aredependent on different time periods in a day (e.g., two restaurantstend to be competitive at midday instead of midnight) . Thus,",
  "DatasetBeijingTokyoNew YorkChicago": "Relation TypeBusinessBusinessMobilityMobilityRelation SourceMap QueryCheck-inBy TaxiBy Bike# Nodes30,1143,0131,587483# Relations at 13,2701,8206471,059# Relations at 296,2333,9917,0165,894# Relations at 397,8299,4197,9096,275# Relations at 44,1551,4464,5231,322 we reasonably detail the relationships with time-aware refinements.In practice, as suggested by the literature with consideringthe real-life experience and data analysis, we evenly split a dayinto four segments 1~4, i.e., morning, midday, night, and midnight.We construct the above four datasets at each time according totimestamps, and finally obtain the multi-temporal Business-RDand Mobi-RD in . The details of relationship constructionare included in Appendix A.1. 5.1.2Setup. Following the previous relationship-based works, we randomly sample 10% of relational edges for testingand 10% of edges as the validation set at each time segment, whilethe remaining 80% of relations are utilized to construct the dynamiclocation graph for training. We also replace the destination node ofeach edge with other random locations for negative sampling. 5.1.3Baselines and Evaluation Metrics. We compare SEENetwith a variety of advanced GNN methods for dynamic locationrelationship inference: (i) The relational-based GNNs (GCN ,PathGCN , CompGCN , MixHop , and NL-GNN )are typical graph structure learning models considering node cor-relations and contexts. (ii, iii) We also select recent graph self-supervised learning models (DGI , GCA , and RGRL )and snapshot-based dynamic GNNs for link prediction (EvolveGCN and ROLAND ). (iv) Moreover, SEENet is compared withstate-of-the-art relationship prediction methods (DecGCN ,IRGNN , DeepR , and PRIM ) which are designed forlearning relational and spatial dependencies. We conduct time-specific link prediction experiments to rank candidate locationsat each time. As introduced in for relationship inference, we",
  "Overall Performance Comparison": "We first compare the overall experimental results on four real-worldrelationship datasets, where the evaluation metrics are calculatedover all time periods to reflect the general prediction performance.As presented in , we report the metrics MRR@10 and HR@10in the relationship prediction results following the previous work. The values in boldface indicate the best results, while theunderlined values signify the second-best results. On the whole, itis observed that our SEENet consistently outperforms all differentbaseline methods by an obvious margin on each dataset. In specific,compared with the second-best model on four datasets, SEENet im-proves the MRR@10 by 16.5%, 30.4%, 13.3%, and 21.7% respectively.We further have the following observations and findings.As we can see, the relational-based GNNs roughly perform worsethan other types of baselines since they only leverage the graphtopological structures with learning node relations. It is not sur-prising that the recently proposed PathGCN just achieves compa-rable results with GCN because the learned spatial operators withrandom paths are uncertain and sometimes may go against therelationship prediction. Moreover, CompGCN performs slightlybetter because of the ability to distinguish multiple relations, whilethe non-local message-passing models (Mixhop and NL-GNN) canexplicitly learn multi-hop relational contexts and further improvethe performance. In general, the above GNNs are not ideal withoutspatial and dynamic learning schemes, which verifies that simplyaggregating relational edges is not adequate for complex dynamiclocation graphs. As to self-supervised learning methods, RGRL out-performs the other two baselines, as it can enable Self-SupervisedLearning (SSL) with capturing the augmentation-invariant relation-ship at the same time. Note that although both DGI and RGRL adoptthe global-local SSL architecture on graphs, our SEENet incorpo-rates the spatial distribution and evolving pattern into SSL beyondthe traditional framework and performs much better.",
  "SEENet0.25450.23140.25260.1506": "From the perspective of dynamic relationship modeling, sinceEvolveGCN and ROLAND can take advantage of dynamic propaga-tion cross times to preserve time-aware relational characteristics,these models exhibit considerable improvement over classic GNNs.Furthermore, we can see that the latest ROLAND can not alwaysoutperform EvolveGCN due to the failure of recurrent designs onsome datasets, indicating dynamic GNNs are still not powerfulenough in the domain of location graph learning. From the per-spective of special relationship prediction approaches, we noticethat spatial-oriented models (DeepR and PRIM) tend to performbetter than DecGCN and IRGNN as a result of considering essentialgeographical information and adapting the relationship learning inthe scenario of location graphs. One exception is on the Chicagodataset with the fewest relations. The potential reason is that DeepRand PRIM requiring enough neighbors lose their effectiveness whenlearning spatial contexts on small graphs. By contrast, our modelcan fully capture both spatial correlations and evolving dynamicswith graph convolution-level and SSL-level enhancements. There-fore, SEENet is much more effective for multi-temporal relationshipinference among locations.",
  "Impact of Spatial and Dynamic Designs": "5.3.1How SEENet Architecture Design Helps (Model Analysis). Toinvestigate the contribution of each component in our designedmulti-slot spatial graph convolutions SEConv, we compare SEENetwith the following variants on four datasets in . SEENet-SEC replace the whole SEConv with a classic GCN. SEENet-RS removes spatial RS-AGG for intra-time learning. SEENet-LD removes dynamic SE-Prop for inter-time learning. SEENet-C drops the evolving context of SE-Prop in Eq. (13).It is obvious that other variants of SEENet outperform SEENet-SECand the performance generally decreases when we gradually re-move the graph learning components. In particular, if we replace thetime-aware contextual aggregation with a simple GCN-style func-tion when performing inter-time interactions, we find that SEENet-C gets worse, which confirms that it is beneficial to integrate thespatially evolving context for Trial. Furthermore, SEENet-LD per-forms better than SEENet-RS on Beijing and New York datasetswhile the converse is observed on the other two datasets, prov-ing both spatial and dynamic modeling can play significant rolesacross different scenarios. In summary, the results highlight the im-portance of designing synergistic SEENet architecture to combinegeographical factors and dynamic relationships.",
  ": Parameter analysis on four citywide datasets": "SEENet-SSL w/o pre-training, i.e., removing the whole SE-SSL. SEENet-L w/o the loss of local relational evolving constraint. SEENet-G w/o the loss of global spatial information maximum.As we can see in , there is a consistent performance degra-dation when excluding either global-view loss or local-view loss.SEENet-SSL performs even worse than SEENet-G and SEENet-Lwhen dropping global and local learning objectives at once, show-ing both of them can contribute to model training. The observationverifies that considering global spatial distribution as well as localevolving relationship patterns in a self-supervised learning manneris critical for location relationship inference. We further explore the influence of various important parametersin SEENet. More experimental results are in Appendix A.3.3.5.3.3Coefficients of global and local loss functions. As depictedin (a) and 6(b), we first study the weight of global loss 1and local loss 2 respectively. When increasing the coefficient foreach loss, the results slightly get better and keep stable in general,with the exception that the performance on New York increasesrapidly in the beginning and then remains at high scores. Thisindicates integrating more local evolving relationship informationis necessary for some scenarios. Overall, our collaborative global-local learning makes the model training more expressive and stable.5.3.4Scales of spatially evolving context. We also investigate thenumber of sampled neighbors for capturing critical multi-temporalspatial factors in SE-Prop. (c) shows that the performance ofSEENet gradually improves at first and then declines with neigh-bors growing, which achieves the best at = 5. The reason is thatcommunicating more location neighbors in SE-Prop can providemore informative spatial contexts, while sampling excessive neigh-bors may lead to unexpected homogenization of the propagation.To conclude, moderate fine-grained contextual information canhelp to outperform all baselines in our problem Trial.",
  "CONCLUSION": "In this paper, we provided a new multi-temporal perspective tounderstand the location relationship, which is significant in ur-ban intelligence. In detail, we proposed a spatially evolving GNNframework, named SEENet, to effectively discover multi-temporallocation relationships in urban areas. The designed spatially evolv-ing convolution can capture intra- and inter-time spatial contextswith dynamic influence. To overcome the issue of data sparsity, wealso devised essential self-supervised learning tasks to integrateevolving patterns. Extensive experiments were conducted on fourdatasets to verify the effectiveness of the proposed model.",
  "KDD 23, August 610, 2023, Long Beach, CA, USALi and Zhou, et al": "Sami Abu-El-Haija, Bryan Perozzi, Amol Kapoor, Nazanin Alipourfard, KristinaLerman, Hrayr Harutyunyan, Greg Ver Steeg, and Aram Galstyan. 2019. Mixhop:Higher-order graph convolutional architectures via sparsified neighborhoodmixing. In ICML. PMLR, 2129. Wei Chen, Huaiyu Wan, Shengnan Guo, Haoyu Huang, Shaojie Zheng, Jiamu Li,Shuohao Lin, and Youfang Lin. 2022. Building and exploiting spatialtemporalknowledge graph for next POI recommendation. KBS 258 (2022), 109951. Yile Chen, Xiucheng Li, Gao Cong, Cheng Long, Zhifeng Bao, Shang Liu, WanliGu, and Fuzheng Zhang. 2022. Points-of-interest relationship inference withspatial-enriched graph neural networks. PVLDB 15, 3 (2022), 504512.",
  "Yu Liu, Jingtao Ding, and Yong Li. 2022. Developing knowledge graph basedsystem for urban computing. In SIGSPATIAL. 37": "Yiding Liu, Yulong Gu, Zhuoye Ding, Junchao Gao, Ziyi Guo, Yongjun Bao,and Weipeng Yan. 2020. Decoupled graph convolution network for inferringsubstitutable and complementary items. In CIKM. 26212628. Hui Luo, Jingbo Zhou, Zhifeng Bao, Shuangli Li, J Shane Culpepper, HaochaoYing, Hao Liu, and Hui Xiong. 2020. Spatial object recommendation with hints:When spatial granularity matters. In SIGIR. 781790.",
  "Bishan Yang, Scott Wen-tau Yih, Xiaodong He, Jianfeng Gao, and Li Deng. 2015.Embedding Entities and Relations for Learning and Inference in Knowledge Bases.In ICLR": "Dingqi Yang, Daqing Zhang, Vincent W Zheng, and Zhiyong Yu. 2014. Modelinguser activity preference by leveraging user spatial temporal characteristics inLBSNs. IEEE Transactions on Systems, Man, and Cybernetics: Systems 45, 1 (2014),129142. Yang Yang, Jie Tang, Jacklyne Keomany, Yanting Zhao, Juanzi Li, Ying Ding,Tian Li, and Liangwei Wang. 2012. Mining competitive relationships by learningacross heterogeneous networks. In CIKM. 14321441.",
  "AAPPENDIXA.1Dataset Introduction": "Business-based Relationships. We first use the QueryBJ datasetcollected from Baidu Maps, which contains millions of map searchquery logs from January 2019 to August 2019 in Beijing. Eachquery log provides the users query session with timestamps.Following the works , the two types of relations betweenlocations and are defined as:(1) Users viewed also viewed within a query session;(2) Users viewed then viewed across different sessions.As for the public Foursquare dataset , we collect the check-in data from April 2012 to February 2013 in Tokyo. All visitedlocations of a user are classified into several categorical trips (e.g.,all restaurants visited in a day form a categorical trip). Similarly,following , we have the two kinds of relationships as follows:(3) Users visited also visited within a categorical trip;(4) Users visited then visited across different categories.According to these relationship studies , we refer to (1)and (3) as competitive relationships while the other (2) and (4)are known as complementary relationships. Mobility-based Relationships. For the taxi driving data, thepublic NYCTaxi includes the order records traveling throughoutNew York from January 2015 to June 2015, while the datasetDivvyBike collects bike riding orders from January 2017 to June2017 in Chicago. In this scene, the location can be a bike stationor a region. Each trajectory by taxi or bike includes the pick-upand drop-off locations with timestamps, which connects a pairof locations. After counting the overall records for mobile-basedrelevancy, we label the two meaningful relationships betweenlocation pairs, namely high-flow (top 25% high) and low-flow (top50% high) relationships according to the mobility degree.",
  "A.2Experiment Details": "A.2.1Implementation and setup. We train the model on 24 IntelCPUs and a group of Tesla P40 GPUs. The unified input locationfeatures are initialized with one-hot embedding for generalizedrepresentation learning. For data splitting, we guarantee that thetesting and validation sets Y are absolutely independent of thetraining set Y across all times, meaning that every relationaledge in Y at a certain time will not appear in Y at any time . A.2.2Evaluation Metrics. In inferring location relationships, themodel should be able to accurately rank the relational locationsinstead of only predicting whether the relationships exist or not.Thus, it is important that relevant locations are ranked higherthan irrelevant ones with the ranking metrics MRR and HR. Giventhe test set , we follow these steps for evaluation at each timesegment: (1) For each relational pair (, ,), we first calculate allpairwise scores for relation between and the locations inthe candidate set using the relational-specific prediction function. (2) We sort these locations in descending order and obtainthe ranked list. The ranking index of node is denoted as (i.e., a certain position in the list). (3) If , we consider ita hit (successfully discovering the target location from the top-K locations), otherwise, we consider it a miss. The HR@k metricis defined as the average of total hits over the entire test set ,",
  "A.3Additional Experimental Results": "A.3.1Time-specific Performance Analysis. exhibitsthe multi-temporal relationship prediction results over all timesin a day. The proposed SEENet provides stable performance gainsover major competitive baselines at all time periods, which con-sistently verifies the superiority of our multi-slot spatial learningframework in time-aware predictions. We also observe that mostbaselines perform worse at midnight due to the sparsity of locationrelationships. We observe that the graph at midnight with fewerpeople activities only contains limited environmental informationfor location relationship inference. Moreover, we find that dynamicGNNs (EvolveGCN and ROLAND) can partly alleviate the aboveissue thanks to the capability of involving the relational knowledgefrom the previous time, which agrees with the fact that consideringdynamic relationships is essential and valuable. However, the per-formance is still unsatisfactory. By contrast, our model can achievestable and accurate prediction results at any time, demonstratingthe exhaustive effectiveness of SEENet.",
  ": More parameter analysis on four citywide datasets": "A.3.2Efficiency Analysis. We also conduct the efficiency evalua-tion for the training and inference time. We compare our model withseveral most competitive baselines on the largest Beijing dataset in. The results show that SEENet can be comparably efficientwith other models and will not sacrifice much computation andtraining time to trade for performance. It is worth noting that theinference (s/rank) refers to the total time of ranking all nodes onthe graph for a specific location. When we use SEENet to discoverlocation relationships, inferring the ranking list for one location ona large graph (over 30,000 nodes) takes only 0.25s on average. A.3.3Additional Parameters Analysis. As shown in ,we first present the influence of urban gridding size in the globalspatial information maximum loss, which determines the spatialgranularity for global region pooling. With the growth of the grid-ding size (e.g., the larger region area), the performance of our modelfirst increases and then tends to decrease. The reason is that SEENetneeds a suitable splitting scale for higher-level aggregation accord-ing to different citywide application domains. While the largerregion grid can contain more informative spatial locations, addi-tional redundancies may be introduced for relationship learning.Moreover, we change the another important parameter of SE-SSL,i.e., geographical sampling size in , to investigate the affect ofheuristic negative sampler in (b). The performance im-proves slightly at first and then keep relatively stable as the numberof negative samples grows, verifying that more grid-based negativesamples can enhance the global spatial self-supervised learning.Finally, (c) presents the effect of the size of distance-spacebins . We can observe that our model can stably perform wellwith changing distance bins due to the adaptive ability to learnspatial distances in SEENet."
}