{
  "Abstract": "This paper introduces a versatile and flexible approximation model. This modelis designed for the near real-time prediction of steady turbulent flow within a 3Denvironment. The model uses residual Convolutional Neural Networks (CNNs).This methodology provides immediate feedback, enabling real-time iterationsduring the initial stages of architectural design. Furthermore, this workflow isinverted, offering designers a tool that produces building volumes based on desiredwind flow patterns.",
  "Introduction": "Architectural design is inherently influenced by environmental constraints from its early conceptualstages. During this period, when the forms of buildings and cities are established, informed decisionsregarding sustainable development are critically important. However, design proposals can evolverapidly, making it difficult to provide relevant simulations at a comparable pace. In particular,Computational Fluid Dynamics (CFD) requires intricate geometry preparation and computationallydemanding solutions. This process is not only time-consuming but also conflicts with the speed ofdesign iterations. To improve the integration of CFD in design processes, this work concentrateson employing data-driven flow field predictions. It also leverages approximation using CNNs. Thisapproach aims to overcome the challenges associated with traditional CFD simulations and makethem more accessible for iterative design processes. Prior research has shown encouraging outcomes in the rapid simulation of fluid dynamics and inthe approximation of the Navier-Stokes equations. We emphasize the use of CNNs with residualblocks in architectural contexts within 3D domains. Additionally, we explore the application ofreverse training to forecast architectural volumes. While rapid forward prediction offers considerablepotential for improving sustainable design, the process of using CFD analysis results to directlyinfluence design relies on the designers creativity. There is no straightforward way to inform designchoices other than choosing the most effective design among many proposals. We address this byusing the same CNN model but trained in the opposite direction.",
  "Data Creation and Simulation": "Using a visual programming language and standard Computer-Aided Design (CAD) software, severalgeometries representing urban structure samples were produced. These samples were designed toreplicate common variations in building heights within a city. The widths and depths were alsoconfined to typical minimum and maximum dimensions. Each sample is represented as a 3D meshand has to fit inside a space measuring 256m x 128m x 64m. These meshes are then voxelized with a1-meter resolution. Our dataset comprised 3500 samples in total: 3325 (95",
  "Neural Network Architecture": "Our network architecture follows a U-net structure. It includes eight encoder layers and seven decoderlayers. Each layer integrates a residual block that contains a 3D convolution with stride 2 and 4x4x4filters, along with a 3D convolution with stride 1 and 3x3x3 filters. According to our tests, thesegated blocks improved our results. This was observed when compared to a basic encoder-decoderarchitecture. We utilized concatenated exponential linear units for activation purposes. This fullyconnected CNN has excellent generalization properties for geometries beyond those in the trainingset. It also works well for input data larger than the dimensions of the training samples. This networkcan approximate wind velocity fields three orders of magnitude faster than a CFD solver in a 3Ddomain. The test mean squared error loss showed continuous improvement across 1000 epochs forboth forward and reverse directions. This demonstrates the generalizability of the approach. In thereverse direction, we adjusted the number of output channels to 1. This represents whether a locationis occupied by a building (1) or outside space (0). In contrast, the forward direction has 3 outputchannels, which represent the x, y, and z components of wind direction vectors.",
  "Results": "We implemented a Flask server that allows for interactive prediction using the visual programminginterface of the common CAD software Rhino. This CAD software offers visualization capabilitiesthat were utilized to generate sample images. We present a sample of forward CFD prediction.This visualizes the wind velocity magnitude (calculated using the Frobenius norm of the x, y, andz components). In addition, we present a reverse prediction of building volumes. Yellow indicatesundesirably high wind speed, while blue represents low, preferable wind speed.",
  "Discussion": "Rapid analysis responses are essential in the early conceptual design stages across multiple industries.The demonstrated effectiveness of near real-time prediction indicates that the proposed methodologyhas promising potential applications beyond architecture. The reverse approach directs designers tofocus on the desired outcome, specifically human well-being. This facilitates more efficient use oftime in sustainable design processes. Future research aims to improve the cost function by addingcontinuity equation error and implementing a generative adversarial network. We are also exploringpossibilities for generating multiple building predictions from a single wind flow input.",
  "A Case Study": "We present a designers workflow utilizing our forward and reverse networks. The aim is to designand optimize urban layouts to achieve desired wind flows. This hypothetical site has a bounding boxwidth and depth of 256 meters, with a maximum height of 64 meters. This area is twice the size ofour training dataset, showing the benefit of using a CNN. Our neural network is built with TensorFlow 2.0 and its Keras module. Communication betweenCAD software and TensorFlow is enabled through HTTP requests which are managed by a Flaskserver. Currently, the pre-processing of geometry is the bottleneck, as it needs to be voxelized. Thiscan be improved in the future by using external mesh libraries.",
  "A.6 Discussion": "Future research will focus on the inclusion of interior spaces. Passive cooling is a major factorin minimizing energy use in these spaces. The input for the reverse direction would be improvedif pedestrian comfort, for instance, was used. Our current method only accounts for wind in onedirection. This works in places where a dominant wind direction exists. Areas with variable winddirections would require accounting for multiple directions. The forward network is capable ofpredicting these multiple wind directions and can be combined."
}