{
  "Abstract": "We introduce a novel approach to human-machine interaction, framed as a pictorialgame where artists and a computer collaborate in iterative creative rounds. Thecomputer uses machine learning to partially complete the artwork at each stage,projecting its additions directly onto the canvas, which the artists are then able tomodify or incorporate. This process encourages creative exploration and provokesquestions about the growing relationship between humans and machines.",
  "Introduction": "The ongoing technological advancements are reshaping human-machine interaction, providing newtools for artistic creation while simultaneously prompting contemplation on their effects on humancreativity. Generative Adversarial Networks (GANs) have demonstrated the creative abilities of neural networks,producing aesthetically full paintings. However, in these instances, humans serve as either engineersor curators. Our work introduces a new method of machine utilization, integrating it into the core ofhuman creative processes. While painting, this approach presents humans with different paths andconcepts for their artwork. This concept is approached through a unique interactive framework. The artist duo Tina and Charly have previously investigated interaction through canvas art. To initiatetheir creative work, they select a theme and depict it in dark colors on a white canvas. They thenstart their game. At each round, using a vocabulary of strokes and symbols, Charly anticipates Tinasemotions and thoughts in red, before responding with green strokes on the painting. These roundscontinue until both artists reach an agreement on finishing the painting. The entire process unfolds insilence, with the canvas serving as the sole medium of dialogue. The purpose of our work is to introduce artificial intelligence as a third participant in Tina andCharlys dialogue. The AI initially captures a raw representation of the painting, then processes it topartially complete the work in progress, which it projects back onto the canvas. The artists then havethe freedom to incorporate the machines suggestion in blue, a color that has not been assigned toeither player. The use of different colors allows for the analysis of each players contributions.",
  "Methodology": "The engineered system includes a camera and a projector connected to a computer on a support. Ateach computer round, the system captures an image of the painting and analyzes it to extract thecanvas strokes. This pre-processing is made robust to changes in lighting, ensuring that the interactioncan be used seamlessly in any studio. These strokes then feed into a neural sketcher, which producesnew strokes to be added to the painting. Post-processing is used to project those additions back ontothe canvas. The neural sketcher is a recurrent neural network, based on a recent improvement to the seminal workof previous research. It is trained using a sequence of points and a channel encoding for stroke breaks.The sketcher produces a similar series, which is then converted back into strokes on the original",
  "Discussion": "The artists found the machine strokes to be surprising and suggestive of movements they would nothave made on their own. Some painters have previously expressed how unintended strokes can beevocative. Our installation, where the machine projects completions without physically painting, andthe generative network capabilities, allows this to be explored. Furthermore, the ability to changeparameters, such as the learning data set, provides the artist with more control over their usage of themachine. Our interactive installation can be used by anyone and aims to raise awareness and initiate thoughtabout the interplay between humans and machines. This work highlights the need to make machineshuman-friendly, while also acknowledging how technology changes human behaviors and routines.Tina and Charly felt like they were interacting with a full-body system, which had been designedto simulate human-like painting. They experienced the machine as sometimes restricting, hard tounderstand, and sometimes magical. It infused new dimensions into the painting. The feeling that themachine could be collaborative or limiting is an echo of the role of technologies in our daily lives. From an outsiders perspective, the machine changes their original painting style, both in the shortterm artworks (as seen in ), and on their long-term body of work, inspiring their machine-freepaintings. Even though we have made the machines influence explicit with its blue contributions, theinteraction is not neutral."
}