{
  "Abstract": "Phonological typology, a vital area within linguistic studies, examines the patternsand functions of sounds across the worlds languages. This paper offers an overviewof completed and ongoing experiments utilizing phonological representations,derived from typological databases, in speech processing tasks. It primarily focuseson two lines of inquiry motivated by the need to adapt speech technologies to low-resource languages and dialects. Initially, a framework is presented for evaluatingthe cross-linguistic consistency of phonological characteristics within multilingualphoneme inventories. Subsequently, an outline is given for a method that couldpotentially contribute to the development of future phoneme inventory inductionsystems, highlighting the crucial role of phonological typology in this process.",
  "Introduction": "The field of phonological typology investigates the distribution and functionality of sounds inlanguages globally. Typological databases are instrumental in making generalizations in this domain.These resources are valuable not only for creating probabilistic models of phonological typology butalso for enhancing downstream multilingual NLP, speech technology, and language documentationefforts. This paper summarizes our research involving phonological representations in speech processing,utilizing phonological typology databases. Despite the prevalence of end-to-end approaches inautomatic speech recognition, text-to-speech, and speech-to-speech translation, the integration ofprecise phonological knowledge remains essential in various scenarios. Our research is driven by the goal of extending speech technologies, which still rely on phonologicalrepresentations, to under-resourced languages and dialects. We first review a framework designed toanalyze the cross-linguistic consistency of phonological features in multilingual phoneme inventoriesobtained from cross-lingual typological databases. We then propose a preliminary method that mayact as a foundational element in a future phoneme inventory induction system, emphasizing thesignificance of phonological typology in such an approach.",
  "Multilingual Phoneme Inventories": "Traditionally, a phoneme is defined as a theoretical concept specific to a single language. Applyingphonemes and their feature encodings across languages presents a challenge: its unclear whether alldistinctive features (DFs) will be relevant or applicable in a multilingual phoneme inventory takenfrom a typological database. If DF representations were phonetic instead of phonemic, and acousticrather than articulatory, one might anticipate a strong correlation between DFs and the acousticsignal. However, in practical multilingual contexts, these representations are frequently influenced byphonemic considerations due to the accessibility of phonemic inventories and transcriptions. Our approach was straightforward: a phonemic contrast is deemed consistent across languages if itcan be reliably predicted in a binary classification task on withheld languages. This problem involvesa segment of a speech signal and a label (e.g., front vowel vs. back vowel). A classifier is trained on a multilingual, multi-speaker dataset, excluding some languages for later assessment. In cases wherecross-linguistic consistency was lacking, we enhanced the method by basing the representation oncontextual phonological knowledge provided as DFs, excluding the contrast being tested. Our experiments involved languages from the Dravidian, Indo-European, and Malayo-Polynesianfamilies, with phoneme inventories sourced from a phonological database. The results are varied. Anexperiment designed to predict contrasts in unvoiced labial consonants between specific languagesyielded reliable predictions across languages. Similar consistency was observed for contrasts betweenfront and back vowels, as well as vowel height and continuant manner of articulation distinctions.Negative outcomes include the cross-lingual prediction of retroflex consonants between languagefamilies: a predictor trained on Dravidian languages cannot accurately predict retroflex consonants inanother language, and vice versa. The detection of aspiration was similarly inconsistent. Incorporatingother contrasts as contextual features did not result in significant improvement for these complexcases. Our research is partly motivated by a persistent question: Can this methodology assess the cross-linguistic validity of existing phoneme inventories given available data? For example, among theMalayo-Polynesian languages studied, only one has retroflex consonants, acquired from loanwordsfrom other language families. Different phoneme inventories exist for this language, one of whichincludes retroflex plosives, while another omits them. Determining which representation is superiorin a multilingual pronunciation model remains an open issue.",
  "Towards Phonology Induction": "Our current research efforts are directed towards the induction of phoneme inventories for languagesthat lack the standard resources needed for speech model training. This task aligns with other workin zero-resource subword modeling. Existing unsupervised methods for discovering acoustic unitsderive acoustic-phonetic and latent auditory-like representations, but the typological accuracy ofthese representations is uncertain. Our initial work with \"universal\" multilingual phoneme recognizers was not successful. This wasmainly because the limited training data and the lack of language models to guide the search frequentlyled to unreliable phoneme inventory recovery even for closely related dialects, for instance, in tryingto identify the phoneme inventory of one dialect after being exposed to two others. An improvedstrategy involves incorporating language identification and phonological typology into the phonemerecognizer. Using an accurate language identification model, the phoneme inventories of the mostclosely related languages can be employed to narrow down the potential phonemic hypotheses for anew, previously unseen language or dialect. We are currently adapting the phonological contrast predictor methods from the previous section forphonology induction tasks. Several approaches for detecting phonemic features in continuous speechare known, some relying solely on signal processing and others that are model-based. At a basiclevel, the output of such predictors represents speech as parallel, asynchronous streams of articulatoryfeatures. More complex models that utilize the structure of articulation, feature geometry, and othercorrelations between features are also feasible. In these methods, cross-linguistic phonologicaldatabases are crucial for not only integrating various features into phonemes but also for validatingwhich combinations of hypothesized phonemes are acceptable based on known phoneme inventories.Furthermore, additional phonological insights from other typological resources can be incorporated ifthey can be reliably extracted from the speech signal."
}