{
  "Abstract": "We introduce DSDS: a cross-lingual neural part-of-speech tagger that learns fromdisparate sources of distant supervision, and realistically scales to hundreds of low-resource languages. The model exploits annotation projection, instance selection,tag dictionaries, morphological lexicons, and distributed representations, all in auniform framework. The approach is simple, yet surprisingly effective, resulting ina new state of the art without access to any gold annotated data.",
  "Introduction": "Low-resource languages lack manually annotated data to learn even the most basic models suchas part-of-speech (POS) taggers. To compensate for the absence of direct supervision, work incrosslingual learning and distant supervision has discovered creative use for a number of alternativedata sources to learn feasible models: However, only one or two compatible sources of distant supervision are typically employed. Inreality severely under-resourced languages may require a more pragmatic take what you can getviewpoint. Our results suggest that combining supervision sources is the way to go about creatingviable low-resource taggers.",
  "We propose a method to strike a balance between model simplicity and the capacity to easily integrateheterogeneous learning signals": "system is a uniform neural model for POS tagging that learns from disparate sources of distantsupervision (DSDS). We use it to combine: i) multi-source annotation projection, ii) instanceselection, iii) noisy tag dictionaries, and iv) distributed word and sub-word representations. Weexamine how far we can get by exploiting only the wide-coverage resources that are currently readilyavailable for more than 300 languages, which is the breadth of the parallel corpus we employ. DSDS yields a new state of the art by jointly leveraging disparate sources of distant supervision in anexperiment with 25 languages. We demonstrate: i) substantial gains in carefully selecting high-qualityinstances in annotation projection, ii) the usefulness of lexicon features for neural tagging, and iii)the importance of word embeddings initialization for faster convergence.",
  "We apply the approach by where labels are projected from multiple sources and then decoded throughweighted majority voting with word alignment probabilities and source POS tagger confidences. We": "exploit their widecoverage Watchtower corpus (WTC), in contrast to the typically used Europarl data.Europarl covers 21 languages of the EU with 400k-2M sentence pairs, while WTC spans 300+ widelydiverse languages with only 10-100k pairs, in effect sacrificing depth for breadth, and introducing amore radical domain shift. However, as our results show little projected data turns out to be the mostbeneficial, reinforcing breadth for depth. While selected 20k projected sentences at random to train taggers, we propose a novel alternative:selection by coverage. We rank the target sentences by percentage of words covered by wordalignment from 21 sources and select the top k covered instances for training. In specific, we employthe mean coverage ranking of target sentences, whereby each target sentence is coupled with thearithmetic mean of the 21 individual word alignment coverages for each of the 21 source-languagesentences. We show that this simple approach to instance selection offers substantial improvements:across all languages, we learn better taggers with significantly fewer training instances. Dictionaries. Dictionaries are a useful source or distant supervision. There are several ways toexploit such information: i) as type constraints during encoding, ii) to guide unsupervised learning,or iii) as addiional signal at training. We focus on the latter and evaluate two ways to integratelexical knowledge into neural models, while comparing to the former wo: a) by representing lexiconproperties as n-hot vector (e.g., if a word has two properties according to lexicon src, it resultsin a 2-hot vector, if the word is not present in src, a zero vector), with m the number of lexiconproperties; b) by embedding the lexical features, i.e., is a lexicon src embedded into an /-dimensionalspace. We represent as concatenation of all embedded m properies of length [, and a zero vectorotherwise. Tuning on the dev set, we found the second embedding approach to perform best, andsimple concatenaion outperformed mean vector representations. We evaluate two dictionary sources, motivated by ease of accessibility to many languages: WIK-TIONARY, a word type dictionary that maps tokens to one of the 12 Universal POS tags; andUNIMORPH, a morphological dictionary that provides inflectional paradigms across 350 languages.For Wiktionary, we use the freely available dictionaries from The size of the dictionaries ranges froma few thousands (e.g., Hindi and Bulgarian) to 2M (Finnish UniMorph). Sizes are provided in , 1st columns. UniMorph covers between 8-38 morphological properties (for English and Finnish,respectively). Word embeddings. Embeddings are available for many languages. Pre-initialization of offersconsistent and considerable performance improvements in our distant supervision setup ().We use off-the-shelf Polyglot embeddings, which performed consistently better than FastText.",
  "Experiments": "Baselines. We compare to the following weaklysupervised POS taggers: AGIC: Multi-sourceannotation projection with Bible parallel data DAS: The label propagation approach by over Europarldata. GARRETTE: The approach by that works with projections, dictionaries, and unlabeled targettext. LI: Wiktionary supervision. Data. Our set of 25 languages is motivated by accessibility to embeddings and dictionaries. In allexperiments we work with the 12 Universal POS tags. For development, we use 21 dev sets of theUniversal Dependencies 2.1. We employ UD test sets on additional languages as well as the test setsof to facilitate comparisons. Their test sets are a mixture of CoNLL and HamleDT test data, and aremore distant from the training and development data. Model and parameters. We extend an off-theshelf state-of-the-art bi-LSTM tagger with lexiconinformation. The code is available at: https:// github.com/bplank/bilstm-aux. The parameter l=40was set on dev data across all languages. Besides using 10 epochs, word dropout rate (p=.25) and40-dimensional lexicon embeddings, we use the parameters from For all experiments, we averageover 3 randomly seeded runs, and provide mean accuracy. For the learning curve, we average over 5random samples with 3 runs each.",
  "Data selection. The first take-away is that coverage-based instance selection yields substan-": "tially better training data. Most prior work on annotation projection resorts to arbitrary selection;informed selection clearly helps in this noisy data setup, as shown in (a). Training on 5kinstances results in a sweet spot; more data (10k) starts to decrease performance, at a cost of runtime.Training on all WTC data (around 120k) is worse for most languages. From now on we consider the5k model trained with Polyglot as our baseline (, column 5k), obtaining a mean accuracy of83.0 over 21 languages. Embeddings initialization. Polyglot initialization offers a large boost; on average +3.8% absoluteimprovement in accuracy for our 5k training scheme, as shown in (b). The big gap inlow-resource setups further shows their effectiveness, with up to 10% absolute increase in accuracywhen training on only 500 instances. Lexical information. The main take-away is that lexical information helps neural tagging, andembedding it proves the most helpful. Embedding Wiktionary tags reaches 83.7 accuracy on average,versus 83.4 for n-hot encoding, and 83.2 for type constraints. Only on 4 out of 21 languages aretype constraints better. This is the case for only one language for n-hot encoding (French). The bestapproach is to embed both Wiktionary and Unimorph, boosting performance further to 84.0, andresulting in our final model. It helps the most on morphological rich languages such as Uralic. On the test sets (, right) DSDS reaches 87.2 over 8 test languages intersecting and. It reaches86.2 over the more commonly used 8 languages of, compared to their 83.4. This shows that ournovel soft inclusion of noisy dictionaries is superior to a hard decoding restriction, and includinglexicons in neural taggers helps. We did not assume any gold data to further enrich the lexicons, norfix possible tagset divergences.",
  "Discussion": "Analysis. The inclusion of lexicons results in higher coverage and is part of the explanation for theimprovement of DSDS; see correlation in (a). What is more interesting is that our modelbenefits from the lexicon beyond its content: OOV accuracy for words not present in the lexiconoverall improves, besides the expected improvement on known OOV, see (b). More languages. All data sources employed in our experiment are very high-coverage. However, fortrue low-resource languages, we cannot safely assume the availability of all disparate informationsources. presents results for four additional languages where some supervision sourcesare missing. We observe that adding lexicon information always helps, even in cases where only1k entries are available, and embedding it is usually the most beneficial way. For closely-relatedlanguages such as Serbian and Croatian, using resources for one aids tagging the other, and modernresources are a better fit. For example, using the Croatian WTC projections to train a model forSerbian is preferable over in-language Serbian Bible data where the OOV rate is much higher. How much gold data? We assume not having access to any gold annotated data. It is thus interestingto ask how much gold data is needed to reach our performance. This is a tricky question, as trainingwithin the same corpus naturally favors the same corpus data. We test both in-corpus (UD) and out-of-corpus data (our test sets) and notice an important gap: while in-corpus only 50 sentencesare sufficient, outside the corpus one would need over 200 sentences. This experiment was done for asubset of 18 languages with both inand out-ofcorpus test data. Further comparison. In we directly report the accuracies from the original contributions byDAS, LI, GARRETTE, and AGIC over the same test data. We additionally attempted to reach thescores of LI by running their tagger over the data setup. The results are depicted in as mean accuracies over EM iterations until convergence. We show: i) LI peaks at 10 iterationsfor their test languages, and at 35 iterations for all the rest. This is in slight contrast to 50 iterationsthat recommend, although selecting 50 does not dramatically hurt the scores; ii) Our replication falls223c5 points short of their 84.9 accuracy. There is a large 33-point accuracy gap between the scoresof, where the dictionaries are large, and the other languages in , with smaller dictionaries. Compared to DAS, our tagger clearly benefits from pre-trained word embeddings, while theirs relieson label propagation through Europarl, a much cleaner corpus that lacks the coverage of the noisierWTC. Similar applies to as they use 1-5M near-perfect parallel sentences. Even if we use much : Results on the development sets and comparison of our best model to prior work. LEX: Size(word types) of dictionaries (W: Wiktionary, U: UniMorph). TC: type-constraints using Wiktionary;(embedded Wiktionary tags), DSDS: our model with ;. Results indicated by use W only. Best resultin boldface; in case of equal means, the one with lower std is boldfaced. Averages over languagefamilies (with two or more languages in the sample, number of languages in parenthesis).",
  "Related Work": "Most successful work on low-resource POS tagging is based on projection, tag dictionaries, annotationof seed training data or even more recently some combination of these, e.g., via multi-task learning.Our paper contributes to this literature by leveraging a range of prior directions in a unified, neuraltest bed. Most prior work on neural sequence prediction follows the commonly perceived wisdom that hand-crafted features are unnecessary for deep learning methods. They rely on end-to-end training withoutresorting to additional linguistic resources. Our study shows that this is not the case. Only few priorstudies investigate such sources, e.g., for MT and for POS tagging use lexicons, but only as n-hotfeatures and without examining the cross-lingual aspect. : Results for languages with missing data sources: WTC projections, Wiktionary (W), orUniMorph (U). Test sets (TEST), projection sources (PROJ), and embeddings languages (EMB) areindicated. Comparison to TnT trained on PROJ. Results indicated by use W only.",
  "Conclusions": "We show that our approach of distant supervision from disparate sources (DSDS) is simple yetsurprisingly effective for low-resource POS tagging. Only 5k instances of projected data paired withoff-the-shelf embeddings and lexical information integrated into a neural tagger are sufficient to reacha new state of the art, and both data selection and embeddings are essential components to boostneural tagging performance."
}