{
  "Abstract": "Short-range forecasting of rain or snow, known as precipitation nowcasting, is typically displayed on geographicalmaps by weather services for up to a 2-hour timeframe. Current methods for precipitation nowcasting predomi-nantly use the extrapolation of ground-based radar observations, employing techniques like optical flow or neuralnetworks. However, the effectiveness of these methods is geographically restricted to areas surrounding radarinstallations. This paper introduces a novel precipitation nowcasting technique that utilizes geostationary satelliteimagery. This method has been integrated into the Yandex.Weather precipitation map, which includes an alertsystem with push notifications for Yandex ecosystem products. The integration of satellite imagery significantlybroadens the coverage area, marking a step towards developing a comprehensive global nowcasting service.",
  "Introduction": "Weather conditions significantly impact the daily routines and planning of urban populations. Similar to how ancient humansrelied on environmental cues for hunting, modern individuals adjust their daily and leisure activities based on the likelihood ofrain or cloud cover. Weather forecasting services provide essential data, including temperature, precipitation intensity and type,cloudiness, humidity, pressure, and wind conditions. These services offer current weather updates, short-term predictions up to 2hours (nowcasting), medium-range forecasts up to 10 days, and long-range predictions spanning several months. A crucial component of weather services is the precipitation map, which combines radar data with neural network-based, veryshort-term precipitation forecasting to deliver a detailed map of anticipated precipitation for the next two hours, updated every 10minutes. This feature enables personalized, user-friendly notifications, such as alerts about impending rain. The popularity of thisfeature is evident, as it significantly influences user engagement and reliance on weather services. The information from the precipitation map is used to refine current weather condition reports (e.g., sunny, cloudy, rainy) on the mainweather website. Additionally, partners and offline users, including radio and television, depend on this data, effectively doubling theaudience for the precipitation nowcasting product. Traditional weather forecasting, which involves numerical modeling of the atmosphere, cannot accurately predict exact rain locationson short time scales. For instance, it struggles to determine which part of a city will be affected by rain within the next hour.Moreover, traditional methods provide hourly updates, making it difficult to pinpoint brief periods without rain during short, intenseprecipitation events. People often need straightforward answers to simple questions like when it will rain or stop raining, requiringspecific predictions such as \"heavy rain will start in 10 minutes and last for 30 minutes.\" Conventional numerical weather prediction (NWP) models are limited in their ability to forecast precipitation events at specificlocations and times. Radar extrapolation products are effective for the first couple of hours but fail to predict precipitation accuratelydue to physical processes. Consequently, the current trend in nowcasting is to merge high-resolution radar data with traditional NWPmodels. However, radar-based products are limited by the location of radar installations and are not easily scalable. Radars are costly, theirinstallation requires governmental and public approval, and their operation needs trained personnel. Coverage is particularly sparsein large, unevenly populated countries like Russia, where many remote areas lack the necessary infrastructure. Similar challengesexist in many developing countries that need weather services but lack the infrastructure for radar networks. The objective of this research is to develop and implement a practical system for precipitation nowcasting that relies on satelliteimagery and NWP products. The goal is to replicate the precipitation fields obtained from radar using satellite data and then toprovide nowcasting over a much larger area using a similar predictive model. The systems effectiveness is validated by comparingpredicted precipitation with data from ground-based weather stations. The primary focus areas with limited radar coverage are theSiberian and Ural federal districts of Russia, which have a combined population of approximately 30 million.",
  "Precipitation detection": "The global and continuous coverage offered by geostationary satellite imagery makes it a highly desirable data source for precipitationnowcasting algorithms. Since satellites do not directly observe rainfall, precipitation data must be extracted using heuristic ormachine learning methods. This extraction can be framed as either precipitation estimation (regression) or precipitation detection(binary classification). This paper concentrates on the binary classification approach to precipitation detection. The interaction of light with the atmosphere, specifically absorption and scattering, is governed by established physical principles.These principles can be used to develop heuristics for detecting precipitation. One such implementation is the multi-sensorprecipitation estimate (MPE), which is, however, limited to detecting convective rain and may produce inaccurate results inareas with other forms of precipitation. This limitation is particularly significant in middle and high latitudes, where convectiveprecipitation is predominantly a summer phenomenon resulting from surface heating, leading to the formation of cumulonimbusclouds and heavy rainfall. During much of the year, frontal precipitation, driven by cyclonic movements and interactions betweenwarm and cold fronts, is more common. The MPE algorithm often fails to capture these frontal precipitation events. A more advanced physics-based heuristic is the precipitation properties (PP) algorithm, which integrates NWP model data, cloudphysical properties, and satellite measurements. This algorithm uses radar observations to calibrate its parameters. However, becauseit relies on satellite observations at visible wavelengths to determine cloud properties, it can only retrieve precipitation data duringdaylight hours. Machine learning techniques, including decision trees, neural networks, and SVMs, have been evaluated for precipitation detection.However, these studies often used pixel-wise data splits for training and testing, which may lead to overfitting due to neglectingthe spatial and temporal smoothness of atmospheric phenomena. While these studies examined day, twilight, and night conditionsseparately, with the best results during the day, a more sophisticated method using a fully-connected stacked denoising autoencoderhas also been applied to precipitation detection. Although the autoencoders unsupervised training helps mitigate overfitting, there isno comparison with other architectures. From a machine learning perspective, precipitation detection is similar to semantic segmentation, where a multichannel image isinput, and each pixel is assigned an output label. Convolutional neural networks have become the standard for semantic segmentationin recent years, making them a natural choice for precipitation detection as well. Convolutional neural networks have been effectively used in various satellite image processing tasks, such as road and buildingdetection. Despite numerous public challenges that have advanced the field, the range of architectures used for aerial imageprocessing remains narrower compared to those used for semantic segmentation datasets like Microsoft COCO or Cityscapes. Acommon issue in these datasets is the presence of objects of the same class at different scales, which has led to the developmentof multiscale approaches. However, these approaches are less applicable to precipitation detection and other satellite imagerytasks, as the distance between the sensor and the Earths surface is usually known. Consequently, simpler models like UNet andfully-convolutional ResNet remain relevant.",
  "Nowcasting": "Upon completing the reconstruction of the precipitation field in the area of interest, a separate algorithm is employed to forecast futureprecipitation fields based on several consecutive reconstructed fields. Two options are considered for this algorithm: extrapolationwith optical flow, as used for frame rate conversion, and a convolutional neural network previously developed for radar dataprediction. The network consists of a sequence of blocks, each modeling the extrapolation process with optical flow via a spatialtransformer layer. Although the neural networks prediction mechanism is intentionally similar, end-to-end learning on real datatheoretically allows it to surpass the performance of simpler algorithms. While the neural network approach was found to be superiorin the single radar setting, preliminary experiments did not show the same success with composited radar images and satellite data.Despite the optical flow approach being simpler and not requiring retraining with the introduction of new data sources, it is believedthat neural nowcasting remains promising and could outperform simpler techniques with proper tuning of the network architectureand training regimen.",
  "Data Sources": "Precipitation nowcasting imposes distinct data requirements compared to Numerical Weather Prediction (NWP), including highspatial and temporal resolution, direct rainfall measurement, and global coverage. Since no single source can fulfill all theserequirements, it is necessary to combine multiple data sources. Weather stations provide direct precipitation observations, typically measuring accumulated precipitation every 12 hours accordingto the SYNOP protocol. Although many stations report more frequently, usually every 3 hours, this frequency is insufficient fornowcasting due to the lack of detailed spatial and temporal data needed to generate high-resolution precipitation fields. Radar observations are the primary source of high-resolution precipitation data. The Russian network of DMRL-C radars, operatedby Roshydromet, uses C-band Doppler technology to measure raindrop reflectivity and radial velocity. Each radar covers a circulararea with a radius of up to 250 km and 10 km above the ground, with accuracy diminishing with distance. The radar echo can beconverted to surface precipitation using the Marshall-Palmer relation. The resulting precipitation field has a resolution of 2 x 2 km,with scans repeated every ten minutes. However, radar coverage is limited, especially outside densely populated areas of Europe andNorth America, with most Russian radars located in the western part of the country. Low Earth orbit satellites equipped with radars and sensors provide another source of precipitation measurements. These satellitesscan a narrow band beneath their orbital path, offering global coverage in the sense that every location within a certain latitude rangeis eventually scanned. However, the time between consecutive passes of a single satellite can be quite long. The Global PrecipitationMeasurements (GPM) mission, operated by NASA and JAXA, uses a constellation of about 10 operational satellites to provideglobal precipitation coverage from 65S to 65N with a 3-hour temporal resolution. Geostationary satellites are widely used for weather observation. Positioned 35,786 km above the equator, these satellites match theEarths rotation, allowing continuous monitoring of a large area. However, at such altitudes, the only feasible instrument for cloudand precipitation detection is a high-resolution imager that captures visible and infrared spectrum snapshots. Accurately detectingprecipitation from these images is challenging. Previous studies on this topic have not achieved the accuracy needed for user-facingproducts that aim to alert users about precipitation within 10 minutes. This study uses data from the Meteosat-8 satellite, operated by EUMETSAT, positioned over the Indian Ocean at 41.5 longitude,covering the western part of Russia and Europe. The SEVIRI instrument on Meteosat-8 scans the Earths surface in 12 channels,with a spatial resolution of 3 km per pixel and a full scan time of 15 minutes.",
  "The data preparation process involves several steps aimed at minimizing the discrepancies between different data domains": "Radar data preprocessing begins by discarding radar observations taken beyond 200 km from the radar, as these are deemedunreliable. Subsequently, observations from various radars are consolidated onto a single map, resolving any conflicts betweenradars with overlapping coverage areas. Due to frequent false negatives in radar observations, the maximum value between two datapoints is used for aggregation. Finally, radar observations are binarized using three thresholds: 0.08 mm/h for light rain, 0.5 mm/hfor moderate rain, and 2.5 mm/h for heavy rain. Satellite images and radar observations are remapped onto a uniform grid using an equirectangular projection. Given the obliqueobservation angles and the fact that precipitation can occur up to 2 km above the ground, there can be a parallax shift of up to 3pixels between radar and satellite data. However, in practice, accurately estimating precipitation height is complex, and accountingfor parallax did not improve the alignment. Satellite and radar data have different observation frequencies: satellite images are available every 15 minutes, while radar imagesare available every 10 minutes. To align these data sources temporally, a frame rate conversion is implemented using opticalflow interpolation. The goal is to match the radar datas temporal resolution, so satellite data is converted to a 10-minute time step. However, optical flow cannot be directly computed from satellite imagery due to the presence of both transient atmosphericphenomena and the permanent underlying relief. This issue is circumvented by performing precipitation detection before the opticalflow step, allowing the optical flow to be computed directly from the precipitation detection results, which do not include the relief.",
  "It(r) = aIt0(r + bu01) + bIt1(r + au10)": "where a =t1tt1t0 and b =tt0t1t0 are coefficients dependent on the time of the generated image, and u01 and u10 are the forward andbackward optical flows, computed using the TV-L1 optical flow algorithm implemented in OpenCV. Roshydromet radars record the timestamp at the end of a scan, whereas EUMETSAT marks the start. Since the Earth is scanned in aseries of lateral sweeps starting from the south, the actual observation time varies with latitude, with northern latitudes observedlast. The combined discrepancy between timestamps can reach 20 minutes. Experimental validation has confirmed that this valuecorresponds to the minimum discrepancy between radar data and precipitation field reconstruction. Additional features are incorporated into the satellite imagery to enhance the signal. The Global Forecast System (GFS) modelis used to provide a comprehensive description of atmospheric conditions, including physical properties not easily inferred fromsatellite imagery. The GFS model produces forecasts four times a day with a spatial resolution of 0.25 x 0.25 and temporalintervals of 3 hours. Key fields from GFS include convective precipitation rate, cloud work function, cloud water, precipitable water,and convective potential energy at different levels. Additionally, a topography map and solar altitude data are included as features.",
  "Training": "A modified UNet architecture is employed as the primary model for precipitation detection. Through testing, it was determinedthat using 5 upsample/downsample blocks, compared to the original 4, yields the best results on the validation dataset. The modelutilizes standard 3x3 convolutions, 2x2 pooling, and batch normalization layers. The number of channels begins at 16 in the firstblock and doubles with each downsampling step. This reduced number of channels helps mitigate overfitting and accelerates trainingand evaluation. The network is trained for 250,000 iterations using the Adam algorithm, with an initial learning rate of 104, which is reduced by afactor of 10 after 200,000 iterations. The addition of the Dice loss to the standard binary cross-entropy improves the F1 scores forthe converged model. Training is performed using the Keras framework with a TensorFlow backend and Horovod for multi-GPUlearning.",
  "The model is trained to detect three levels of precipitation (light, medium, and heavy) simultaneously, producing three output mapswith binary classification loss applied to each map independently": "Typically, precipitation estimation algorithms are developed separately for day, twilight, and night conditions. However, thisseparation is challenging for machine learning in high-latitude zones due to the underrepresentation of night during summer and dayduring winter, making it difficult to compile a balanced dataset. Therefore, a single model is trained, with solar altitude provided asan additional input feature. Overfitting is a significant concern due to the limited geographical area of the dataset. The network can easily memorize the relief,which is visible in some wavelengths even if not explicitly provided as a feature, and use it to overfit on ground truth labels withinthe radar coverage areas. Moreover, memorizing the correspondence between geographical location and output labels may cause themodel to ignore areas outside radar coverage, leading to constant output in these regions. This contradicts the goal of extendingnowcasting beyond radar coverage. To address this, the model is trained on relatively small data crops (96x96 pixels). Due to the large number of channels in the input data, which is atypical for computer vision problems, data loading can be slow. Tomanage this, a small batch of 5 multi-channel images (including all additional features) is loaded, and each image is then cropped 10times at random locations.",
  "Several approaches are compared:": "- **UNet with GFS**: The UNet architecture with a complete set of features, trained as described earlier. - **UNet w/o GFS**: Thesame UNet approach without GFS features. - **Pointwise**: A neural network with two convolutional layers using 1x1 convolutions,equivalent to a pointwise perceptron model. GFS features are not used in this model. - **PP and MPE**: Physics-based algorithms(Precipitation Properties and Multi-sensor Precipitation Estimate). Given that PP and MPE algorithms are designed for daylight conditions, the metrics are also averaged separately for day, night, andtwilight periods. The neural network approaches consistently outperform the physics-based methods across all time periods andmetrics. The generally poor performance of PP and MPE in these experiments may be due to their tuning for predicting convectiverainfall aggregated over extended periods, which does not align with the requirements of this service. The pointwise models performance falls between that of UNet and the physics-based approaches. Since it is trained on radar data, itdetects similar types of precipitation and performs well during testing. The UNet architectures superiority over the pointwise model likely stems from its ability to gather information from a largereceptive field. While precipitation reconstruction does not require the same extent of multiscale data processing as many semanticsegmentation tasks, the interconnectedness of adjacent atmospheric locations makes a large receptive field beneficial for precipitationdetection.",
  "Post-Launch Performance": "Although the satellite-based rain detection model was trained to match radar fields, its reception by users was uncertain. A/B testingalone was insufficient to evaluate the products performance, as it was essentially a new feature for several regions of Russia andcould be well-received initially even if the map quality was low. Therefore, the performance of the new precipitation map wasassessed using ground station data. While the optimal metrics for a user-facing precipitation prediction algorithm are still debated,there was evidence of the nowcasting products popularity, and the aim was to replicate the properties of the radar-based precipitationmap using satellite data. Specifically, the radar data differs from longer-term forecasts based on proprietary Meteum technology inhaving higher accuracy and lower systematic error rates (precipitation imbalance) at the cost of a lower F1 score when compared toground station weather observations. The same comparison strategy was used to evaluate the performance of the new satellite-basedrain detection algorithm over the federal districts of Russia. Results showed that while the accuracy of the satellite-based product islower than that of radar, it is still better than traditional forecasts, with precipitation imbalance and F1 scores similar to those forradar. It is important to note that the radar located in Siberia was used only for verification at this stage; its data was not included inthe training dataset. This comparison allows for evaluating precipitation detection quality in regions without radar observation. This result confirmed the success of the new rain map. Additionally, A/B testing on users showed a statistically significant increasein daily active users (DAU) in areas where the rain map was previously unavailable (Siberia and Ural regions), justifying its rolloutin late September.",
  "Conclusion": "A precipitation nowcasting system has been developed, implemented, and launched, utilizing both ground-based radar observationsand geostationary satellite imagery. The system employs advanced machine learning algorithms and incorporates the physicalproperties of the atmosphere and ground surface based on NWP models. The inclusion of satellite data enables nowcasting for areasnot covered by ground-based radars, achieving quality comparable to traditional radar-based nowcasts.",
  "MPE0.190.220.210.21PP0.320.310.270.30Pointwise0.540.480.410.48U-Net w/o GFS0.650.550.490.56U-Net with GFS0.670.600.540.60": "Currently, the system is limited to the region centered on European Russia within the Meteosat-8 field of view. Compared to previoussolutions, the potential audience has been expanded from approximately 70 million to 300 million people, based on coverage areaand population density. The approach can be extended to the rest of the Meteosat-8 coverage area. Scaling the technology to othergeostationary satellites with similar measurement systems, such as Himawari and GOES, offers the possibility of providing globalprecipitation nowcasting and alerting services worldwide. However, differences in weather patterns across geographical regions willlikely necessitate retraining the detection model and adjusting the set of input features. One encountered problem is the sharp edge between radar and satellite data. This stationary edge on the weather map can confuseusers, indicating the need for more sophisticated data fusion techniques. Experiments with image blending to erase conflictingobservations along the border and inpainting the missing parts have been conducted."
}