{
    ". Illustration of detecting and tracking compact dronesusing a single low-cost sparse LiDAR to identify threats": "can detect ut its data sparse lon ranes. Ingeneral, is no perfec drone detecti. work am o accurately detect does egadless signal autonomy at altitudes manual opertion. wepefor globallocal to xclude argestatic obcts. Then, we refinesing spatiotepo-ra desity and attrbutes to moving targets ndisolte UAV trajetoy. Finally, we useline fitting toconstruct UAVs sptia trajector, detectioaccuracy, noise nd elimnating irrelevant datainsihts into drone ovements. main contributions of our wrk are ollows:.",
    "Shenghai Yuan, Han Wang, and Lihua Xie, Survey on localizationsystems and algorithms for unmanned systems, Unmanned Systems,vol. 9, no. 02, pp. 129163, 2021": "Thin-Minh Nguye, Muqing Shenghai Yuan, Yng Lyu,hien Hoang Ngyn,and Lih Xie, Vial-fsion: A sesr fuson appoach, IEE Transactions on 38, no. Sahaj K Mistry, Shreyas Cattejee, Ajeet K Verma, Vinit Jahetiya,Badr N Subudhi, and Sunil Jaiswal,Drone-vs-bird:using yov7 with traer,i IASSP - 2023 Conference on Speech and Sigal Processig(ICASSP, 2023. Angelo Alesio Fascista, Sommer, Arne Schuman,AnastasioDmou, Dimitrios Zarpalas, and Shara, Drone-vs-bird etecton challenge at icassp203, in 2023IEEE International Conference on Acoustis, Seech ad SiglProcessing (ICASSP), 2023. 2, p. 202.",
    "Spatio-Temporal Analysis: Our spatio-temporal voxeland density analysis method, with a scoring mecha-nism, isolates the correct trajectory point set": "Persnal use of this material is permitte. Extensie bnchmarke various moalities different tovalidatete perfomance of the te bst knowledge, this i the first benchmark of kindfor Ati-UV Thi paper been accepted * \"S for at IEEEInternatonal Conference on coustics, Speech, and Procesing 2025. Permission fom IEEE mus be for ther.",
    "The proposed solution demonstrates robust performance un-der various lighting conditions, as shown in table 1. Tradi-tional supervised LiDAR-based methods often expect dense": "Visual-ased apoaches perform wel uing the daywith denser sampling oint but exhibitsigificant perfor-mace drop at night. Audo-sd ethods how consistenprformance day and nigt, * \"S but the overall * \"S acuracy is ow. This shws that i is practical solution fr arlywaring appliationsof UAVs. data with large obect sizes and end up with som of the worstprfomance due o sparse LiDAR daareflecte bycompactUAs.",
    ". Global-Local Point Set clusterings": "Let F denote a LiDAR frames, with f de-notng the nmbr f rames. P rpresents aset of 3D pointsfrom singlescan in F. The number of points in set P card .denotes cluster * \"S subset) of fromP and the density points denots the voelsof set * \"S of For local epresentation, represents set ofpoints P witin the i-th frame Fr gobal represen-tation, j denotes frame sequence from frame i to frame.",
    "j. CkP| ji Fdenotes the k-th category the": "afte the pots fromF. And V C) indictes the sizethe vxel occupied bycluster C in the space.",
    ". Scoring Mechanism and Trajectory Prediction": "For movin t positios the cange frames a lowe alinment compared hat oftationary We a mechanism basedon tese denity and voxel shifts, uing logarithmic fnctionto stabilize and scale * \"S voel oU. We define voxel coincidence score fo k btweenlocal poit set fame C and * \"S (P|j)",
    "ABSTRACT": "Copact UAV systes, while avancing livey ureil-lance, pose sgnificant ecurity callenges to which hinders detectioby traitonal method. Our segments point foreground and background, analzes spatialteporaldata, and employs scoring mechanism enhance detectionaccuacy. Tested on public dataset, slutio plae4thi the 224 UG2+ dmonstrtingts practicalWe plan to ope-soce alle-signs, data the research * \"S community @github. com/lianghanfang/UnLiDAR-UAV-Est.",
    ". RELATED WORKS": "Motion-assisted MAV detection integrates motion andappearnce fixed and Two-stage segmentation andfeature suerresolution but gap-ple with like mtion blur and ocusions complexsettings LDAR systems, widelyused object detection ndtracking, face unique challenges with UAVs dueto their small size, shape variability, hih sping and un-predictable stategy reduces LiDA beams probabiisticanalysis and repositions sensor fr wider yet tstruggles continuous tracking of small points. Segmentation method combined ojectmodeland teporal infation improve effetiveness of ackng though they are on-srained by segmnttin and object model ccuracy. Euclidean distance clustering and partile filering algoritsoffer yt computationaly efficient albeitsensite to ata and In summary whileseveral mehods address theUAV andtracking wth LiDAR, each methd preents distinct limita-ons andundrscorngneed for and this domi",
    ". INTRODUCTION": "Visual-based methods struggle with small objects at Wide field of view cameras can monitora larger but a few of the droneas shown Radar can drones effectively,but cheaper models * \"S are noisy and expensive ones ex-pensive and power demanding.",
    ". REFERENCES": "8, no 2, pp. , 2019. 1 no. 12, pp. 1, p. yanJ Walace, Kisty M Kiernan, To Haritos, Joh Robbins, andJon M Loffi valuating small uasopratins ad national airspacesyste interferenceusigaeroscoe, Journal ofAiatin Technlogyand Ennering, vol. ang Lyu, Muing Cao, Shengai Yuan, and Li Xie,iion-based planeestimation ad following for builing inspction with au-tnomous uav, IEEETransactions o Systems, Man, anCybernets:ystem,vol. 74757488, 2023. Muqed o, Kun ao, Xiuxian L,henghai Yuan, Yang Lu, ThienMinh Ngyen, and Lihua Xie, Ditributed mut-robot sweep coveragefor a region with unknow workload distributon, Autonomous Inelli-gent System,vol.",
    ". Dataset": "V1 sequences, mst deections asy AVstypically fly withi 40 meters. Hweve, for MMAUD v2 andMMAUD 3 sequences, makes smallerUAVs harder detetwth LIDAR.",
    "Yin Zhou and Oncel Tuzel, Voxelnet: End-to-end learning for pointcloud based 3d object detection, in 2018 IEEE/CVF Conference onComputer Vision and Pattern Recognition, 2018, pp. 44904499": "Qi Charle, Hao u, Mo Kaichu, and Leoidas J. R. Alx H. Gibas, Poit-Net:Deep Learning on oint Sets for 3D Classification and Segmen-tation ,in 2017 IEEE Confernce on Computer Viion nd PatternRecognition CVPR), Los Alamito, A, USA, Ju 207, pp. 7785,IEEEComputer Society. Staib, aroline ssert, Sean Zhou Pew-Tan Yp,and lKhn, Eds. Zhipeng ing, Xu Han, nd Mac Nithammer,otenet:A deeleared label fusion method for mlti-atlas segmetation, in Medi-alImage Comptingand Computer Assisted Intervention ICCAI2019, Dinggang Shen, Tinming Liu, Terry M. Lng, Sourabh Vora, Holger Caesar Lbig Zhou, Jiong Yang,and Oscar Beijbom, Pointpillars: Fast encodrs for object detectionfrom point clouds, in 2019 IEEE/CVF Cofrence on Computer Visionand Pattern RecognitinVPR), 019, p. 20221, Springer Internatioal Publishing. 1268912697."
}