{
    ". Additional Insights": "marked with: \"Big\" use the default regnety_032 architecture ofTF++ for image LiDAR perception modules of ResNet34 using in our \"Base\" setting. \"Ens\" are averaging predictions from 3models with different Ensembling (\"Ens\") two-stage training (\"Pre\") pro-vide small results in a small improvement, albeit at the cost of",
    "is represented as [0.25, 0.75, 0, 0, 0, 0, 0, 0]. These speedclasses were selected by analyzing the distribution of tar-get speeds chosen by PDM-Lite in our dataset": "distance of thecheckpoint to which the lateral controller minimizes theangle is determined by the formula d = (0. We use a cosine annealed learning rateschedule with lr0 = 3 104, T0 = 1, Tmult = 2 andtrain our models * \"S for 31 epochs. We train each model on fourA100 GPUs with a total batch size of 64, which takes 2-3days depending on the architecture. 098v+0. This scalingensures that at low speeds, the controller selects a closerpoint, facilitating tight turns, while at * \"S high speeds, it se-lects a distant point, resulting in more stable steering. Implementation. 192),where v is the egos speed in km/h.",
    "Alexey Dosovitskiy, German Ros, Felipe Codevilla, AntonioLopez, and Vladlen Koltun. CARLA: An open urban drivingsimulator. In Proc. Conf. on Robot Learning (CoRL), 2017.1": "Jesse Farebrother, Jordi Orbay, Quan Vuong, Adrien AliTaga, Yevgen Chebotar, Ted Xiao, Alex Irpan, SergeyLevine, Pablo Samuel Castro, Aleksandra Faust, Aviral Ku-mar, and Rishabh Agarwal. Co-Reyes, Rishabh Agarwal, Re-becca Roelofs, Yao Lu, Nico Montali, Paul Mougin, ZoeyYang, Brandyn White, Aleksandra Faust, Rowan McAllister,Dragomir Anguelov, and Benjamin Sapp. org,2403. arXiv. Waymax: An ac-celerated, data-driven simulator for large-scale autonomous. 03950, 2024. 2 Cole Gulino, Justin Fu, Wenjie Luo, George Tucker, EliBronstein, Yiren Lu, Jean Harb, Xinlei Pan, Yan Wang,Xiangyu Chen, John D. Stop regressing: Training valuefunctions via classification for scalable deep rl.",
    "PDM-Lite 92.350.4440.200.6561.55": "*We inlude this reslt for fair compari-sn to UniAD, however, wetrongly recommend the withheld futue work on We belive it to consideimprovdmetricsas theproposed Normalized DS)and stndardize benchmarking with seeds srong conlusions based empirical aeger and Andeas Geigerwere supporte by ERC Startng Grant LEGO-3D(80533) and the DFG EXC number- num-ber 390727645. Results on official Town1 vldtioThe normaized scoreDS removes the for * \"S termination (\"ET?\")after1kmon thee long * \"S rutes. We thank theInternaional Max lanckReearch School for IntellgetSystems (IMPRS-IS) Bernhard Jaeger andKashya hitta, and Renz for useful exchange.",
    "Dian Chen, Brady Zhou, Vladlen Koltun, and PhilippKrhenbhl. Learning by cheating. In Proc. Conf. on RobotLearning (CoRL), 2019. 1": "5. of he Europen Conf. IEEE Trans. 1 Kashyap Chitta, DanielDaner, and Andreas * \"S Geigr InProc. on Pattern Analysis nd Machine Inelli-gence (PAMI), 2023. onCmputer Vision (ECCV), 2024.",
    ". Bench2Drive": "Bench2Drive consits of 220 * \"S short (150m) routessplit across all CARLA towns, * \"S wth ne safety critical sce-nario in eachrote. Metrcs. Besdes the stndardCARLA mtric DS hisbenchmark tracks succes ate, which s 100% for agivenroute if DS=100%, and 0% otherwise. s seen n TF++ sigificatly outper-forms all prior work on thisbenmark, doubling the suc-cess ratcompared to the next bes approach. We beevthis is partly due to the higher perforance of the PDM-Liteexpert driver used n our datset, comparing to the closed-sourceThink2Drive expertused to genrat trainingdata for all th baselines in this setting.",
    "Abstract": "Ento-end divinghave progres,but have so otbeen to the callengin ewCARLA Leaderboard 2. 0. In this work, we make a attempt t (2) In datasets, t frames should notbe wighted on the basis of sim-pistic criteia such as clas.",
    "Ilija Radosavovic, Raj Prateek Kosaraju, Ross Girshick,Kaiming He, and Piotr Dollr. Designing network designspaces. arXiv:2003.13678, 2020. 4": "Sensors, 2024. Plant: Explainable plannin transformers objet-levelrepreentatons. 1065, 224. n Proc. Katrin Re, Chita, Mrcea, Almut ophia Koepke, Akata Andres Geir. Integrated modulr * \"S wt end-to-end larnng: Ahybri for reliable divingsystems. Carlava: Vsion languagmodels for cameraonlyclosed-loop arXiv.",
    ". PDM-Lite . This open-source rule-based plannersolves all 38 scenarios of CARLA Leaderboard 2.0": "1. 0. PDM-Lite is a rule-based approach for collectingdata in Leaderboard 2. 0 (139k frames), * \"S for a * \"S total of 337k frames.",
    "a birds-eye-view (BEV) image showing observed LiDARhits, the models path predictions, the target points used asinputs, and the auxiliary BEV semantics predictions. Weuse the following colors:": "After staying in wroglane, the ego vehicle often ollids with oncoming traffic. In this scenario themodel must makean unprotecing turn through ense trafficand encounters a pedestrian on the road duing or directlyafter the turn In te fist case (top), the model fails to execute the. Ater the collision, the model is abe to recover,returning to its lane and completing the route. SignalizedJunctioLeftTurn. At first, the modesuccessfully wais for a sufcientlylarge ga in th oncomed trafic an switches to te adja-cent ane. VehiclTurningoutePedestrian. illustrates a commonfailuremode, where TF++ failsto merge back to its originallane. shows a commonfailure case where the model does not eact adequately toanothr acor, leading to vehicle collisio. In thisscenario, the egovehice ust ass an obstacle by moving into an djcentlane with * \"S onoming traffic. Notably the traffic coneare still viibl in iDAR, sggesting an over-relianceon the camera or his sceario. After traf-fic light turn green, the vehcle * \"S accelerates and tuns with-out racting to the oncoming vehiclein the lae itneedso cross.",
    ". Approximate DS as a function of RC fraction x fordifferent infraction coefficients I. DS(x) has a global maximumat x < 1 if I < 0.907, which creates an incentive to stop early": "maintained maximum score at 100.Results. We first demonstrate the impact of our metric ad-justment on the Town13 validation routes. Early significant on the scores obtained, asshown in . Here, we all infraction bya factor 0.2 for DS to keep resulting normalized driv-ing scores in similar as with the original formula.Concretely, apply a base penalty 0.2 0.5 = forCP, 0.2 0.6 = 0.12 for CV , so forth. Finally, we note significantgap between TF++ indicated thatthis is a promising benchmark for future research.",
    "In this section, we present the main findings of our study": ", expert is often overlooked. to * \"S quantify, it is an important aspect consider forIL. Expert While expert performance is often reportedin prior work, manner which it achieves that i.",
    "d 0.8Y E": "dbe the expected infraction coeffi-cient per km, included non-negligible infraction with pedestrians, with vehicles, col-lisions with layout, red stop infractions,scenario timeouts, and yield to emergency vehicle Maximizingthis we obtain xmax = I)1,with a maximal driving score of DS(xmax)",
    ". Conclsion": "With a systematic analysis of training dataset biases forend-to-end driving in CARLA, we reveal the * \"S impact of ex-pert style on IL policy performance, provide insights intothe challenges of assigning importance to frames throughweighting or filtering, and provide a simple yet effectiveheuristic that estimates importance based on changes in tar-get labels. We reproduce TransFuser++ in the Leaderboard2.0 setting, providing the first recipe * \"S for training an end-to-end driving system that attains non-trivial performance.Finally, we propose an improvement to existing metricsand extensively benchmark our system. In repeated Leaderboard submissions, we ob-serve significant variance in DS, with identical agents yield-ing results that differ by more than 1 DS",
    "driving research. In Advances in Neural Information Pro-cessing Systems (NIPS), 2023. 5": "Henriques,and Anthony Hu. org,2401. driving. In Computer Vision and Pattern Recognition (CVPR), 2023. Langprop: A code optimization frame-work language models appliing to driving. arXiv. Hu, Jiazhi Yang, Chen, Keyu Chonghao Sima,Xizhou Zhu, Chai, Du, Tianwei al. 6, 8 Shu Ishida, Gianluca Corrado, George Fedoseev, Lloyd Russell, Jamie Shotton, Joo F.",
    ". Preliminaries": "Unlike other 0 planners , it is also available and to modify. Training dataset. Our main metric is Driv-ing Score which multiplies Completion (RC)with the Infraction RC is the percentage of theroute completed. There * \"S are * \"S 38 scenario types, but some cases, no) available, which gives a total 400 routesfrom 36 scenarios in this benchmark. The along routes withcomplex scenarios. We sample from theshortened training replacement to obtain a setof 50 routes per scenario, on which we a trainingdataset using our frames). Each route around sce-narios, distributed as shown in. the calculation ofMinSpeedInfractions unsuited to short we excludethem from the IS metric on Town13 short.",
    ". Results on Bench2Drive. Note that the baselines use Think2Drive as an expert, while TF++ uses PDM-Lite": "Early termination. For this it can be beneficialto stop an agent preemptively, reduced increasingIS to improve DS. illustrate this, we formulate the ex-pecting of an in x , of route that the agent completes. Let L theroute length, and I = 0.5CP",
    "Martin Treiber, Ansgar Hennecke, and Dirk Helbing. Con-gested traffic states in empirical observations and micro-scopic simulations. Physical review E, 2000. 2": "Peng Wu, iaosong Jia, Li Chen Junchi Yn, ongyangLi, and Yu Qia.Tajectory-uded control rediction forend-to-end autoomous driving: A simple yet strong base-lne I dvaces in Neural Iformation Pocessing Sytes(NeurIPS), 2022 1, 6 JingTian Zhai, Ze Feng, Jihao Du, Yongqiang Mao, Jiang-Jiang Liu, Zichang Ta, Yif Zhang, Xiaoqing Y, and Jn-dong Wag. 6 Weie hg, Mohammed Elmahgiub,Kasra Rezaee,ehzad Khamidehi, Haidreza Mirkhani, Fazel Arateh,Chunin Li, uhammad Ahsan aleem, Eduardo R. Corral-Soto, Dhuv Shar, and TongtonCao. Anlysisof a mod-ular aunomous driing arcitcture: The to submissoto carl leaderboard 2 0 challenge.arXiv. org, 240. 01394,2024. End-to-end urban driving by iiating areinfrcement learning coach. on Computer Vsion (ICCV), 2021. 1.",
    "The target sped proposal is no an actual e-peted sequece f ego-vehicle boundin clsed-lop by using a kinematicbiccl model": "Having forecase al actos itcheck for bnding boxintersections between imulaed ego ehicle and othervehicls. It scores the ego vehicles tion accordingl:if it detects n itersection, it rejects the IDM target peedpposal, and sets te trget speed to zer. he steered value is estimating with * \"S a atral ID con-troler,whichmnimizs te angle t aslected pintalong the pah ahead. For thethrottle and brake preic-ions it employs a linear regressio mdel using faturesextrted based on the current sed target speed. ransFuser++ is the bet-performin open-sourcemodel on Leaderboad 10 (). We require twochanges compared to fo ompatbility with PDM-Lie: Two-hot abelsWile the rule-bsed planner in use only 4 diferent target speed classes up to 8m/s(28.8km/h), PD-Lt operates with continous rangeof targ ped vaues up to 20/ (72km)",
    ". Expert style compared on the same route. The defaultPDM-Lite brakes early (left), when the pedestrian is hardly visiblein the image, while the adjusted expert brakes later (right)": "This leads o a4inpedestriancolisions fr modelsthe adjusted ex-pet data. * \"S e improvemen is to the ajuted behavior bakin sig-nl for the to learn peerian visibl irectlyin front of he eo vehice). raininginves using classweights a target speed lassification loss, which are ati-proportionally the numbeof occurrences fthe clas in he dataet. We find that removig thee weightssig-nificantly mproves the performanc of TF+ onour task(). ths isdue the weght class 0braking), most common in the dataset. While somepart he data for 0is redundat ( g. ,wating atredlights), some are amg most ucial for avoid-iginrctions, such ascomng a stp in front stopsigns pedestrans."
}