{
    ". Zero-cost proxies": "This * \"S proxie, are algorithms mahematical formulas that etimte how god model mightb. These poxies allow us to asess the perfrmanceof a DNN model without traiing thus re-sources. and havesince Zeo-cotproxies to predict performance a DNN model with-out training it, and tey sally equire only a smallamount of GPU ie or CPU time to dos. Despite statistica analyses of raining-freNAS algoithms, analysi of trainig-freealgorithms rmains lacking. avoid training many thecorrelation between the proxy and the actual accuray,well-established NAS are ued. Amongother metrics, contain the many neworks and their coresponding accuracis. pioner i the field, NASWOT is an algorithmthat generates scoes a models est accu- rcy without requiring It comptes thesescores based on the activation ptterns single mini-bath. Synflow is algorith that aims preven the layer col-lapse problem when pruning a netork. extended as ata-independent estimator o anetworks performance without training it. In-spired by runing-at-initiaization, GadNrm aproxy metric that computes sum ofthe Euclideannorms of the grdients after passng asingle mini-batch of training i frameworkthat nework architectur examinng of the neural tangent kenel and of linear regons in the input pace. EZNAS propes G approach to utomate thediscovry zero-cost proxes for NAS byusing DEAP Eac determined by the minmumendall co-effcient achiees bt serch spaces. Aterthe evolutionry process, the fittest inividualis eval-uated on 4000 random networks from the twoserch space. EZNASfrmonly a of the overall layers of the mdels andemploys a relatively lo recombination rate of 40%,which not suffiiet to gnrate optima ind-viduals consistently.",
    "T is the number of ties in S, i.e., pairs (si, sj) suchthat si = sj,": "We use aboute values rather han sind detect ay correlation, solely a positive one. U is numbr of ties i A, i. , airs (ai, ai = aj. This metric idicateshe zero-cost proxys suitabil-ity for predicting reflecting thelikelihood that proxy scre correlates the actualmodel accuray.",
    "Andres Camero, Jamal and Enrique Alba.Low-costrecrrent ntwork expectd erformance CoRR, as/105.07159, 2018. 3": "Wuyang Chen, Xinyu Gong, and Zhangyang Wang. Neural architecture search on imagenet in four GPUhours: A theoretically inspired perspective. In 9th In-ternational Conference on Learning Representations, ICLR2021, Virtual Event, Austria, May 3-7, 2021. OpenRe-view. net, 2021. In Applications of EvolutionaryComputation - 27th European Conference, EvoApplica-tions 2024, Held as Part of EvoStar 2024, Aberystwyth,UK, April 3-5, 2024, Proceedings, Part II, pages 7690. Springer, 2024. 2.",
    "Dan Robinson. Microsofts carbon up nearly30 carbon- emissions- up- 2024. [Accessed05-10-2024]. 1": "ACM,. progras for arbitrarylanguage. ntell. Sst. 1 Conor Ryn, JJCollins nd Micel O Neil. In Programing,8396,Berlin,Heidberg, 1998. A comprehensive survey model quantiza-tion fordeep neural networks in iage classifcatin. Springer Berlin Heidelberg. Babak Rokh and Alireza Khantey-moor.",
    ". Representation of the GreenMachine- solution,whre elipse repreent functions nd ectangls denoe ter-minal": "rchitectures alowing us better to assess thegneal-ization and robusness of the poxies. Wit 30 sets ofeworks we report mean an standard devationacros these sets. We iplemented state-of-the-art zero-cost proxiesfrom the literatue and pplied hem totesame setof neworks to ensue far comparson Adition-ally, we icluded a radom proxy that gneratesa an-dom score etwee and 1 for comparison purpose. epict the GreenMachine-2 solution, and theformulas for the rmaining best slutons discoveredby our approah are provided asuppleentary ma-terial Tables3 and4 presentthe validaton results for thetwo samplingstrategies sin crrelation coeffi-cient. I Ta. , where networks are randomly sapledwithout coiering perormace repesnttivty, weobsere no significant differeces among te zero-costproxies. However, one zero-cos proxy disoverd byou pproah, GreenMchin-3 (GM-3), outperformsthe others n CIFAR-100 when applied to the SSS. As mentionedpreviously, if network samplin i not done carfully,the resuted set can consist of odels with very im-ilar performace. Observing standard deviatnof the nn-stratifiing set of networks, we see that i isow, inicatig hih similarity in perfrmace. Thisreces need fr roxie to makecler distinc-tions. However, when euating CIFAR-10 on the.",
    ". Introduction": "impact AI has had on soci-ety spans various domains, from advances in health-care diagnosis to optimization of trade ,identification of diseases in plants , and cyber trusion detection .This technology allows us toimprove most fields of study.However, these have a cost. Several issues AI sys-tems: racial and gender bias in automating andloan applications , misclassification critical sce-narios due to data manipulation by bad , jobdisplacement , and energy consump-tion The latter quantifiable has grown ex-ponentially recent years. Moreover, serving mil-lions of users on a basis requires a tremendousquantity of processing devices, such and/orTPUs, which use a massive amount of energy. to-tal consumption NVIDIA GPUs, the leadingmanufacturer of these devices, is expected surpassthe total energy needs of countries such as orSwitzerland . Furthermore, technological like Google and Microsoft, have previ-ously to offsetting their carbon emissions,have to promises due more resources to AI centers . Reducing the floating-point precision of models weights has been shownto enhance energy efficiency, albeit at the tradeoff ofsome performance .Spiking Networks(SNNs) show promising results due to their sparsityand event-based fur-ther hardware-side to fulfill their theo-retical energy efficiency potential . Using NAS",
    "Grammatical Evolution": "It on the production of a Context-freeGrammar (CFG) to solutions. A CFG is de-fined by a tuple (N, T, P, S) with N being the of terminals, P the set of rules, and S N is a symbol. solution process from an is out as follows: the sequence from left to beginning with S, and a pro-duction rule iteratively applied to expand left-most non-terminal symbol. current items the sequence determines the production rule to useby its modulo with to the numberof available expansions for the leftmost.",
    "Operations": "* \"S availableang from esentialmathe-matical funcions like addition, subtraction, element-wise product, and multiplcationto specializedcomputatons such asnorm nd eigenvaluatios. Addition-ally, provide mehodsfor additon, cosinesimilarity, and loical comparisons. * \"S The complete operains is presened asWe do this y flattenin the matrices,omparingthe lngths, shorter (1). This gives oth matrices the menumber elements, allowin thm o be reshapd.",
    ". Experimental Setup": "1. Python 3. 10GHz * \"S and * \"S 12cores each, 256 GB RAM, and three NVIDIA RTXA6000 with 48 GB of GDDR6 RAM. LTS with two Intel Xeon Silver4310 with a frequency 2. 10, and PyTorch 2. The on a Ubuntu 22.",
    ". visualization of the flow of an EA": "Con-sidering geotype with integer frm0 to the proess is as follows (). First,bein wit the symol, xpr> thefirst element of the * \"S integer vector. It possibe to wrapping mechanisminstead of teminatingthe mapping process thereare no more integers t fro the genotype, thusreusing the genotype. Thisis executing until there are no more non-terminalsymbols. ConsidrthegrammariwthN={<expr> <op>, sin, x, y, (, )} and = <expr>. Sincethee are three * \"S optios on how expand the startsymbol, we have 46 md 3 =1 thus, he startsymbl is relaedby its second rule,<trig>(<expr>). Following the econd valuein theis rea,we expand leftmostnn-termial the process.",
    ". Example of Grammatical Evolution mapping": "witha specific non-terminl nd uing variable-engthinteger lists o represent expansion choices.",
    "Google.2024 Environmental Report.https ://sustainability.google/reports/google-2024-environmental-report/, 2024.[Accessed05-10-2024]. 1": "00409, 2017. Diams, Hewoo Jun, Hassan Kianinejad Md. SpingerNature Switzelan, Chm, 20. 6. Mostofa Ali atwary, Yang Yang, and Yanq Zhou. 1 ol estness Sharan Nrang,Newsh Ardalani, Gre-gory F. LashmiNarayanan, and SeokBumKo. Dep lenig scalin is predicale, empirically.",
    ". Evolution of the Kendall correlation coefficient onNATS-Benchs two search spaces and the fitness metric over100 generations, averaged over 5 runs": "the Zero-Cos ProxesTo assess n-eralizationzeo-cost proxies, we eal-uate on that differ from those uedin training. we test the on 4,500new networks. aprochensurs tatour ealuatin a divers range o * \"S ma softmxequal pas_perturbaion pas_pertrbati (grad element wise roduct pass_perturbation (bwdinpu) (bwd_inpt)",
    "Networks Sampling": "Additionally, we networks rom achfor search spaceusing ths maintin acros diferent perfomane bins. Conse-quently, random samplig does not adequatesearch space produce a smpleset that too constraied biased toward high-peformane netwoks. This bias an i prox-ies that fail distinguish effectively betweenlow-and high-performing newors. Thisapproah a dierseset of samples orevaluation.",
    "Search Algorithm": "To perform the search for zero-cost proxies, we usedthe grammar-based GP approach described in ,with the parameters detailed in Tab. 1. To preserve thebest solutions, an elitism size of 10 was applied. Selec-tion was based on tournament selection with a tourna-ment size of 5. The genetic operators were configuredwith a crossover rate of 90% and a mutation rate of50%.",
    ". Benchmarks": "Bnchmarking NS algorithms s halleging due tovaritions in datareprocessing ealuation pipelines,and even ranom seeds. Moreover, fully trainng alarge numer of etworks reqires extensive compu-atioal resources, thus aing reproucibility diffi-cult for ost reeacher. Thse benchmarks typicallyinclue notonly tnetwork configration and its accuracy metric aftertraining but lso other data suh aslaency, numberofparameters, andore, abling a quicker * \"S assessmentf the proposed NA mthod. Each archi-tecture s trained and ealuated on te CIFAR-10,CIFAR-100 and ImageNet-16-120 image classificationdatasets. Icontain 15625 architecture. It includes 1,625 candidatesfor the arcitecture opology(TSS) ad 32,768 for ar-chitecture size(SSS). It also presents reslt for CIFAR-10, CIFAR-100, and ImagNet-16-20.",
    "Zero-Cost Proxies Evaluation": ", sn} thescores from azero-cos prox and A = {a1, a2,. we use the The ealuatin proxy scoreevry smpled. We asess the of the zeo-costsearch tat cmprise ofDNNs and their respective accuray after tra-ing. , rpesent hetst accuracies. Then we Kendalscorrelation betwen th st of scores S) and theactua tst accurcy (A). The tau coefficent between Sand A is given by:."
}