{
    ". Discussion": "In this introduced Graphframework to and ALFF wherehyperedge-aware self-supervising learning with a contrastivelearning adversarial in the pretraining stage was de-veloped complex information in brain network.In funetuning stage, The graph embeddings learnedfrom pretraining stage can be fine tuned for downstreamgraph classification task. Finally, experimental superiority of our method overseveral comparable ones for ASD/HC classification. Fur-thermore, our method is interpretable and ASD-relevant ROIs that have previouslyreported in the literature. Hassan Liangzhe Rui Qian, Wei-HongChuang, Shih-Fu Yin Cui, and Boqing Gong. Vatt:Transformers self-supervised learning fromraw audio and",
    ". Experimental setup": "Our model is * \"S implemented in PyTorch. batch sizeis 32. temperature i * \"S is to 1.",
    " Pre-training Stage": "In this way, the trained feature extractorcan the most important information while removingexcessive information in the Specifically, the loss is the principle Devon et al. 2018) which aimto maximize:. In stage, to train feature extractor the pa-rameters in the graph augmentation process, use a lossfunction that the two feature vectors to be close ifthey are from the graph and far away if they graphs.",
    "Franco Scarselli, Marco Gori, Ah Chung Tsoi, Markus Ha-genbuchner, and Gabriele Monfardini.The graph neuralnetwork model.IEEE transactions on neural networks,20(1):6180, 2008. 1": "RNathan Sreng, Raymond and Alice SN Kim. Thecomon basis of autobiographical memory, prospec-ion,navigation, theory of defaultmode:aquantitative f neuro-sciene, 21(3)8510 2009. linical, 26:10249, 2020.5",
    "deficit/hyperactivity disorder.Translational psychiatry,10(1):65, 2020. 1": "ixua Guo, Tang, Shu Xiao, Shilin * \"S Sun,Zibin Yag, Huang, Zhuoming Chen, an Ying Wang. Systemtc review and metaanalyis: multimodal funcionaland anatomical neuralalterations autim pectrum disor-der. Moleular 15():16,5 Anibal Solon Hinsfed, Alexandre Rsa Frnco, Bucweitz, Flipe Mneguzzi. Clinical, 171623,2018.",
    ". Fine-tuningstage": "Finally, a multi-layerperceptron (MLP) s ued t class of the inputgraphs The classfication is los * \"S o otimizethe cassificatopr-formance. First, we fusetwo sets of node embed-ings using a simple Then,1D * \"S convutionallaye i employed to the fused node ebdingsno the ina graph representatio.",
    "Multi-Stage-Graph0.66990.6449": "Terefore,our model supoted de fatures of the DMNas use-ful for ignosis of S. Our results ientified aberntedge feature in thecueus/calcarine n dorsolateralprefrontal cortex(DLPFC) in comparedto TD in both Meta-analysis hd hat autistic people showed lssprefrontal actiitydurig peception tsks agreater re-cruitmentexrastrate crtex during visual processing. () l66 selecting unctional onnection feaures * \"S the circus (b) functionaconnectionson the rfce. Consequently, DLPFC has as target region of trnscranial curentor ag-netic for he treatment of The cee-ellum s also a key node motr learning, languagecomprehension, visual-satial perforance functions , ovelapth aberrant doains obrved among individuals with ASD. The re and bue lines a) and rpreset ineased and decreased functionalonnctions ASD compared to (d) Deread node featresin ASD comared to TD. In fact, genes. Bot of the functional con-nectvity nd ALFF the cerebelum contribut tothe diagnoing model, indicatng that cerebllar untionismore in ASD. role in physiopathology ofAD. It has uthat crebellar reas have reducing to th dorsolateral ad medialprefrotal cortex , whih is reatedto social deicitsand increaed repetitive behaviors ASD moe modlsand indivduals wth ASD. s implcated in visua processingandretreval of memries. In (c, the red, green,an * \"S ubbles represethe Slow-5, Slow-4,classical ALFF features,.",
    "Juliette Bouzy, Julie Brunelle, David Cohen, and Agn`es Con-dat. Transidentities and autism spectrum disorder: A system-atic review. Psychiatry Research, 323:115176, 2023. 1": "Frontiers in Neu-roinformatics, 15:802305, 2022. 5 Xiaokang Chen, Mingyu Ding, Xiaodi Wang, Ying Xin,Shentong Mo, Yunhao Wang, Shumin Han, Ping Luo, GangZeng, and Jingdong Wang. 1 Hejie Cui, Wei Dai, Yanqiao Zhu, Xuan Kan, AntonioAodong Chen Gu, Joshua Lukemire, Liang Zhan, Lifang He,Ying Guo, and Carl Yang. Shared and distinct resting func-tional connectivity in children and adults with attention-. 4 Xiaojie Guo, Dongren Yao, Qingjiu Cao, Lu Liu, QihuaZhao, Hui Li, Fang Huang, Yanfei Wang, Qiujin Qian,Yufeng Wang, et al. Research in Autism Spectrum Disorders, 5(1):254266,2011. Altered periodic dynamics in the defaultmode network in * \"S autism and attention-deficit/hyperactivitydisorder. Abnormalities in the anterior cingulate cortex associ-ated with attentional and inhibitory control deficits: a neuro-physiological study on children with autism spectrum disor-ders. 5 Gaelle E Doucet, Won Hee Lee, and Sophia Frangou. Context autoencoder for self-supervised representation learning. 1 Paul Curtin, Janina Neufeld, Austen Curtin, Manish Arora,and Sven Bolte. IEEE transac-tions on medical imaging, 42(2):493506, 2022. Multi-scale graph representation learning forautism identification with functional mri. Self-supervised learning on 3d point clouds by learning dis-crete generative models. Journal of Child Psychology and Psychiatry, 62(9):10901099, 2021. Agnes S Chan, Yvonne MY Han, Winnie Wing-man Le-ung, Connie Leung, Virginia CN Wong, and Mei-chun Che-ung. Changes in the topological organization of the defaultmode network in autism spectrum disorder. 2 Peter G Enticott, Bernadette M Fitzgibbon, Hayley AKennedy, Sara L Arnold, David Elliot, Amy Peachey, Abra-ham Zangen, and Paul B Fitzgerald. 4 Liting Chen, Yunmi Chen, Huang Zheng, Bin Zhang, FeiWang, Jin Fang, Yueyue Li, Qiuyin Chen, and ShuixingZhang. Brain Stimula-tion, 7(2):206211, 2014. 5 Li-Ying Fan, James R Booth, Min Liu, Tai-Li Chou, andSusan Shur-Fen Gau. Developmental differences in neuralconnectivity for semantic processing in youths with autism. International Journal ofComputer Vision, 132(1):208223, 2024. 4 Benjamin Eckart, Wentao Yuan, Chao Liu, and Jan Kautz. Braingb: a benchmark for brainnetwork analysis with graph neural networks. 2 Ying Chu, Guangyu Wang, Liang Cao, Lishan Qiao, andMingxia Liu. Brain Imagingand Behavior, 15:10581067, 2021. Eval-uation of the spatial variability in the major resting-state net-works across human * \"S brain functional atlases. In Proceedings of the IEEE/CVFconference on computer vision and pattern recognition,pages 82488257, 2021. A double-blind, ran-domized trial of deep repetitive transcranial magnetic stim-ulation (rtms) for autism spectrum disorder. Biological psychiatry, 91(11):956966, 2022. Human brainmapping, 40(15):45774587, 2019.",
    ". Graph Network for fMRI": "For instance, aSiamese GCN model was proposed to learn a graph similar-ity metric between FCNs for distinguishing autism patientsfrom healthy controls . Another study investigated agraph embedding learning (GEL) model for diagnosing ma-jor depressive disorder by learning FCN embeddings viaGCN and then using a fully connected layer activated bya soft-max function for final classification . However,the above GNN network is designed for a single trainingstage and produce low accuracy, therefore, we proposed themulti-stage graph for fMRI analysis.",
    ". Methods": "Duingcontrastve learnin, the model distinguishesbeteen thsetwo vrsions, using * \"S trainabl Bernoulli mask to randomldrop edes, thus encouraging the learning of invariant fea-tures. The distilledfeatures, robust t raph variatins, arecruci for disese dignosis. The remaning ege weightsafter taining can be analyzed potntial bioarkers. Inte fine-tuning stage, these distilled features are lassifiedusing linear classifier trained to erentiae between ASDand NC subjects bsing onconnectvty patterns an func-tional relationships * \"S within the brain.",
    "Tomoya Hirota and Bryan H King. disor-der: A review. Jama, 329(2):157168, 2023. 1": "autism spectrum deriv-ing mechanistic insights from internal model framework. Association of adverse expe-riences and precuneus volume with reexperiencingin autism spectrum disorder. Jour-nal of Disorders, 338:4151, 2023. Neuroscience, 462:274287, 2021. Nature 2020. Aberrant functional connectivity within and between brainnetworks patients with early-onset disorder. 5 Soichiro Kitamura, Manabu Makinodan, Kiwamu Mat-suoka, * \"S Masato Takahashi, Yoshikawa, Rio Ishida,Naoko Kishimoto, Yuka Yasuda, RyotaHashimoto, et al. 5 Huibin Jia, Xiangci Zhiyu and Enguo Aber-rant dynamic spanning tree parameters within de-fault mode network in patients with spectrum disor-der. of behaviors bycerebellarprefrontal cortical circuits. Geneticpatterning for psychopathology is distinct from that and implicates fetal cerebellar Natureneuroscience, 26(6):959969, 2023. Autism Research, 14(9):18861895, 5 Sofia Ktena, Sarah Parisot, Enzo Ferrante, Martin Rajchl,Matthew Ben Glocker, and Rueckert. 5 Elyza Kelly, Fantao Meng, Fujita, Felipe Mor-gado, Yasaman Laura Chongyu Ochoa Jennifer M Gibson, Sanaz et al. 5 Kelly, Ochoa and Peter T Tsai. Metriclearning with spectral graph convolutions brain connec-tivity networks. Neuroscience & Biobehavioral Reviews, 127:146157, 2021. evidence of differential prefrontal earlysensory cortex non-social sensory perceptionin autism.",
    ". Evauation": "Mult-Sae Graph perfms on features extracted from the original hype-graph edge-dropped version n a Bernoulli mask, enabling earned features tobe idependet of the * \"S andgenuinely repreent embedding of graph in Eucliean space. shws accuracy (AC) and are curve (AU) metho * \"S on hese datasets. (2) pr-traind hyperaph autoencoder fMRIsignalsare hen combine to the final graph embedding and dianosresuts under the supervision of the class.",
    "*Guangzhou Women and Medical CenterSouth China Normal UniversityGuangzhou Women and Childrens CenterGuangzhou and Childrens Medical CenterGiant Network AI Lab": "* \"S unctionlcnnecivit networks (FN are construceto represent each subject,with eachelement inicatingthe pairwise relationhips be-tween brin regions of interest (ROIs). However, pre-vious studies typilly etract handcrafted neworkfeatures(ucas nodedegre * \"S and clustring offiient) from FCNsand then ue these features in predcton models or ASDdiagnosis. This apprach lits diagnostcaccuracy andheavily depends on exert knowlege.",
    ". Qualitative results of genered diferentbaselines (the rd mask lesion area, darkbue arios oie)": "were preferentially expressed in the cerebellum during thefetal stage , and models that include cerebellum can sig-nificantly improve the accuracy. Our results showing thatnode and edge features in the rested brain together couldprovide the good classification results in two ASD datasets. Thefunctional organization at rest is expected to possess the in-.",
    ". Introduction": "* \"S. Resting-state functional MRI rs-fMRI) is techniquethat measures (BOLD) ithe brain requirng th subject to performspecific tasks. However, current dagnostic methodsheily rely on tradtionl behavioral assessments hichare subjetive and can often result missed earlysymp-toms and misiagnoes. Consequently, is a rowinginterest n ientifying objectiv biomarkersfor early and intervention ASD treatment within of neuroscience. Autism spectru a dvelopmentby social, behaviral challenges.",
    "Mei-Kei Leung and Way Kwok-Wai Lau. Resting-state ab-normalities of posterior cingulate in autism spectrum disor-der. Progress in Molecular Biology and Translational Sci-ence, 173:139159, 2020. 5": "* \"S spectrum isoder reves Diseasepriers, 6(1:123, 2020. Restig-statefunctional and imaged as noninvasive ools to study(b) normal neurdevelopmentin and rodents. Jour-nalf euroscience, 43(49)82758293, Neurimag, 4."
}