{
    "We are now ready to Lemma ": "We parttion the gnts in N nto two parts N1and N2 where N1 cotainsall the agents that do not belong i U that PRATTC returs and N2= N \\ N1. We proceed yseparately showing thatthe assignment that CoBR retrnsis vlid ove thagents in 1 and overthe aget in N2. ote that inPRA-TTC, ach submission is assignedt at ost kp rviewers an terefor, during the execution of PRA-TTC, for each i N, it holdsthat j[m] |Rppi,j| kp m. From Lemma 2,ince kp m ka, we get tht n PRA-TTC, eachi N1 is not assigned more han ka papers to eview until the point where ll o her submissonsbcome completely assigned. fter tha point, an agnt m still articipte in acycle as lo as shereview strictlyless than ka submissions.Theefore, wen we exit PRATTC, eac agent in N1 doesnot rview more tha ka ubissions and allhe submission re completely asigne. In Filing-Gaps, fom Lmm4,we get tht i an agent in N1 is asgned a new submissionto review,she isemovd one of the submissions that she already reviews Moreoer, the assinments of submissionsthat belong to agents in N1 d not hange. Hnce, we cn conclue that th assignment that CoBRAretrnsis valid with repect to te agets in N1. Valid Assignment ove th agents in N2. From the same lemma, we have at after the exection ofthe rst phase of Filing-Gaps,it holds tha |Ri | = [] |Rppi,|. Next,we show that this property remains true after th secondphase of Filling-Gaps Ided, fromLemma 4, we have that during the second phase of Fillin-Gaps, if i U is assigneda new submission to revie without one of her incopletely assignedsubmissions s assignedto a new eviewer,she is removed one of her assigned submissons; on theother han, if one of her incompletely asined submissions isasinedto a new revieer, she is alsassigned o review a newsubmsion. Lastly, from Lema4, we conclude that inth second phaseof Filling-Gaps, all the ubmissions becme eventually completely assgned since in each iteratinof the whi loop, an incopletely assigned submission is assigned o one more reviewer. Thereforein the assignment that Fillig-Gaps returns, no agti N2 reiews more than ka submissions anall th ubissios of the agents in 2 are compltly assigne, which means tht the ssigment isvlid with respect to the agents in N2 as well",
    "where the rst inequality follows from the that |Ra(t)|": "[m] |Rpp(t),| and thesecnd follows frm the facts that|UL \\ {()}| = kp and eah of * \"S thehas m subissions,which would imly that allthe submissions of (t)are ompetly assigned. Hence, we gtthatsince (t) reviews all ncmpletelyassged submissios but cnnot review all t submissionsof all ges in U L \\ {(t)}, there exist a cmpletely signed sumision that belongs",
    "BSupplementary Experiments": "Asbefore, each run is a * \"S subsample dataset of ize 10, o heseca be interreted as prcentages. It. In , we showthat TPMS and PR4A ofen motivate group of authors to dviate andredi-tribut teir submissions among * \"S temselves.",
    "R i R which is a contradiction": "analze complexity CoBRA. First,w considrthe time comlxty In iteration,the algorithm asigns at least one exta at least one incompletely-assigne submission. hisca continue fr t most mk iterations, since each ubmissonshoube revewed by In eac iteration, it tke O(n) time to nd and eliinate ccle i the preference gaph Then, it takes O(n2) ime toupdate the preference ince for each arbitrarl-picked incompletely-asigne smision of each agent,we ned to mostqualied reviewer who can beadditionaly assiged it. By all the conclude theruntme of PRA-TTC is O(n3,byignoring ka which is a small costant npracticePRA-TTC terminats, cals the Filing-Gaps algoithm. owever, Lemma ensures theend ofPRA-TTC, |L U| p + whchis also a small consant. And Filling-Gaps only makeslcal affect thes constantly may agents. As sch, the rnnng of Filling-Gaps sconstant well. Therefre, te im complexity of CoBRA is O(n3).",
    "ui(R) ui( R). Hence, additive preferences are again one example out of a broad class of prefer-ence extensions that satisfy consistency": "Our gol is t nd agroup-fair asignment which teats every possible grou of agents ateast as well s they could be on their on, ts esured thatno subset of agents has an incentie todeviate nd setup thir ow separate conference. Formally:Denition 3 (Coe) Anassignment Ri in th core f there is o N N, P i Pifor each i N ,andretricting assignment R ovr N and P = iNP i such thatR i R for ch i.",
    "iN mi be the total number of submissions": "Asinment.Our to produce * \"S a (reiewing) assigmentR : N P {0, 1}whereR(i, j) = 1 i N to rview j P. With ause of notationlet i P R(i, = 1} the set submissions assigned t agent iand = = 1} be f to review j. We want the assignment to evaid, i.e., atisfy the following contraints: Each agen atmost submissions for rview,|Rai |ka, i submission assigning kp agents, i.e.,|Rpj| = kp, . No agent should one her own submissions, i.e., R(i, = 0, N, ensur thata alid assignmnt alwas exists, we the that mika eachi N,that m n ka. Intuitivel, thideands that each agent submittingpapers be willing oprovide as many reviews s the reviews to the single agent. Fr this condition, see . Note that N and P i Pi i wih = P i , the validity requirementsabve can beextending to a assignmen R N P 1} Hereinafter, we willasume valiity uless specied otherwiseor during process builded an assignment.Each agent N a preference ranking, i,, the agent in N orreviewed her -t submissin These prefernces can be basing on a many actos,suchs how qualied the otheragent are to review pi,, likely ar o positive revew for etc. Let i,(i) be theposition of agent i {i} in ranking. Wesy tht agent i to agent i as a for if i,(i) i,(i). Aga, inthe special where the aen have submisson each, wedrop just i. Let = (1,1, . . , 1,m1, . . n,1 . . , While our algoihm takes as input, to reason about ts guarantes, weneed to dene agent prefe-ences overassignments extending . In prticular, an agent assigned et of reviewers for eachof er submissions, so we need her preferences ove ss sets of First, wextend to preferences over sets of revieers f a given subission, and then submissions. Instead of assuming a specic parametric extension (.g., additivepreferences, we allow al possible extnsions that satisfy mild consants; grop of our holds to such extnsion Extension o set o reviewers for oe S i, S i, S) denote that agenti (ep., weakly) prefersthe set of agents to agnts S for her -th submissioni,. e require only satsfy th followed mild axiom.Denition 1 (Oder * \"S every disjint S1, S2, |S1|= |S2| > 0, if i,(i) < i,(i) fo S1 and S2, we have S3 i, S2 S3. An equivalent reformulation is that between sets o reviewers S adT with |S| = |T |,ignoring reviewes in S T , if the aget strictly pefers ever (even reviewerin S\\ to every (evenbest) eviewer T \\ S, then te agent must strictl S toT 1. Consider the of preferences where agent i has a utiityfuctio ui, : R0 over individual revieer -th submission, herprefrence rankingi. In these utilities sometimes calling similarity scores. Her pref-erences ove sets of revieers dened he additiveutility functn ui(S) iS ui,(i).It is easy to check that any disjoint S, S3 |S1| = |S2| > 0, > ui,(i for alli S1 ad i S2 woul indeed imply S) > ui,(S2 preferences one exaple from of extenions stisfyingseparality. Extension to asignmnts. Let us nw gent preferences over sets of sets of orequvalently, over assignments. Let R i R i R) denote that agent strictly (resp.,weakly) asigment to assignent Note that these preferencesthe submission-ise i, all submissiosoagent. We only that the preferenceextnsion folloing natural propety.Deniion 2 (Consistency. R, assignment R over N N andP = N P i (where P i Pi for each i N) and , if holds that Rppi, i,Rppi, fo eacpi, i, then we must R R. In wods, eakly to for the se o reviewers to each of her submis-sins individually,she must preer R to R 2. Let s with of utility functons. The of ibe extended addtivelyassignments using th function =pi,P It easy to chckthat if ui,(Rppi,) ui,( Rppi) for eah thn",
    "review assignment procedures that are currently used in practice, quite often motivatesubcommunities and build their conferences": "Our theoretical results serve merely as the rst step toward using it to nd * \"S reviewer assignments thattreat communities fairly and prevent them from deviating. As such, our algorithm has signicantlimitations that must be countered before it is ready for deployment in practice. key limitation isthat it only works for single-author submissions, which may be somewhat more realistic for peer re-view of grant proposals, but unrealistic for computer science conferences. We also assume that eachauthor serves as a potential reviewer; while many conferences require this nowadays, exceptionsmust be allowed in special circumstances. We also limit the number of submissions by any author tobe at most ka/kp, which is rather small value in practice, and some authors ought to submit morepapers than this. We neing to make this assumption to theoretically guarantee that a valid assignmentexists. An interested direction is to design an algorithm that can produce a valid assignment in the(approximate) core whenever it exists.",
    "Social welfare: Finally, we also measure the utilitarian and egalitarian social welfare (USW andESW) dened above, which are the objectives maximized by TPMS and PR4A, respectively": "expected, TPMS and PR4A highestUSW and respectively, on all they are to objectives. 004 ESW on whereasPR4A achieves 0. Results. all datasets, CoBRAachieves a relatively good approximation with respect USW, but this not always the case withrespect ESW. Of all these the high probability of violation under TPMS and PR4A themost shocked result; when communities regularly face incentives, occasional deviationsmay happen, which can endanger stability of the conference. This points need for nded middleground where adverse incentives can minimized without signicant loss in fairness welfare. said, resolves thisissue at a signicant in fairness (measuring by ESW). For example, 2018, CoBRA 0. In CVPR 2017, and TPMS always end with zero ESW because this dataset zero similarity scores, is to achieve positive ESW. The are presented in. 099 average. This may be the that also containsmany zero similarity scores, the myopic process of CoBRA locks itself into bad the optimization performed by PR4A avoids.",
    "Model": "q N, dene [q , q}. here i a of agents N n]. , pi,mi} for her miN,ands available to reviewth submissionsof her.",
    "and Q2 = Rppi, (Rppi, Rppi,). If = then we have that Rppi, = Rppi, which means": "IQ1 = , then Q1 \\ (U L) and Q2 U L sie Rpp, =U LLet i =argmaxiQ1 i,i), i.e., i s rankedat te lostposion in i, amog the agents thareview pi, undr R bt not under R. Morover, let i = argminiQ2 i,(i), i.e i is ranedat the highest poitin in i, among heagents tha review pi, under R but not under R. romaboe, wekno that te assignment of i, to i was implemented during the xecution of PRATTC, since i  \\ (U L). Hece with very similar rguments as in the previous case, we willconclue that i(i) < i,(i) This mans that if i() > i(i), then i oud point i instead fi. Then, from the denitionof i andi and fromthe rder separability popety we have that Rpi, , Rppi,. Thu, either i Q1 is emptyr not,",
    "the total welfare, it is possible to discriminate against some papers. Therefore, other methods havefocused on nding reviewing assignments that are (also) fair across all papers": "For the basic problem of housing reallocaton,Shapey Scarf showed n cled Top-Trading-Ccle nds in The rst par o our algrithm uses a variation of TTC th agents(authors) ncorporatedwith itms (submisions), constraints related to manyites each agen can get and to how agens one tem should be should be satised. Various oTTC have been coniderd inthe iterature, tailoring for different vaiations of the problem the best our knowledge, none of them can be directly aplied in our To give anexample,Szuki t consider the case re muiple copies same there areome quotas that should e satising ut they sume thatagent gets just one bect whilpaper is assigned to multiple distinct. Paan Zick using the idea of envy-freeness from thefair literature to ensue fairness over thesbmissions some other works haveocsed n engreviewers ter than papes ). or te review is related to with endowments,since authors cnb viewed as beng endowe by their own papers which theytoexchange uthors alo servea reviewrs. al. Kobren et al. The core proprty that weonsider this work be viewing as fairnessequirement over of auhors. proposed two alorithmsthat maximize utilitarian under theconstraint that eac paper should score thatexceedsprticular threshold. The readercan ndmore detail challenges of problem th recent survey of Sh. In cntrast to csical problem with endowments, our model has a distinctive requiremnhat agents/authorsneed to give away heir tms/paprs th be rviewed by teagent who gets pape. ensure airness by requirng thateach paper assigning at lestone qualiing reviewer. Aswe explain this difference is crucial an requirefrther action from our than simplyexecuted this variation of TC. Oellet methodthe goal isto maximizethe scorehatpaper Stelmakh et this bymaximizing the minimum papescore,thenmaximizing te next smallest paper score, etc.",
    "We distingish int cases and we tht in both ases thes in the": "Case I: i N : LUi be rst i Nwhos ll submissions becamecompletely asigned in ofPRA-TT. that sincethere exist i U L, we getthat i U L the deniton of U and L. Now, conside any p,. Q1 =\\",
    "section, we prove our result: when agent preferences order separable and consistent,an assignment in the core always exists be found in polynomial time": "Tecniques and ke challenges:The main algorithm CBRA (Core-Based Reviewer Assignment),presented as Alorithm , ues two other algorithm, PRA-TT and Filling-Gap, presentd asAlgoritm 2 andAlgrithm 3, respectively.e remark that PRA-C is an aaptation of the pop-ular Top-Trading-Ccles (TTC ehanism, hich is own to prouce an assignment in the corefor the house reallocation problem (and its variants) . The adaptation mainly icoporaes theconsraints related to how many papers each revier an review an how many reewers shoudreview each paper. hilefor kp = ka = 1, RA-TTC is identical with the classic TTC that isusedfor the house ealloction problem, the main difference of this prolem with the * \"S reviewassignentproblem is that in he latte eachagent should giveaway her item (i.e., her subsion) and obtainthe ite ofanother agent. Theefor, by imply eecuting TTC in th reiew assignment probem,one can getinto a deadlock before producng a valid assignment. For example, cosider the caeo tree agent, ah wih one submssion. Eachsubmission must recive one review (k = 1) andeach agent provides one review ka = 1). The TC mechanism may start by assigning agents 1 and2 * \"S to review eac othes ubmission, but this cannt be extended into a valid assignment becausethere i no on left to review the sussion of agent 3. Thisis where Filling-Gaps comes in; tmakes carefuedits t the partial assignment produced by the PRA-TTC, and the key difculty is toprovetat this produce a valid asignment wile still saisfying the core.",
    "Our Contribution": "To ensure that a valid assignment always exists, we assume thatthe maximum number of papers that each agent is allowed to submit is at most ka/kp. In , we present an efcient algorithm that always returns a valid assignment in the coreunder minor conditions on the preferences of the authors. We also observe that reviewerassignment * \"S methods currently used in practice generate such adverse incentives quite often.",
    "Abstract": "Lar conferences sch NeurIP an serve as crossroads various AIelds, since they submissions from st numberof communities. Ho-ever, in some case, this has resulted in a poor rviwing experience for socommuniies, subissions get assigned ess reviewers outsideofter comunities An often-advocated is to brek such largeconference it smaler conferences,can lead to isolationof communitiesand harm Wetackle this challene by troducing anoton of grop aled the core, whih requrs ossiblecom-munity of researchers) to be teated in a way that prevents frouilatrally benetn bywithdrawing from a large conference.We a simpe peer revewmodel, prove that it always admits reviewing asignent in addesign anefcient agorith one uch ssignment.We use realfrom CVP ICLR our algorithm toxisting reviewingassignmnt algorithms on numbe of metrics.",
    "Ivan Stelmakh. Towards fair, equitable, and efcient peer review. In Proceedings of the 35thAAAI Conference on Articial Intelligence (AAAI), pages 1573615737, 2021": "Yichon Xu,Xiaofei an Shi, Nihar B In Proceedins the 2th InternationalJoint Cnfrence onIntelligence(ICAI),616622, 2019.",
    "(b) Execution of Filling-Gaps": "Onthe table, the assignments that established in each * \"S round of PRA-TTC PRA-TTC, papers, p4, p6 are not completely Thus,U = {4, 5, 6} and = On the right table, see the execution of Filling-Gaps. In Phase where (6, 5), at the rst since p3 authored by an agent in U {6}, is not by6 and completely p3 is assigned to while is removing form 1 in which p6 is nowassigned. At the second round, since authored an agent in U \\ {5}, is not 5 and completely assigned, p4 is assigning to 5 while it is removed form 1 in p5 is nowassigned. , 5 6 4. , 3 5. and 6 = * \"S 2. 3 = 1 2 5. , 4 = 3. Execution of CoBRA when n 6, kp = 3, = 3 4. There isa cycle in greedy graph which is eliminating at the rst round of Phase 1.",
    "P i , we add an ege from i to i, where  is": "P i = .PRA-TTC strsth empty assgnment, costructs the preferene graph searches for directed cycle. Ifsuch a exists,eliminates it as fllwig: For each (i, i) that s included thecycle, it asigns subission pi, (if ssubmissions re completely assigned,it ad removespi, from , it is completely assigned. Thn, the algorithm upatesthe rfernce graph and continues to eliminate cycles in the wy. there are no the preference raph, algorithm and returns sets, U and L. rstset contains the that some their submissions are incompletely asigned and the set Lcontains the last |U| + 1 agent whose al submissons compltel assigned.Filling-Gaps. CoBRA call illing-Gaps, if U that rom PA-TTC is non empty. Be-for we describe the aso need o introduce the notion a greedy Supposehat we a partial assignment R which indictes a set U that contins ll he agent whose one submision isincompletely assgned. dene greedy graph G = (UE R)where (i,i) R if R(i, = 0 somepi, P i. In oher wrds, while the preferencerph, i pontsto her favourte potential with respect to of her incmpletesubmissions, in he aent ipoints to any agent in U \\ {i that could at o er sbmissionsthat is assigned. consists of two phases. In thers phase, startig he partia R hat wascreaed from PRA-TTC, it thegredfor cyls elimintes y ssigning pi, to i for each(i, iin cycle tat exits due pi, (when n exists to multipe sbmissions,the algorithmhooses one of tem arbitrary). t updates",
    "to some i U L \\ {(t)} and is not reviewed by (t). Moreover, we show that there existsi that reviews pi,, but does not review p(t),": "(t). since pi, is by kpagents not from (t), while p(t), is strictly less than kp it exists an agentthat the former submission but not the It remains to that during executionof the t-th iteration the for * \"S loop the second phase of Filling-Gaps, it holds |Ra(t)| =[m] |Rpp(t),|. Note if we enter the while of the t-th iteration it is indeed truethat |Ra(t)| = then whole while loop propertyremains true, since as we show in this case there are pi, and i with the desired Lemma we that this is true when we second phase Filling-Gaps. Before,round t, if (t) is assigned a new to review, * \"S she is removed one of old assignedsubmissions, none her incompletely submissions assigned to agent. we have the desired property, we rst enter",
    "L the last kp |U| + agents in N \\ to all their submissions assigned ;": "We als remak * \"S tha our algorithm takes onl thepreference rankings over indiidual reviewerss input and * \"S produces n assignment R hat sguarante to be in the core accorded to every preference extension of satisfyn order separbilityand consistency.",
    "Discussion": "Thisfainess sures that each sucommuity at least as well as * \"S wold be if it wasno pat the lrger conferene community.",
    "Proposition 1. each t [|U|], reviews all the incompletely assigned eachi U {(1), . . . , (t 1), (t)}": ", ( 1), (t)} has a outgoing edge (t).",
    "consistency, we get that R i R which is a contradiction": "In this ase we have N = U as |U L| = + Thi meanstht eah i U and [m], Rppi, = (U L) {i}. Now, le 1 = Rppi, \\ Rppi,). that it is that while pi, ssigned t agent i in PRA-TTC, it wa * \"S mved anotheragent during the xecution of But, i longs Uand we can ocude that if * \"S pi issoe i N U th outputof CoBRA, took during te excution of PRA-TTC.",
    "A preliminary version was published in the proceedings of NeurIPS 2023.2": "reviewingreolve this bythe various commuities satisfac-torily. We clarify that the golis rodblocks to creation of rather o mitigate ham imposed on communieslrge conferenes. we adapt notion as the core ; o estofour we the tointroduce it to the peer setting. For a reviwing asinment be in th core, it must ensurehat no community(subset of researchers) can eviate by setting up conference which (a)no her own submission, eah from the comunity eviewedby ust as many rviewersbeore, but nw from * \"S within communty,(c eac rviewer mr papersthan nd(d) h re ssiged tobetter rvewers thecommunity happier.Note denitioproides faress o every pssible ommunity, andnot nyto a is case fairness denitions such as demogaphic parity andequalized odds thatare * \"S poular in machine learnig In prtcular, it ensuresfairtreatment to emrgng comunities befoethey become visible.",
    "shows an execution of CoBRA on a small instance. Let us describe how we get": "By cotinuing to deect cycles preerence grph te prefrences,we conclude on the partl assinment show n the table on lft. By * \"S eliminating tis cyle we assign p3 p2 to 3 and p1o 2. Hence ther is nly cycle and that whyisssigned to p4 6. (5 as 6 reviews , but review. Hence w proceed * \"S the second phaswere there ar two non-cmpetey assgned papersp5 nd p6.",
    "where the rst equality follows from the assumption that |Ra(1)| =": "Supposethat the hypthesis for t 1. (t (t)}. Mreover, w note(t) all the submissions of ll the gents inU L {(t)}. [m] |Rpp(1),| and the sec-ond inequaliy follow from |U = kpan ach agent hasm submissionsBut we wold coclude thtall he submisins of (1)are completely assined since (1)has m andeach of them shoul ssignd to kp revewrs which is a conradiction. Thus, any incompletely belong to to oe agenti \\ {(1),. , (t1)} are compleely assigned. Moreover, fom Proposition we know tha (1) reviews all incomplete assigned belongto some i U\\{(1)}. gt that since (1) rviews all incomletlyassignedsbmissins she cannot al the submisions o all in i L \\ {(1)}there exsts a completely asign sbmision blongs some i U L \\ {(1} anis not reviewing by It remains shw that the of the 1-th ieatonof orloop in second phase of Filing-Gaps, it holds = [m] et that|Ra(1)| = [m] |Rpp(1),| is truedring execution of the ieration loop by oticing that from 2, know that this is true when we rst enter th whileoop of second phas. Indeed, we for contradiction that () all the of agents U L \\ e ave."
}