{
    ". Results": "Also,the number of comparisons sill affects nequity, but it isdifficut to disentangle its effects and diferentiate the minorrend rom maor trend of inequitby votingatterns. Th value for mrics for theegression poblem type can be seen in Figure a. We hav consdered the Leaning-To-Rank task on theStreetiew Image Dataset as Regression rolem, wherethe model utpus sores for both the images inthe com-parison and is traied to match differncein the pre-dicted score to te scor provided by the participant fortheparticular comparison. Here, he inequity seems tobe brougt about majorly by the voting pattens as the meansqured rror (MSE) used t tain themodel penalse themodel for every minute discrepancy wth uers compar-isos. Ad-ditioally, te inequiy seems to be highrin cae of criteriawhere th model seems to perform the bes overall,as seen in b and c. However, given a dif-ferent oel, ths learned votng patern an difer.",
    "driven cost-effectveness, perpetuates ivisibility andexploitationofworkers, those from thgloalsouth": "the failure to the soio-cultualcontxt within wich introuce biasesito atasets. For * \"S algorithms trained on datasetsdevod of thecontext o my ina-vrtently pepetuae biaes against certin minrity groups. Furthermore the identiies of worers involve inan-nttiosarfrequenty overlooked, to a lack of n viewpoints ctr within datases address these we in a specific socio-ultural cntet dataset and developent. We argue hat this p-proach notbass within datasets but alsoosers the creatio of highr-qulity dta reflcting diveseperspectives. pub-li sae qality is inheently subjectve, as demonstratedby showing variations across culuralgroups. Leveraging our propose methodology inco-design nd EDI principles, wecurated dataset ofstreetview image anotatd by a divese grou of ciizens Using this daset, we trained a baseine AI model to scorpuli space images along variou iensions.",
    "Abstract": "However,concerns persist regarded transparency and contextof data collection methodologies, especially when sourcedthrough crowdsourcing platforms. To ad-dress these limitations, we propose a methodology involvinga co-design model that actively engages stakeholders at keystages, integrating principles of Equity, Diversity, * \"S and In-clusion (EDI) to ensure diverse viewpoints. We apply thismethodology to develop a dataset and AI model for evalu-ated public space quality using street view images, demon-strating its effectiveness in capturing diverse perspectivesand fostering higher-quality data.",
    ". Introduction": "Curret advancements in AI heavily rely on the availabilitof large-scale * \"S datasets meticulouslycuratedand annotatedfor trining purosesThe sgificance of such datastshas been unerscore by thsuccesof models like Chat-GPT, which leverages Reinorcemet Learning with Hu-man Feedback (RLH) to fine-tune models based onhmaninput. This reliance o crowdsouring, often.",
    "Co-design fosters inclusivity by integratingdiverse viewpoints and voices into the design process,which lead to fair algorithms that better members of society": "This inclusive pproach ot only e-hances te and of te data but asoad equity the rulting algrithms models. Recruiment forts tareted vaouscommuity organizations representing diverse underrepre-etd groups. Each com-ponent f EDIis integal tocreating envronments whereal have equtable opportities to thrive, of or idetiyn the context and datet w that principles repramount hould be * \"S carefully considered,particulrlywhen selecting annotators. Based ese we have eveloped method-ology creating a and n I modelto evaluatethe of pubic spaces using sreet-ie images. Diversity, and Inclusion (EDI)principlesafoudationa framework vaues ndaimed atfostering representation, and withinomunities ad societies. Owrship: Stakeholders a sense over the final AI, aing actively participatedin its creation inception. Amongthe participants, identifie as. total of par-ticiants wereto take the andimagennotations.",
    ". Equity Metrics": "inspiration has drawnfrom equal-opportunity fairness metrics and also theGini , which is widely used in economics the inequity wealth distribution in society. To for a respectto the participants domain, we view the problem generative problem, where participants togenerating the final ranking. Maximal Per-User Accuracy:.",
    "Accmax = maxi,j (Acci Accj)(1)": "Here, cci an Accj are it respect to theith and jth user. This mtric aims t alculte the max-imum difference te accuracy of two users.",
    "M Asro. Trsforming societybytech-nology: the scienceand pltics participatory design. Ac-counting, Mnagement Information Tecnologies 10(4):720, 200.": "disagreementsLooking byondthemajority voe * \"S insubjectiv annotatins. * \"S Transactions ofthe Association for Coputational Linguistics, 10:92110,202. 1 Anne AH de Hond,Marike M van ad inaernandz-Boussard Journal of MedicalAssocia-tio, 9(12):21782181, 022.",
    "To evaluate the quality of public spaces, we compiled adataset of pairwise comparisons of street view images": "To this, weimpemented a sam-plin sratgy. Initially, we samped a 50m cov-ering entire region idetied locations ith street-view images neaby. However, this introduces oting attrns. In he sec-ond stage, we randomly selected subst ofimages fromhe reained locations. ould in-dicate theirpreference adjusng thepositionof the Appenix C. Subsequently, we exclded locaionswithout images within of ess than 1m. AnnotatonsThe dataset consist of parwisecmpaisos etween woimaes. hs trateg aimed boost thenumbr f imagesampled regons th highe streevewdity, typically correatin with higher populaiondnsity and more divers sacs. magesThe dataset coprises 7,33 view imgesgatheing from Greate Montreal images from suh a vasarea oses challenges, acertain regis are more denely populateddiversthaothers. Partciats were tasewith selectin th prefrred iage based on given crie-rion uing a cursor fro -1 to 1. vaues denoting the image positive values for thclose toindicating no Tis scorinthod, differing o simple binary choices, mitigate Ar-rows imossibiltytheorem , as More-over, employing continuous score allows for quantizationinto finite bins during training, offrg adding flexibiliy.",
    "N(2)": "Aci theaccurcy with respet ith sr,Acc=1NNi=1 ci the erae pr-user Accurac,and N the numbr articipants. A standr deviation will * \"S imply n-equal distribution pe-user accuacies, whichi-ply hat users are provided with eqal opportu-nity to the rankings. Gin over Per-UserAccuacy: The ratio underneath th of Equaliy(all th uses hav-ing the sme per-user accurcy an area underneaththe orenz Crve(give by cumuativeper-usr ccu-racy). to the clasical definitionof * \"S Gini Coeffi-cient rspect to the relative differece:.",
    ". Expeimentation Details": "We haveall in work ued PyTorch The model with performnce anEfficientNet feature on ImageNet, it weghtsavailable from theorchVision ackage. t also hasa with 256 dimenins. traning, e hae randomlyth dataset in an split fortraining and validation.We trained he * \"S Baseline * \"S model over 0 epochs thetraining size3. Finally, we usd early stoppng stopthe modl from overfting and have staed the results the hichperormance training.Additionally, to the effcts tochatiity, wehave replicated the te ptimal hyeameters five times, wt diferent initial seed",
    "women, 5 as belonging to an ethnic minority, 2 as handi-capped, 10 as members of the LGBTQ2+ community, and2 as belonging to a religious minority see Appendix A": "Identification of Evaluation Criteria:To capture the di-verse uses of public spaces, we defined 35 criteria for eval-uating their quality. Thefull list of criteria is presented in Appendix B.",
    "The methodology we propose is grounded in co-design andbuilds on EDI principles": "In thecontext of * \"S AI, we that a methodlogy based on co-design can mitigate bias fromalgorithmsand that careult from such bias. Unlike conveioal design methods, which may only in-volve users once a is completed, o-design aims tointegrate stakehoders t every phase of developmet. known as paticipatry design or ebodis an aproch where stakeholders e * \"S ac-tively engaged throughout the design to ensure thatthe meet their pference. For emple, a baseon o-design rejects practice crowdsourcingand seeks to involve staeholders direty the an-notation poces The beefits involving sakeholders."
}