{
    ": Average metrics computed over the train set (40 samples) and test set (24 samples) of the UruDendro dataset": "the mets esus ver the EH dtase reszed to 1500 pixels in the longerdimension As be there appears be minor imrovement both metrics (test st)regarding the resultsinthe rignal article, whichcan e the we ground truthcenter bounaryiut and modifcation in iput imae reslution.",
    ": Pith samples from the UruDendro dataset. In the Pinus taeda species, the characteristics of the pith presentdifferences within the species": "model best performs on the UruDendro training set was chosen. This is done by using a combination of cross-entropy loss and Dice loss, as shownbelow:. The Segmentation f ) * \"S * \"S how segment the pith for Pinustaeda species. As shown in the pith vary greatly within the the pith size, relative to the sample size, much smaller taeda in Shrub As seen the size for much bigger than the samples inthe UruDendro dataset. INBD uses a loss combines three it detect (background, boundaries, andcenter region).",
    "A Brief Analysis of the Iterative Next Boundary Detection Network for Tree Rings Delineation in Images of Pinus taeda": ":Disks F0c (First row),L03c(Second row), (Third row). The INBD method to errors originaed in rings alongradia The irst colun In thrd column, the absolteerror betwee the detections andthe ground truh ring is visualized, ithfrom low error) tble (hgrror)",
    "Henry Marichal, Gregory Randall": "Te first columndisplays the rw disk. INBD metho cannot recover from an eror i the firt rings.",
    "Training": "The training must be done sequentially because procedure for the g needs the (more details can found in ). train the INBD model with the UruDendro we randomly divided it train andtest sets with 40 and 24 images, respectively. UruDendro images and 1123 rings. Even the EH dataset has images, the UruDendro dataset hasmore rings per image. The.",
    "Experiments and Results": "This the inference results ome samples the est et. follwingmodiicatios made the code: First, the infrence code was updted to accept the pithbounaryn input shown in, the the H dataset i relativelybigger in th UruDendro dataset. code ws also odfied to cceptthe mas as annp, usin it as a stopigcriterion. As son in, the automatic background detction isnot working properly, and the ak solves this poblem for the erformance",
    "Quantitative results": "section presents quantitative metrics evaluate the the model. Recall (R), and F-score (F) metrics are used. We follow methodology defined todetermine assignment of * \"S detections to each ground true ring. The mAR * \"S and ARAND metricsdefined in the INBD article are also utilized. Notably, the F-score decreases in order of the disks which aligns with.",
    ": Samples from UruDendro dataset": "Even if INBD originally for icrocpy images shrub crosssections,he gobl structre i the same: a pith surround by concentric nnual growth rings n the diskscenter. Inthis work, w stuy INBD, a neural network-based aproach presenteoriginally deelpedfor delineatng nual in icroscope images 4some examplesf tose partof theEH datasetWe the networktautomatially ree rngs in oss-sectionimagesof Pinus taeda. The uthors orginaltraind the model applying 4x resiz factor to the images, reduin the raw resolution (beteen2000 and 3500 pixels wid) to a fina resoution 500 and 875 EH dataset. n this ay, dont lose resolution on the thicker ings. Given this, ue th oiina taine on the EH dataset, and refine the modelwiththe Urudendro datas. emake two small modifcations to the autors implemntaton. he ptimal size found n to process th UruDedo datase, consieringthe width of thering. Secondly wesubstitut the interpolation used with a Lanczosone, Pillw3 library. As in imags are f veydiferent and the exture very ferent to speciescharcteritics This dataset is named UruDendro, and ts smpleare from rees nthenorthen prt o Uruguay. irs we the dension) maintaining the Next, we tnd the using the EHdatase Finall, weevaluated the INBDmodel using metrics provid in nd. spefi proedure t conduc our expriments. TheUrudendrodataset size imges vary beteen 700 ad pixels width."
}