{
    "Wei Yang, Masahiro Toyoura, and Xiaoyang Mao. Ef-fect of facial makeup style recommendation on visualsensibility. Multimedia Tools and Applications, pages843853, 2014. 2": "A graph neu-ral networks-based framework with embedding for personalizing tag recommenda-tion. 1 * \"S Chunmei Zhang, Li Zhang, Weibin Zhao, and Hai Geng. Understanding hyperbolic metric learningthrough hard sampling. In Proceedings ofthe IEEE/CVF on ofComputer Vision, 18911903, 2024. hyperbolic temporal process for user-iteminteraction sequence 2. Yun Yue, Fangzhou Lin, Mou, and ZimingZhang.",
    ". Introduction": "In the distance the in-creases exponentiallas one moves towards the outsde space. Ti propet makes well-uied for moel-in hierachical data by representing th node orgin leaf nodes near thesurfae o the ncomputer vision, its effectiveness as confirmd onman tsks , ncluding classificatio , re-treval , segmentationthis paper, we a nw fashion item recommen-ion thatncorports hyperbolic geomery intouser and represenations we name it HyperbolicVi-sual Attentive Collabotive Filtering (HVACF). Using space, our ais o apture implcit hierar-cies fashion itemsbasd their image data andusers purchase histry. Totrai our model, we a.",
    "Yi Tay, Luu Anh Tuan, and Siu Cheung Latentrelational learning via memory-based attentionfor collaborative In Proceedings of WorldWide Web Conference, 2018.": "Yi Tay, LuuAnh Tuan, and Siu Cheung Hui. Hyper-blic repreentaion learng for fast and fiient neu-ra questio answering. In Prceedings ofthe ACM In-ternational Conferece on Web Search nd DataMin-ing, pages 58391, 201. 1 Yi Ty, LuuAnh Tuan, and Siu CheungHi. Hyper-bolic epresentation learning for fat and efficientne-ral question anwering. 2",
    "Ilya Loshchilov and Frank Hutter. Decoupled weightdecay egurization. In Poceedngs the International Conference n Learning": "In Proceedings ofthe Conference on Artificial Intelligence, vol-ume 36, pages 19261934, 2022. 2 LeylaMirvakhabova,EvgenyFrolov,ValentinKhrulkov, Oseledets, and Alexander Performance of hyperbolic geometry models recommendation 2. Adaptive poincare to set dis-tance for few-shot classification. Ma, Pengfei * \"S Fang, Tom Drummond, Harandi.",
    ". Impacts of Hyperparameters": "shows thatsetted to small harms the indicat-ing that is to consider hyperbolic andEuclidean distances during b shows c is set too large, the performance drops asa result of the radius of the embedding space (ball) 1/c.",
    "Bike Chen, Wei Peng, Xiaofeng Cao, and JuhaRoning. Hyperbolic uncertainty aware semantic seg-mentation. IEEE Transactions on Intelligent Trans-portation Systems, 25(2):12751290, 2024. 1": "In roceed-ins of Internatona ACM SIGIR Conferne onRsearch and Dvlopment in 335344, 21. Attentivecollaborative fiering: Multmedia recommendationwith iem- and component-level attenion. n roceedings ofthe Visin * \"S and Patten Recognition2021.",
    ". User 2D-representations compressed by tSNE on Amazon Women": "to 512 for models. Wetune learned rat r {0. 01,1, 0. 01, 0.001} for each moelon theperforance th validation Inceptin V3is usedas the backbone image encoder model for all models withvisul its paramtes arefreeed during train-ng.",
    "where is a scaling factor (the larger the value is, thesharper the attention score becomes), which we set =": "E() is apre-traie backbone encodermodel and I is the -th itemsiage data. Wu,Wv, WRDD, ad f RDDpoolenote tansformation matries for te uers, tes, anditem visal feates etrced by the imae encoder, respc-tively (Dpool is dimension sizeof the final poolg layer ithe backbone model); b1 RD is the biasectr of the firslayer and w2 RD and b2 R are the weighing vectoand bias o the secnd lyer.",
    ". Performance with different hyperparameters": "The area under theROC curve (AUC) is used for evaluation, following previ-ous work .",
    "Tran Dang Quang Vinh, Yi Tay, Shuai Zhang, GaoCong, and Xiao-Li Li. Hyperbolic recommender sys-tems. arXiv preprint arXiv:1809.01703, 2018. 1, 2,3": "Luas Vinh Tan, Y Tay, Shuai Zhan, Gao Cong,and Li. Hyerml: A bostimetric learn-ng approch in spac forrcommendersystem. In * \"S the International Confer-enceon Web Serch and Data iing, 60967,202. 1, 2, 3 ang, Defu an, Hangang Lu,ZhenyaHuang, and Enhng * \"S Cen. ACM on Informatio Systems, 40(2),201.",
    "Ruining He Julian McAuley.Vbpr:Visualbayesian personalized ranking from implicit feedback.In Proceedings of the AAAI Conference on ArtificialIntelligence, 144150, 2016. 1,": "Chen-Kang Hsie, Longqi Yang, Yn CuTsung-YiLin,Serge Belngie, andDeborah Estrin. learing. 2 Wang-Cheng Kang, Chen Zhaowen adulian McAuley. Visualy-aware fashion ecommen-dation and design with image models. InProceedins EEE Intenatinl inng, pages 207216, 2017. 1, 3.",
    ". Recommender Systems in Hyperbolic Space": "This property is well-suiteformodelinghierarchis and has been used for representation learningon various tasks. Previouswork ao showed tht i is effective in capturing thecom-plex interactions between items and user preferenes in rec-ommender systems. For instance, Tranet al. Lucas et l Other studspropoed recommndation * \"S models that incorporate hyper-bolic geometryito grah-basing mehods ;temporal pint * \"S pocess ; or autncoders. proposing a method based onhypblic space,calling Hyerbolc Bayesian PersonalizedRanking (BPR),and Benjamin e al. In yperboic space, te distanc from the originincreases exonentially s one moves towards sufaceof he space.",
    "Abstract": "Our ablation studies show that multi-task learningplays * \"S a key role, and removing the Euclidean * \"S loss substan-tially deteriorates the model performance. 1.",
    "Training a Model in Hyperbolic Space": "Among several isometric models for modeling hyper-bolic space, this adopts Poincare ball model, the most models in vision . In this geodesic distance be-tween and in hyperbolic := {x, y Rn cy2 < 1} for c 0 is defined as follows:",
    ". Neighbor-Attentive Aggregation": "popose mde extracts user prefrences sed purcase andimage data of iem. ; RD} RNuDebedings andV vn;. ; Nv]|n RD} RNvD denote separate embeddins associatedwiththe items. ; pn;. ;vNv]|vn RD} RNvD * \"S and P = {[p;. ere,U =. * \"S.",
    ". Analysis of Embeddings": "shows the norms of he anditem embed-dings trained on Amazon Women datai (i. 360. e. It cleary items users are separatedin mbedding space, with the items being laced nearthe origin the users apped the ballsNext, we analyse the ofthe users and iems in 4a-4c, where eah plot is coloredbased te logartically transfomed alue of te num-ber of the purcases or purchases We can purchases are mapped ar usr em-beddins. This indcatesthat popular items tnd to be mappd the orgin,andour proposed modl item onhowpopular they are among users. h(u) nd h(v), respectively), the distance tributions from the bas thespace."
}