{
    ". Challenge Results": "Qualitative rsult: First,we performanceof baselineon our OEM-GFSS benchmark in. Nonethees, thebaselinedemonstrated wel performae ovrall both onthe noveland bse clas * \"S performance, dueto its transdu-tiveinferece that to cope wih he challenges pre-sented tet set. Quantitative results: shows thechallenge re-sults for the to phases, where the firstevaluate onthe validation the second he test set. Itshos IoU per class for both the ase and novel classes,the mean for base and novel, and weighted whichwas used score to the winningentries. In the first it shows that was the win-ning entry, where t outrormed mthos inthe mIoU the nd thefinal weihted * \"S aver- age. FoMA relied on enriching labels and dstllig from a vision languagemodel which re-sulted in such performance. I he seondphse, SegLand outperforming all te other methods theranking scorewit aconiderabe margin due to the ensem-be of learners.",
    "Yuan Hu, Jianlong Yuan, Congcong Wen, Xiaonan Lu, andXiang Li. Rsgpt: A remote sensing vision language modeland benchmark. arXiv preprint arXiv:2307.15266, 2023": "Steve Immanuel Hagai Raja Sinulingga. Proceedings the IEEE/CVF Confer-ence and Pattern Recognition (CVPR)Workshops, pages 27552761, 2024. Noah Johnson,Wayne Treible,and Daniel Crispell. Opensentinelmap: A large-scale land use dataset using and * \"S sentinel-2",
    ". Introduction": "his work explores generalizedfew-sht semantic segmentation its itersection with re-mote snsing, specificlly, fcusing o submeter-level lndcoer mapping. These remte seningfoundation models focuing n eth self-supervised learnng r sio-language modelling. There has also been anemergece of oundation models for remote sensing, whichrefer to models trainedon broad datasets wth powerful generalization capabilities. , support set) to eneraliz to unseen nvel classesinte target imaes (i. e. This mechanism is referring as metalarning. Although it isof paramount importance specificaly with the currnt re-easeof foundation models and the demnstration ffw-shot promped of uch models. Onthe other han, few-shotlearnngwhich enbles deep learn- ingmodels to learn from few rained exampes, is still rel-atively underexploring in reote sensing. The emergence of fondatio models has marked new paradigm for few-sho learning whih explores few-sot rompting * \"S of such odel. Few-shot learning is guiding by a few labeling examples(i. Deep learnig has shown great success in remote sensingapplcations with varous supervised learnn tasks such sland over mapped (i. Insummay, our contributions are twofold: We preent OpenEarthMap generalized few-shot se-mantic egmentation(OEMGFSS) dataset, a sumete-level land covermapping dataset, xtending the8 claseso OpenEarthMap to 15 fine-grained classs. Thebechmark dataset and chllenge serve to provide a base-line for researchers interested in pursued learnin in low-resource settings fo the ask of lan coermapping. e, semanic sementation) and crop yiing predction. This is consideraby ore challeng-in than stnard fewshot semntic segmentation yet, odate, there is no edicating benchmark dtaset for generl-ized few-shot semanticsegmentation in remote sensing toth best of our knowledge. , query et) Mst approaches emulatethe nferece stage during training y sampling pairs of sup-ort and query sets. We proposaeneralized few-shot sean-tic segmentation benchmak daase or remote sensin thatwe rlease * \"S as part of he first chalenge of this task, whichbuilds upon the recent dataset, OpenEarthMp. A recently proposd generaizing few-sot semantic sementation stted defines a more realisticscenario where te goal is to perform we on al clases,nveland base. Tre have een ariouswoks on few-shot learning for the task of semanic sem-tation in atural imge where it stated with seg-mentin the ovel classes with respect to he bakgroundin he query set. e.",
    "similarities and imbalance from generalized few-shot seg-mentation.In Proceedings of the Conferenceon Computer and Pattern Recognition pages 27622770, 2024": "Qinglong Xiaoxu Feng, Gong Cheng, andJunwei Transactions and Remote Sensing, 2021. Openearthmap: A benchmark dataset forglobal high-resolution land cover mapping. Jiaxuan You, Melvin Low, David andStefano In Proceedings of conference on artificial intelligence, 2017. In Proceed-ings of the IEEE/CVF Winter Conference Applications ofComputer Vision, pages 62546264, 2023. Junshi Xia, Naoto Yokoya, Bruno Adriano, CliffordBroni-Bediako.",
    "Guneet Singh Dhillon, Pratik Chaudhari, Avinash Ravichan-dran, and Stefano Soatto. A baseline for few-shot image clas-sification. In International Conference on Learning Repre-sentations, 2020": "Tianyi Wei o, Xing-Ao YuanaoZhao, PingMa, Mengjie Xie, Hang u, Ren, anZhi En-rich distill and Gralized w-hot semantic in remote sensing leveragin models Proceedins te IEEE/CVF Conference on Coputer Vision and Ptern eognition CVPR) 27712780, 2024 Gupa, Bryce Goodman, Nirav Patel, Sajeev, * \"S Eric Heim, Jigar Doshi, Keae Lucas, and * \"S Matthew Gasto. Creatingxbd: A forasessing damage imagery",
    ". Few-Shot Learning": "While theprevious works mainly focused on natural images, there hasbeen some exploration of few-shot learning in remote sens-ing. Few-shot learning has been heavily investigated in vari-ous tasks including classification and segmenta-tion. It also provides additional challenges arisingfrom forgetting the base class performance when learningthe novel classes from few examples. OEM-GFSS has a greater rep-resentation in Europe and less in Oceania and North America. On the other hand, our bench-mark focuses on more realistic setted for the generalizedfew-shot semantic segmentation, where models are capa-ble of segmenting both the base and novel classes in N-way manner. The number of images and geographical regions in theOEM-GFSS dataset across the six continents. For example, few-shot seman-tic segmentation has seen the prevalence of multiscale ap-proaches and the exploitation of dense pixel-to-pixelaffinities between support and query sets. Few-shot learning in remote sensingwas explored in scene classification and in land covermapping.",
    "et al. On the opportunities and risks of foundation models.arXiv preprint arXiv:2108.07258, 2021": "In Proceedings of theEEE Conferencen ComputerVision andRecog-nition paes 201. Yezhen Samar Khann, Chenlin Meng, Patrick Li,rik Rzi, He, Marhall rke, Dvid * \"S oell, ndStfno Pretraining tansfrmers fortemporal and lti-spectal satelte imagery. Gong Liming Lang, Xiwen Yao, Chen, Lei and Junwei Siaese-prott network or fewshot remte sensing image sceneclassification. Deepglobe A chllenge parsethe earth through satelli imges. IEEE o Geoscience RemoteSesin, 60:111, 221. ke Koerski, David GunPang, in Huang, Saika Bau, Forest Hughes Dei Rmesh Rasar.",
    "Abstract": "Learning with limited labelled is a challengingproblem various including remote Few-shot segmentation is approach that canencourage deep learning models from few labelledexamples for novel classes not seen during the training. previous datasets andbenchmarks discussed few-shot segmentation setting inremote we are first to propose generalizedfew-shot segmentation benchmark Thegeneralized setting is realistic and challenging, exploring within the remote sensing context. few-shot segmentation setting has an additionalchallenge encourages not only to adapt tothe novel classes but also maintain strong performanceon training classes. The the Open-EarthMap land cover mapping generalized few-shot chal-lenge the workshop in conjunction with CVPR2024.",
    "Z. Tian, X. Lai, L. Jiang, S. Liu, M. Shu, H. Zhao, and J.Jia. Generalized few-shot semantic segmentation. In CVPR,pages 1156311572, 2022": "Aysim Toker, Lukas Kondmann, Mark Weber, MarvinEisenberger, Andres Camero, Jingliang Hu, Ariadna PregelHoderlein, C aglar * \"S Senaras, Timothy Davis, Daniel Cre-mers, et al. In Proceedings ofthe IEEE/CVF Conference on Computer Vision and PatternRecognition, pages 2115821167, 2022. Dynamic knowledge adapter with probabilisticcalibration for generalized few-shot semantic segmentation. In Proceedings of the IEEE/CVF Conference on ComputerVision and Pattern Recognition (CVPR) * \"S Workshops, pages27812790, 2024.",
    ". Data Curation and Annotation": "2) by inspect-ing all the images, excluding xBD images, in testset of OpenEarthMap. We first pre-pared a set of new classes (see. This resulted in 408 images that were sampling from 73regions of the 97 geographical regions across the 6 con-tinents in the OpenEarthMap dataset. 5mground sampled distance as in OpenEarthMap. The images are of thesize of 1024 1024 at a spatial resolution of 0. The OEM-GFSS dataset extends the 8-class coarse-grainedland cover labels of the OpenEarthMap dataset to 15-class fined-grained land cover labels. If there is a disagreementbetween the two annotators on a particular labelling, a thirdperson verifies it.",
    "Note: The weighted-sum mIoU is calculated using 0.4 base mIoU + 0.6 novel mIoU": "balance arising. The fourth winner, P-SegGPT ,relied on a learnable prompting technique for SegGPT foun-dation model. Finally, the fifth * \"S winner, DKA , focusedon improving the adaptability to novel classes through effi-cient parameter tuning and overcoming the catastrophic for-getting * \"S on the base classes through relabelling the trainingset."
}