{
    ". Selected images and the corresponding GradientSHAPmaps for 7 vs 1 and four-lter Features the of 1 are red, and 7 are green": "GradientHAP maps * \"S indicate that features leadingtoclassicatn sthe positiv clas (7) inclue he top el-bow and the mddle line of the seven. Remarkably, these mapalso expres uncertanty earding th misig porio fthe sevens upper section, validated our hypothess that themoe has diclty learning this featur.",
    ". Synthetic Data Generation": "Howevr, contrary ex-ample is ou least accurate clasier, wich prodced real-istic (low FID scores) synthetic images that wee unrealitic(highFID scores) near the decision boundary. 1 This processresulting in average FID score increase f250 points forimagsner the decision ounday and an average 86% reduction inimage coun post-lterng. TheMNST 5 vs 3 subse usin a CNN with one lter atainedhe lowest accuracy of 2. Aftr traing GASTeN foreach classer-datasetub-set combination, we generated 15,000 synthetic images andsubsequently ltered those with ACD < 0. 53%, while 8 vs 0subse witha four-ler CNN reahedthe highest accuracy of 98. 92%.",
    ". Borderline Prototype Generation": "summaries the propoed ethod.The model thatis being subjece to strs-tst must a dep binayimage clasication it is referred to as theModelTesting (MU). We lte the images byACD < 0. 1 o esure o-condnce Particular hyperpramters artuned, considering the secic aracteristics o thelow-condenceegion, explain in Sec. te fourth step we evaluate repreenativenesseeced pototypes vsual inspectn. Then, analyz thepo-sitonig ofthe prototypes ithin the 2D created. in-depth analysis whythese images close to bunry, we use GadientSAP techniquethat explains the contribuion each pixel t he modelotput by integratin with SHAP vaues.",
    "Kilian Hendrickx, Lorenzo Van der Plas,Wannes Meert, and Jesse Davis. Machine Learning with aReject Option: A survey.": "Distillation with SamplesSupported Decision Boundary. 2 Martin Heusel, Hubert Ramsauer, Unterthiner,Bernhard and Hochreiter. bya Two Time-Scale Update Rule Converge to a Local In Advances in Neural Information ProcessingSystems, pages 66266637. Curran Associates, * \"S ,",
    ". Conclusions": "ExplinableArticial Intellgence (XAI): Cneps, taxoomies,oppor-tunities ad challenges toward reponible AI. Further reerh incudes improvin the generation ofambiguou imaes,exploing othe clustering and embed-dig techniques for imprved erformance, anddeeop-ing quantitative metrics t validte our prootypes taist-cally. 46858);Competitivenes and Internation-aisionOperational rogrmme (POCI) d LisbonRegionalOperationalPrograme(LISBA2020),nde the PORTUGAL 2020 Partnership Agreemen,thrghtheEuropeanRegionalDevelopmentFund(ERDF); NetGenAI - Center for Responsible AI (2022-05i0102-02), supportedby IAPMEI; FCT plurianulfundng fr2020-202 of LIACC (UIDB/00027/220UIDP/00027/2020). GASTeN: Genrative Adversarial Stress Test Networks. In this ork, we iesgate borerlne instances that con-tain viul propertis tha maepredictions complex, evenfr huans. InformationFusion, 8:82115, 2020. 1LusCunha, Carls Soares, Andre Restivo, and Lus F Teix-eira. In dvances in Intelligent Data Analysis {XXI - 21stIn-teatinal Symposim on IntelligentData Analysis, pags9102, 2023. AcknowedgmentsAISym4Med (101095387) throughthe Hizon Europ Cluster 1:Helh,Cnnected-Health (n. Addnly, as we tested our approachon simpieddatasets, where it is possible toassss amiuity visually,the performance in complex senarios needs o be assessed Suhinsihts ar invaluable forauditingmachine leaninmols, identfying and mitigating * \"S * \"S potn-tial weanesses during development,or docueting thelimiatons of lassiers in model cards uon deployme.",
    "Erxue Min, Xifeng Guo, Qiang Liu, Gen Zhang, JianjingCui, and Jun Long. A Survey of Clustering with Deep Learn-ing: From the Perspective of Network Architecture. IEEEAccess, 6:3950139514, 2018. 2": "Margaret Mitchell, Simone Wu, Zaldivar, Lucy Vasserman, Hutchinson, Spitzer,Inioluwa Deborah Raji, and Timnit Gebru. Model Cardsfor Model Reporting. In Proceedings of Conference and Transparency, pages 220229,2019. Gregory Nari Johnson, Angel and AmeetTalwalkar. Towards a More Science of BlindspotDiscovery Image Classication Models. Transactions onMachine Learned Research, 2023. LANCE: Stress-testing Vi-sual by Generated CounterfactualImages.",
    ". UMAP 2D space for MNIST 7 vs 1 and four-lter CNN.The test set is marked by stars with 1 in red, and 7 in green. Blackpins indicate the prototypes or baseline positions": "g. g. There is room for improve-ment, possibly due to some overlap or sparseness in clus-ters. GMM clustering resulting in ei-ther small (e. 3) or large (e.",
    "Peter J Rousseeuw. Silhouettes: A graphical aid to the in-terpretation and validation of cluster analysis.Journal ofComputational and Applied Mathematics, 20:5365, 1987.3": "No Subclass Left Behind: Robustness Coarse-Grained Classication Prob-lms. In in Neura nformatin Proessing Systems3, 2, 3 Chistian Szgedy, WojiechIya Sutskvr, JoaBuna Dumitu Erhan Ian J Goodfelow, and Rob Ferus.Intrguing propties of network.",
    ". Slice Discovery Methods": "Slce discovery consist of that identify seanti-cally meaningful subgrups within unstructuring ta, par-ticularl where models perform poorly. he slice methods GEORGE ad PlaneSpot extract the emd-dings fom laye of ther model, whereasDOMINO ues pr-traine CLIand These methods thenne-tuneGMs for clusteig. These employ dimensionality reduction whenfacing hallenges igh-dimensional data, such similariy and f dimension-ality. UMAP helps preerve the * \"S essental structure of hedat, combining UMAP with GMM, as seen tudies ikeN2D , demonstrates that techniquescan improve clutern b cnsideringthe loc. approah,while similar, fousing on low-cndence Thesemethods leverage deep clustering, tech-niqe * \"S thaes neural o cature relvant inputfeatures, following by traditioal clustering algrithms.",
    ". Schematic overview of the proposed method for improv-ing the decision boundary interpretability of the Model Under Testby combining synthetic image generation and deep clustering": "Ou method, in ,comprise four stps:1. visulize he and thedecisin bounary us-in 2D andGradintSHAP. Ultimaly, our method aims for more respnsibleI odes y upportin development and auditing. generatedata the decisionboundarywith GATeN; 2. pattns n these us-ing UMAP and Gaussian Mixure Models GMM); 3. dta with undetectab to the hunadversarial exmples prior wor shown tat substof such sample resmbles geninlyhard-to-classify imaes, evenfr humas. eamples ao frdevelopingmodels with a optio good refrain on these prototyps. Resulsthepotenti the method,revealing distinct compact clutersand diverse prototypestht embody the features contribu-ing to lw-condece decisins.",
    ". Model Architecture": "Following the GAS-TeN study, we utilized a CNN architecture with two convolutional block, where h complexity is adjustd b vayingthe number oflters . * \"S Trainig GAS-TeN required choosig two specc hyperparameters be-yond th standard DCGA parameters:he confusion dis-taceweighting () nd the re-trainin epochs. The value critically inunces GASTeNs loss function, whilethe pre-training uration affects iagerealismBased o te original * \"S authors suggestins, we opted for 5 pre-training epochs fr MNIST and 10 for Fasion-MIST,each with an weiht of 25. Given our focus n classifyig similar conceptsnd analyin regions of low condence, where features areless distinct, our analysisprioritized local structures. There-fore we xplore a range of to 25 neighburs.Wealso var-id theminimu distance betwen 0.01 and 0.25 to controleedng compactness nd set the components between1 and 60 to enur etailed clustred without losing rit-ical infoaion. For GMM we variing the cluster countfrom 3 to 15 to maintaia practical number of prototypesfor analysis",
    ". Dataset": "We chose these datasets for their in-terpetbility * \"S without needing expert koledge, simplicityin size, and lack color. We use MNIST ad Fashio-MNST datasets toevaluate our method.",
    ". Introduction": "sythetic low-condenc exmples, using tchniques A-vrrialGANs) Vriational While many borderline instances consist of noiy."
}