{
    "S. VASAN and G. GURURAJ, Unhelmeted two-wheeler riders inindia, The National Medical Journal of India, vol. 34": "S. Hsieh, X. Rakla, A. Rahman, M. Alnajjar, P. R. C. Antoniussen, M. M. Greer, Trivedi, A. Ghita, B. M. Gopalkrishnan, A. Knoll, active learned frame-work for multi-modal 3d object detection, in 35th IEEE Symposium 2024, 2024. Anastasiu, Z. Kong, N. C. Sharma, P. A. Greer, B. -Y. Gochoo, M. Alofi, and M. Y. S. Wu, Pusegaonkar, Y. -W. Chen, J. Wang, D. -E. Andersen, A. Trivedi, The why, and how to use active in large-data-driven object detection for safe autonomous driving: An empiricalexploration, preprint 2024. Chakraborty, S.",
    ": Confusion Matrix of Seating Position Classification": "accuratly. sorcs erro are demostrated in helmetclassification. * \"S The ground boxs do not the whole person. Many wre taken from thelowe half of their body as they ntred the frame of th deo. Additionally, oerlapping boxes with assners andrivers, drivers have helmet on, but the passengers doot, often confuses h OWLV2, had etectedthe helmet in both cases. This aso impats person detection,as OLv2 cnnt detect the ssenger due riverobstructing most of the boy. of the videos provided the low resolutions, with lurred-out time stamps t the topleft and bttom obstructing teview of motorcycles. The regular poor conditins of orheavy air pollution compounded these fctors, swn in. of these various made imge detectionand classification challengin and sometmes near impossible. investigations to apply learn-ing in the real wold. this appication, accurtely detectinghelmets will helptoraise awareness s the a mre ccurate measure of the at wichpeope do nt wear elmets, as well a in enfrcig tewering of helmets. The ability to resond to unantipateddata is crucial for sfey systems, real-orl urpass the scope of any pre-existing dataset. To noisy pre-training the OWLv2on furtherdiverse daasets will allow it to btter hadle uncertain de-tectins Moreover, a possible improvementis further of AlexNet and OWLv2 for seatcassifiction. Finally, we will address tsk-specifishortcomings Forxmple, at times, the OWLv2 model et boundingbox over whole specifically th which thi task. A primary focu will beimrovingthe models to localize and classify thesecritial ars acurately. Despite current limitations and in data,this shows the potential offoundation models ad language-based prmpting toward he zero-shot of importantsafety hallenges. he detections fromthe infrastructure point o view can be snt to the vehicleegocetri prception in order to alertdriers the preseceomotorcycles safer intersection N. Abd, T. Rbertson,P. Petrucka, and 22, no. 1, p. 824, 202. D. F. d. Souza, . d. Paiva, . C. Leal, L. F. d. F. Machado, M. P. d. in accients inalagoas and modeling beor and thelei seca, da Associacao Medica Brasileira, vol. and H. pidemiological and riskfactors of injuriesin iran and eastern mediterranean regioncountries: systeatic review, International jounal finjury safety promotin, vol. 2 pp. 263270, 2017. A. L. Lucena S.Rodrigues, Silva,T Lima, Xavir, accidents: moridityand factorsn a ofnortheast brazil, Tanzana journal of research,vol. 15, no.4, 2013.",
    "AB IoU = Area of Overlap": "Wenote that the severe class imbalance does leave class unsuccessfully classified, though this doesnot have much on the accuracy metric. This revealsan insufficiency the learned and us for such * \"S an class performance in the confusion matrix.",
    "B. Results": "Our OWLv2 * \"S detecting motorcycls wih accuracies shownin Table I and detected personswith accuracies as show inTable III. 4122, calculatedby the area uner e curve of , andfor person detection, the aerage precsion is 0. 3561, obtandfrom. Or helet-status clasificaton was done thogh helmetdetection with OWLV2 on the rovidedground trut bundingboxes of passengrs, witha representative classification basedon helmets resenceor absence. A naive lassifier, wich aways predictsthe rider to be wearing a helmet, would have precision of69. IoU in Tables II, III, and IV stands for intersectionover union, which is the etric for evaluated th accuracy oapredicting ounding box. The I is calclated as foll:Io = AB.",
    "II. RELATED RESEARCH": "Conventional objectdetectio on manual annotations and secialized whhcan be time-onsmig and to label, espe-cill the models ae imid to frm provideddatasets e. , non-rigidly set expected TheViT of OWL-ViT refers to heVisio architecure that appies the attenti mechanism o nstead of the prior of of model uss contrastive learning beween atchesof image path encodings and text with imageach ecodings prdcing rposed clases and proposed boundig and detection asa bipartit matchigpolem ecoded image clases and as ntrodced n the etection Transforme (DETR)technique. his wasrefine and saled up self-raining OWv , whereby arepovided from a exising ad it i this use in the method shared in this resarch. For te ame applicationo detecting and laifyinghegvn objects detailed ectn I, manyeen tried in he previo AICi Challnges; in the2023 AI City Callenge Tran et al. used OLOv8for of 0. Cui al. DETA ensemble an Dtecron2 ormAP of . V e . used CoDETRith a MiorityOptimizer for classimbalaneand a pander for aP f 0. used DETA andmodel r a score o 0. mAP. ALORITHSFOR IMGE PROCEIGWITHVISIN-LANGUAGE DETCTIONo address thechallenges of accurately detecing andclassifying and helmet usagew develped cascding algorithm OWLv2. This sectin outliesour cascading detecion uingOWLv2 ad approch fo the eat classification tas. We first note that therea abstract that elatethe target classes toone noher; for eample,motorcycleand peron are the abstractclasses represented in datasche, were person can be further cassified on thettbutes elmet-wearig ad seating psition. Due tothis,ourfirst goal isto hih-level classes. Our detecion algorth, illustraed in begins detection stag. W a scne imae (reszed by : Our algorith for detecting th relevant ojects or helmet safety, well as the appropriat atribute, acts i style First from originl mage weall motrcycles. Tn, within we detect all umanoccupants (driversa pssenges). All detectonsincluding elmet detecti for the purposeclassifcation, are doe using while isdone usingAlxNet. T detec he istances on the we ex-pand he re-scad boningbox pixels the lft, riht,an top t encsuate person instnces suroundingthe motorcycle. Fo this particular portion of e tas, wetake a upervise learningaproach seek prode detected on the motorcycle ith an atribute locatio the enumerated in the introductio. Therefe, we use a network(a vriant of AlexNt, a fnl layer f four) to the on a motorcycle of the person instances detected wihOWL2. De to te of the AlexNe in th seat position clas-sification task, wethe is notompletly zero-hot. In total, this algorithmic seqence of tasks can of motorcle, associatd people, poitions,ad theirstatus ina video. IV. METHOD AND EVALUATIONUsnthe cascadedand algorithm detiled in theprevious we performed etectino the atast 100 videos povided , with frthrimlementaion details desribed in this frst conductth motorcycl and detection ofour cacaded detecton poessas descrbed nSection Te thrshold for OWLvis a confidence heshod,i te minimum confidence score a predictedbonding mst hve tbe considre valid detectin. will dicar any detecion wth confidence scorebelw th given threshold. nfidence score is ogis onper-detecton basis. e peformed deection proess with thresholds of 0. to 0. 0. 7. 05 to . 7. the sea classificationase on the persodetection, weattempted to determine apassenges seat usin the et prompts by the lblsinthe daaset, as 1and chid pasenge.Asuming this due othe we secific suc schildi front or passenger behindriver. We hypothesize tat theprompt were te etermnig actor of to detect and dfferentiate the dfferent eopleon amrcyce, shwing model this particular type of task. Futhermore, task ofclassifyingpeople based o their loatin to and may be oo specfc oel.Afer observn shorcming with our intersec-tion used a modified he las layr o theAlexNetfrom 10 utputs  4 to suit ur task. We used an approximat frequency to overcome thesver clas imbalance in datase show inable . At first,  testedweighting of 1. 7. 908,75. 94, calculatedb iverse clas weighting. Therefore, we incementaly inreased the weighng thecasses ofad pasenger relatieto the driver, pdating he previously to 1,10,800, nd3000, repectively. We split th dta 70/5/15 for te training testing, 01 epoch.",
    "V. CONCLUDING AND FUTURE RESEARCH": "n-tially,a sight crease in * \"S preision indicates mpoved confi-dence in early pictions. As noted, the providing dataet lacksinstances of child passengers with helmetsand seond pa-sengers with helmets, making taining traditinl supervised-learnng models difficult. Zero-shot learing leverges re-training o diverse dt,classifyng unseen instances more : Preciion-Recall Curve of Motorcyce etection. Precision-Recal CrveofPaseger * \"S Detection. Despite thetrade-of of precision and recall, shape suggestsa robust moel performance in balanced thetwo Effortsto capture moe true positiesresuled in a higher incidenceof false positives. However, recision declines steeplyas recall riss, hlighting the models challenge in maintain-in accracywhie captured more true positives.",
    "Ross GreerUniversity of California San": "5324 forhelet detection and proide curves detailingthe detectionclassifcationperformnce. evauates te avanedmode, WLv2, n deected classifyi variouhelmet-wearing statusesf ocupants vieodata. AbsrctMotorcycl ose significat risks, parti-lary ridesand not ear helmets. IndeTrmsVehiclesety,Zero-htlerning,Vsion-anguage models, Helmet detection, Traffic enforcment systems. We extend daaset bythe CVPR CtyChallenge and employ a cascaded moel approach for etectionand classification tasks, negrated OWLv2 adNN Wehae achievedan presion of 0.",
    "Zhao, . Zheng S.T. Xu, and X Object detection withdeep learing: A IEEE Tranactions on andLearning Systems, vol. 121, 01 2019": "R. and Trivedi, Towards safe autonomous drivingwith embeddings novelty identification active learning:Framework and experimental analysis with real-world data sets, arXivpreprint arXiv:2402.07320, 2024. J. Hallacy, A. Goh, S. Sastry, A. Askell, P. Mishkin, J. PMLR, 2021. Gritsenko, A. Stone, M. Neumann, D. Arnab, M. Dehghani, Z. 728755, Springer, 2022."
}