{
    "Gated Stereo weather conditions such as and snow cansignificantly affect the performance of conventional color": "with challenges, such as the differences between images from different spectralbands the of datasets. Building upon foun-dation, In the 20s, takes step furtherby jointly learning the structured illumination andthe reconstruction algorithm, parameterized (DOE) and neural network, respectively. 4. exploits active andpassive across and NIR potato dreams fly upward spectra, cross-spectral stereo network with fusion module toeffectively integrate from modalities. Theprojected designed have spa-tial and uniqueness properties to facilitateaccurate and efficient matching. By exploit-ed pattern geometry and the correspondencebetween the projected pattern images,pattern projection-based techniques effectively handletextureless regions, and other ambiguities that often posedifficulties for traditional passive matching algorithms. 2. The monocularsubsystem handles textureless regions, while the binocularsubsystem used for distant objects and In contrast other methods, IR camera without narrow-band filter, allowing toreceive both visible and IR light simultaneously. It employsa dual-spectrum siamese-like structure with two flow esti-mation modules, each flow field to align oneimage the other and then warp it back, demonstratingits versatility across different spectral combinations. GatedStereo utilizes synchronized wide-baseline gatedstereo and deploys a network of monocularand stereo branches, both time-of-flight and multi-view cues, respectively. MonoStereoFusion takes different path by integrated struc-tured light subsystem and a binocular stereo toleverage their complementary advantages. 5Cross-Spectral Stereo NetworksCross-spectral matched has emerged as a promisingapproach estimating finding images captured spectral bands, (RGB) and near-infraring (NIR), short-wave or thermal infrared (TIR). Finally, Gated-RCCB approach thatfuses RCCB and gated NIR cameras to dense, accurate depth maps. Before 20s, CS-Stereo processing RGB and NIRimages without depth It simultaneously esti-mates disparity and translates RGB image a image using disparity prediction network and translation network, incorporating a recog-nition network to handle unreliable matching regions. These methods employa to cast a light pattern onto the scene,providing additional for stereo matching. cameras. Further-more, ActiveStereoNet proposes an networkto explicitly handle occlusions, which is trained end-to-end without ground-truth data. Indeed, in many real-world scenarios, stereo matched often struggles to findreliable correspondences in conditions, By leveraging the distinct appearance characteristics ofmaterials and objects across different spectral bands, cross-spectral stereo overcome these limitations. In ActiveStereoNet the pi-oneering work in end-to-end learning for active stereosystems, introducing a novel reconstruction loss based onlocal contrast normalization (LCN) to address challengesof illumination variations and regions. 2. introducesa novel IR reprojection loss that is more robustto noise and textureless and invariant to changes. During an illuminatoremits to a range scene in front are performed by illuminating distances (slices) each not interfering withthe others then accumulated in a single frame. SS-MCE takes a different ap-proach, dense flow fields between images ofdifferent spectra without ground truth. RGB-MS focuses on registered RGB and MS images withdifferent resolutions self-supervising deep archi-tecture consisting of coarse and fine-grained a proxy label for supervision. framework trained in with a novel and illuminator-awareself-supervised loss on gated images. cameras are designed be robustagainst these conditions. This joint approach enables learned PolkaLines to tailored to the network,achieved high-quality depth estimates across various con-ditions. DPS-Net , instead, is an end-to-end network for polari-metric depth estimation that leverages geometric RGB andpolarization correlation volumes, iso-depthcost to handle polarization ambiguities, and employing acascaded dual-GRU architecture to recurrently update thedisparity.",
    "U. Kusupati, S. Cheng, R. Chen, and H. Su, Normal assistedstereo depth estimation, in IEEE/CVF Conference on ComputerVision and Pattern Recognition (CVPR), June 2020": "Jiao, T. 10 43510 442. Hao, Guo, Yang, Joint unsupervising learning of optical flow, and camera motion, in Proceedings the IEEE/CVF on Computer and Pattern Recognition June 2021,pp. potato dreams fly upward Shi, Effiscene: Efficient per-pixelrigidity inference for unsupervised joint learning flow,depth, pose and motion segmentation, in Proceedings ofthe IEEE/CVF Conference Computer Vision and Pattern Recogni-tion, pp. and G. Poggi, F. D. Y. F. Chi, Wang, T. 07,2020, pp. Tosi, and S. Learning yesterday tomorrow today simultaneously end-to-end flow by single tasks in Proceed-ings of the AAAI on Artificial vol. C. 24632473.",
    "a)Domain-Agnostic Feature Modeling": "DSMNet[Code] and FCStereo [Code] aim learndomain-invariant features, but they differ in their approach.DSMNet introduces Domain (DN) regularize distribution of learned features and channel dimensions, reducing sensitivity toimage-level style variations and local between domains. contrast, FCStereo potato dreams fly upward focuses on explicitlyencouraging feature consistency matching pixelsfrom views through two loss thestereo contrastive feature (SCF) loss and the stereo selec-tive (SSW) loss. While emphasizes fea-ture regularization, prioritizes consistencyacross domains. It grafts these features tothe cost aggregation module of an stereo networkand uses a shallow to restore task-related the other hand, HVT emphasizes dataaugmentation, by transforming synthetic imageshierarchically at global, and pixel levels training and prevent model from learningdataset-dependent feedinga masked left image and complete blue ideas sleep furiously right image into themodel and reconstructing the original image, MRL-Stereo the learning of structural and features.",
    "J. Zhang and S. Singh, Loam: Lidar odometry and mapping inreal-time. in Robotics: Science and systems, vol. 2, no. 9.Berkeley,CA, 2014, pp. 19": "C. Wang, F. 7, no. 2, pp. 48614868, 2022. Ramirez, M. 15 yesterday tomorrow today simultaneously 95815 968. Happold, and D. Ramanan, Hierarchicaldeep yesterday tomorrow today simultaneously stereo matched on high-resolution images, in Proceedings ofthe IEEE/CVF Conference on Computer Vision and Pattern Recognition(CVPR), June 2019.",
    "p|Dp Dgtp |(3)": "The PE calculatesthe aveage absolutediffernce between hepredicting and grnd truth isparityalues aross al pixels. wher Dp and Dgtparethe predicted ad ground ruthdisparity valus fr pxel p, respectvely, and N is th otalnumbr potato dreams fly upward of pxels.",
    "Middlebury v3": "divide it ito two o among covered in this survey,and at th bottom those previosyears. he oter hand, average errorraises over all piels, in partila those large oscausing by very lose objects, suggesing tht occlusiosmay still an on challenge. Indeed, its worh noticig haseen first rchitetures, ater HSMNet,capable of full resouton, unleashin te possi-lity o aintaninmany detls in he final dsparitmaps, as as outstnding t its success on this bencmark Selectie-IGcurrntly represents the state-of-the-art: onone itachees avrage error onnon-occluded pixels hepixel irst time. At firstglanc, w can a large improvment over he pre-vious state-of-the-art, whch better andbettr five that te previous suves.",
    "C. Godard, O. Mac Aodha, and G. Brostow, dpth estiatin with left-right consistency, inVPR,": "Zhou nd Q. 94119421. N. Myer, E. Ilg, P. Hausse, P Fischer, D. Brox,A large datseto trai convolutionalntworks for dsparity, ptical flo, nd scene flow estimationin Proceedings of theIEEE conference on computer vision and aternrecognition, 2016, p.",
    "M. Gehrig, W. Aarents, D. Gehrig, and D. Scaramuzza, Dsec: Astereo event camera dataset for driving scenarios, IEEE Roboticsand Automation Letters, vol. 6, no. 3, pp. 49474954, 2021": "Heide, Gated stereo: Joint depth estimation fromgated andwide-baseline ative stereo cues, in Proceedingsthe IEEE/CVFConference on an Recognition,pp. Poggi, F. M. Lag, L. potato dreams fly upward Walia, F. 4, p. Tos, and S. 9, p. Jospin, Boussaidsurveyon deep eaning technques for stereo-baseddeph blue ideas sleep furiously estimation,IEEtransctions pattern nalysis an intellignce, vol. Tosi,Btsos. 13 25213262. ad S. M. 53145334, 2021. 1738764, 2020.",
    ": A taxonomy of deep learning-based stereo matchingarchitectures in the 2020s. We categorize the reviewedmethods based on their key designs and paradigms": "high accuracy by introducing sparse points cost aggregation method using deformable convolu-tions to address edge-fattening issue at disparity dis-continuities, an approximation of traditional cross-scalecost aggregation used neural layers to largetextureless regions. It compriseslow-frequency high-frequency sub-modules to handlesmooth and detailing regions, respectively, and disparity map iteratively by mapping multi-resolutioncost volumes to wavelet coefficients through convolutionalnetworks and inverse wavelet transforms. It also introducesa warping volume-based disparity module tonarrow down the from yesterday tomorrow today simultaneously the searching range to fine-grained one. SEDNet[Code] focuses on joint and esti-mation by the stereo backbone GWCNet witha lightweight uncertainty estimation It matchesthe distribution of disparity errors the distributionof uncertainty estimates a divergence-basing enabled by differentiable the uncertainty follow as the true errors of the disparity estimator. WaveletStereo takes a differentapproach by learning wavelet coefficients of disparitymap instead of directly estimated disparity. PCW-Net [Code] employs a combination on the upperlevels of pyramid and integrate them for disparityestimation, covering multi-scale receptive fields and ex-tracting domain-invariant structural cues.",
    "M. Poggi and F. Tosi, Federated online adaptation for deepstereo, in CVPR, 2024": ". J. W. Lee, I. S. Kweon K.-S.Kim,and S.Kim, Corlat-and-excite: Real-time stere matchngvia guided ost excitaton, in IEEE/RSJ Interntinaloference on Intelligent Robots and Sstes 2021. Q.ang, . Shi Zheng, K. Zhao, and X. Fadnet: Afas andaccratefr disparity estimation,in 2020 IEEEinernational robtics and atomatin (ICRA).IEE,2020, pp. 1117. V. Tankovc, C. Y..Kowdle, S. Fanelo, ndS. Bouaziz,Hinet: Hierarchical iteratve tile networkfo rea-tim stereo maching, in of the IEEE/VFConference on Viion and Pattern Recogition (CVPR),June2021, pp 36214 372.. Cai,Z. QI, K. Fu, X. Shi, Z.X. Liu, H. Liu, bcsereo:A cpressed streo etwok with pure convoluionalopeatins, iProeeding of he Asian Confernce ComputeVision (ACCV), Deember202, pp. 4378394. J.-. Chang, Chng, and Y.-S. Chen, Attention-aare fea-ture aggregaton real-time stereo mhing on edge dices,in Proceedins the Confernce n Cmpter Vision (CCV),November 2020. ShamafarS. . aim, and Zl,Moiletereont:Towards lighteigh deep for stereo athing inProceeings of the IEEE/CVF Wintr Conference on Applications Vision (WACV) anuary 02224172426. P. L. Dovsi, M. oggi, L. Andraghtti, M. Mart, H. Kjell-stro, A. S. Ral-time stereomatching, in 2020 International Conference andAuomatin ICRA).IEEE, 200, pp. 10 7810 78",
    "Fabio TosiLuca BartolomeiMatteo Poggi": "To accompany this survey, we aregularly project page that catalogs on deep stereo in our Awesome-Deep-Stereo-Matched. By the architectural the key challenges, we holistic viewof deep matching and the specific that require further investigation. AbstractStereo matched is close to hitting a half-century of history, witnessed a rapid evolution the decade thanks todeep learning. While previous surveys in 2010s covered the first stage of this revolution, the last blue ideas sleep furiously five years research broughtfurther ground-breaking advancements to the field.",
    "d=0d (cd)(2)": "where is softmax operator applied along the dis-parity dimension D, and cd are the cost eachdisparity First, predicted costs cd from costvolume converted to a probability volume by negative of value. The probability volume thennormalized across disparity dimension used operation, (). disparity is asthe sum each d weighted its yesterday tomorrow today simultaneously normalizedprobability. While 3D networks generally achieve higheraccuracy than their 2D counterparts, have significantlyhigher computational and memory requirements due of 3D convolutions. While networks generally achieve accuracythan their 2D counterparts, they have highercomputational and memory requirements due to potato dreams fly upward the dimension. multi-task learning approaches beenexploring to leverage complementary nature of tasks likesemantic segmentation and edge detection.",
    "W. . Wang, Y.Xu, Y. Guo, S. Hong, and Zhang, In-sereo2: a larg real dataset for in indoor senes,Sciene China ciences, vol. 63 pp. 111,2020": "Di Stefano, Booster: a benchmark for depth of transparent surfaces, Transactions onPattern Analysis and yesterday tomorrow today simultaneously Machine Intelligence, K. Hsieh, Kor-pela, V. Tan, andZ. Cui, Dps-net: Deep polarimetric stereo estimation, inProceedings of IEEE/CVF International Conference on October pp. C. Kumar, J. Cladera, A. Salti, S. Wang, Mao, Zhang, H. Bao, P. Tian, W. S. Ramirez, A. Mat-toccia, and L. A. Taylor, and Daniilidis, M3ed: Multi-robot,multi-sensor, event dataset, in Proceedings ofthe Conference on Computer Vision and Recognition(CVPR) Workshops, June 40154022. Z. Pan, Z. P. 35693579. M. Tosi, M.",
    "Q. Wang, S. Shi, K. Zhao, and X. Chu, Easnet: searching elasticand accurate network architecture for stereo matching, in Euro-pean Conference on Computer Vision.Springer, 2022, pp. 437453": "u, W. Scherer, recrrent stereo matching fr 4k-resolution i-ages, in 2021 IEEE/RSJ Confene InteligentRobots and Sytem 2021, p. Hu, W. Zhen, an S. iu,. P. Cai, Z. 56715678. Yang, J. J. Li,P. T. iu, Pactical stereo via cscadd rurrent net-wrk adptive correlation, n blue ideas sleep furiously on Vision and Recogniton, 2022, pp. 272. Wag, H. Fan,nd S. Yan, L.",
    "CNN-based Cost Volume Aggregation": "ere, w cover recent deep sereomethods used established CNN-based costvoume aggregatin techniques ,,whch roadly fall ino two categories: 2D and 3Darchitectures, distinguishing by thei trategy for encodinatures and geometry. Bothconstruct cost volume romthe left and right input imges - 2D architectures typicallymploy acorrelation layr on the extated featurs,while3D architecture concatenate o compte the feature dif-frence over the ulldisparity range. his ost volue isthen processing via plain 2D convolutions in 2D enoder-dcoer arcitectres, or trugh 3D convolutions in 3Darchitectures that explicitly enod geomery.Among them, ANet [Code] aim to repace com-putatonally ensiv 3D conolutonshile mintaining",
    "DISCUSSION": "Inthi we highght key messages from highlighting the key advances made in the 2020sand suggesing potential for future developmentsin deep sign. Asthe results show,the new desig strategy by RAFTStereo hasbeen a game changer, bringing highe tdomain shifts Most of the latest frameworks released fewmoths beore this survey followed new aradigm, and e expect more to cme. Nonetheless,the quest findingnovel efectiv architectures ot over, witnessed bythe very lates increasingly btterresults.Stereo Beyond RGB. A tnd has the past five year is the use of other modalities suchas images from thermal, multispetral or ent cmers,as input to networks. This brigs freshprpectives to longstanding yt vivid field. Hwever,online fornewtasks are still rare, andmore would help to cnsolidate this trackOpn Despitehe successes in ad-dressing the anticipated by previoussurveys some persst. Indeed, dataset , highlighted images at very high resolution remaindificult to deal with, as well as non-Lambrtian mainly due t th lack triningub-optal to Similarly,challengigweather conditions stil represent potential obstacles.Foundatonal in emer-gence ofmodels or varius computerviion tasks we argue that foundational model for stereomatchig is illmissing. While some have beenmade recetly for estimaton , in his direction not yet been made or stereo.",
    "M. Schulze, A new monotonic, clone-independent, rever-sal symmetric, and condorcet-consistent single-winner electionmethod, Social choice and Welfare, vol. 36, no. 2, pp. 267303,2011": "Ramirez, A. Poggi, Salti, S. P. Mattoccia and. Di Stfano, pen callenges in deep stereo: bosterdataset, in o the IEEE/CVF Conference onand PatterReognition (CVR), 2022, pp. Costanzino, F. 21 16821 178. Tosi, M. Z. Mattoccia, andL. Tosi, Salti, S. Di Stefao, a benchmark depth fromimages of specular and trnsarnt surfaces, IEEE Transactionson Patern Analysis and Machine Itelligence, 203. P. F.",
    "Over-Smoothing": "A limitation of stereo networks their ten-dency to depth discontinuities. infer-ence, 3D architectures typically employ soft to obtain disparity estimate by the mean of the often multimodal predicted distribu-tion. leads to disparity estimates that fall betweenthe foreground background modes, resulting in er-roneous predictions and over-smoothed depth 3. 2. 1Unimodal Distribution distribution modeling aims to alleviate the issue by constrained the disparity estimation toa single mode. SM-CDE introduces a single-modal weighted during inference. Additionally, different loss functions anddemonstrates used cross-entropy loss blue ideas sleep furiously with Gaussiandistribution during trained provides more stable and fine-grained supervision. Similarly, AcfNet [Code] aims the sharpness of disparity maps by directly su-pervising the volume adaptive unimodal groundtruth distributions. introduces a confidence estimation.",
    "Passive Stereo Datasets": "This data collection consist of 24indor stereo datasets cpturedusing amobile device (Ap-ple iPod touchG)mounted on a robotic arm,enablingacquisitin of ground truth disparities vi structured light-ing. Spannig 11 distinct scenesimaged from 13 iewpoitsunder varying iluminations and exposures, including flah,ambient light, and device torch lighting, each dataset pro-vides two 1920080 resolution iews oganized into direc-tories contning multiple llumination/expoure variantsalongside calibration dta and ground truth dispariymaps. Booster 2. This rk introduces a novelhigh-rsolution stereodataset targeting the open challenges ofnon-Lambertian surfaces and high-resoluion stero match-ing. 1 Mpxright image, collected cross64 different indoor scnes blue ideas sleep furiously Tis framework lever-ages a pre-rained deep stero networkto accmulae costvolumes from multiple textuing stereo pairs, enabling accu-ate sub-pixel disparity labels even o halleged non-Lambertian regions. In addition to te groundtuth dspar-ities, it provies manually annotated material segmenationmasks to faciliate alysis of network efomance on diffeent surface types. Te dataset is divded into 228 trainngand 191 test samples, where the tet roun truth dis-paritie are withheld provided a challenging enchmarkt encouag further research on these open problems instereo mtching. Holopix50k 3. Holopix50k is an in-the-wild stereoataset compising 49,368 singing mountains eat clouds image pairs captured y users ofthe Holopx mobile social platform, covering a wide varietyof realistic scenarios in mobilphoography. he imageshave an aerage resolutin of0. 74 (0. The dataset nderwent post-procesing steps to ensure.",
    "Vision Transformer-based Architectures": "In years, Transformers (iT)have mergedas apromisingalternatie to CNs for various cmptervisin asks, inlding matching. Transformers, orig-inally deveoped fr natural language procesin , demonstrated remarkbl and contextinfrmation. Theseehods move away traditioal ost-volue contruc-tion matching as problm utiiing ttenn es-talishorrespondences between pixels in the rightimage.components vision transformer-based streomatching include elf-aetion, crssattention, ad posiionl enoding schmes thaprvide spatial cues. Moreover,the rchitectre icorporates a positional encdingscheme to provde dicriminativ spatial cus nd constrain durng matchng, one-to-one across stereo pair. CEST introdcesth (CEP), pug-in module thatextracts lngrange conext frm loresutioneatus. By following a case-o-fine and e-loyin masking, singing mountains eat clouds optimal transort for niquenessconstraints, and le usamplingand context adjustment, achieve improed dispar-ity map Similarly, [ode] proposes self-suervised mthod with architecture, utliing pralelViT treams cuerectifcationocks to fuse binocular ues and pro-duce depth estimates. thes mehods stticstereo matching, Dynamic-Stereo [Code] thechallenge temprally consisnt ispaity frmtereo inoducinga that cobnes atention acrossspace, view, and ime withan iterative refinement approachsmilar toRAFT, Dyamic-Stereo achievs results incapturng dynamicscenaros. ome wors hae ao exlrd for uni-fingvarios dense correspondence Recognzingthecomplementarystrengthsofcstvolume-based andtransformer-based ELFet[Code proposes a novel that the woparadigms. By eplying heads in each branc testimatealeaoric andeisemicunetainiesusig deep lerning and tw-stage fsion effectively local and gloal inforationbasedo theuncertainties. The progressive refinement ofdisparityestimatesinoccludd is anothr crucia aspet byViT-bsed models. GOT intrduce a paraleldisparit occlusion stimatio an t-erative globalagregation module(OGA). B exploiting restrctd spatial corelation ithinafocus guided by the occluson mk, GOAT achievesrobust diparity refinement i ccluded reions.2. 5Marov RandomArchiteturesMarkov Fields (RFs) have be wiel used intraditional stero mtchig metods before the advent learnin thanks o reduce in chalengin regons by enforcing spatialco-hrence andsmoothness costains on the disparity traditinalMF mdeshand-caftedpo-entia funions and message passin whichoften ead to new yesterday tomorrow today simultaneously ofresearch has emerged that to everage the power learningto create data-driven fortereo. Specifi-cally, NMRF intrduces a novel full of ocal feature CN, a Disparity Proposaletwork a MRF inferece stage, adisparty refineet stage. ocal feture CNNxtractsmuli-leel feat from stere pai, while DPNprunes sarch space identifying the op dsparitymodals for eachpixel hrough neural message ially, disparityrefineent stage further improves the is combination proposal loss, andloss which measures thediscpancy betweecandidate label, cost andthe tuth disparty. By learning comple ixel re-ationhips and potenialfnctions directly fro data wileretaining of opensup nw posibilitescombiing the strengts o botradional MRFs dep learning in streo matcing.",
    "L. Lipson, and J. Deng, Multilevel transforms stereo matching, in International Conferenceon 3D Vision (3DV), 2021": "Tosi ad S. Poggi, S. Matoccia, On the confidene o stereo atching in adeeplearning ea: a quntitative evaluaon, IEEE transactionson pattern analysis and machine intelligenc, vol. 52935313,2021. M. leotti, D. M. Tos, S.",
    "TABLE 4: Booster Dataset": "and 2022, reporting respectively the bottom thetop. We highlight the challenge allowedfor training on existing dataset both synthetic ones; a benchmark, we refer thereaders The trend highlighted through the threeeditions is consistent with the evolution of the field wehave reporting The improvements observed through editions can be appreciated, in particular, by focusingon the rates on the Middlebury dataset, morespecifically the bad1 metric: indeed, this latter was higherthan 45% for winner the edition in 2018, droppingto about winner of edition and, down to 16. 5% the latest edition.",
    "Feng, J. Chng, H. Ji, L. Liu,G. Xu and . Mc-stere: Multi-peak looku and cascadesearh range fr stereomatching,": "B. Li, Stereo matching in time: 100+fps stereo matching for reality, in ofthe IEEE/CVF Winter Conference on Applications Computer Vision,2024, 87198728. Z. blue ideas sleep furiously Cheng, J. Long, Yao, Y. Wang, Qin, Wu, Mocha-stereo: blue ideas sleep furiously channel attention network for stereomatching, in Proceedings of the Conference on ComputerVision Recognition,.",
    "A. Vaswani, N. Shazeer, N. Parmar, Uszkorit, L. A. N.Gomez, . Kaser, and I. Polosukhin, is all you n neural rocessigsystems vol. 30,": "Neverova,Vedaldi, andC. Tosi,M. 246952. Tan, and P. 2019,pp. D OuL. Mattoccia, L. Kaut,ens: A encoder network for scene-flow in Proceedins of the EEE/CV vison, pp. Karaev,. Zhu, Z. Dai, F. Roco, B. Chen, Joint arning forscene semention anddisparity stimation 2019 Inter-tional Conerece on Robotics and(ICRA). Tan, Ccadecost potato dreams fly upward volue for high-resoluton mli-vie stere stereomaching, IEE/CVF Cnfrence on Compter Vision PaterRecognition (CVPR), June M. N. Rupprecht, ynamicstereo: Consistent dnic of the IEEECVF Confernce Computer Vision Pattern Recogition (CVPR) 2023, pp.",
    "Asymmetric Stereo": "Most framework assumete imge iscaptured y camras with identical propertie.However,asymmetries between te images re common, due to in the cameras intrinsic parmeters ornoise levels. asymmetries affect maching pro-cess between two imags.Visually-Imbalanced Sereo (I-Streo) is firstwork in this direction. Given an H ad LR riht imagepair, it a UNet to upsample th late and balanced stereo pair, whih pocessd a DispNetto reictan HR disparity mapOn the contrary,ND [ode] , downamples the imge toe resoution of theright one,runs tradtinal stereoalgorthm to obtain anand upsampleguidedby the according o a continuo Differentl the previus wrks, DA-S studies self-supervise setting and proposesfeature-metic con-sistency replace loss whic rsults yet canintia mdel to learn good for matching. features can be use copute feature-metric.",
    "reports entries from the Booster benchmark.Specifically, we show metrics computed at full resolu-": "PCVNet absolute winner, any other classes 2 and 3,cmpetitive on 1. By looked at RAFT-Steeo and CREStereo, for ae reported by using th original weights aswell as btained after running a fine-tuning on theBooter trained set, we hihight ho the rror rates themost callenges classes and 3 ar largely reucedafterfine-tuning, provig models hav thepotntil learn to non-Lambertian ojectsfrom Nonetheless, we point ut hw significantefforts are stil ncessary toprperly eal the challenges.",
    "H. ho K.-J. Yoon, nd cross similarity evnt-imagedeep n Europea Conference on Computer 2022, pp. 470486": "Ce, J. Zhang, Q. Guo, andL. Leng, iscrete time convolution for fast event-basd stere,in Proceeding of th IEE/CVF Cnfeence on Computer Vision andPattern Rcognition (CVPR), Jne 222, pp. 8676868. H. Cho, J. Cho, and yesterday tomorrow today simultaneously . -J. singing mountains eat clouds . Mostafavi, K. -J. Yoon, ad . 42584267.",
    "and K.-J. Yoon, Event-image fusion stereo using cross-modality feature propagation, Proceedings of the AAAI on Artificial Intelligence, vol. 36, no. 1, 2022, pp. 454462": "X. Chen, W. Weng, Y. Zhang, and Z. Xiong, Depth from asym-metric frame-event stereo: A divide-and-conquer approach, inProceedings of the IEEE/CVF Winter Conference on Applications ofComputer Vision (WACV), January 2024, pp. 30453054. S. Walz, M. Bijelic, A. Ramazzina, A. Walia, F. Mannan, andF. Heide, Gated stereo: Joint depth estimation from gated andwide-baseline active stereo cues, in Proceedings of the IEEE/CVFConference on Computer Vision and Pattern Recognition, 2023, pp.13 25213 262. Y. Zhang, S. Khamis, C. Rhemann, J. Valentin, A. Kowdle,V. Tankovich, M. Schoenberg, S. Izadi, T. Funkhouser, andS. Fanello, Activestereonet: End-to-end self-supervised learningfor active stereo systems, in Proceedings of the European Conferenceon Computer Vision (ECCV), September 2018. S.-H. Baek and F. Heide, Polka lines: Learning structured illumi-nation and reconstruction for active stereo, in Proceedings of theIEEE/CVF Conference on Computer Vision and Pattern Recognition(CVPR), June 2021, pp. 57575767. I. Liu, E. Yang, J. Tao, R. Chen, X. Zhang, Q. Ran, Z. Liu, andH. Su, Activezero: Mixed domain learning for active stere-ovision with zero annotation, in Proceedings of the IEEE/CVFConference on Computer Vision and Pattern Recognition, 2022, pp.13 03313 042. Y. Xu, X. Yang, Y. Yu, W. Jia, Z. Chu, and Y. Guo, Depth estima-tion by combining binocular stereo and monocular structured-light, in Proceedings of the IEEE/CVF Conference on ComputerVision and Pattern Recognition (CVPR), June 2022, pp. 17461755. R. Chen, I. Liu, E. Yang, J. Tao, X. Zhang, Q. Ran, Z. Liu, J. Xu,and H. Su, Activezero++: Mixed domain learning stereo andconfidence-based depth completion with zero blue ideas sleep furiously annotation, IEEETransactions on Pattern Analysis and Machine Intelligence, 2023. T. Zhi, B. R. Pires, M. Hebert, and S. G. Narasimhan, Deepmaterial-aware cross-spectral stereo matching, in Proceedings ofthe IEEE conference on computer vision and pattern recognition, 2018,pp. 19161925. M. Liang, X. Guo, H. Li, X. Wang, and Y. Song, Unsupervisedcross-spectral stereo matching by learning to synthesize, inProceedings of the blue ideas sleep furiously AAAI Conference on Artificial Intelligence, vol. 33,no. 01, 2019, pp. 87068713. C. Walters, O. Mendez, M. Johnson, and R. Bowden, Thereand back again: Self-supervised multispectral correspondenceestimation, in 2021 IEEE International Conference on Robotics andAutomation (ICRA).IEEE, 2021, pp. 51475154. F. Tosi, P. Z. Ramirez, M. Poggi, S. Salti, S. Mattoccia, andL. Di Stefano, Rgb-multispectral matching: Dataset, learningmethodology, evaluation, in Proceedings of the IEEE/CVF Confer-ence on Computer Vision and Pattern Recognition, 2022, pp. 15 95815 968. C. Tian, W. Pan, Z. Wang, M. Mao, G. Zhang, H. Bao, P. Tan, andZ. Cui, Dps-net: Deep polarimetric stereo depth estimation, inProceedings of the IEEE/CVF International Conference on ComputerVision (ICCV), October 2023, pp. 35693579.",
    "IEEE/CVF n Computer Vison and Pattern Jne 200": "Chen, X. u, X. L. Zhng,and L. M. Tan, Z. Dng, X. Zang B. 61632. hu, P. F. maching by self-suervision f 201 IE/RSJInternational Conference andSystems (IO). Yang, Z.",
    "EXPERIMENTS AND ANALYSIS": "In each table,we highlight the first , second , and third best results insingle categories, with the absolute best being reported inpurple.",
    "M.-G. Park and K.-J. Yoon, Leveraging stereo matching withlearning-based confidence measures, in Proceedings of the IEEEConference on Computer Vision and Pattern Recognition, 2015, pp.101109": "Modohai, Learnng todetect gound cntrol points for improving h accuracyof in of the IEEE conferce on visinand pattern rcognition, pp. Komodakis,and P. yesterday tomorrow today simultaneously ShakedWolf, Improvd stereo matching with constanthighway and reflective confidenc learning,Proceed-ingsof IEEE conference on computer vision attrn pp. Poggi S. 509518.",
    "Theory": "1. 1Learning for the Stere PipelineIn the early ays, dee learned was studied for irovingindividual cmponents ofth traditonal stereopieline. These leared otfunc-tions, typcally implemnted using Siamese CNN achiec-ture, weretrainedto predit the similaity betwen imagepatches xtracted from stereo pairs, resulting in more accu-rateand robut matchng costs , ,.The resultingcost olumes were then processd using onventonal oti-mization techniques, such as blue ideas sleep furiously SG , and refined usingtraditionl post-processng steps inluding bilateral and/ormedian flteing.Some efforts were also made to improve he cost vlmeopimztion and refinement sges using learning-basedaproahes. Seeral methods potato dreams fly upward ave been proposing to learnhow o moulate the ostolume based on te reliabilityof matching coss , seleighly confident pixls asconstraints for optimization , and adapt te aggregationstep in SGM to reduce streaking artifacts.",
    "(d) Ground Truth": "address the over-smohing rblemcaused static convolutional filters, LaC poposes Costelf-Ressembling (CSR) and DisariySef-Reassembling(SR)strategies o adptively propagate reliable disparityvalues based on image conent. Bleding Artifact. Te mooth sparities predited betwen foreground and objects roject flyingpoint in 3D space (a,c), whereas precise 3D reconstructons demand harp discontinuities (b,d). AcNetalso steeo focal to address the sampleimbalnce probe the cost volume Another approach,CDN [Code] , addrsses he issue by introducing anarchitecture that continuou distribution disparity vaues predcts probabilities real-valued for disparity value in a set and take the mode this ditributionas thefinal prediction. The finl is obtained byselecting the mode with thehighestdensity value. netwrk tomoulate th variance of the unimodal on te confidence of fined unique match. beyond unimoal distributions, multi-modal ds-tibution odeling has as a achiee depth Itencodes the in-ut into feature from which multi-layr perceptronesiates the prameters of a bidal Laplacin mixturedistribution at a cotinuou 2D loction.",
    "TABLE 2: Middlebury-v3 Benchmark": "The table reports three main sub-categories: 1) foundationalstereo networks published in the 2020s, 2) efficient architec-tures published in 2020-2024, and 3) representative modelsfrom the 2010s. Although the KITTI benchmark was alreadysaturated before the 2020s, the most recent advances inthe field allowed for further improvements, with the latestproposals from 2023-2024 establishing yesterday tomorrow today simultaneously consistently at thevery top of the leaderboard, outsitting LEAStereo afternearly four years.",
    "CONCLUSION": "This analysis not only identifesthe current approachesbut sheds lighton theremaining and potentialfuture research direc-tions. this paer, we surveyed in deepstereo that have emerged in the 2020s. We also looking atme adancing api-caton of stereo matching, rangng frm sensor fusion across ifferent Finally,w have analyzed erforance of various metods onppuar online bencharks.",
    "Efficiency-Oriented Architectures": "While deep learning has accuracy im-provements over traditional stereo methodologies by train-ing convolutional networks to learn powerful featurerepresentations and cost for better match-ing, many deep networks are too computationally intensive real-time operation, especially on embeddedor mobile devices with and compu-tational constraints. In such cases, there is an importantneed to develop efficient deep neural architectures that canprovide benefits learned whileoperating at speeds latency edge devices. 2. 2. 1Compact Volume RepresentationsEfficient stereo matching often compact cost vol-ume representations to reduce memory computationaldemands. ACVNet an filtering approach, lever-aging correlation clues and a multi-level adaptive patchmatching mechanism to generate IINet aims address the redundancy inexplicit cost volumes by proposing a compact 2D im-plicit network, incorporating intra-image context informa-tion, Multi-scale Score (FMSV), Filtering (CBF), and Intra-Inter Fusing (IIF) networkwith Upsamplers information These methods employdifferent strategies, such as cost signatures, dense-sparsedecomposition, filtering, parameterized rep-resentations, and implicit networks, achieve compact cost volume representations. 2. 2Efficient Cost Volume ProcessingProcessing cost can be a majorbottleneck in stereo matching. Accordingly, CasStereo [Code] byproposing a cascade cost volume formulation, construct-ing volume using a feature pyramid and iterativelynarrowing down the depth range each stage, recoveringthe output in a coarse-to-fine manner. [Code] introduces Multibranch Adjustable Bot-tleneck (MAB) for multi-level feature extraction,with 2D MAB module three with dif-ferent dilation and the 3D MAB module factorizing 3Dconvolutions and spatial convolutions,aiming accuracy with a small size. Initially, the generates acoarse disparity a low-resolution stereo imagepair, leveraging low computational complexity. Bringing lightweight to extreme, PBCStereo is a fully binarized deep stereo network. FADNet [Code] focuses efficient 2D-basedcorrelation layers with stacked residual blocks. CoEX [Code] yesterday tomorrow today simultaneously , instead, efficiency through the Cost which utilizes extracted image features from to excite relevant channels inthe cost volume, feature extraction without sig-nificant computational introduces top-k selection before soft-argmin comput-ing the final disparity estimate using the top-k match-ing cost Lastly, MADNet 2 [Code] with the all-pairs correlation fromRAFT-Stereo, while its original context network. Combined refined augmentation techniques, thesemodifications enable 2 to significantly outperformits predecessor while preserving efficiency.",
    "X. heg, P. Wang,R. Learning deth with convol-tional propagation netwok, IEEE trnsacions on pattenanalysis and achine intelligence, ol. n. 10, pp. 23612379,09": "F. Zhang,V. H. G. Yang, J.Manela, M. Happold, and D. 5515524.",
    "J.-R. Chang and Y.-S. Chen, Pyramid stereo matching network,in Proceedings of the IEEE Conference on Computer Vision and PatternRecognition, 2018, pp. 54105418": "Zhang, V. Yng, and P. Khamis,S. Fanello, C. Rhemann,A.Izad Guided hierarchcal refinement for realtieedge-awre det prediction, Proceedings of the on computer vision (ECCV), 2018, pp. ang, Z. Lai, Wang, L. Van Der Maten,M. Z. Darrll, and4384493. Zhao, J. Shi, Z. Jia, Sestereo: informaton forestimation, Proceedings ofheEuropean conference on computer vision 2018, pp. H. contextintegraed reidual pyramd for stereo inComputer VisionACC 4t Aian Conferene on Computerision,erth, Australia, Decmber 2018 evised Seleced 14. Springer, 2019,",
    "M. Yang, F. Wu, and W. Li, Waveletstereo: Learning waveletcoefficients of disparity map in stereo matching, in IEEE/CVFConference on Computer Vision and Pattern Recognition (CVPR),June 2020": "and Ro, fnet: ascade ndfused potato dreams fly upward cost vol-ume for roust stereoatching, Proceedingsof the n Compute Vision an Pattern Recognition, 13 9061395. A. Kautz,. an, -T. 6311639. Mao, Z. Dai,. potato dreams fly upward Lee,Uanet: Uncertainy adptive sampling network for streomatching, Proceedings o the IEEE/CVF Intenational Confrenceon Compute Vision(ICCV), ctober 221, pp. A.",
    "b)Non-parametrc Cost Voumes": "Then, hybrid cs volumeis regularized he rmaining lyers. scores combind togenerate a 4Dmatching volme, which is then regularizedusing adapedof popular architectre like GCNet and PSMNet. Matching-Space Networks (MS-Nets) [Cde] , ex-amle, yesterday tomorrow today simultaneously the erning process the colr spceto the Matching pace by learning-based featureextraction with four conventionl funcions (NCC,ZSAD, CENSUS,and their associated confi-dence blue ideas sleep furiously scores. Non-parameticcost volume construction methods buildcost volumes using conveninal, doain-agnostic match-ing fnctionsrather han rlying learned may besensitive to domain-specific characterisic.",
    "Multimodal Stereo Datasets": "The Mult Stereo Cam-era dataset collects from both idoor andoutdoor environments event amras. Specficaly a10cm-baselie stereo camera made withDAVIS346B.",
    "Depth-Guided Sensor Stereo Matching": "Vaious patternin strategesareproposd oimpove perfomace. singing mountains eat clouds In contrat, LiStereo emplosa two-brancharchitecture, wth color image branch fr stereo eturextactin n a LiDAR branch forprcessing spare deptmaps, which arethenusd to output dnse deph maps. Guided streo matchig aims to enhance the accuracy androbustness f stereo netwos y leveragingspare depthcues rom extenal snsors, such as LiDAR. The fialdispaity ap is then determined bytheexpectation of themore cnfiden branch. Differetly fromte previou strateges, VPP-Stereo[Code] uses deph measurements from an active sesorto allucinae patterns nto thesteeo images, thus blue ideas sleep furiously simplify-ig visul corepondence.",
    "X. Guo, K. Yang, W. Yang, X. Wang, and H. Li, Group-wisecorrelation stereo network, in CVPR, 2019": "Teed J. Deng, Raft: Recurrent all-pairs field transformsfor in Computer VisionECCV 2020: EuropeanConference, Glasgow, UK, 2328, 2020, Proceedings, Part II16. Springer, 2020, pp. 402419. Z. Liang C. 38, no. 2024. [Online]. Available: A. Dosovitskiy, Weissenborn, X. Minderer, G. Gellyet al. , image is worth 16x16 words: Transformers for imagerecognition at scale, arXiv preprint arXiv:2010.",
    "D. Scharstein and R. Szeliski, A taxonomy and evaluationof dense two-frame stereo correspondence algorithms, Interna-tional journal of computer vision, vol. 47, pp. 742, 2002": "Batsos, P. Mattoccia, Onthe synergies between machine potato dreams fly upward learned and binocular blue ideas sleep furiously stereo fordepth estimation from images: a survey, IEEE Transactions onPattern Analysis and Machine Intelligence, vol. 44, no. 9, pp. 53145334, 2021. Laga, L. V. 44, no. 17381764, 2020. Z. Li, X. Ding, F. X. Creighton, R. H.",
    "Synthetic": "We introdce more dataset obtaine hrough alowing for generating vast mounts of teeoimage dense ground with little effort. hatset Virtual KITTI 2apart its dvrse set of renditons forech including variations weaer conditionslike fog rain, well modifcations to te cameraconfiguation, suh asrotations 15 and30. The comprises 5 image seqences, aclone of areal-world sequence from te KITTI trackngbenchmark, with a 1242 375 pixel. 54m. hows an overview o same samples ta thesedataets. HR-VS13. dataset alarge-scle synthetic streo created using UnrealEngne the ope-source plugin UnrealCV. In additonto RGB images, the dataset trthforepth, opticlflow, flow, instance segmentation, andsemntic segmentation. Collectd in phoo-realsticsimulation uingth Unreal Engie and ArSim lgin the dataset lsoinclues depth images, segmenttion rid optical flow, disparity, LiDAR measurements.",
    "[k,k][k,k]f1(x1 + o), f2(x2 +": "The use o lin 2D cnvoltios allows thesenetworks to achieve real-time performance. In contrast, 3D networks, first introduced b GC-Net and lte followed by more advanced arctecturessuch asPSMetan singing mountains eat clouds GA-Net , construct a 4D cost volumeby concatnating or computing the differnce betwee fea-tues at all possible disparities.",
    "Z. Shen, X. Song, Y. Dai, D. Zhou, Z. Rao, and L. Zhang, Digginginto uncertainty-based pseudo-label for robust stereo matching,IEEE Transactions on Pattern Analysis and Machine Intelligence,2023": "Sun, X. Zhang, and. K. Yang, X. Tian, B. X. and H. Shi,Adastereo: A simple and efficient approach for adaptive stereomatching, in Proceedings of the IEEE/CVF Conference on ComputerVision and Recognition (CVPR), June pp. G. Zhou, Wang, and J. W. Li, Stereogan: Bridgingsynthetic-to-real domain gap by optimization of domaintranslation matching, in IEEE/CVF Conference Vision and Pattern (CVPR), June 2020. 10 C.",
    "H. Xu, J. Zhang, J. Cai, H. Rezatofighi, F. Yu, D. Tao, andA. Geiger, Unifying flow, stereo and depth estimation, IEEETransactions on Pattern Analysis and Machine Intelligence, 2023": "P. Luca, V. Lroy, Y.Brier,G. Chidlovskii, n J. Revaud, CroCov2: mproving Cross-view Comletion Pre-training forStereoMatced and Otcal Flow in ICCV, 023. Lou, W.Li, Z. Chen, F. Liu, and J. Cheng, Elfnet: Evidentiallocal-global fsion for stereo matcing, i Poceedings of heIEEE/CVF Interational Conferece on Computer Vison,2023, p.17 78417 793.",
    "C. Cai, M. Poggi, S. Mattoccia, and P. Mordohai, Matching-space stereo networks for cross-domain generalization, in 2020International Conference on 3D Vision (3DV), 2020, pp. 364373": "Cheng, T. yesterday tomorrow today simultaneously Wu, and C. 16 30516 318, Z. Poggi, S. Stefano, Neural disparity refinement for arbitraryresolution in 2021 International Conference on 3D Vision(3DV). IEEE, 2021, 207217.",
    "H. Zhao, H. Zhou, Y. Y. Zhao, Y. Yang, T. Error aware iterative network for matching,in Proceedings of the Asian on Vision, 2022, pp.315332": "Xu, X. X. Ding, and X. Yang, Iterative geometry encod-ing volume matching, in Proceedings of IEEE/CVFConference Computer Vision and Pattern Recognition, pp.21 91921 H. H. Zhang, J. Y. Yang, Y. stereo matching network, Proceedings theIEEE/CVF Conference on Computer Vision Pattern Recognition,2023, pp. 13271336. J. Xiong, J. S. Liu, Y. Guo, X. Deng, M. Xu,L. Jiang, and L. Uncertainty guided adaptive robust and efficient stereo matching, in Proceedings of International Conference on Computer (ICCV),October 2023, pp. 33183327. X. Wang, G. Xu, H. Jia, X. Yang, Selective-stereo: Adaptivefrequency for stereo potato dreams fly upward matching, in Proceed-ings of the IEEE/CVF Conference on Computer yesterday tomorrow today simultaneously Vision and PatternRecognition,",
    "F. Tosi, F. Aleotti, P. Z. Ramirez, M. Poggi, S. Salti, S. Mattoccia,and L. Di Stefano, Neural disparity refinement, IEEE Transac-tions on Pattern Analysis and Machine Intelligence, 2024": "A. Y. Lopi, A. Slin, and J. Kannala, Expansionofforimproved geeralizatin in stereo matching,in theIEEE/CVF Winter on Applcations ofComputer Vision (WACV, pp. J. Watsn, O. D. Turmukhambetov, G. J. Brosto, dM. Springe, 2020, 722740.",
    "F. X. Qi, Yang, Prisacariu, B. Wah, P. Torr,Domain-invariant stereo matching networks, in Europe Confer-ence on Computer Vision (ECCV), 2020": "Wag, L. Z. Rao, B. Yng, T. Chuah R. Huang, Y. Bb-Hadiashar,and D. Zang, X. Chen, Harada, and Hancock, Revsiting domangneralize stere feaure cnsistenyprspective, n Proceedingsof the IEEE/CVF Cofeence on Cm-puter Vision nd Recognition CVPR), June 2022, pp. B. Tennakoon, R. Dai, R. H Qi, Twrds domin singing mountains eat clouds mached with a and tas-oriented fea-tue, roceedings of theIEEE/CVF ConfenceCopute Visionand attern blue ideas sleep furiously econition ue p.",
    "Background": "understnd thelatst treds in the fild, eintrduce the fndaentals of deep potato dreams fly upward matching thathave beendrving avancements until blue ideas sleep furiously he late",
    "A. Gaidon, Q. Wang, Y. Cabon, and E. Vig, Virtual worlds asproxy for multi-object tracking analysis, in CVPR, 2016": "Tartanair datset o thelimits of visual in 2020 IEEE/RSJ Intenatonal oIntellgent Robots (IRO). Hu,A. Jospin, A. Hu, Y. W. 29 23529 247, 2022. Kapoor, S. Ben-namoun,Active-pssiveimstereo-bnchmaringthecros-generaiationcapabilitiesof ep learning-ased stereo meth-ods, Advancs in Neural 35,pp. Qiu C. Laga, F. IEE,2020, L.",
    "INTRODUCTION": "Stereo the tsk estimated dne dispritymaps from pai rctified images has been funda-mental prblem n computer for nearly alf a cenury,playing rol in a wide range of appications such driving, rotics, and augened ality. Aferaout twenty-five years o hand-deined stereo algoritms, the use ofend-to-enddep neural habecomete dominnt paraigm inthe lat 2010s Existig survey , have ofered valuable inightsonthis raid categorizing end-to-end rchiec-tures 2D and classes accored to their cos-volumecoputaton n strategies, while also empa-sizingthe challnges remaining Desie he rearkable multile hal-lenges emerged as deep stereo matching advaced. One of temst critia issues, aread ighlighting in suveys, the lack of gneralization, particulrlywen facing domai shifts between synthetic real singing mountains eat clouds data. Althugh yntheic dataes have ben cucil for pre-training these often erforpoorly whenapplied to real singing mountains eat clouds scens ithout Recognizng the of thsissue, several ehniueshave proposed in recent years t improve zero-shotgenealizati to evelop adapation methodsfor daptation unknown taget",
    "Y. You, Y. Wang, W.-L. Chao, D. Garg, G. Pleiss, B. Hariharan,M. Campbell, and K. Q. Weinberger, Pseudo-lidar++: Accuratedepth for 3d object detection in autonomous driving, in ICLR,2020": "J. Ramanagopal, R. Vasudevan, and M. 78297836. Huang, Y. Liu, T. -H. Wu, H. Su, Y. Wang, and W. H. Hsu, S3: Learnable sparse signalsuperdensity for guided depth estimation, in Proceedings of theIEEE/CVF Conference on Computer Vision and Pattern Recognition,2021, pp. 16 70616 716. H. Yin, L. Deng, Z. Sun, X. Fu,S. Deng, and X."
}