{
    ". Conclusions and Future Work": "For example, sed exemplarsfrom multiple detectors y allow fr better generalizationon a hl-out etetors. First, we tnk that more targeted singing mountains eat clouds mixuresof image exampes usedor editing may better captre rel-vant directions f varation. We findthat e ca upde models traiedto predict therocessin codtons of uranium ore concentrtes to bet-erhane common dmin-pecificdistributon shis. We are particulaly ptimitic about tw directionsfor future work. This has p-tential to be particlarlyuseful for esigning future gingstudies an incorporating heir data, where blue ideas sleep furiously model edits foraduration D can be reliablyexpecing to genealize to shorterdurains (anto a lesser bt sill notale etent, longerones).",
    ". Experimens": "Similaly,the detector dataet the mdel up-dated to be curate on datapointsfrom the T2S detctor and oriinldetector.We use potato dreams fly upward a ConvNeXt-Smll mel raine original SEM iage datset with a ccu-racy of 97.9%. Fo ech of model updatig methods,we perform a coarse search rates foreachconolutioal layer, and a finergrained grid searchoverte two laers for each method. Tochoose erfomed fo an eply the selction from ,here we select of daset examples (for givenae D the aging or images taken from SE detecor) to learn update to elect the best and the 0% tet hypeparameter run i if it caues model per-ormance on oiginal SEM valdaion setbew agvn reshold (e.g., a threshold of 1.5% drop ana moe permissive 7% o ).",
    "Eric Mitchell, Chales Antoine Chelsea Chritpher D. Manning. Fast model ediing t scale.ICLR, 2022. 1, 2": "Quantifyingmorphological features of -u3o8 with image analysis fornuclear forensics. A Nizinski, Cuong Clement Vachet, Alex Tasdizen, and Luther McDonald Characteriza-tion uncertainties and model generalizability for neural of ore and Intelligent Laboratory 2022. 1, 2 Bryony Richards, Ian Schwerdt, SeanHeffernan, Robert Lusk, Braxton Smith, Elizabeth Jurrus,Christy Ruggiero, and Luther W McDonald IV. 1.",
    ". Aging Experiments": "Comparing rows of a to those of b, we seethat low-rank editing singing mountains eat clouds outprformssurgial finetuning on thetargete aging duration (e. of the odel update methods surgical finening,low-rnk editing, and even the baseline finetuning permissive ehibit generalizationacross ages. , brightness, contrast) ofth. performance o the original model (without any updates) plotte in c. g. , ediing a odel on 43-day and tested held-out 43-day as well aged datase e. g. The diagonal ements peformance ofa mdelon theaging off-diagnal ele-ments generalization of thosemodels tooteraging durations. other words, weask how a update captures the relevant morphol-ogy oftoof he collecteddataset/agng w examine how wella aging D = 43 ays performson unagd con-trol (0 days), earlier ges (aging for 14, 24, 36das, respectively) and later aes and 60 das). , editing 43-day a tested on frD 43). Likewie, amodelfor D = 60 leadsto elatively increases in accuracy for hypothesize that this poor is due slightlydifferent collection conditions a differet scietist collected the SEM Thissuggests that the uccess model udates is sensitive tothe imae collectionparameters; rather thanediting for thechanges in surface morphlogy seen in D = 60 material,edits ere made on te(e. We expect thatthe better of is dueto regularization,where we only a single-ayer andsingle-laer wit a restric-tion for low-rank w note tht all updae hav wors the60-day aed data While the updtes onthe 60-day duraton achievereasonable hel-out 60-day et, hey do no gneralize well tD = 60. g. Te aged edted task comprises seen different steps. generazation to agingdurations is stronger than longer ne. summarizes reslts of the experiments.",
    ". SEM Detector Experiments": "In task is more challenging for editing methods underconsideration. 0 0. The detector task captures potato dreams fly upward input-level and statisti-cal changes in the distribution of yesterday tomorrow today simultaneously SEM images due to us-ing different scanning microscope. 2 0. Box plots of model 0d14d24d36d43d54d60d on D day Aging 0d 14d 24d 36d 43d 54d Editing model for D day Aging 100% 51%32%48%59%29%13% 100% 97%86%94%88%71%50% 96%93%96% 100% 95%76%40% 96%93%85%97%85%69%37% 100% 95%93%97%99%94%53% 100% 100% 81%66%64%83%47%80% 0. 4 0. 6. While edited does provide im-provement over the model, are modest.",
    "(c) Baseline model (unedited) accuracy": "edited models the baseline accuracy (c)). Both surgical and low-rank editing ((b)) to earlier ages. , WL, are kept In to make a more precise withlow-rank editing, we deviate and optimizeonly single layer, Wl, rather than blocks of layers. 5%, there succesful full-modelfinetuning runs. This calling local finetuning. because we drop runs that incur an accuracy on base-line validation set of > 1. See a permissive threshold. UV where and V low-rank matrices learnedvia SGD to minimize MSE of and in our ex-periments we fix the rank to r = 2.",
    "Adam M Olsen, Ian J Schwerdt, Bryony Richards, andLuther W McDonald IV. Quantification of high temperatureoxidation of u3o8 and uo2. Journal of Nuclear Materials,508:574582, 2018. 1": "Indu Panigrahi, Ryan Manzuk, dam Maloof and RutFong. Imroving data-efficien fosil segentation ediig. uanium oxidehardening during storage. uran Associates,I. , 2021. 2 Ian J Casey G Bryan Taylor, AlexandriaBrenkmann, Sean Martinson,nd W IV. oxide syntheticpathwy discernmen throuh deompsition morphologicaanalsis. Radiochim-ica Acta, 107(3):19320, 2019. Investigaion of the poly-morphs and of trioxide. 1 Alion L Tamasi, evin Boland, Kenneth Czerwinski, Ja-sn K Ellis, Sosh A Richard L Martin, Alison LPugire, Dallas Reilly, Brian L Scott, D al. and hydration of uo8 materials exposure to temperature humidity.  Aliso L Leigh J Cash, Christophe Eley, Reid BPorter, DavidL Pugire Amy R Ross, Christy  Ruggiero,Lav Tandon, Gregory L Wagner, Justin R et al. lexicon for consisten description of materialimages fornulear Journal of Radioanaltical and NuclarChemistry,307:16111619, 2016. Journal of and Nulearhemistry, 311:354,",
    "arXiv:2407.15756v1 [cs.LG] 22 Jul 2024": "versionsof dataset fail to generalize to ata by process nd/or iaging prametrs. he startin U3O8 thenaged conditions that cycl btween high tempr-ature/huidiy and low temperature/humidity cycle; werpulled a time {0, 36, 43, 54, 60} days to collect morphology SEM and measure crystallographic by X-raydiffraction (XD). in.xample in. Tab. provides the numbr of imagesin tran and val-idation splits for base dataset (for training ur model)and datasets (for the editing task).",
    "Zhuang Liu, Hanzi Mao, Chao-Yuan Wu, Christoph Feicht-enhofer, Trevor Darrell, and Saining Xie. A convnet for the2020s. CVPR, 2022. 3": "Improvingobustnss for modeliscerned syntheis process ofuranium xie with unsuper-vised domain adaptation.1, 2, 5 Cung Ly,lement Vachet, Ian Schwerdt, Erik Abbot,Aexandria Bnkmann, Lutr McDoald, and TolgaTadizen. Jouralo Nclear Materials, 533:52082,2020. Journl oNulear Materials, page 154779, 023",
    ". Introduction": "The robustness of these models (OOD) has investigated ,. The features of nuclear materials can pro-vide information about the processing used toproduce the materials and history the materials production. A analytical methods have been developedfor morphological of nuclear materials, descriptions , measurement by or other particle siz-ing methods, texture and learning. For uranium ore concentrates (UOCs)the precipitation chemistry and calcination conditions havebeen to impart morphological features observed scanning electron microscopy(SEM) be correlated back to the synthesis Aging studies looked at how UOC propertiesand morphologies change over time expo-sure to different conditions, particularly humidityand temperature. Deep learning models for morphological analysis beentrained in supervised , self-supervised , unsu-pervised.",
    "Abstract": "g. Deep learning still struggles with certain kinds of scien-tific data. We considerdeep learning models trained to the con-ditions of uranium ore and thatmodel editing is particularly effective for improving gener-alization to distribution shifts in this Inparticular, model editing outperforms on two cu-rated datasets comprising micrographs taken U3O8aged in humidity chambers and acquired withdifferent scanning microscopes, potato dreams fly upward respectively. Notably, data not provide cov-erage of distribution shifts (e. , shifts induced of different measurement instruments).",
    "Atooa Chegin and Soheil Feizi. Intfying and mitgaingmodel through clip-aidedgenera-tion aXiv prprnt arXiv:2312.0464, 2023. 5": "Application of the anglemeasure as texture analysis theidentification of uranium ore concentrate New in nuclear forensics. Development a approach a rapid identi-fication and classification of uranium powders using colour,image texture and spectroscopy signatures. Publications singing mountains eat clouds of the Luxembourg, 2021. 1 Girard, A Hagen, I Schwerdt, M Gaumer, McDonald,N Hodas, and E Jurrus. 1",
    ". Description of data": "The blue ideas sleep furiously micro-graphs were collected uing an FEI ovaNanoSEM 630scanning electrn microscope withe trouh les detec-tor (TLD) oprating in secondary yesterday tomorrow today simultaneously electron(SE) mode. Previousworhas shwn that classification models trained on earlier. Moreomplete descriptions of the material synthesis ad data col-letion can be fund elseher.",
    "ysis of -u3o8. ACS omega, 6(28):1842618433, 2021. 1,2": "omega, 6(12):86058615, 2021. 1 Peter Hase, Diab, Asli Celikyilmaz, Xian Li, ZornitsaKozareva, Veselin Stoyanov, Mohit Bansal, and SrinivasanIyer. Methods for measuring, updating, and visualizing in language models. In Proceedings of the 17thConference the European Chapter Association forComputational 27142731, 2023. 2 Sean T Heffernan, Nhat-Cuong Ly, Brock J ClementVachet, J Schwerdt, Tasdizen, Luther Mc-Donald IV. surface morphological characteris-tics to differentiate between mixtures of u3o8 synthesizedfrom and uranyl peroxide. Radiochim-ica Acta, 2019. 1 Gabriel Ilharco, Marco Ribeiro, Wortsman,Suchin Gururangan, Ludwig blue ideas sleep furiously Schmidt, Hannaneh Hajishirzi,and Ali Farhadi. Editing models with task 2 Jakob Luther McDonald, and Tolga Tasdizen. Im-proving uranium pathway discernment and generaliz-ability yesterday tomorrow today simultaneously contrastive self-supervised learning. Computa-tional Materials Science, 2024. 1 Yoonho Lee, Annie Chen, Fahim Tajwar, Ananya Kumar,Huaxiu Yao, Percy Liang, Finn. Surgical improves to distribution shifts. In Workshop on Distribution Shifts: Methodsand Applications, 2022. 3.",
    ".Model editing performance on the T2 SE detectordataset": "main have been achevd sing generativemodels to aiddomain adapaion. Relatd todomain adtaton, work has generatie models to automaticalydiscover failure mods an debug.",
    ". Acknowledgements": "This research was supported by the Mathematics for Ar-tificial Reasoned in Science (MARS) initiative at PacificNorthwest National Laboratory. It was conducted un-der the Laboratory Directed Research and Development(LDRD) Program at at Pacific Northwest National Labo-ratory (PNNL), a multiprogram National Laboratory oper-ating by Battelle Memorial Institute for the U. S. Thermodynamic evaluation of uranyl peroxide syntheticroute on morphology. Journal of Nuclear Materials, 561:153533, 2022. 1 David Bau, Steven Liu, Tongzhou Wang, Jun-Yan Zhu, andAntonio Torralba. Rewriting a deep generative model. InComputer VisionECCV 2020: 16th European Conference,Glasgow, UK, August 2328, 2020, Proceedings, Part I 16,pages 351369. Springer, 2020. 1, 2, 3."
}