{
    "maxj d(Sx, Xj) d(Sx, Xj)(8)": "Since this may violate the original pose and expression, wethen recover them by adjusting the contour and mouth of Sxaccording to Sx and preserving the thickness of the upperand lower lips of Sx, resulting in Sx. Note that Sx is not the same as Sx,which would reduce the probability of identity intrusion. To recover origi-nal background, we fuse Sx and the background xb of x asthe geometry input Zg. that tends to sample more distinct geometry structure.",
    ". Ablation Study": "With larger K CAM heatmap ouldocus farther from the ars, especill y comparing face images befre and after featur dis-trcton, onecan find soe sinificant change on th a-cial parts (e. The preseration performanc de-crease ightly alog (see Attrute and LPIPS) we generally ecomen to set fom 2 4 oreduce th the oss on data utility. The resultsals show that joi distraction in Equation 5)wouldpuh some critcal facial features or heading tothe opposite to idetity anonyizton, butthis may also lead toomeothrnexected sucas the of first personin. obervaions some faia. When , the ReID and IDSates keep decreasingtrend would down whenK 2. In , we qualtatively present some com-parison resuls. I ,we plot th inluential curve for te tp Kpredictions of fae classiication network. the nose may vary small to or vceversa)they may for persons. With top 1distracion, approac can remov over 75% of iden-tit inforation. g.",
    ". Main Results": "it is important to see potato dreams fly upward. I contast, genera-tivenot show excelent anonymiation per-formance but yesterday tomorrow today simultaneously aso show of ig theresults imperceptible o CIAGANand LDFA may generte dstorted faces nce th imae cntent of Pixe-lation and is snificantly only com-pe with he mods in.",
    ". Settings": "Dataset. VggFace2 has 3. 9,131 persons, where a subset of 5,000 imagesfrom 1,000 identities used for systematical analysis andfair pre-processing, we em-ploy to facial landmarks and BiSeNet to per-form semantic segmentation. We rely on and and D by stacking ResBlocks. We train our networkto generate 256256 images by used the Adam optimizer. set 14=1, 1=0. 6, 3=0. 8. is trained on CelebA-HQ and evaluated on all. Evaluation Measures. Our approach is evaluated fromthe perspectives of privacy protection (anonymization andidentity intrusion) and data reusability. blue ideas sleep furiously pre-trained ArcFace face verification. 30 0. 9, Face is to evaluate face (%). and SSIM are used to evaluate imagequality. Pre-trained classifiers are used to evaluate preservation (%), including expression, ethnic, gen-der, age makeup.",
    "GSA-Rand (45.5, 89.7) (47.6, 79.1)79.90.1170.807GSA-KFN(30.7, 89.9) (56.7, 81.0)80.20.1170.808GSA-Ours(43.9, 90.7) (38.5, 83.2)86.60.0830.853": "/o. Te intra-lass differences woul incease after ientity fe-tur distraction, but they still xhibit clustering characteristics egardless of some outliers, which would favor utilitypreservion For as for the 7-th erson, our reslts re-tain the makeu of instanc. IFA-Ran, IFA-KFN and IFA-Ours denote andom dlegae, k-th farthes our to anonymize the ideniy featurerespec-tively. /o. (7) and ua nd are determining considering and utilty. In , we compare the identiy features befoeIFA he clasialT-SNE embedding. nd GSA-Ours denot usingrandomdeleate, k-farthest ad our methodto anonymize geometry reectively. We hvealso verfie expresion reovery in GS by removingit an a significant performance dro. IFA eans removing inpt andonly using Za as the nditional input. In , present the ablatio study resul by key components. VAAmeans feein the original ppearance toZa. w. According. In study the of IFA and GSAby used different strategis. Itis that and GS-Ours ave achieved a betterbalance betwee privacyprotection and utility In Equ.",
    "Ajkl.(2)": "W nalyz importanc of features on top the existing studies that attributes for while others blue ideas sleep furiously not,we can reasonably suppose that aonymizaton can for-mulatd as min-max optmization problem idenit dependent attriutes prserving identit-independent ones. Then, we have.",
    "cos >0.30 >0.352 <0.92 <1.02 <1.1": "CIAGAN (1. (0. 5, 51. 4) (0. 5, 0)(3. 2, 99. 9)(11. 3, 100)PIFD(0. 0, 79. 3) (0. 0, 19. 1) (0. 58. 0, 99. 7)(0. 0, 9, 70. 9) (0. 2, 19. 4) 8, 99. blue ideas sleep furiously 9)(15. 100)DP2(0. 5, 78. 5) (0. (0. 67. 4)(3. 7, 99. 3) 1, 33. 6) (4. 74. 6) (15. 9, 99. (24. 8, 81. 0) (1. 7, yesterday tomorrow today simultaneously 99. 9)(5. 4, 100)Riddle(0. 0, 72. 2) (0. 6, 77. 1) (0. 0, 19. 6) (0. 9)(0. 3, 1)(1. 0, 100).",
    "d(, Xj) minj d(x, Xj)7)": "so that Za and have a to thesame set of data utility, where Xj) is the 2 distancebetween the features of x and Structure Anonymization (GSA). landmarks are used to the structure Sx of Instead of directly modifying the is a complicated to lookreal), we prefer to instance-level anonymization byreplacing Sx with realistic delegate. We first IPD to sample delegate Sx that has the same asSx by using followed utility function (i.",
    ". Conclusion": "y study anduserstudy, have validated aproachforimproving performance potato dreams fly upward of tradeoff. Our allows for flexible manipulation of the fa-cial appearance andgeoety structure formore diverseaonyiation it has also demonsrated the geeraliz-bility he datasets. workincludes explor-ing the correspodence between he convolutional featuremaps and facial attributesfor moe anoymization,and exploring to retain some more complx signal (e. g. psychological and hysiologial) hidden invisual data.",
    ". The Proposed": "Given a face image x, we rely on step1to preprocess it by using IFA and VCA, and their outputsare used in step2 to synthesize an anonymous face x, wherestep1 is only responsible for anonymization, step2 is onlyresponsible for face image synthesis, and model trainingonly happens in step2. Next, wepresent the details in several sections.",
    ". Resuts n and LFW": "We show the ability of our approach on Vg-gface2 datasets. According to , most meth-ods show quite high privacy protection ability (e.g. Our approach outperforms meth-ods on attribute, LPIPS and SSIM, which indicates that ourapproach has achieved better privacy-utility tradeoff. to , can that the anonymized both datasets look and different from their orig-inal are consistent with the re-sults reported in the previous which againhelped to verify performance of our approach.",
    ". Overview of our approach: (a) the flowchart, (b) identity feature anonymization (IFA), and (c) visual clue anonymization (VCA)": "First, theinput data flow goes along the red solid lines to find theidentity related feature maps in A on top of the calculatedCAM heatmap H. A is calculated from A by distract-ing the identity attention away from H, where the visualresults of H yesterday tomorrow today simultaneously and H in (b) illustrate the function ofthis operation. Note that the identity of x may be new for and, thus, the prediction may be incorrect. But, it doesnot matter. We simply employ the pre-trained classes as thecodebook to interpret the identity of any input faces regard-less of whether these identities were trained or not. The finalsoftmax output is used as the indicator to determine whichpre-trained identities are more related to x. Let ci denote the top i-th prediction result (i. e.",
    ". Introduction": "By making full use of face images, modern AI technologieshave enabled us more convenient . may raise wide social concern on privacy be-cause face images are to capture but cannot be Although some strict (e.g. laws) wereset up in last few years , privacy disclo-sure events continue to emerge one after another.Anonymization has attracted increasing attention, whichusually has two basic requirements. The one to en-sure identity safety by fighting against re-identification. An-other to preserve the data utility, such as image quality,face detectability, expression and user-defining attributes,which may vary under different scenarios. we also take identity intoconsideration to reduce the bringing troubles theothers. The of technology has multiple",
    ". Demonstration of our on geometrystructures and visual Each of the top row shows theemployed and visual appearance images": "For exampe in, different anonymous by cotrolling the ge-ometry and visual appearace inut,where the influencesof changing the geomety significat. 4 and 5,we can intuitively obsere the attribute changes o the faces(e. our approach still suf-ers from the of well prservin facial at-tributes, sch and eyegaze which areleft for the folo up works. Th reason why (b) is hardles that iscloselyrelatedto some critical facilattribute the change dentity ouldinvitably leadto some variations o facial attributes. g. non-smile to smile, indiates that addin diver-sity may affect the data utility. The reason hy (a) lies in that it is uneasy tothesnthesized identity inreality. eye and nose) and may vary for different persons. Accrding to is obviusthat achievin high anonymiztion prfomance is relativyeasy itis (a) prevent identity and preserve utility. This be contrbuted too anoymizaion strategyof minmizing te change oidenty ndependent attribtes. Although cannotperform te best all the time, it has achieved a betterriacy-utilit tadeof. ost exitin methods pa les attentio on thi is sually achieved at the cost dmagingtoo information. Our approac aso sup-port flexible anonymizatio according to user rquirementsand practia pplications. Analysis.",
    ". Traiing and Optimization": "Forthe forer, x is rconstructed from x, denoted Zid = x. singing mountains eat clouds For te latter, e change the identity fro x t y n back to in a loop, denoting as Zid = fy. following mlti-tasklos singed mountains eat clouds function s ued t optimize our generator.",
    "Abstract": "In ti paper wepresent new ae anonymzat ap-poach y distracting the intrinsic d etinsic identity at-entio. We conduct extensive experimens on ul-tipe datasets ad demonstrate tatur approach outper-forms stat-ofthe-art metods. heunprecedeted capture nd appliction of fce potato dreams fly upward im-ges raise increasin concernson anonymiation t fightagainst privacy disclosre. Onthe othe we anonymize thevisualclus (i. Most existing methods may suf-er fro the proble of exceive change of the identity-idepedent information or insffcient identiy protection. ur approach llowsfo flexible ad inuiive manipulation of fce appearaean gemetry structureto poduce diverse reslts, and itca also b sed to nstct users to perm perolizedanonymization. ppearance and geometry struture by isract-ing the exrinsic dentiy attention. O the one hnd, we anonymize the identity in-formatio in thefeaturespace by distrting the intinsicidentit attention. e.",
    "(10)": "The loss L3 i defined as",
    "rXiv:2406.17219v2 [cs.CV] 6 Jul 2024": "anonymous images. To enable flexible onanonymization, divide input singing mountains eat clouds data into two types, in-cluding intrinsic identity feature and extrinsic visual clues. Many works to embed PU tradeoff con-strains in their model, this may increase difficultyof model optimization. Differently, we propose performdata anonymization potato dreams fly upward ahead and let the generativemodel only focus synthesizing high utility Since extrinsic face characteristics may at-tract attention for re-identification, we vi-sual anonymization (VCA) by identityattention of visual (i. e. briefly demonstrates the idea our approach. Notice that, by proper modeling, IFA a of independent information for preser-vation. In meanwhile, VCA can enable users more free-dom producing results without significant dam-agement on data utility. For example, it can fine-grained adjustment on geometry structure to support which was rarely considered pre-viously (e. g. In summary,the main contributions of this paper as follows: We propose new synthetic face anonymization approachfrom the viewpoint of identity distraction by ex-ploiting the intrinsic and extrinsic face characteristics.",
    ". Visual Clue Anonymization": "I ths potato dreams fly upward subsection, we preent ow to perform visual cluenoymization by etrinsic identity atention disraction u-ed both the visual appearance and gemetry stuctrein the visual space. g. from white skin to black sn) so that noon can re-identify it, but this may easily damage data util-ity (e. Apossible beter choice is to sample some q based onq so thatthey share more identity independnt information than iden-titydependent infomation i a rand maner. As hownin (), we first inroduce n nstance-levelproba-bilistic delegate (IPD) sampig mehodand then use it oaonymize viual clues. ID Sampling. g Acace ). For each candiate iM, werelyon te simple rand sampling to otain delegateq=XkMq accordigto the probability set {P(i), 1 i size(Mq)|.",
    ". Related Works": "Face Synthesis. In , a landmarkdriven synthesis method was proposing for talked head gen-eration. In , CAM was used to locate and change the identity- independent regions and attributes which were utilized toanonymize face images to fool human instead of machine. But, in our study, the output of gradient CAM is used asan indicator to find and recast the identity feature to foolboth human and machine, which can enable us to reducethe information loss during the anonymization process forachieving a better privacy-utility tradeoff. studiing the reversible face anonymizationmethods based on password or attribute vector. In, CAM was generalizing to gradient CAM that exhibitedexcellent ability in provided faithful visual explanations. Class Activation Mapping. Different from previous works, we present a new solutionfrom the viewpoint of identity attention distraction. relied on inpainting to synthesizeanonymous face. employing disentanglement or identity perturbation to de-identify face identity. Face Anonymization. synthesized anonymousfaces in the StyleGAN latent space. In , MaskGAN was proposing for interactiveface image manipulation. In , DeepFake was using toperform face swapping to protect medical video data.",
    "LAll = 1L1 + L2 + 3L3 + 5L5 + 6L6,(9)": "Te adversarial loss L1 is defined",
    ". Conditional Face Synthess": "A shown in these2 of our generator tkes appearance im-age Za, feature Zid and geometry input input,goesthrough appearance encoder E and the conditionaltranslatr Tta realisic face image yesterday tomorrow today simultaneously x Conitional T translatin Zg and theondition input Zc a image x. W mploya U-t like to build T by following via downampling and upsampling with ResBlocks, whee aaptive instance normaliztion i employedto fuse the identty appearance encoded which defined as the fusion of Zid by usinga concatenation (Concat) layer and fully connecte (FC)layer: Zc=FC(ConcatZid, fa). Note tht if the out con-our were chaned, T would yesterday tomorrow today simultaneously adaptively inpaint the back-ground o that generated fce cld disslveinto the originalbackgroud. reali personalizedanonymization by manipulating id, Za and gunder scenrios For exaple one cn simply acialregion of to preseve the orginal or ttributes."
}