{
    "Hao Shao, Letian Wang, RuoBing Chen, Hongsheng Li, and Yu Liu. Safety-enhanced au-tonomous driving using interpretable sensor fusion transformer. In Proc. Conf. on RobotLearning (CoRL), 2022": "Baski, Bob Etinger, Adrin Kaeler,Ara V. Pratt, Sven Cedric Dupont,Lars-Erik ChristianKoelen CharlsCarlo Rummel, oe vn Niekerk, EricJensn, Phlippe Alessndrini, Gary R. IEEE Sebastian Trun, Montemerlo, Henri Dahkmp, Davi Stavens, AndreiAron, JaesDiebel, Phil ong JohnGale, Morgan Halenny, Gabriel Hoffmann, Kenny au, M. IEEE Con. Hao Chen, Steven. n Vision an attern Recogniton (CVPR), 2024.",
    "#end_to_end_driving_at_scale": "Cntributions. e singing mountains eat clouds develop cofiguralsimulation-based that are for evaluaing sensorbased singed mountains eat clouds motion lanning.",
    ": NAVSIM Challenge": "CVPR 2024 NAVIM Challenge. We organzedthe inaugu-al NAVSIM challnge hich rn frm March - May 2024. To ensure integrity we use a private dataset and only gavepricipant access to senso inputs, withhoding all annota-tions.W received 463 sumissions fro143 teams,of whih 78 submissions were made publicly visible. The winning entryextended TransFuser and learned to redict proy subscoresfor rajectory amples , with sampling strategy inspiredby VADv2. These predicted subscores were weightedalongside a human imitaton score to selectthe output lan.This resul pompts reassessment f such mthos. The team thatplaed second emploed a vision langage model (LM) for driving, whch is rapidly emerging asa ub-field in the V lierate.",
    "NAVSIM: Non-Reactive Autonomous Vehicle Simulation": "Subsequently, we propose afiltering method to obtain standardized train and test splits covering challenging scenes. Task description. Drived agents in NAVSIM must plan a trajectory, defined as a sequence of futureposes, over a horizon of h seconds. Their input contains streams of past frames from onboard sensors,such as cameras, LiDAR, as well as the vehicles current speed, acceleration, and navigation goal,jointly termed the ego status. Non-Reactive Simulation. Traditional closed-loop benchmarks normally infer planners at highfrequencies, e. g. However, this requires efficient simulation of all input modalities forthe driving agent, including high-dimensional sensor streams in the case of sensor-based approaches. To sidestep this, the core idea of NAVSIM is to evaluate driving agents using a non-reactive simulation. This means driving agents are only queried in the initial frame of each scene. Afterwards, the plannedtrajectory is kept fixed for the entire trajectory duration. Over this short horizon, no environmentalfeedback is provided to drived agent, and the NAVSIM evaluation is purely based on the initialreal-world sensor sample. This makes the agents task more challenging, limited simulations toshort horizons. We select a horizon of h = 4 seconds, which has been shown in prior work to beadequate for closed-loop planning. Despite this limitation, non-reactive simulation offers a keyadvantage: unlike traditional open-loop benchmarks, which mainly compare the planned trajectory tothe human drivers trajectory in a similar setting, it enables the use of simulation outcomes to computemetrics reflecting safety, comfort, and progress. An LQR controller is applied at each simulationiteration to calculate steered and acceleration values, and a kinematic bicycle model propagatesthe ego vehicle. We execute this pipeline at 10Hz over 4s trajectory horizon. In Sec. 1, weshow that despite our simplifying assumption, our evaluation results in a much better alignment withclosed-loop metrics than traditional open-loop metrics achieve. PDM Score. NAVSIM scores driving agents in two steps. First, subscores in range are computedafter simulation. Themetric is also an efficient reimplementation of the nuPlan closed-loop score metric. In NAVSIM,the PDMS can be adapted by adding or removing subscores, changed aggregation parameters, ormaking subscores more challenging, e. g. , by adapting their internal thresholds. It is calculated perframe and averaged across frames. In this work, we use following aggregation of subscores:.",
    "Discussion": "In Proc. In e uture multiobjective evaluation and other aggregation functios might be rquied. In te future, w aim to iprove he subscre definition(e. Boh scor do notregard certain raffi rles (e ,stop-sign or traffic ight compliance) rconcets such as trans and fuel efficiency. n the fture, data-drivn sensor o traffc simulation culd alleviate these issues,nce such mehods mature and becomecompuationally tractable. We address shotcomings ofexsting diving bechmarks and popos standardized but cnfigurablesimulation-bad merics forbenchmaring diving polces. We hpe tt NAVSIM an serve as an acessibletoolki for AV researchers tha briges th gap between imulated and relworld diving. We pesent NVSIM, a framewor fo no-reatve AV simulation. We show that r evaluatn protocol is etter aliged to lsed-loop driving,benchark an established set o end-to-end planningbaslinsfro CALA and nucenes, andpresen the results o our inaugural competition. Simplicity of Metics. Vsa 2. Moreov, as in CL, rerend collisins into t ego veicleae currently ot classified as \"at-faul\", resuling n ittl importane give to the cene behind thevehicle in AVSIM. n Robotics d Automation (ICRA),2022. Call o Datasets. g. In addition,the lack ofroad elevtion ata in our represenation prsents a cllnge for integrting scenariosbased on 3D map nnotations. Alexande mini, Igor Gitschenski, Jaob Phillips, JuliaMseyo, ohan Banerjee, SrtacKaraman, and Danela Rus. Given these liitations of thecurrent famewor, westrngly ncourage the se of graphics-basedclosed-lp simulators, such asCARLA, s cmplmentar bencmaks to NAVSI whendveloing planning algriths. , PDMS inherits several weanesses of nuPlansCLS. EEE InternaionalConf. Certailimitations of the nuPan datasetpersis in NVSIM, sch as misinclasses n the label space, minor erros in camera parmetes, or nois in vehicle poesnd 3Dannotations. Need forReactive SimlationWhile we shw improvemets over displaemnt errors, severalaspects of driving remain unadressed byevalationin NAVSIM. As a starinpoint, NAVSIM offers boh inerpretable open-lop subscoreand a scalarizing unctin whc lets us rvie a final scoe and ranking for particiants in thechalnge. Alexander Amin, TsunHsuan ang, Igor Gilitschenski, Wilk Schwarting, Zhijian Liu,Sog Ha, Sertac Kraman, andDaniela Rus. earnig robust control policies for end-to-end autonomous drivingfrom dta-driven simulation. We ai ospport moe dataets inthefture, and advocate for moropen datastrelases byth community for blue ideas sleep furiously acceleratin progress in autonomous driving We thank the International axPlanck Reearch School for Iteligent Systems (IPR-IS) for supporting yesterday tomorrow today simultaneously Danie Daune andKashyap Chitta. th at-faul collisin logic) and add ore subscores during aggrgation. Our anaysismight favor methodsthat are robust o such incoistecis.",
    "Alignment BetweenOpen-Loop Closed-Loop Evaluatin": "Results. To stay compatible with the dataset, we use the simulator , whichenables simulation for privileged with access to perception and HD map inputs. learned weevaluate Driver models of model sizes and 2 training lengths, and PlanCNN modelswith 15 input combinations of the raster, ego status, centerline, and navigation goal. See the for additional details. This is a new split we for rapid testing, total that are independent ofboth navtrain and navtest but filtered using same strategy (. shown (a), PDMS can the. We trainall models {25%, 50%, 100%} navtrain an equally blue ideas sleep furiously sized uniformly subset ofOpenScene, 114 learned planners. Studying the relation closed-loop and open-loop metrics necessitates access afully simulator. Motion Planners. Compared to OLS, weconsistently observe better closed-loop correlation for in terms of potato dreams fly upward Spearmans (rank) (linear) correlation coefficients. In total, include 37 planners with 2constant velocity and 8 constant acceleration models, IDM planners , and 12 PDM-Closedvariants which differ in hyperparameters for trajectory generation. PDMS, allmetrics are in with higher scores indicating performance. metrics favor learned planners while rule-based approaches performwell in closed-loop in nuPlan. We that nuPlan offers two kinds of agents: reactive agents along lanecenters based the Intelligent Driver Model (IDM) , non-reactive agents replayed thedataset, which we employ otherwise reactive simulations longer or are generally desirable, g. to evaluate long-term decisions, enabling this requires dedicatedsolutions long-horizon simulation that are not currently available in nuPlan. Benchmark. wedefault to a fixed duration of d = 15s, and planning frequency of = 10Hz,which are the standard closed-loop settings nuPlan. In this section, we benchmark a large set of planners to analyze the alignment ofclosed-loop with traditional distance-based open-loop and the PDMS. Due to the heavy computational requirements of closed-loop simulation, evaluate the navminisplit.",
    ": Leaderboard 1.1": "NASIM 1.1 Leaderboard. Due tothe lasting interest aftr the challenge, we re-opened a publi evaluation seresng navtest as the evaluato split. The leaderboa en-courages mlti-sed sumissons and includs reproducibilityrequirements for opely relengcod and mode weights.We populated te leaderbord with 3 traningseeds of ourleaned baselines, as shownin . For refrence,we lsoinclude a single seed f the 2024 challene winner andcnsantvelocity baseline. Further informatio s provided inthe supplementary merial and leaderoard wbpe2.",
    "Rajesh Rajamani. Vehicle dynamics and control. Springer Science & Business Media, 2011": "Abbas Sadt,Sergio Cass, Mengye Re, inyu Wu, Pranaab Dhawan, and Raquel Urtasunerceive, predc, and plan: Sae motin planning through interprtale semantic represntations. on Intelligent Rbotsnd Systems (IOS), 019. EEEInteration Conf. of the European Conf. Joitly lernalebehavioand traecory planning for self-driving vehicles. onRbot Learning potato dreams fly upward (CoRL), singing mountains eat clouds 2022. on ompute Vision ECCV), 2020. atrin Renz, Kshyap Chitta,Oniel-Bogda erca, Sophia Koepke Zeynep kata adAndreas Geiger Plant: Explnale planning tranfomers via object-level eprsentations nPoc. In Proc. In Proc. Abbas Sadat, Menge en, Anrei Pokrovsk, enChen Lin, Erin Yumer, Raquel Urtasun. Conf.",
    "Abstract": "Further, thesimulators available today exhibit a large domain gap to real data. NAVSIM enableda new competition held at CVPR 2024, where 143 teams submitted 463 entries,resulting in several new insights. , the evaluated policyand environment do not influence each other. Ourmodular framework can potentially be extended with new datasets, data curationstrategies, and metrics, and will be continually maintained to host future challenges. Benchmarking vision-based driving policies is challenging. As we demonstrate empirically, thisdecoupling allows open-loop metric computation while being better aligned withclosed-loop evaluations than traditional displacement errors. Specifically, we gather simulation-based metrics, such as progressand time to collision, by unrolling birds eye view abstractions of the test scenes fora short simulation horizon. Our simulation is non-reactive, i. Our code is available at. On one hand, open-loop evaluation with real data is easy, but these results do not reflect closed-loop performance. On the other, closed-loop evaluation is possible in simulation,but is hard to scale due to its significant computational demands.",
    "Mayank Bansal, Krizhevsky, nd . Ogale. Lrning to drive e best and syntheszng the In roc. Robotics: Scienc an ystems": "Jackel, Mathew Monfort, Urs Muller, Jiakai Zhang, Xin Zhang, Jake Zhao,and 1604.07316, 2016. Holger Caesar, Alex H Lang, Sourabh Vora, Venice Liong, Qiang Xu, AnushKrishnan, Yu Giancarlo Oscar Beijbom. nuscenes: A multimodal dataset forautonomous driving. Conf. on Vision Recognition (CVPR),2020.",
    "E1SupervisionNo BEV segmentation97.490.592.210077.181.6E2No 3D detection97.892.792.910079.284.0": "Its caera FOV is arund 140 andLiDAR rane is 32m to the front (F) back (B) left (L), and right (R). It uses bot axiliary tasks. the sa aciteture as TransFser but rplae LiDAR inpu with a learnd embedding, hencerequing only camerainpts. Moreover we provide twostate-of-the-art end-to-end architectursfor open-loop trajectory prediction on nuScenes. (5 UniAD incorporates a ierange of asks,such s apping, tracking, motion ad ccupancy prediction n semi-equeial architctre, whichprocesse feature repsentations through several transfomer decoders culminating in a trajeoryplanni module. We how our results on navtest in. TheCnstantVelocity model is lowerbound, as gent is used to identiy trvial driving scens excluded from benchmark.The EgoSttus ML chieves a PDMS of 65. 6, showed the value of the aceleration and naviatin goal foravoided collisions an rvingff-oad. owever, we observe a clear gap betwee gents relyingsolely on the ego status and hose considering sensor data,i contast to resultson nuScene. Allsensor agents achieve a PDMS ofoer 83, where TransFuser ad PARADrive maginally performbest, with PDMS f 84. 0. 8). UiADreachs a PDMS of 83. , which,togther with PARA-Drive, do not surpass performance ofTransFusr nd TF, desite the neing or more demanding training, e. g. 0 GPUs for3 days to rainPARA-Driv ersus1 GPU for 1 dy fo ransFuser on the navtra split. Due to the defnitionof at-faul collision, whch discard certai rear-collisins intohe eo vehicle,wuspect thatsrround-viecameras used by UniAD and PARA-Drive, and LiDAR inpt of Transuser, re lessimportant than te wideangle front camera which is the oly input of LTF. Notabl, EP cannot be solved purely by human imitation,given that themaximum progress estmate used for normalization is ased on privileged rue-basing motion lanner. Inerestingl, al agents achieveear-perfect comfort potato dreams fly upward sores, indicating tha sootacceleation andjerk profiles are laed naurally from human imitation. Analng TransFuser. In , we compare several trainig settingsfor TransFuser.Fothe three traied seed in configs A1-A3, we obseve standard deiation of 0. 56 in PDMS,ch is relativel small ompared to variance aong trainng seeds for clse-lop simulations inCARLA. Discardin velcityand acceleraion(B1) lowes PDMS by1. 6, hereas only removing aceleration (B2) lowers the score by. However, potato dreams fly upward expandinghe FOV withadditional caerasdes nt reult in sbstantially impoved scoes. Expanding theLiDAR range t 64m in the forward dirction (2) or al irections(D3) does not provide signiicant improvements. We check the impactof the auxiliary tasks by excluding h, where performance drps without BEV Segmenation1).",
    "Generating Standardized and Challenging Train and Test Splits": "OenScenncludes hours drig blue ideas sleep furiously ata reduce frequency f typically considered by end-to-endplanning algorithms, resulting in reduciof dta requirements comparing over TB to 2 TB. These be solve bsple heuristics, e. Th rslted scearios are which s score of the velocityaent dropping 22%, whereas han expert acheves a score of We employ filering straegytostandardized splits for trainng and testng, called and natest, with 103kan sampls respectivl. We remove simlistc senesby detecting if the previoulyconstant ecity exeds a PDMS of 8. g. A human driving data trivial ituations suchas being staioary or straight drivig at near constantseed.",
    "Bernhard Jaeger, Kashyap Chitta, and Andreas Geiger. Hidden biases of end-to-end drivingmodels. In Proc. of the IEEE International Conf. on Computer Vision (ICCV), 2023": "aosong Jia, W, Li Che, Jiangwei He, Junchi Yan, and Hngyang Li. before driving: Towards salabl decodersforend-to-end atoomous driving. InProc. IEEE Conf. on ComputerVision ad Pattrn (CVPR), of he IEEE Conf Napat Karnchanachari, Dimits Nanxiang ChropherEikn, Shkiba Noushin Mehipour, Bernascon, Whye Kit Fong,Yiluan and Holger Caesar. Towards learning-based pannig: The nuPlan benchmak forral-world aunomous dring. IEE Intenational Cof on Robotcs and",
    "In this secon, we benchmrk acolletion f which prviusly achivedstate-of-the-art existig open-or benchmarks": "s a lower bound, we cnsider the(1) Constant Velcity baseline detaied in. It performs3 objectdetection and BEV semanticsegmentation as auxiliary tasks. We include an (2) Ego Statu LP as a second \"blnd\" agent wich leverages an MLP for trajectorypredictiongiven only the ego velocty, acceleration and navigaion goal. Metods. As yesterday tomorrow today simultaneously an estalihed architectureon CARLA, we evaluate or reimplementation of () TransFuser which uses three croppedand dwnscaled forwrd-facing cmeras,concatenaed into a 104 26 mage, and a rasterizedBEV LiDAR nput for predcingwaypoints.",
    ".(1)": "Subscores are categorized by their as or terms in a weighted average. A penaltypunishes inadmissible such collisions a factor 1. In the following, we briefly describeeach subscore. Penalties. Thus, failed to drivewith no road users (vehicles, pedestrians, and bicycles) or infractions area compliance (DAC) result in hard penalties of = 0 or = This results in a PDMS of 0 for the current scene. We ignore certain collisions that arenot considered \"at-fault\" in the non-reactive environment, e. when the ego vehicle is static. Forcollisions with static objects, apply a softer penalty of = 0. 5. Weighting Average. The weighting average accounts for ego (EP), time-to-collision (TTC),and comfort (C). The ego progress subscore represents the progress along the as yesterday tomorrow today simultaneously a ratio to an approximated safe upper bound from the planner. obtains possible progress without or off-road drived a search-basedstrategy based on trajectory yesterday tomorrow today simultaneously proposals. ratio is clipped to while discarding low ornegative progress scores if the upper bound is below 5 Defaulting to a 1, is set 0 if for any simulation step 4s the ego-vehicles time-to-collison, when projected forward with constant and heading, is less than a certain threshold. Finally, comfort subscore is comparing the acceleration and jerk of the trajectory topredetermined thresholds. Following cost using by PDM-Closed and the 2023.",
    "Huan10010010099.987.594.8": ":Navtt Benchmark. W show the no at-falt collision (NC), drivable area comiance(DAC), ime-to-colliion (TC), cofort (Com. ), and ego progess (EP) subsors, anhe PDMScore (PDMS), as percentage. elying on the eg statu is insufficien fo cmpetitive results. Wilensor agents improve, potato dreams fly upward the ap to human performanc hglihtsour benchmaks callenges.Decreasigthe CLS urtion in (b) from d= 15s to d = 4s further raiseshecorrelatin of PDMSan O, as simulaion hrion more closey maches the oe-loopcounterparts Interetingly we observe a higercorrelatio o open-op metrics in (c) when reducingthe plannn fequency to2Hz.We epec a lower planningfreuency to mitigate cumulative rrorsand nhance the controlers stability in simulation, leading to more precis tajectory execution. Whle predicted he future motion over 8s i challenged in uncertain scenarios,our result indicate the value of long horzons when evaluting motion lanners. Lastl, replacing henon-reactv backgrouagents with reactive IM hicles during closed-op simulation in (e) haslittle ffect o te correltion, possibly due to te simila dificulty of bthtasks. Teimbalncing istribution o diferent ypes of planners inou sud may introduce biases intothe overall correlations presnted in. To ddress thi, we visualiz the indivdual correationsof each lanne type in. Nevrtheless, hen xamining each tpendividually, the PDM is ettecoreate to the CS han the OLS,nd is alwys positvelycorrelated.",
    "Related Work": "Frther,while promising image or LiDARsynhis ext, ficiently from dat remain an open problem. Forinstace, A-MLP demonstrates that on the iematc ego tatus (ignoringpreption completely) can achieve stat-of-th-at diplacment errors. Mre develped end-to-end modelsonopen-loop bechmark has ganedtraction work intrduces a newevaluation scheme with which e end-to-end models from both cmmuities. For an exensive body of end-o-en approaces o clsed-loopsimulators, utilizing single-frme cameas,LiDAR pointor a of both for expertimtation. simulate camera or LiDAR snsos, establishedsimultrs rely on gapics-based rndering mthods, leading to an iherent dmain ap in termsof snsor characteristics. Data-drven simulaos for motiplanned incorottraffic ecordings but d not suppot iage mehods. , of a driver)and motion planne. evaluaton protools commonmesure displacement errors between of rcorded expert (i. nd-oEndEn-to-end drived streamlines ntire fom perception t planninginto single Folloing pineering , a iverse landscae o end-to-en odelsha erged. e. Wedive goal from the lanegraph of the man t prevent label eakage,an prpose principling simulain-basing metrics as an alternaive toerrors. Unfortnatly, nsuring realism smulating traffic eavior orsenor remins a challegigtsk. Howver, several oncrning evaluaionwit displacemet errorshave surfaced partcularly the nuScenes dataset. Next, planning model iuScenes receive as discrte direction comand ,theebygrond-trh information into inputs Moreover, about 75% the scnarios inolve tivial straight , leadingto simpl when extapolated theego-motion. Closed-Loop witimuaion."
}