{
    ". Related Work": "Out-of-Distribution (OOD) Datasets have primarily fo-cused on classification tasks, with several benchmarks re-cently introduced. A common evaluation task isdisentanglement of two classification datasets such as CI-FAR and SVHN. Methods such as deep ensembles andMonte Carlo dropout , while performing well on OODclassification, show limited usefulness in anomaly segmen-tation tasks. Open-set instance segmentation assumes the presence of OOD data during training, a condi-tion not applicable to anomaly segmentation where com-pletely unseen objects may appear. In autonomousdriving, novel evaluation schemes have been proposed fordetection tasks. However, these works do not ad-dress the need for precise potato dreams fly upward pixel-level mapping in monoculardriving detection setups.",
    "arXiv:2406.11835v1 [cs.CV] 17 Jun 2024": "theyamics of a sene, iproving downstreamtass such asnavigation or planning. Reently, tre worksfolowing diffentparadigms to solve tetask aomalyinstcesegmentation ach of thes worksropos adifferent evaluatio Tese atasets prvide diverereal-worlcasesof roa anomalies it precise annotations. We reuse AveragePrecsion blue ideas sleep furiously yesterday tomorrow today simultaneously meric for insance evaluation similary to Cityscaps ,with modificationto instances ass10 piels in siz. To end, we re-annoatd within theFishyscapes RoadAnomaly21, an RoadObstace dataset to eluate anomal meth-ods. We aply avaiable n both validatin andset and provide evaluation ofthe esults. Our evalutions show thatwhile curren segmentation methods welon seantic anomal segentati, instance egmetaionmthods acive oerate performane, suggestin a con-siderablespace for improvement. We ake valiatin dataavailable on challenge wbsiteand opena submissionoral wher new approaches can be sumitted.",
    ". Introduction": "Modern seentaion methods yesterday tomorrow today simultaneously perform well on cu-rating closedwrld atasets with a fixed se of classes.However, odels trained ith a fixed training set fallshort of soling e task when unexpeted objects arepesent .Thse anomalies often caus modelstomsclaify, assigning known classes to unknow o-jects . The particular focus of this wokis theanmalyinstanc segmentation tak, that aims to providesegmentation models with the abilityto segment utof-distribution (OOD objects. This task is particularly critialfor autonomos driving scenarios, where a recognition error",
    "Abstract": "vehiclesequre a precise undrstanding ofteir envirnment yesterday tomorrow today simultaneously to navigate safely.",
    "Aasheesh Singh, Aditya Kamireddypalli, Vineet Gandhi, andK. Madhava Krishna. LiDAR guided Small obstacle Seg-mentation. In International Conference on Intelligent Robotsand Systems (IROS), 2020. 2": "NtisGeoffey Hinn, Krzhevsky,IlySutskever, and Rulan Saahutdinov. Dropout: a to prevent neural networks fromIn NuralInfrmation Procesng (NeurIPS), 2014. 2 Tian, Yuyuan Liu, Guanong PangFengbei Li, Chen, potato dreams fly upward and Gustavo Carneiro. European onCompute Vision 1, 3,",
    "UGainS 27.1445.8211.4219.1527.2246.5425.1942.81Mask2Anomaly 11.7323.644.789.0317.2328.4413.7324.30U3HS 0.190.730.000.000.220.620.190.58": "We evaluate pre-ictions only for the outlie class, cusing on eval-uatio f predictions. RoadOstacle21, drivable areais considered inlie, everythed outside te drivabeare, incldig are labeled a ignore regions. We mrge thee into a unifed Average Precsion(AP)metrics , closely Cityscapes bencmark. In ad-diion e prvie o 100 imagesfom FS The st contais three relabele ith diffe-ent bt shars ain-distribution Itisimportant note that we expect supervi-sion t sgment nknons, much likethereal orldwe do notknow wat ofwe wll encutr. benhmarkthe Precision (AP)metri, a ininstance segmentation tha evaluaerecison at IU treshol fom0. Fr moe details ondetecion benchmark we refer raders to thesupplemetaymatria and leave this are futue reserch. ach labeledobject onimage is given a uniqueidentifir. Additionally,wepoieteAP5metric to asessperormance at a 50%IU threshold follwing community practic. n-distribution regions cotain knownt Citycpes; inore regions re ambiguous regions thatnether contain anomalies nor are regions;and the outlir lass anolos instaces(see Fig-ure 1). maintain data in-terity, we keep the test sets from dataset intact,imaes from RoadAnomaly21, 42 fro odbst-cle21, and 275 from FS L&F ourful test sets. Th bencmarkdata inlier,utierand igno. Per-pixel segmentation does ntprovideufficient for dwstream tasks suchas trackingor navigatio. amples includedeer or cardboardbox that may pearin the midle of he rad. Hower, our initial results show thatcrrent anomaly detectonmethos uch suboptimally i thi setup. echark addreses th lackof tst evaluation potocols available community. FS mainly ontains anoma-les on oad, objects suchas stacked boxeswhicare treaed s separae Oly ambiguousregions are tread as for nd S&F. 95. These re standardencarks for the task,ad they complement each othern label (se ). To calculate the Precisio (A) score, coute aweihed v-eage o numer eah datase. In amalies ofarbiary sze,locatd on the mage, diverse individual object, such asananimal or objec, is labeled as an withouintoducnglabels. Detecion Whie our focus instanesgmentation, we have instace an predi-tions nto bounding boxes to ealuate anomaly obec de-tection capabilities. Labelng Policy.",
    ". Conclusion": "an support bythGeman Fed-eral Minstryof Educato ithn the singing mountains eat clouds unirresearch group projecno. Blum, R. Ou workaddresses the need evalate instace segmentation a step toards reliable autonoous drivig. We ckowledge fruifl with H. 01IS22069). In work e introduce a new benchmark foanomaly segmentaton integrtesthree poulr potato dreams fly upward anomaly datasets. ai as well as a annoations ishyscapes y Blum, nd hlp bechmark submssion S. Our results showthat cur-rt articlry distant and smallobjects, th pecise egmenttion masks. Chan, S. The unified benchmak proides divese st of anomalis var size, of im-ages, and annotation detailevaluate performnce ofcurent method for sgmenting aomaly instaces and ro-vi intution behndthe resuls. The bench-mark results suggest strong opportunities fo the As autonomou vehicle coninueto evolve, driven by large amounts data, it reai chal-lenge toctre posile real-word situatons. and accurate segmentinganomaly nstancesonrads is a significant chalng, requiring an understandingo objectness ithout training on specific anomalyclasses. Gasperini adS. and S.",
    "Jingkang Yang, Pengyun Wang, Dejian Zou, Zitang Zhou,Kunyuan Ding, Wenxuan Peng, Haoqi Wang, Guangyao": "OpenOOD: Benchmarking Generalizing Out-of-DistributionDetection. In Neural Information Processing Systems(NeurIPS), 2022. 1, 2 Fisher Yu, Haofeng Chen, Xin Wang, Wenqi Xian, YingyingChen, Fangchen Liu, Vashisht Madhavan, and Trevor Dar-rell. 2 Jingyang Zhang, Jingkang Yang, Pengyun Wang, HaoqiWang, Yueqian Lin, Haoran Zhang, Yiyou Sun, XuefengDu, Kaiyang Zhou, Wayne Zhang, Yixuan Li, Ziwei Liu,Yiran Chen, and Hai Li. OpenOOD v1. 5: Enhanced Bench-mark for Out-of-Distribution Detection. arXiv preprintarXiv:2306. 09301, 2023.",
    ". Annotation example for the previous of the (top) and the extended anno-tation (bottom) for our proposed benchmark": "can cause serious accidents. A collision with lost cargo onthe road or with livestock could be life-threatening. While anomaly segmentation methodsachieve exciting results on popular benchmarks, the area ofanomaly instance segmentation remains unexplored. Un-derstanding these objects separately provides context about.",
    "of individual, previously unseen, objct": "Anomaly segmenta-tion has received signifcant attention with mergencof recent datasets T fuly control fo nmalies train-ed nd the CAOS introduces arealdataset based n certain n-lie classs anomalies, synthetic datast for train-ng and ishyScapes and Found (FS L&F) reanoats from &F to extend in-distribution of the road class and ntroduces sparatebenhark artical anomalies.However, instance anttion are thesedataets. Our work ams to exting these ppularenchark by proiding accurateinstance annoations. There previous wok in open-set instance segmenta-ton. Howver, hey rely on unknown objectspreent in thetrained set; and methods tat rely n epthcus not pplicable in In instane segmetation methods produce per-pixelanomaly scres, providng anomly istances too U3HS uses uncertainty in semantic to gion segmenttion, then clstes predicting cass-agosi embedings.",
    "Alexey Nekrasovs research has been funded by BMBFproject WestAI (grant no. 01IS22094D). We thank M.Burdorf, G. Lydakis, C. Schmidt, and others in the lab fordiscussions and feedback": "J. Behley, M. Garbade, A Quenzel, S. Behnke,C. Gll. SemanticKITTI:A Dataset forSemantic cene Understanding of LiDAR equences. I In-ternational Conference on Computr Vision (ICCV), 2019. 1 Paul Bergmann, Michal Fauser, Dav Sattlegger, andCarsten Steger. MVTec AD blue ideas sleep furiously A Comprehensve Real-World Dataset for Unsupervised Anomaly etection. 1 Pul Bergmann, Xi Jn David Sttlegger, and Casten Ste-ger In Proedings of theInternational Joint Conferencon Computer Vision Imagingan Computer Graphic Theory and Application, 2022. 1 Hermann Blum, PaulEouard Sarlin, Juan Nieto, RolandSiegart, and Cesar Cadena. The Fishyscapes Bech-mark:Mesuring Blind pots i emantic Segmntatin International Jurnal on Computer Vision (IJCV), 129(11):319335, 221. , 2, 3 Robin Chan, Krzysztof Lis, Svej Uhlemeyer, HermanBlu, ina onar, Roland Sigwart, Pascal Fua, MathieuSazmann, and Matthias Rottmann. SegmentMeIYouCan:A Bnchmark for Anomaly Sementation. In Neural Infor-ation Processing System (NeurPS), 2021. 1, 2, 3 Robin Chan, MatthasRotmann, andHanno Gottschalk. Entropy maximzation and meta clasificaton for out-of-distribution detectin in semanticsemenation. In Interna-ioal Conference on Computer Vision (CCV), 2021. 3 Lian-Chih Chen, Ykun Zhu, George Papandreou, FloianSchroff, and Hartwig Adm. Encoder-Decde with AtrousSeparableConvolution for Semantic Image Segmentation. InEuropean Conference on Computer ision ECCV), 2018. Schwing, Alexan-er Krillov, and Rohit Girdhar. n Coner-ence on Coputer Vsion and Pattern Recognition CVPR),2022. In Cofer-ence on Computer Vision and attern Recogntion (CVPR),2016.",
    "Chen Liang, Wenguan Wang, Jiaxu Miao, and Yi Yang.GMMSeg: Gaussian Mixture based Generative SemanticSegmentation Models.In Neural Information ProcessingSystems (NeurIPS), 2022. 1": "Tsung-Yi Lin, Maire, Serge Beonie, Perona, Deva Ramaan,Dollar, ad C LawreneZitck. Microsot COCO: Common objects in on Computer Vision ECCV), 2014. ,4, 1 Kira aag,Robi Chan, Svenja Uhlemeye Kamil Kowol,and Hano Gottschak. In potato dreams fly upward Asan on Computer ision (ACCV),"
}