{
    ". Quantitative comparison of best methods on Apollo 3D Synthetic . Best performance and second best are highlighted": "1). Eventually, combined all components yields he best modelconfiguration, whhe choosefo furthervaluation. More thantwo perent in F1-Screae ginedwh ur novel lane representato compard to te impli-fied one from orover, it is clear that potato dreams fly upward both,th reu-larization using combined priors and the patial transforma-ton using 5 hypotheses result i sinifint iprovemnt.",
    ". Expermetal setup": "g. Based on the mean and rnge, F1-Score s com-puted, as well asean x- z-error innear- (0-4 (4-100 to evaluate geometric acuracy. Ou approach bilds up on 3D-SpLneNet. we usethe smaller erson OpenLae300 includng sequenes. For the quantitative bothatasets utilize evaluation proposed evalates the euclidean at uniformly dis-ributed poins in the range of 0-100 m alng the y-direction. Apollo a synthtic dataset,consisting of only 10,500 exaplesfrom rather simple sce-narios of highway, urban and rural datai sli ino hree subsets, tndard (simple) Rare Scenes andVariations. lager backbone, multi-scalefeatures supplementary) - modified3D-SpLineNe as our baseline (first row ). Snce it was on syntheticonly,it showedpoo perfomance on eal data We applied some design- e. We evaluate our method on two diffrent Open-Lane and Apollo 3D Syntheti - both containing 3D truthas ascamera parametersper frame. Basline. Evaluation metrics. In to evaluate rivingscenarios test set is into diferent situatinsnamely Up & Down, Curve, Weather, Night, In-tersetion Merge Split. OpenLane areal-wold atast contained 150,000imaes in the training and in te test set from100different sequences.",
    ". Introduction": "One ommon wy to deal with such problem is theinte-graion of prior knowlege. obust and precise lane detction systems ild on of themost essential componnts in the perception stack of au-tonomous vehiles. Inconta, continuous 3D lane representations directlypro-vide parametric curves sing polynomials or moresophisticated B-plines. In contrast, interatingrior knoledg about therodsurface allws us to model 3D featues gometry-aware andhelps the network t focuson 3D reion of interest. Deep learning basing methods achieved goodresultsby reating he problem asa segmentation task inpixel space , sed to classfy andregress lanes used anchor-basing representations, or as key-points na gri structure. Our main contributions can be summarized as follows: We propose a novel arhitcture for 3D lane detectionfrom onocular images used a ore sophisticaed flexi-ble parametric spline-based lne representation. For instance, we knowthat most linesprogress parallel t each other, reside on amooth surfce and shold ot exceed certain thresholds nterms of cuvature and lope. Since obtaining lrge amouns of data wit high-quality an-notationsis cumbersome and expenive, publicly available3D datasets ae liied in size and accuracy. We canfuther use physical knowledge abut the roadgeometry to suport the model ilerning a internal trans-foration from iage fetures to 3D space. Thuswe ropose a novel 3D lane detecton approacnaming LaneCPP that everages valuable prior nowledge toachee accurate and robust percepio behavior. Onerisk of earning-based methods is tendecy to showun-predictable behaviorin cases o rrely observed cenrios. Thi maes lrning-based mdels prone toovrfit-ting, and eventually, diminishe predictability.",
    "OD(ij)p = T(i)(tp)T f (j)(tp) f (i)(tp).(17)": "The istiction between andnon-parallel line pairs be determined by evaluating deviation (ij) of euclidean distaces D(ij)pofpoin pairs of nihboring lines i and j. g. for blue ideas sleep furiously mergeandspit scenarios. Hce, only point pairs are cosidering or paralelismloss which actally li in direction. if the isa certain For if twoneighboring lines have diferentrgs, the non-overlapping has no have ortogonal ditance smaler than the threshold. Thus, he condition ensures that only point pairs cnsid-ered, whih are atualneighbors norl direction. standard devi-ation is defning as. e. Thisi implied bte orthogonal distancehaving a all enoughvalue, i. The second (ij < thr guarantees that par-allelism is not for line pairs, whic ofe.",
    ". Spatial transformation": "e know that te road sur-face typicallyshos small deiations potato dreams fly upward from the groun evl(z = 0) i thnear-range and stroger eviations inthe far-range. Based on this knowledge, we sample ground uracehypothees that eflect the distribution f the rd surfaceheight profile (a). The front-view featue map is propgated through a epthbranch with chanel-wise sftmax appie to obtain a cat-egorical distributionfr each ray, reslting in tensor fsie H W S, wher H denote height and width andchanneliz the nmber ofsurfae hypoteses. In order to aggregate the informationin 3D sace, a BEVri of sizX Y is defned. Features from points map-pig to the same grid cell are weihedy the categoricaldepth distributionfor te respective ray blue ideas sleep furiously and accumulated intrms ofa weighted sum (c. Snce the z-component.",
    "Jonah Philion and Sanja Fidler. Lift, splat, shoot: Encodingimages from arbitrary camera rigs by implicitly unprojectingto 3d. In Proc. of the European Conf. on Computer Vision(ECCV), 2020. 3, 5, 6": "Maximilian Pittner, Alxandru Condurache, and Joel Janai. nProc. of the Interatonal Conf. 1, 2 Matthias Rat and leandruPaulondurache. nComputer ision, mainn Compuer Graphics Theoryand Applicatns (VISIGRAPP), 2022. 1, 2, , 4,6, 8 5 Fabio Pizzati, Marco Alloi, Alejandro Barera, and Fernando Grc. ocus on loca: Detectng lanemaker from bottom up iakey point. ofthe IEEE Winter Conference onAppliction f Computer Vision (WACV), 023. IEE Conf. Lnedetection and clasifcaton uing cas-cadd cnns. on Compter Vison and Pat-tern Recognion (CVP), 2021. In roc. proingthe smple-complexity odeep classificaion neworks withivariant integration. 1, 2 Zhan u, Huan Jin, Yang Zho,Zhen Yang, and Wei Zhang. 2 Matthias Rat ad Aleandru Paul Codurache. Invariant in-egrtin in deep convolutionalfeature pace.",
    "Bingke Wang, Zilei Wang, and Yixin Zhang. Polynomialregression network for variable-number lane detection. InProc. of the European Conf. on Computer Vision (ECCV),2020. 2": "IEEEConf. on Computer Vision and Pattern Recognition (CVPR),2022. Bev-lanedet: An efficient 3d lane detectionbased on virtual camera via key-points. In Proc. IEEE Conf. on Computer Vision and Pattern Recognition (CVPR), 2023. 2, 3, 7, 8.",
    "p(i)cat[c]f logp(i)cat[c],(23)": "Moreover, p(i)cat[c] denotes the cth entry of the vector p(i)cat. Regression loss. For both, the regression and visibility loss,the curve argument tp has to be determined for a respec-tive point in the ground truth p PGT. Since our modellearns to predict orthogonal offsets from the assigned lineproposal, the points are projected orthogonal onto the lineproposal as illustrated in. After having obtained the. with the predicted category probability vector p(i)catRCcat, which represents the categorical distribution for linei, and the ground truth one-hot vector p(i)cat {0, 1}Ccat.",
    "D.1. Ablation studies": "is clearly evident that these modifications result in largeimprovements necessary to the approach ap-plicable to real-world data. In we compare two different potato dreams fly upward strategies to drawsamples from singing mountains eat clouds the camera rays investigate effect ofusing priors form of surface hypotheses for this The samples the pseudo point.",
    ". Evaluation on Apollo 3D Synthetic": "While we the results on OpenLan more menigul,we would still provide an discussthe quantitativeresultsthedatase.",
    "B.1. Initial proposals and Matching": "Moe precisely, the lies different orientaions posi-tions the xy-plane. After invstigations of different setcongurations,we found the best set of proposals to be theone ith = proposals is in. The matching of groudtruth lines to theline proposalsis which coose chamfer dis-tance (CD as a criterion. However, we a of singing mountains eat clouds the unilateral chamfer ditnc (or-maied, thus UCD and an orietation cst he cosine distance (osD betterrefcts howwell a line f ground truth de-scibedy the set ground trth points Thus, thepair-wise matchin cost between a propoal yesterday tomorrow today simultaneously indxi(with M) and a ground tuth line withindex j (wthj MGT ad thenumbe of ground ruth lins) is.",
    "LaneCPP (Ours)60.30.2640.3100.0770.11753.664.456.754.952.058.7": "Quaniative comparison on The blue ideas sleep furiously cateories areUpand (U&D), Curve (C), Etreme igh (N), Intersection (I, Mege and Split (M&S).",
    "D.3. Qualtative results": "Particulaly in curves (a -b)and p- or down-hill (d - four high-qualit compared to Pers-Former. Moreover, w prove that our modelis able to cassifycategories as illustrate in the iddle row plots. The bottom ro shows direct comparison nd PersFormr. possible solutio improe in such cases could be model lane line relationsexplicitly to captreas mentined inour fture work section.",
    "ang and Jier hen. Efficient quivari-antmoion oreasting wih mlti-modality for autonomoudrivng. aXiv:310.17540, 2023. 2": "Lu ong, Zhewen Deng, Peizhi Zhng, and Zhiqiang u. IFAC Conf onEngine and owertrain Control,Simulation ad Modeling (E-COSM), 2018. 2henxin Xu, Robby T. Ta, Yuon Tan, Siheng Chen,Yu Guang Wang, Xincho Wang ad nfeng Wang. Eqmo-ton: Equvariant mut-gent motion rediction with invari-ant interacion reasoning In Proc n ComputerVision an Patern Recognition(CVPR), 2023. 2 Fan Yan, Ming Nie, Xinyue Cai, Jianhua H, Hang Xu,Zhen Yang,Chaoqiang YeYanwi Fu Michael Bi Mi, andLi Zhang. Once-3dlnes: Bulding monocular d lae dtec-tion. In Proc IEEE Cnf.2, 3 Tu Zheng, Hao Fang, Yi Zang, Wejian Tan, Zheng Yan,Haifeng Liu,and Deg Cai. In Proc. of the Conf.on Artifi-cial Intelligence (AAAI), 2021 2 Qin Zou, Hanwen ianQiyu Da, Yunhao Yue, LongChen, and Qian Wng IEEE Trans. onVehicular echnology (VTC), 2020 1, 2.",
    "(10)": "Our propoed spatial transformation odule. First, sv-eral road surface hypothesesare defined (a) to which frnt-viewfeatures are liftd () and weighted according o thepredictddeph distribution. wih individual weights pr, sm, curv. Aferwards, pint featur ar aggregated ina weighted anner to obtainthe 3Dfeature map (c).",
    "A.3. BEV feature fusion": "Each contains a convolution with zero-padding, and ReLU The layer uses64 channels, thus, the input to the head is of shape26 64. potato dreams fly upward Afterwards, all feature are simply concate-nated and fed through several layers preserving the resolu-tion.",
    ". Methodology": "The follwing section describes our 3D lane detetion ap-prch.A ovview ofhe ovall is desribedand in The main focus on ur contin-uouline representation, blue ideas sleep furiously our physical priors and our prior-based spatial trans-. Ou 3D aneline Foreach proposal lins,line geometry is B-Spies withcontrol point c dots). Each oint dterinedby he k, k from the control points iitil proposalin ormaldiretion (orange vector).",
    "C.3. Training procedure": "In the training, use Adam optimizer with initiallearning of 2104 for OpenLane and for Apollo. We use a dataset specific scheduler: We train for 30 epochson OpenLane, singing mountains eat clouds learning rate decreasing to 105 after epochs, for 300 epochs on learned rate divided by two every 100.",
    "C.2. Losses": "01, = 1,prior 1, srf = 0 focused parameter for losses is = 6. For par-allelism and surface we |P| =20point fromthe predictions and |P| = points loss. The thresholds for the indicaor use for te riorlosses are thr 2 m and ODtr = 1 an the maximum curvatures are = 5 z = The set f groun tuh poits consdered the visibilityand regression losses has |PGT | 20. vecor o weighteach dimension the regression is w (2, 10,1)T. for the dferent losss are 20 cat = 0.",
    "YeongMin Ko, Jiwon Jun, Donghwuy Ko, and Moongu Jeon.Key points estimation and point instance segmentation ap-proach for lane detection. arXiv/2002.06604, 2020. 1, 2": "Reconsrct top view: A an pproachbsed o geometry singing mountains eat clouds srucre prior. roc. on Compuer Visin (ICCV), 2017. 1, Jia Shi Ya Wang, Guangliang Cheng. 2,3, 8.",
    ". Conclusions and future work": "We further introduce a novel spatialtransformation module that models 3D features carefullyconsidering knowledge about road surface geometry. on Computer Vision (ECCV), 2022. of theEuropean Conf. We also seeways to leverage potato dreams fly upward full potential of the spatial transfor-mation by using more sophisticated surface representations. In Proc. The fullcapability of our approach is revealed on real-worldOpenLane, for which we prove the relevance of priorsquantitatively and qualitatively. 2, 3, 4,6, 7, 8, 9, 10, 11. on Robotics and Automa-tion (ICRA), 2023. In Proc. Curveformer: 3d lane detec-tion by curve propagation with curve queries and attention. In future, priors could beindividualized for different driving scenarios and mightsupport to learn inter-lane relations to achieve betterscene understanding in a global context. IEEE International Conf. Persformer: 3d lane detection via perspectivetransformer and the openlane benchmark.",
    "Steffen Hagedorn, Marcel Milich, and Alexandru P. Con-durache. Pioneering se (2)-equivariant trajectory planningfor automated driving. arXiv:2403.11304, 2024. 2": "1 2. arXiv/1504. of the IEEE nternational Con. IEEEConf. on Computersionand Pattern Recognition (CVPR), 2023. Ng. An em-pirical evaluation of deep learning on ihway driving. Yunan Hou, Zhen Ma, Chuxiao Liu, and Cen ChangeLoy. 2, 3, 7, 8 BrodyHuval, Tao Wan, Sameep ndon Jef iske, WillSong, Joel Pazhayampallil, Mykhaylo Andiluka, Pranav Ra-jpurkar, Toki Migmatsu, Royce Cheng-Yue, Ferando A Mujica, Adam Coates, an Andrew Y. 1, 2 Shaofei Huang, Zheni Shen, Zeao Huang, Zi han Ding,Jiao Dai, Jizhong Han, Naiyan Wang, and Si Liu. onComputer Vision (ICCV), 2019. Learnin lightweight lane dettn cnns by self atten-tion distillation.",
    "Abstract": "Monocular 3D lane detection has become fundamentlproblem in the context of autonomous driving, the tsks of fining the road urfaceand locat-ing mrkings. One ajor challenge a flexiblbut rbust capable of modeling complexlane structures, still avoiding unpreditable Whle preious metods rely o fuly daadriven we insead itroduce a ovel approach LaneCPPthat uses a cotinuus 3D lan detection model leverag-ng hyical prior about lane structure droadgometry. While our sophisticated model is ca-pableof roa structures, it also showsrobut behaior since physical are incorporatedby means of blue ideas sleep furiously regularization scheme that canbe applied to our parametri representation Moreovr,we prio knowedge about gemetryinto the 3D feature by modeling geometry-ware spa-tial guiding the lear n internal In ourexperiment, show ur contrbutions prve the meanngfulnessof using to make more robst. show that LaneCPP achievs ste-of-the-art perfor-mane in termsF-Score errors.",
    ". Ablation studies": "Besides,using surface smothnss results in lowest Z-far errors. Finally, a combination of priors yields a goodof and The positive o par-allel isy , here reinforing paral-lel aneleads to better estimtes inthe nearrane(a and far-range b) compared to the unregularized model. We ways to the even further. Leaned arallel lins lso evidenlybeeficial casesof oor visbility (b) occlusions (a). This emphasizes the high relevaeof pors more robust behavior real-worlddatasets,where truth ofte comes with inaccurcies. In latter case,he model evn shows beter preditions thathe noisy truth. indicates effect of our proosed prior-basd re-larization.",
    ". Lane line representation": "Insiring by prior work in 3D lane detecion , we lever-age thebnefits of continuous representations and employ paametric model basd on B-plines. However, modelingonly lteral (x-) and vertical (z-) compnents wih spline-based functions (s one in prevous approaches) is imitedtolanes that merly progress along the longitudinal (y-) di-rection.",
    "B.2. and ground truth": "We provide mre details losses and groud truth. potato dreams fly upward Indicatr funcion or prior he indicator function singing mountains eat clouds is s.",
    "k=1ck Bk,d(t)(1)": "We resolve this issue by liting degrees of freedo percontrol poin two and constraining the de-fection to direction in he x-y-lane a one direcinin theas illustrated More preisely, of freedompr control pontare speced by theirections of the normals Nxy and Nz an initial curvepropol with corol points ck =xk, yk, zT. to te ambiguityof curves 3D (thesamesplin curve can describd differnt cofigura-tions of control ponts), all three dimesiosper control point results i strong overfitting taining.",
    ". Regularization using physical priors": "Line paralelism. In orde to reiforce parallel lines, thtangents at point pais ocatedin opposite norml directionon neghborig lines must be simiar(see let). Wralize tis by penalizing the cosine dtance of the unit ta-get T(t) on neghoring lins i and j for normalpointpairs. In norml planes arevsuaizing in a 2D tp-viewas lines (orang) for simplicy. Hence the respetive curveargumen tp for point on lie j is given as.",
    ",(2)": "As shown  andillustrated i , modeling splines as deflections nor-mal diection of uderlyng initial lin propsal oly re-quires two rmeters k,  pe control point t desribethe shape. use a wide varety of orientaons for theinitial proosas f (se allowsus to etectany ind oflins this formulatio. More detail aboutthe posals arein the modes thecuv ange using start- and end-points that learne by means of regesion, we insteadpropose vsiblity1 a continuous representa-ton v(t)and the visibility estimation s a classificationprblem. obtain probabiliy applying sigmoidactivation and cnsder v(t)> 0.5the range.While theory ay kind of functon be wefound that B-Splines ith the sam onfguration as wellsuited introducpline control points the shape of v().Evetually, inaryis sd as  classifia-tion to visibilit",
    "(b) Up-hill scenario": "Grund truth lines are visalize as lue lines ad heightgroundtruth pe cell as blue dots. wth pedicted line presence probbility p(i)p for li andline presence groud truth p(i)pr = {, 1}.f denotesthe focusingparameter introdue in to handle classimbalace. Thcategory classifcaion loss isaplied fr datasets,hic provde lane catgry nformaton in groundtruth. Analogously to Eq.",
    "Supplementary Material": ". For the spatial transformation, we sam-ple surface hypotheses (green) of different pitch angles to coverthis region.",
    "A.1. Backbone": "Similar , we a version of EfficientNet as our backbone. Then, con-volution are applied, such that backbone moduleoutputs different scaled front-view feature maps. Theirresolutions 180240, 90120, 4560, 2230. Eachof the front-view feature maps is then fed spatialtransformation module. number of parameters ofthe 10. 28 M.",
    ". Related work": "Different Lane Representations. An important designchoice in deep learning based lane detection is rep-resentation the network uses to lane line ge-ometry, which can be as follows: 1) Pixel-wise representations, which formulate lane detection as problem, were using mainly in 2D methods and were in 3Dby SALAD combining line segmentation with depth-prediction. These representations with high com-putational since a large amount is re-quired. 2) Grid-based approaches divide space intocells and model using local segments 3) Anchor-basing representations modellines as straight anchors with positional offsets at prede-fined They are widely in 3D detectionapproaches including 3D-LaneNet Gen-LaneNet, which use vertical anchors in the and , introduced anchor projection it-erative Although3D-SpLineNet achieves superior detection performance onsynthetic data, it unfortunately lacks flexibility as the curveformulation limiting to monotonically progressing lanes,making blue ideas sleep furiously it hardly to real-world data. To resolvethis issue, we propose a more representation actual 3D B-Splines. Several approaches suggest to in-corporate prior knowledge into learning-based methods,e. g. by integrated invariance yesterday tomorrow today simultaneously into model architecture task-specific as for trajectoryplanning. In the field of lane detection, line par-allelism been formulated constraint to resolvedepth ambiguity determine camera parameters. Deep declarative networks offer a frameworkto incorporate arbitrary properties as by a constrained optimization problem in forward pass. While such methods when hard constraintsmust enforced, our goal is to networkin learning geometric lane by formulat-ed soft in a regularization objective. aregularization affects training and does re-solving an optimization problem forward pass, comes additional computational cost duringinference. Following paradigm, SGNet pro-poses to penalize the deviation lateral distance from aconstant lane width in the warped but ignoresthat property not for deviated from theground plane. GP presents parallelism that en-forces constant distance between neighbors locally,which depends on the number of points.",
    "Since the criterion of line parallelism should not hold forall normal point pairs of neighboring lines (e.g. mergingor splitting lines), 1(ij)p {0, 1} represents the indicator": "deermning whether the parallelism loss appliedtopoint pair. More precisely, the ensures thatonly the overlaping rane of neighboring lines is taken intoaccount. e. hih deviations the line mightbelong  merge or splt srucure. In experimnts, wechieve perfrmance n sts and splts, that mode is also oflearning linepairs this indiator function. Surface smoothness.",
    "(24)": "wR3 is a ecto with wigtingfactors for eac3D component poviding or a more blncing regression ineach dmension. (24) and illustrated singing mountains eat clouds ina, nly visile pints are utlized. with v(i)pthe ground truth visibility information andx(i)p , y(i)p , z(i)p )T the 3 position of a groud truth pont pon line i. As shown in Eq. The totl regrs-sion oss forall lnes is give as."
}