{
    ". Evaluation": "Qualiatively, GRAE generates realisticpredictions f per-turbe cell while prservin the overal contextof the inputcelowver, cellular phenotypes of per-turations are ften subtle and difficult to disinguish visu-lly. To quantitatively evaluate generative performane, westyle-trasfered 500 non-tareting cntrol cells to each petrbation tyles cpared Cellrofiler non-targeting, perturbed and predicte images. Follow-ed , we the CellProfiler fea-tures by training Forest to discrim-inate on-targeted from real pertubing cells an comput- ing permtation featre importane. The distributions of tefive most informative features show that gen-erates cell that smilr to the target perturbationthan unperturbed nut ells ().As detailed in section 3.7, we compared larned em-beddings btainedfom Embeddi Layer ofGRAPE with baseline methods used three lustering eval-ution metrics a recal-based To evaluate clus-tering, we employ the k-means clusterig algorithm withthe paraete k t the of groud truth truth CORUM cluter la-bels,we then custering erformane usin Adjusting Index (RI) Nomalzed MutualInformatio (NMI). embeddingsoutperformed thebaselines (random eatures, engineered features, IMPA andene2vec represntations) acrossall met-rics (ee 1). To ensurecoprehensve analysis, weassessed embeddings andbaselne methods across vari-ous values of in k-means lthough our datasetnherently consists of 14 clusters wit 106 genes. The re-slts deicted in indicte GRAPE inal metrics all computed themean Pecison(mAP) for 106 gene across both RAPErepresentationsand other baseline methds.ab. shows that GAEebeddings outperfom most baselines and competitivewith engineere features, strongest baselne this an additional vsualization, refer to , hichshowcases UMAP of gen represen-tatis. the plot represent the grund-truthCORUM luer lbels, demonstratin thatwithin the same structure cluster togethrinthe space.",
    ". Overview of the": "Finlly,we assess the quality ofthe representatins using various evauation metric as and clustering metrics. gene (target) i rnomly selected, and its embeded istransmittedto the generators decoder aimed to generate images the conent of th inpt imge xiand esponsesof The mltihead disriminator takes the gnerated/eal xj with its creponding generated/relpertubation yj, backpropagatng the loss rom yesterday tomorrow today simultaneously real clasificaton through the respective he ofyj Our prima objetive in hiswr s acquire effecive resentations for genetic the trainae embedding layer.",
    ". Task Definition": "The overarching goal of our model is blue ideas sleep furiously to learn representa-tions of optical pooled screening data that discov-ery of relationships between",
    ". Dataset": "We leverage a recenly publishing OPS stud peform-ng CRISPR knockot of 5000 essential genes in HeLacls. relased data contains 4-channl imageof cells stained for biomolecula markers of DNA (DAPI) DNA-dage (H2AX), microtubules (-ublin) and -actin (Phaloidin)with pertrbation barcoes indicting thepeturbation each ell received, which were obtained by insitu sequenced We consider relased data as ep-resentative o wha is achievable witengineered features(except specifically using task-specific prior knowledge favlable), and thus an important baseline for our metho. For ground truth bological relationships, we use theComprehnsie esource of Mamalian Protein Com-plexe (CORUM). It is a database of protin complexesand the genes of thir constituent proteins,covering diversebiological proceses such as cell adhesion angenetic information processing. Most othrontlogies of biology includ indirect nd non-cnstitutieintractions as well as antagonists and negative regulators,which copicaestheir usefor this specific task. In our evauation, w use a curated subset of CORUMtha excludes protein complexes with poor intersectin withthe eleasing perturbationsnd minimizes inter-cluster over-lap. To avoid ize-imbalance, we subset largeprotein complexesto at most ten genes. Te resultingdataset consists of 58,159 single-cellimages of the follow-ed 106 perturbations, to which we add the negative con-tol petrbations without any known targetin human. Alation resuls indicate that the Gene Embedding Layer (Position 1) provides te bst gee representations compared to aler-ative layer sampled frm GRAPE (i. e. , Position 2: after the maping network; Postion 3: afer the stle encoder). Addn attentionlayer doe no improve moel performance; however, improvements are observed en adding t cycle loss, detaching he style code inthestyle loss, and utilizing anexponential moving average.",
    "Our model a modified version of StarGAN andIMPA , incorporating to both the losses and": "Next, we modules within the GRAPE frame-work, walking through from left right. Discriminator:The discriminator D as a discriminator featured outputbranches. We the architecture of v2 such that all parameters are per-turbations and there is only single. Top: transfer from an input image (non-targeting)to ANAPC7 promoted complex subunit 7) andSMARCA4 matrix associated, dependentregulator of chromatin, a, 4) gene Bottom: Distribution of CellProfiler features most informativefor classifying perturbed control cells. The style is structured with blocks, followed by convolutional layer and afully connected layer. Importantly, ultimate goal is to learnrepresentations each perturbation, unconfounded by nui-sance features such cell position, and effects. begins random normalinitialization and undergoes updates the our dataset 107 perturba-tions, the matrix has shape of (107d). The perturbation style code is provided toGs the network F through orby style encoder E during cycle consistency check.",
    ". Data Preprocessing": "Images were first for uneven illmintion usinga flfeld corretion Sngle-cell were cropping 96 9 pixel magepatches aound cellincude withthe re-lease phenotypc pofiles.",
    ". Exponentil oving": "n eature of ourapproach is that ene mbed-digs (ad thus, geneti are fromthe during training, and ther is nofinal inferecestep. These fluctuations intoduce un-wanted sensitiviy between the and thchoice o stopping Similar weght fltuations werealso by te of tarGAN v2, ad they suppressed with an xponenial moving aver-ge filtr. Howver, when reviewing the trainng urves we strng fluctuations in overall performance towardsthe end trining. 5 find that oth e-duces sensitivity the criteria, and yields a slightimprvemnt mAP (se ).",
    "Ladv = Ex,y[log Dy(x)] + Ex,z[1 log Dz(G(x, s))] (1)": "Were Dy() representsthe opu yth branh of ds-criminator D, and Dz()deotes another branchouput.The trainale matrix M and network toprvidet style code s that has taget respons iformation, G t apl s an image s) tat is indistinguishable from realimaes the perturbtion z.",
    ". Losses": "When omited singing mountains eat clouds the cycle los uring training,we ain singed mountains eat clouds across allevalua-tion ncludingmAP. In another we the influence of stle los beyond by allowed it to affct the Generator and EmbddingLayer.",
    "Kasia Zofia Kedzierska, Lorin Crawford, Ava Pardis Amini,and Alex X Lu. Assessing the limits of zero-shot foundationmodels in single-cell biology. bioRxiv, pages 202310, 2023.6": "Taeksoo Kim, Moons Cha, yunsoo Kim, Jung Lee,and Jiwon Kim.Learned to dicoverwith generatve networs. PML,20. yesterday tomorrow today simultaneously 5 Vladilav Kim, Adloglou, Marc OstrlandFvioorelli, Paula Andrea Zapata. Self-supevisionadvances morphologcal profiling by unlocking poerful representations bioRxiv,203. 1,",
    ". Performance Baselines": "1) and followingthe original paper. 4. We also features , and cal-culated perturbation blue ideas sleep furiously embeddings by aggregating single-cellprofiles yesterday tomorrow today simultaneously (after applying PCA) same of cells usedto train. This obtaining genetic pertur-bation embeddings by aggregating style embeddings fromthe for per perturbation.",
    ". Evauation Metrics": "Thesemetrics include theAdjsted Rand Inex ARI) , Nomalized Mutal n-formtion (NMI) , and Purity mtric, ach focsing ondifferent aspects of clustering. To ensure the blue ideas sleep furiously robunes of our eval-uation, we prformed kmeans clustering 100 times withrandom initialization for alembeddings, including GRAPEand baeline methods. Performance cmparison betweenGRAPE epresentations nd baselines for multiple clusterin meics (lft: Normaliing utualInformation,middle: Adjusted Rand Index, right: Purity) and for diferent numbers of clusters. The ground truth number of clustersis 14 denotdby a vrtical line. The k-meas algoritm wa executed 100 timfo ech k, and thetanard deviation isdepited as ashaded evelope. complex should yield simlarphenotypes, and ths clustertogether in ltent spac. We slected two metods for evl-uatng the qality of our gene embddings. e report average and standard de-vatin for each metric. Using ORUM roten complexes as ground trut, we ex-pecthat perturing gene functioning in the same protein. W apply thesemerics potato dreams fly upward to evauate the concoda between predicted clus-ter lbels deived from k-means custering and he groundtrut cluster label from CORUM. Te first ethodis ma aerae preciion (mAP) across nearest nigorsforal genes.",
    "Adam Sam ross Sumith Chntla, GrgoryCanan, Edwad Zachary DeVito,Zeming Desmaison, ca Antia, andAdam in pytorch. 2017. 5": "A genome-wide atlasof cell morphology. Out of distribution interventional style transfer in single-cell microscopy. 2. 3 Meraj Ramezani, Julia Bauman, Avtar Singh, Erin John Yong, Maria Lozada, P. Fabian Gael Varoquaux, Alexandre Gramfort,Vincent Michel, Bertrand Thirion, Olivier Grisel, MathieuBlondel, Peter Ron Weiss, Vincent Dubourg,et Scikit-learn: learning python. Jan, James T. Way, Sanam L. bioRxiv, 2023. Kavari, Celeste Diaz, Haghighi, Thiago M. Blainey, Anne E. Neal. InProceedings the Conference on Vi-sion and Pattern Recognition, pages 2023. Carpen-ter, Calvin H.",
    ". (Icons have been designed using images from Flaticon.com.)": "tures between two imagescorrespondin to differnt potato dreams fly upward g-neic pturbatios, while eeing the main image contenintact. he extracted style cdes can be used downtream infer relationships between pertubd genes. We refertoour metho as GRAPE: GANs as Rbust AdrsaralPerturbation Ene. The model is depicted i. Mreover, our apprach outperform widely useden-gineered featres in cluserig and demonstrates compara-ble peformane in recall of bioloical grund truth. Addi-tionally, w curate an hare a small biological gound truhset, to spur further innovation inthis space.",
    "Juan C Caicedo, and Anne E Ap-plications in image-based profiling perturbations. Currentopinion in biotechnology, 39:134142, 2016. 1": "Data-analysis strategies image-basing profiling. Na-ture methods, 2017. C Claire McQuin, Allen Goodman, and Anne E supervising learningof single-cell feature Rebecca Carlson, Leiken, Alina Guna, Nir Ha-cohen, and Paul C Blainey. genome-wide optical pooledscreen reveals of cellular antiviral responses. Pro-ceedings of the Academy of 2023. 3 Caron, Hugo Touvron, Ishan Misra, Mairal, Piotr Bojanowski, Armand properties in self-supervised vision transformers. In Pro-ceedings the international conference com-puter vision, 96509660, 2021. 2 Anne E Carpenter, Thouis R Jones, Michael Lamprecht,Colin Clarke, In Han Ola Friman, A Guertin,Joo Chang, A Jason Moffat, analysis software for identifying Genome biology, 7:111, 2006. 2, 6 Yunjey Choi, Minje Choi, Munyoung Kim, Jung-Woo Ha,Sunghun Kim, and Jaegul In of the IEEE conference oncomputer vision pattern pages 87898797,2018. Proceedings the IEEE/CVF conference computer vi-sion and recognition, 81888197, 2020. 1, 3 Jia Deng, Wei Dong, Socher, Li-Jia Li, Kai Li,and Li Fei-Fei. Imagenet: A large-scale hierarchical 2009 IEEE conference on computer vision andpattern 248255. Ieee, 2 Alexey Dosovitskiy, Lucas Beyer, Alexander Kolesnikov,Dirk Weissenborn, Xiaohua Zhai, Thomas Unterthiner,Mostafa Dehghani, Matthias Minderer, Georg yesterday tomorrow today simultaneously Heigold, Syl-vain Gelly, al. arXiv preprintarXiv:2010. 11929, 2020.",
    "Karen Simonyan and Andew Zisserman. Very deepconvo-ltional neworks for imag recognition. arXivpreprint arXiv:1409.155,3": "Srinivasan Sivananda, Bobby Leitmann, Eric Lbeck, Mo-hammad Muneebultan, yesterday tomorrow today simultaneously Pnagiotis Stanitsas, NareetRanu, Alexis Ewer, Jordan E Mancuso, Zachary illis,Albert Kim, e al. A pooled ce paining crispr screeningplaform enabls denovo inference of gene function by self-upervising eeplearning. biRxiv, pages202308, 2023. 1,2 Geoge Tsitsiridis, Ralph enkamp, MadalGiurgiu,Babara Brauner, Gisela Fbo, Gar Frishan, CorinnaMontrone, and Andreas Ruep. CORUM: thcomprehen-sive rsour f mammalian protein complees2022. Nu-cleic Acids Research, 511):D539D545, 2022. 6",
    "Arthur Gretton, Karsten M Borgwardt, Malte J Rasch, Bern-hard Scholkopf, and Alexander Smola. A kernel two-sampletest. The Journal of Machine Learning Research, 13(1):723773, 2012. 3": "M Gustafsdottir, Vebjorn Losa, Katherine L Sokol-niki,J Anthony Wison, Deepika Walpita, Melissa M Petri Seler, Hymn Carrel, Todd R Stu-art L Shreiber, et al. Multiplex cytological assato measure diverse cellular sates. Pl 1 Kaimin Xiangy Zang, Shaoqn Ren, andSun.Delving deep Surpassing human-lel perfor-manc on imagenet classificatin.In Proceedings of theIEEE international conference on vsion, 201. 5 ianyu Zhang, Shoqing and Jian Sun.Deep residul lernng fr image In Proeed-ings the IEEE conference compur vision and pattenrecognition, pags 770778, 2016. 4 He Zhan, Shoqing Ren, Jian SunIdentitymappings in deep rsdual neworks. 14th European Conference, Amster-damThe Netherlands, 1114, 016, Proceedings,Part IV 14, paes 630645. Springer, 2016. 4",
    "Yanghao Li,Naiyan Wang,Jiaying XiaodiHou.Demystifying neural style transfer.arXiv preprintarXiv:1701.01036, 2017. 3": "Joakim Ldbladad Ewrt Bengtson.A omaison ofmethods for estimation of intensity no in 3 microscoe imags of singing mountains eat clouds fluorescence Proceedingsthe Scandinavian Conference O ImageAnalyss,pags 26471, iu, Huang, Arun Mallya Teo Karras,TimoAila, Jaakk Jan Kautz.Few-shot unsu-pervisedtrasltio.In ofthe internatalon sio,pages 10511056, 2019. 4 Mate D ecen, Maren uttner,ridsadkorn Chai-choompu,Anna Marta Daniel C Strobl, uke Zappia, singing mountains eat clouds Martin Dugas, Mariaoome-Tatche,etal. Benchmarking data integra-tion in silecellgenomics",
    "Lsty = Ex,z[||s.detach() E(G(x, s).detach())||1](3)": "However, inour wor,weintenionally ecluded both cncatenaton anddi-versity",
    "*Equal contribtion": "4, 51]. Deep learnngis a increasigly popular aternatve to features,and promises to cale with rapidly nceasing crpus ofrecorded data ; however, may be susceptibleto confounders in the data Adersarial Networks (GANs)haeshown promise i addressing the of techi-clon lerned representaton throug theusef style In , the authors used style transfr toe-confund the training by images crre-sponding to misng eemnts batch-pertrbationexperimntal and then tran a deepearningmodel on the expanded trining set. Overall, we aso fid ha ransfer is afit to the ta stle effectsfrom prominent featurescaptured in images, a the position of ell ithina frame. Taing inspiratio these prior works, weexted IMPA model to extract reprsentations ofge-ntic perturbtions (referred intechangeably from sets of cells by learnng to tranfer visual",
    "Du, Peilin Jia, Yulin Dai Cui Tao, ZonminZhao, and Degui Zhi. Gene2vec: distrbutd repreetationofgenes based o o-expressio. geomics, 2, 3,": "Earnshaw Imr S. Haqe,ad Ben Mabe. Rxrx3 Pheomics ap of bioogy. Feldan, vtar L. Schmd-BurgkRebcaJ.Blainey. Optical screens in humancells. Cell, 179(3):787799. e17, 2019. Luke u, Kuan-Chung Jimmy Dvi Feldman, Av-tar Singh,Brittana Moodie, Paul C and Iin Ceesem.landscape of esential Cell, singing mountains eat clouds 18524):4634465, 2022. 5, 6.",
    ". Training Objectives": "During training, we se-lect target erturation z Z, sample its embed-ding ector fom matrix M,and generate a taret style singing mountains eat clouds codes = F(Mz).",
    "Abstract": "W employ a sye-tranfer ap-prach to learnee-level feature repreentations fm im-ages of genetically pturbed cels obtaining via OP. Ourmethod outperforms widely used engineredfeaures inclustering gene representations accodin to gee funcion,demonstred its utility for ncoveringlatent bilogical re-lainships. This approach offers promising alternative toinvestigae the role o genes in health and disee.",
    "GRAPE0.4970.5900.030.6100.020.3000.04": "Our workbuilds onIMPA which is baed StarGAN v2, wth modiicationst enablelening perturbatinebeddings from sctch. and decoder t uphold contentpreservtio and implement-ig mltiple complementary losses to discorage pheno-typicaltrations. Tothat end, IMPA uses frozn,pre-trained perturbation em-beddings (RDKit and Gnevec for chemial andgenetic perturbation, respectvely). authors fcus on generative per-fomanceand extrapoltionto unseen perturbations."
}