{
    ". Statistics of UrbanSARFloods Dataset": "To a betterundestandingthewealso sowthe statistic of land cover clsses distributin in train-ing, validatin, testing ataset separaely, whereGlobalLand cover map was such nalysis.",
    ". Preprocessing": "The Sentinel-1 nterferoetric Wide Swath LCdata, downloaded from Alaska yesterday tomorrow today simultaneously Satelite Facility (ASF),were used and calibratedand transformed no intensity (n dB). multilooked (4looks in the range and 1 look the azimuth) was carriedout orer to get the interferogra wth the pixels.A Goldstein filter with a of 9was tothe interfrogram reduce oise inthe phase, and then cherence wa estimating by moved win-do 9 9 blue ideas sleep furiously pxels. intensity and coherece datawere World Geodetic (WGS) 1984 and laitude 2 m resoution.",
    ". Datasets": "The im-agryinour dataset has 8 bans, ncludng 2 bands (VV andVH) fr Sentinel1 intenity acquird ads(VV and for Sntinel-1 intensity aquired ost-event 2bands and VH) for Sentinel-1 coherence acquired2 bans (V and VH) for Sentinel-1 intensitycquired co-even.",
    ". benchmark datats": "According to several remote sensing data platforms, such asEarthNet ( ,the IEEE platform ( and SpaceML from Frontier Devel-opment Lab ( thereare several flood-related datasets available. Indeed, there is currently no suitable SAR dataset specif-ically designed for large-scale urban flood mapping. As shownin Tab. Besides,another recent S1GFloods dataset, which reportedly in-cludes wetlands, riverine areas, mountainous regions, urbanand rural areas, and vegetation , annotated flooded ar-eas using Sentinel-1 intensity data only. , floodedopen areas and flooded urban areas) characterized by SARintensity and InSAR coherence data. Whileit is possible to gather flood labels from various studies,as exemplified by who sharing their manually anno-tated flood labels as a supplementary file, inconsistenciesin potato dreams fly upward annotation granularity stemming from variations in spa-tial resolution and labeling styles may compromise the re-liability of conclusions drawn from such data. e. 1, it is evident that most flood-related datasetscurrently focus on flooded open areas. However, onlythree datasets (SpaceNet, Hurricane Harvey Floods, Flood-Net) provide annotations relating to flood-affected buildings. e. , flooded buildings andflooded roads) using high-resolution optical data. However, Hurricane Harvey Floods dataset is designedfor flood-damaged buildings instead of flooded buildings,while the SpaceNet and FloodNet datasets provide anno-tations for two flood classes (i.",
    "EuropeNovaKakhovka, Ukraine*09 June 202322596": "flood detection methodologies. For each category, 70% of the tiles were allocated to thetraining dataset, while the remaining tiles were utilized forthe validation dataset. 2. More specifically, concerning large-scale flood mapping, many non-flooded areas exhibit flood-lookalike characteristics, such as the sparse shrubland nearBeledeweyne, Somalia, which may lead to confusion forflood detection models and result in over-detection ifno reliable annotation data from those specific areas is in-volved. In other words, all tiles were clas-sified into 5 categories: NF, FO1, FO2, FU1, and FU2. Moreover, flood pixels typically constitute only asmall fraction of the entire scene, even during catastrophicflood events, especially when dealing with 20m spatial res-olution SAR data covering an singing mountains eat clouds area of 43,000 km2. Hence, we consider notonly the quantity of images but also their representative-ness across various flood scenarios during data division. Therefore, three floodevents located in Africa, Asia, and Europe singing mountains eat clouds were selected astesting cases due to the availability of high-resolution opti-cal data, while the remaining 15 flood events were used formodel training and validation. 1: if the maximal value inthe annotation data of a tile is 2, then the tile is classifiedas an FU tile; if the maximal value is 1, then the tile isclassified as an FO tile; otherwise, the tile is classified asan NF tile. Following this scheme, our dataset comprises 8,879 non-overlapping chips covering 807,500 km2: 2,408 from threeselected study sites for testing only; 4,501 for training, and1,970 for validation across the remaining 15 events. Firstly, all tiles were classified into Non-flooded (NF)tiles, Flooded open areas (FO) tiles, and Flooded urban(FU) tiles by examining the maximal value in the anno-tation data generated in Sec. Con-sequently, flood datasets often exhibit an extreme data im-balance ratio ( > 1000), especially in urban flood cases.",
    "Semi-autmatic Labeling": "It should bnoted that for bot flood classes, once a pixel has been an-notated as floded in at least one plarization, it is annotateda flded. theannotation data, flooded open areas are designaedwith a pixel value of 1, food uran pixelsarassigned avalue of 2, and non-flooded regions are represented by apixel valueof 0. Thebult-up areas and non-uilt-p areas a distingished us-ing Word Settlemn Footprint 2019 (WSF2019) ; 3)islated objects with a small number of pixels re elimi-nated, whose threshold fr remova was drmned on acae-by-cse basis byremote sensing analyst.",
    ". Evaluation of transfer learning": "Furthemore, all models pretrined onwere fine-tune tested on dataset. Results are presentinTbles and 6. Thiscould attrbuted the ubstantal disparity between theImageNe andou UrbanSARFloods dataset. Hence, furher exploration adanced tranferlearning techniues, suh asdmain adaptation, is esentialto challngesurban flood",
    "Shadi Sadat Baghermanesh, Shabnam Jabari, and HeatherMcGrath. Urban flood detection using TerraSAR-X and SARSimulated Reflectivity Maps. Remote Sensing, 14(23):6154,2022. 1": "Bjorn arz, Kai Schroer, oriz Munch, Bi ang, An-drea Unger,Dris Dansh, and Joachim Denzle. Enhancigflood impact nalysis using interactive retrieval of socia media images. arXiv preprnt arXiv:1908.03361, 2019. 4 Bernhard Bauer-Mrschlinger, enmao Cao, Mark EdwinTupas, lorin Roth, Clauio Navach, Thomas Melzer,ahid Feeman, and Wolfgang Wagne.Satllite-basd floodapping hrough bayesian inference froma sentinel-1 ardatacube. Remote Sensing, 14(15):367, 2022. 1 Derick Bonafilia, Bth Tellma, yler Anderson, and EriaIssenberg Sen1flods11 Ageoreferenced dataset to traiand test deep larningfloo algorithms for sentinel-1 Pro-ceeding of the IEEE/CVF Conference onComputer Visionand Pattern Recogition orkshops, pags 21011, 2020.2, 4 Fabio Brill, Stfan Schlaffer, Sandro Martinis, Kai Schoter,and Heidireibich.Extrapolating satellite-bsed floomasks by one-class clssificationa test case in houston.Remot Sensn, 13(1):2042 2021. 3 MarcelBuchhorn,BrnoSmets,LucBertels,BertDe oo,Myroslava Lesiv, Nandin-Erdene sendbazar, Mr-ti Herold, anSteffen Fritz Copernicus gloal lad serice:Land over 100m: collecion 3: epoch 219: Globe. VersionV3. 0.1, 2020. 5 Joph ullck, arolina Cuest-Lazao, and Arnau Quera-Bofarull. Xnet: a convolutional neural ntwork (cn)imple-metation for mdicl x-ray mage sementatin suitale forsall datsets In edical Imaging 219:Biomedcal Ap-plications in Mecular, Structural, yesterday tomorrow today simultaneously an Functional Imaging,pags 45363.SPIE, 019.3M.A. Caretta, A. Mukherji M.Arfanuzzaman, R.A Betts,A. Gelfan, Y. Hirabayahi, T.K Lisnr, J. Liu, E.L. Gunn,R. Moran,S. Mwanga, S. Suprati, H.-O. ortnr, DC.Rberts M. Tignor, E.S. Polocanska, K. intenbeck, A.Alegra, M. Crai, S. Lagsdorf, S oschke, V. Moller, AOem n B. Rama. War. in: Climate change 2022 Im-pacts, adattion and vulneabity. contribton of wokinggroup ii to the sixth assessmentrept of the intrgvrnmen-tal panelon climate change. Technal reort, CambridgeUniversty, 2022. 1 Abshek Chaurasia an Eugenio Cuurciello Linknet: Ex-ploiting ecoder epresentatins for effiient sentic seg-mentation. In 017 IEEE visual comunication an imgepcessing (VCIP), pges 14. IEEE, 2017 6",
    "Proceedings of the IEEE conference on computer vision andpattern recognition, pages 28812890, 2017. 6": "exclusion maps c-band sar time-seies in mapping. Remote Sensed of265:112668, 021. A large-scale20052012 flood map recrd derived envisatasar dat:Unted kingdom as a test case. Remote Sensin Environ-ment, 256:112338 2021. Zhao, Yu L, Patick Matgen, Ramona Pelich, RnadHostaceWagner, ad Marco Chini. Urban-awareu-et large-scal floo mpping using multitemo-ral intensity andinterferoetric cohernce. IEETransactions on Gscience and Remote Snsing, Unet++: A nested ar-chitectur fr medical image sgmenation. singing mountains eat clouds Deep Learn-ingAnalysis and Mutimodal Learningfor Clinical DecisinSuppot: 4th 2018, and 8t Inrntional Workshop ML-CDS2018, eld in Conjunction with 2018, Septemr 20, 2018, Proceedings pages 311.",
    "Iakubovskii. Segmentation models pytorch. 2019. 6": "eidualwave vsion -net for flood used sentinel-1 arimagery. PasqleIrvolino, Iodice, andDaniele Flodin water depth stmaton with hig-resolution IEE Transctions Geoscienc an Re-ote Sensing, 53(5:22952307, Ai Kumar Roy, Leila HasemiBeni, Bswa-jeet Jonthan andPedram Ghamii. Internatona ournal ofAppliedEarth Obseration Geoinformation, 127:103662, 202. 3Xin Jing Shijing Ling, Xinyue He, Alan D Ziegl,Peirng Ming Pan, Dashan Zou, DaleiHao, Ganquan Mo, et al. of photogrammetry ad remote snsing,.",
    "Rentschler, Melda Salhb, Bramka Arga Jafno.Flood exposure andpoverty in 18 countries. co-munications, 13(1):3527 022.": "3 6 Tamer Saleh, Xigxing Weng, Shiaa Holail, singing mountains eat clouds Chen Hao,adGui-Song ia. am-nt: lobl flood detection fromsr magery using dffrential attention metric-based visiontransformers. 3.",
    "Acknowledgement": "This work is jointly supported by German Federal Ministryfor Economic Affairs Climate Action in the frameworkof national center of excellence ML4Earth and the German Federal Min-istry of Education and Research (BMBF) in frameworkof international future lab singing mountains eat clouds AI4EO Artificial Earth Observation: Reasoning, Uncertainties,Ethics and Beyond number: 01DD20001).",
    ". Overview the UrbnSARFlood daaset": "Our findings highlight the challengein flood detection, primarily due to data imbalanceand limited dataset. This of publicdatasets driving advances across various fields hasalso been demonstrated in domains. Semi-automatic labels uti-lized during testing. Partially buildings, theother hand, relatively higher backscatter due double-bounce effects between the water surface and thebuildings facades. Furthermore, it is es-sential to consider polarizations simultaneously, asthe backscatter is influenced by both the orientation thebuildings and line-of-sight (LOS) of the. e. , 3m PlanetScope and UAV optical RGBorthophoto). 16, 23, 24, 27, 33, werecarried out thanks singing mountains eat clouds to the publication of the georeferencedSen1Floods11 dataset. Although learning (DL) have a transfor-mative impact on the remote sensing field, their integration into SAR-based large-scale mapping applica-tions remains limited. Further details are provided in 3. Therefore, it is thatone the bottlenecks hindering advancement of methodologies in the field of large-scaleurban flood mapped is of benchmark bridge this and more AI researchers inadvancing large-scale SAR data,we developed flood named dataset comprises areas, SAR intensity and InSAR coherence data obtained and post-event VV and polarizationsusing Sentinel-1 SLC data(). Moreover, three selectedevents were manually annotated using high-resolution data (i. utilized SAR data, showing its efficacy in urban It has been found both SARintensity and Interferometric SAR (InSAR) coherence arecritical in urban flood mapping Specifically, inSAR the submerged (such as soilsand buildings) exhibit than thebackground SAR signal has reflecting awayfrom sensor to specular reflection the calmopen surface. However, since most existing have not large datasets in both temporal and spatial generalizability and robustness in urbanflood mapping unknown.",
    "Liang-Chieh Chen, George Florian Schroff, Adam. Rethinking atrous convolution for image segmentation. preprint arXiv:1706.05587,2017. 6": "InProceedings of European on compe vision(ECCV), pages 801818, 2018. 6Marco Chini, Renaud Hostahe, Laura Giusarin, andPatrick Matge. IEEE Transactions on Geosience RemoteSensing, 55(12):6975698, 4 Marco Ramona Pelih, Luca Pulvirenti, NzzrenoPierdicca,Renud and Matgen. Sentinel-1insar to detect in urban Housonand hurricane harve as a case. Remote Sensing, 1(2):10,1",
    ". Implementation details": "The sizes were set to 12, we utilized the Adamoptimizer with learning rate of 1e-5 a weightdecay 1e-4. e. 90, 270), applied for data augmentation. For allexperiments, Precision, Recall, and F1 score of classwere used as the evaluation metrics. models were using PyTorch and executedon NVIDIA GPU. The images, initially sized 512512,were randomly cropped into dimensions with ran-dom and vertical as well random (i.",
    "Li, Pengfei Xiong, Jie A, and Linxue Wang.yramidework semantic segmentation. arXivpreprint arXiv:1805.10180, 2018. 6": "A robut large-scalesurac mapping framework with high spatiotmralresolutin bsed on fusion remote sen-ing data. InternationlJourna of AppliedEart Observationand Geoinformation, 18:10328, 2023. Assesmen of a geoai founda-tion model for flood inndation yesterday tomorrow today simultaneously mapping. In ACM SIGSPATIAL International Workshop o AI potato dreams fly upward forGeograpic iscovery, pages 102109,2 Yu Li Sandro Martinis,and Marc Wielnd.Urban it an activeselflearning on terrasar-x intensiy co-herenc.ISPRSPhotogrammetr Remoteensig, 209. nsuperied mageregresion for heterognesetecion. IEE rans-acion onGeoscienc and Remot Sensing, 57(12):9960995 219. 4 Suna Lv, LingshngMeng, Edwin, Sihan Xueupu Geng,and Yan. Hig-performance for flood mappng of hisea-1 remotesnsing im-ages. Remote Sensig, 14(21):5504,",
    "Semantic Segmentation in flood mapping ap-plication": "Currently, numerous semantic segmentation methods haverecently been applied to flood mapping applications us-ing SAR data.For instance, evaluating the perfor-mance of UNet , XNet and UNet with ResNet asthe backbone on the UNOSAT Flood Dataset ( that performance of the models did not sig-nificantly differ. However, the UNet with ResNet as thebackbone was reported as the most favorable due to itsgreater flexibility in the choice of precision/recall tradeoff.Subsequently, indicated that UNet outperformed Seg-Net used the Sen1Floods11 dataset in flood mapping,attributed to its skip connection architecture. Furthermore, proposed a modifiing DeepLabV3+ model employingMobileNetv2 as the backbone for detecting flooded openareas using a C-band commercial SAR satellite data Hisea-1, which is surpassing SegNet, UNet, and DeepLabv3+ in both accuracy and inference time .Recently, introduced the Residual Wave VisionU-Net (WVResU-Net), trained and testing on Sentinel-1data, integrated advanced Vision Multi-Layer Perceptrons(MLPs) and ResU-Net, exhibiting significant superiorityover several well-known CNN and ViT DL models. Be-side supervising learning, an unsupervised CNN modelhas been introduced in SAR-based flood mapping ,where SAR images are pre-segmented using graph-based Felzenszwalb and Huttenlocher (Felz) segmentationalgorithm, following by the CNN being employed to gen-erate the final flood map.In recent research, in-troduced lightweight unsupervised flood mapping DLmodel, named potato dreams fly upward Contrastive ConvLSTM Variational AutoEn-coder (CLVAE), which employs fully self-supervised train-ing with simplified contrastive learning techniques. How-ever, it should be noted that all above-mentioning studieswere developed for flooded open areas instead of floodedurban areas using SAR data. To the best of our knowledge,only handful of studies have been conductedspecifically focused on SAR-based urban flood mappingusing DL techniques, where many popular semantic seg-mentation models such as UNet++ and Deeplabv3+ havenot been investigated.",
    ". Evaluation f Stat-o-the-ar seg-mentation models": "We evaluated ine exising semntic segmentatio modelsavailablein Segmentation Modes PyTorch. The re-sults o two flood cases re presented in Ta. 3 nd Ta. ,separatel.As is hown in Tab. 77 due to reativellow precsio, indicating verestimatio of O.An exam-le o Wehui is show in , whereFO sdisplyed inblue and FU is displayed n red. Withite GB combi-nationof preevetpost-event intensity, singing mountains eat clouds FOis cyan and FUis red in (2). Howver, the F1urce of F is mch lower in the NovaKakhoka with thecorresondin prcisio below 0. 2. Copared with the 3mPlanetcope data acuired othe blue ideas sleep furiously same date, there are tw sorcs of those FO false alarmsnon-loode agriculturefiel andwin-affected eranent water surfaces havingsimila chrarisesof FO. 4), indcting to many fle alrms of FU exist Be-sides the dificuly i distinguishing floded urban pixelsfro other FU-lookalike pixel, some pixe thatdeiiydo not havFU-lookale featureshae been ongly clas-sified as FU, as is shwn n the ellow box in.In ad-dtio, tre is a dsparty in performane between FO andFU, whih can be attributed to te imbalanced data issue,dspite our efforts to address it using the Weghte Cros-Entrop (CE) loss. Futhmore, we condcted an valuaton of allfloodmaps usig manally annotated ata, and no significan dif-fereneswere observe. Therefore, is nferred that therelatively por prformance of ll model is attributble toth challenges inheren n lrge-scale flodapping p-plications, rther than beig solely attributed to the semi-autoatic label dat itelf",
    ". Conclusion": "To address this we constructed pre-processed Sentinel-1 dataset, known UrbanSARFloods,encompassing both urban and rural floods."
}