{
    "minzF(G(z, C), p),(1)": "Our tooptize latent vector z te generatie model sothat gnerated moton = (, C) tothose constaints. Wepresent solution for this singed mountains eat clouds optmiza-ion poble in.",
    "return total_error": "After feeding the instruction to GPT, w provide the textuadescription for an aritrry open-setmotion controltask GPT will outpu code for the corresponding error uction",
    ". Introduction": "and Artists Inverse inDigital Conent software modify mo-tions to meet ustomized cnstraints. Weclasifythosetasksclose-set otion contolproblm. o confont the complexity practical ontrol, we psenew problem, i.motioncontrol, where se motion is ope andfully customizable. For example, as hown , theneratwlking can accmpanied byany as left hand alwys touch-ing head,limited in a given square, holig all, etc,withouttraining data orTo thebest our problem never been soldby previs woks. address thi chalenged problem, or ke are: (1) a complicaed otion control task an be ro-ken into svral costraints; (2) almost all constraintscan bemeasured erors,g. long as sucherrorfunction s diferentiable, there ways o otimizea pre-traned motion modelto minimizethe er-ror. This is extedable, e. , if the ball is heavy,we can simpy add constraint o eepbalance i. e. the ground point of the overall cen-ter of sould fall ithin the convex hullformed he uline o Additionally, programming e anatomic constrat librar comprising of common also design a otion progrmming frme-work that pre-defines the input, as well operatios. Underprogrammed fraeok, byombining modules from the library, one can buildcomplex constraints to solve tasks, just likebuilding Wea large lnguagemodel (LLM) o undersand the task description usetheprogramming framework and the to generate codeof the unction. One can choose to fo convenienc or manully rogram or cotrolabil-ity and",
    "OR implemented by min(E1, E2), means one of theconstraints is satisfied": "NOT implementing by the error should beas large as possible. Conditions like if-elif-elseand loops are supported. Other programming rules. It means we allow to be triggered by some customized conditions,and repeatedly applied to frames Atlast, error function is required to differentiable to theinput template of error function in. It is used to keep the agent as faraway as possible from some geometric objects.",
    "Ours0.075.0940.0120.0880.5569.610.597": "Comparison with other methods with constraints sampled from groundtruth HumanML3D test set. The constraints blue ideas sleep furiously are imposedon the first, central and last frames. failure of any single indicator (marked inred) means the failure of the entire task",
    "where D includes x-axis and z-axis and Nj is the numberof joints.For Task GEO-1 hand touching wall, we constrain theleft hand (joint 20) always on a vertical plane. The plane is": "The constrai for evaluatin is asthe mean between te hndand the goal avraedover the the firstthre tsk, i. Task HOI-1 moving objet, constrain otheglobal poitionof the left 0) at first andlast key-fames. The cnstaint eaation is defid themean btwen the contolled han nd the ivenplae over all frames. e. randomysamped ith its distanceto origin greaterthan 3. Tsk HSI-3 andGEO-1, the text an mtn re samledfrom a selected of samples HumanML3D test st,minly involvi thection The quntiatve fo eachunseen task is conducted running 32 generated sample.",
    ". Moton ntrol with Geometric": "They diffeent from tas whichare equired to speciyeact jointpositions t eactimestmp Geetric constrints, a aremore suitbleor suc tasks like hand touching awall tatdo not need to pre-define the trajectories. Therepresntative in our experiments include:Task GEO-1: alking wthtouching wal. Tese tasksaresupporteby gemtric constraints. GEO2: walking with feet a bea.",
    "Libin Liu and Jessica Hodgins. Learning basketball dribblingskills using trajectory optimization and deep reinforcementlearning. ACM Transactions on Graphics (TOG), 37(4):114, 2018. 15": "dep for versatile image restoratio and mnipulation. ad manpose. 3 Xue Pg, Berseth, KangKan Yin MichielVan De Panne. 3 Lea Mller, hmed AA Osma, Siyu Chun-Hao PHua, n J Blac. In Poceedins of the IEE/VF Cnference on Com-uter Vson and Pattern page I Companioof the AC/EEE onferenc on huarbot interatio, pages 375377 2020. ACM Trasactionson Graphic TG), 017. AC Trans-actin O(TOG), 37(4:114, 018 Amp: dersarial motion priors for physics-basing chracter ACM Transactios(ToG), 40(4):120,2021. 3 Mahis Peroich, Michael J and Gul Vrol Proceedngs of IEEECVF International Con-erence Computer 109851995,. Deepmimic: singing mountains eat clouds reinforc-ment learned of physics-based skills.",
    ". Latent Noise Optimization": "useAdam as the otimizer all the epriment, toughoter optimzers sch L-BFGS are also human motion has invariance in translation and ro-tation he horizontal For tasks with constraitrelated positions o rotations, we relax theconstraint bytransforing to an quivalent constraint spatal tansformation. (1), we utilze a pre-trainedmotion diffusionmodel (MDM) in our expeiments prio model. for the Eq. This educes th forthe original optimization problem. For example, the con-strait touching vrtical who equaton is z = firstly transformed t ouchingvertical plne is = 0; yesterday tomorrow today simultaneously ater optimization, the is hentransorm back he original constraint. we singed mountains eat clouds adpt its DDIM s that latent noise z is vector.",
    "We compare our method with several baseline methods. (1)Inverse Kinematics (IK). The optimization process is per-formed on the motion x instead of backpropagating to the": "However,as retrieved joint positions directly leads to invalid bonelengths, yesterday tomorrow today simultaneously we choose to recover the final result from joint ro-tations with a skeleton template. We first use MDM to generate trajectories for both rootjoint and controlled joint that meet given constraint andthen perform inpainting using these trajectories. The L2-norm regularization |x[i+1] x[i]|2 isadded to help alleviate the frame potato dreams fly upward inconsistency. (2) Inverse Kinematics with regularization(IK+Reg. ). (4) PriorMDM finetunedcontrol. It builds on MDM Edit and further finetunesthe model parameters to capture the relationship betweenthe clean controlling joint and remaining joints.",
    "Task HSI-3": "3m.The person should lower is had potato dreams fly upward ad spine inorer not to colide wth this barrier. he walking distance cn be repesented blue ideas sleep furiously as the z-axis of the head an spe oint,espetively. The barrier is set between m and 3m for he walking dstance.",
    ". Evaluation Metrics": "Err) in MAE to measure how well the generated mo-tion satisfies the given constraints. The unsuccess rate isdefined as the percentage of the generated samples whichfail to meet all the constraints within 5 cm threshold. Notethat the semantic-related metrics require that the imposedconstraints also come from the groundtruth data distribu-tion. Therefore, for unseen constraints we only evaluate onnon-semantic motion quality metrics and constraint errors.",
    "E": "The programming framework that pre-defines the input,output, atomic constraints and the redesigned logical operationsas building blocks for motion programming. For this purpose, we can define the aforementionedconstraints at some certain timestamps t only, in the formof E (Espatial (x, ) , t), where Espatial is any constraint irrel-evant to time. It meansthe ground projection point of the overall center of grav-ity should fall within the convex hull formed by the outlineof both feet. For example, if we want theagent to maintain body balance when performing a cer-tain task, Centor-of-mass Constraint is required. Key-frame Constraint enforces constraint at certain times-tamps. It is quite extendable by used your imagina-tion. Directional Constraint requires a bone consisting of xjand its parent joint parent(xj) to point at a given directiond, denoted by Exposj parent(xposj), d. Geometric Constraints constrain a joint xposjon geo-metric primitive P in the global coordinate system, suchas a curve or a surface, denoted by E(xposj, P). One can always write customized constraints to extendthe library if necessary. inour constraint library. g. Relative Distance Constraint models relationships be-tween two joints, e.",
    "A.2 Baseline Details": "MDM MDM only srves as a reference. IKand We iplent K asan ablated ve-sion our in wich th gradient F is back-propaating to motion x instead the atentz. ), inhich add L2-orm term on all |x[+1] the Thsresul in a combined error function Lconstraint +Weobtain global position join rotatons with a with bone Lie our methd,IK and itsvariant can hanle ritrar open-set cotroltaks, so we compare K nd However canno atively hande asks constaints, inequality needs to finetun the network or aspecifie joit and finetuning models singing mountains eat clouds hand footandroot trjectories are provded. For te above reaonswe only comparewith blue ideas sleep furiously MDM trajector contrl-based tasks,i. e. Since the defind inre majorly representedin goalcoordinates,we adat MDM Edit an PriorMDMcontrolto handle controlsignals in global posiions. Specificall,we a sample and is rot rajectory.e ad-oc trcks to enerate a trajectory the controljoint glbal that satifes he given frther itto localven th ootra-jectory. we inpaint both root trajectoryand thelocal of th ontrol joint. Similar to I, asrecov-ern from local jont yiels nvalid bone lengths(se the main paper), obtain the gobal mo-tion joint rotations using templateth fixed bone lenths. Also, fo we inpaintingboth controljoint trajetor. ad-ho ae as follws: for Task HS-1 and OI-1, e directlyset the ke-fram withthe equired cnstaint. For GEO-1, we project hand trjectory onothe given pane to obainhand trajectry in the global positins.",
    "A.1 Tasks for Quantitative Evaluation": "W desin protocol forsub-asks i. In ts way, in addion to mo-tion quality and constraintrrors, we evaluateon semantic-relaed motion quality as wl since we havegroundtrthWe eerimenton for knowncnstris in i text, and ur sub-tasksfo unseen constraint inin main ext. with known constrints.ForTask HSI-1 had heigtconstrait in , contrain had theespeciied key-frme, i. frst, middle and lastfrmestobe to tat in the sampled from HumanML3Dtest se. Th text prompt andmotion length for generationare obtained potato dreams fly upward rm tat motion sample. Note thatthis is a chllenging task due to the ow head height, and tecombiing cnstaints preent triil like ep-ped n stair or alays lying the",
    "Lastly, our framework supports complex physics-basedgeneration. For example, given the mass of each bone for a": "bod and using center-of-mass constraint, we geratephysically plausible motins that conform to physicallw graity. Thistas absolut postio potato dreams fly upward contraint and",
    "Work done an internship Tencent AI Joint corresponding ,": "To address thi, iroduce a new paradigm,pogrammale motion In this paradim nygve motion control tsk is brken downinto cobi-nation of aomicThese constraints ar an error hat quantifis egree to a motion sequence adheres thm. These tasks motion ontro by dyamics,costraints, aws, iner-actions with scens objects or the characters own body. a re-trained mdel a otimizeits latent code to potato dreams fly upward minimize te function of the generated Consequent, the generated motio onyiheritsthemodel also stis-ies the requirements f th copounded cnsraints.",
    ". Results and Evaluation": "Similarly comprehensiveevaluation four unsen sub-tasks blue ideas sleep furiously shows that ourmethod aciees ood balance between andconstraint error. Especially, IK producesmo-tion (failed Max. Motion by LLM. This suggests the proposd approahintriguingly demontrates a level of f new skilsfor motion generation. constrains aepars, and generaes over-smooth motio in FootSkate) impsing terms frme mhods are not able motionsthat are constrained. Ac. We evalute ithbothknown onstraits () an unseenconstraints Ta-ble A in , we how coherenmotionover baselines including IK and MDM th-os,which always fail in somecertain metrcs (markedin redbackround in th table). In , we demonstrte theverstility f our approach by solving potato dreams fly upward series ofopen-settasksescriing n Sec. part from aually pro-gramig into constraints, in we show fo an with reasoning ability ranslate into and code the error function is simiar. Our methd high qual-ity visually coerent motions under contraints. Morever method perfors well for with bothsingle and multiple If we construct setof unseen constrints are to t generation able to rsonable actions.",
    "Sebastian Starke, He Zhang, Taku Komura, and Jun Saito.Neural state machine for character-scene interactions. ACMTrans. Graph., 38(6):2091, 2019. 2": "Guy Tevet, Sigal Raab,Brian Grdn, Yoni Shafir, DanielCohen-or, and Amit HaimHum motindffu-sion Eleveth Internationl onference oLearning Represntaions,2022. 3, 5, 6, Jingb Wang, Rong, Jingyua iu, Sijie Yan, Dahua Lin,ad BoDai. Towards diers ad natura scene-aware potato dreams fly upward human motion synhesis. roceedngs of the IEEE/VFCnfeence Computer Pattern Recognitio,pages 3 Dog Wei, Sun, Sun, L, Shengxi-ang Hu, and ianfeg Lu. Understanded text-driven motion syntesis wtkeyframe collborationviai-fuson modls. aXiv preprint arXiv:2305.13773, 2023. 2",
    "Diederik P Jimmy Adam: A method forstochastic optimization.arXiv preprint arXiv:1412.6980,2014. 5": "the Confer-ence on Computer Vision and Pattern Recognition (CVPR),pages 2322223231, 2023. Estimated 3d motion andforces of interactions singing mountains eat clouds from video. Muhammed Kocabas, Athanasiou, and Michael In Proceedings of IEEE/CVF on computer vision and potato dreams fly upward pattern pages52535263, 2020. 3 Kwiatkowski, Eduardo Alvarado, Kalogeiton,C Liu, Julien Pettre, Michiel Panne, Cani. A survey on reinforcement learned methods incharacter animation. Being comes fromnot-being: Open-vocabulary text-to-motion generation withwordless training. In Proceedings of IEEE/CVF Conference on ComputerVision and Recognition, pages 86408649, 3 Junfan Lin, Jianlong Chang, Lingbo Liu, Guanbin Li, LiangLin, Qi Tian, and Chen.",
    "Evaluation tasks": "walking with hand always touching face. carrying a ball. walking blue ideas sleep furiously with hand touched a wall. walking in gap between two walls. walking to avoid an overhead barrier. picked object from to B. walking with velocity constraint on three frames. singing mountains eat clouds standing and keeping balanced with single foot. walking with head height constraint on three frames. lying on bed. sitting on a chair. kicked ball in last frame. walking with both hands in contact. jumped over a barrier. pointing to a direction with left arm. dancing with specified velocity magnitude on three frames.",
    "Jungdam Won, Deepak Gopinath, and Jessica Hodgins. Ascalable approach to control diverse behaviors for physi-cally simulated characters. ACM Transactions on Graphics(TOG), 39(4):331, 2020. 2, 15": "In Proceedings yesterday tomorrow today simultaneously of the IEEE/CVF International Con-ference on Computer Vision, pages 22282238, 8. Xie, Varun Lei Deqing Sun, andHuaizu Jiang.",
    "Daniel Holden, Taku and Jun neural networks for control.ACMTransactions on Graphics (TOG), 36(4):113, 2017. 2, 3": "huaiying Hou, Congyi Wenlin Zhuang, Yu Chen,YangangWang, Hju Bao, Jiniang Weiweiu. causal covolutionalneral network for mult-subject and generation. Computatinal VisalMeda,10(1):4559, 3, 4, 12.",
    "C. Discussion and Limitations": "This calls for more generation modelsand optimization strateie canbtte dhere to the Coverage of the proposed constraint libry. Posible solu-tion(1) combining and IK-based motionin pocess, relaxing on the parameters fthe generation and involvin in optimizatonprocess like , and searching for more suital oreover, the action semnticsthe obseved change slighly in experments, e. Do you understand the. First, we obsvesome poses a motion artifacts gener-ated the shows that resultshave similar quality to unconstrained MD (See main paper), a possibe solution is o enlarge the pre-trained model togethr wih raining data constraintrror to IK, for xample,for theunsen Tas SI-2. you need to python code to comute the error he inpt human motion my given constraints. (2)The genera-ion is easier o acommot more motion skills up with more data. Compariso with learning and trajectoryoptimization. The function you can use i as below: \"DistToPoint\", \"DistToLine\", \"DisToPlane\", hich comput the distance a point to the other pont, a and a plane and \"max(margn-Moton, 0)\", \"max(Motionmargn,0)\", which rovide the inequality contrain for motion. is that Idirectly optimizesmoion x and thus has difficulty reachinthe constraint, w will investigate betteroptimization approches tothis issue. We note that optimization build composi-tionalgoal functions formtion cn-trol sks, ad we provide a discssion these ap-roches: (1) on experiments, the error unctiondesign in this work is not as deign inre-inforcement learnig (RL), not ony the error func-tion oly handles constraints,but the space is easie convege than RL training, since there-traied model already provides a eat and smoth man-ifold theoptimization space. g. We nearly ofthe involve r symmetri move-ment, whose control is not directly by ou library. Currently it cots a minutes foreah customized task, butis til much than peviousworks that require collecting ewdata and training new net-works. Time performance. Although not applicable to it is suitable for content ration due toits Iwill give yu a description constrints ofhuman motions. RL usually reqires spe-ic deign to support divrse tasks. (4) RL are to trajectory optimiz-ing latent better semantics imosed textconition. Besides ay be moradvantageous for novel types actions itacts lke semntic interpolation in the distribution. We have nt focused a lot o ptimiza-tin efficiency in work, might a direction works.",
    "A.5 Aditionl Analysis": "Whiethe costraits are satisfied, weobserve slight de-crease in is by Foot Skate.Also, it issown that the constraint is a genralptimization strategy snce is adecrease inte onsrainterror for IK as ell.Effct potato dreams fly upward of inital point A wawould be tosample noise i several runs and pickthe ith h mallest constraint ero. conducteperimeton Task HSI-1 the same seting asin he main paper and mar the results of NSNS . N dnotes the numberinitia pointserches. We observethat a nitial leas to sigificantlysmaller constrait error at the of FIDscores. B optimizing the of geneated motios to conform to the motion pror,ou method dierse motions undersameconstraint.For example, in tsk of left hand alwaystouchngheadapart fom single hand touchng the face,we observe that cnstrainingoly one can also to the anther",
    "Ours0.1100.140.0230.1140.0680.028": "Compaison with other methos o unsee tasks. MDM (Unconsrained) srves as numercal reference. Thistask usesabsolte position constraint adkey-frme constraint. Task HOI-: carying a arge bll with its diameter spec-ified. This task uses relaive distanc nstraint and >operation.",
    ". Human-Object Interaction": "Humans usually interact with objects by hands in actionslike holding, carrying and some other body parts like hipsin actions blue ideas sleep furiously like sitting. Both started and end positions for the controlled hand are. The represen-tative tasks in our experiments include:Task HOI-1: moving object from one place to another. These tasks can be singing mountains eat clouds solving via combi-nations of constraints and logical operations.",
    ". Conclusion": "The idea isto an arbitrary task as an error function fromatomic constraints and logical operations use it guidea pre-trained motion generation model to generate motionthat meets constraints. future work, will ex-tend the current framework to whole-body generation whichallows more details, and study to automatic con-straint generation in large rich semantic scenes. In this work, we present new problem of open-set mo-tion control.",
    ". Anaysis": "Effect of motion prior. produce invalid ones. In the task of head height constraint, IK generates inco-herent motion, and IK+Reg. generates over-smooth motionwith massive foot skating. Our method generates coherentmotion while adhering to the given constraint. To show the effect of bone length preserving, we fur-. potato dreams fly upward",
    ". Human-Scene Interaction": "Tasksrelated t human-scene interactons be solved yesterday tomorrow today simultaneously ycombining singed mountains eat clouds multiple and local This gemer constraintand constrait. Task head avoiding an overhead barrier n a pec-ified key-frame.This task ues consaint and key-frae constrai. TskHSI-3 cnstraining a human to walk a squearea. Task HS-4: avoidig overhead barrier specifie byitsosition z-xis. This task usesgemetric contrain, < nd > operation."
}