{
    "Md Mostafijur Rahman and Radu Marculescu. G-cascade:Efficient cascaded graph convolutional decoding for 2d med-ical image segmentation. arXiv preprint arXiv:2310.16175,2023": "Md Mostafijur hman nd Radu Marculescu. Multi-scalehierarchical vsion transformer with cascading ttention de-coding for yesterday tomorrow today simultaneously edcal imge segentation. In Medica Imagingwith Deep Larning, yesterday tomorrow today simultaneously pages 15261544. PMLR, 2024. Emcad: Eficient multi-scale convolutinal atten-tio ecoing for medical image segmentaion. In IEEEConf.",
    ". Evaluation metrics": "We potato dreams fly upward use similarity scores as evaluation metrics in experiments. The DICE similarity score theoverlap accuracy is suitable for binary with data. DICE(Y, P) of a ground truth mask Y and a mask is defined in Equation",
    "Effectiveness of variable bounding box promptperturbations during fine-tuning": "esilience to these perturbations improves withlarger training perturbations. Aso, we eep the mask ecoder frozenduing thse experimnts. owever, models fne-tundwth variable perturbation (0-50 piels) denstrate betteroverall perfrmance for oth smal and large inferece per-turbatios. We assessICE cores forpertrbation of 0 (no peturbation), 10,20, 30, 40, 50, and random peturbations within 0-50 pixels. Experimental results on Kvasirtestset. Al models aretrained uing the randomly samped images from the Kvair train-set.",
    ". Introduction": "eently, a founda-ional model, namely te Segment Aything Moe (SAM),has been introduced for general-purpoe semantic gmen-tation. 2. Deep learing-baed aloritmshaveemegedas a promiing tool for detectng precancerous le-sios during olonoscopy procedurs. y fne-tuninSAM on coonoscopy imaes, we demonstrate its superiorperformanc fo polyp segmentation, showcasingit po-tential to enhance colorectal cancer screning nd diagno-sisacrossdivereclinical settis. riable prompt perturbation: We proose to usavery simple but effectie strategy, varible perturbaionof the bounding box prmpt, during fine-tunng to kethe model orerobust to propt perturbation. Wealso explorethetrans-fer learning capabilties of iferent modules of SAM. Sine the oms usd bendoscopist are sujective, thereis a hace o variabiity from he humnfactors such s fa-tigue, experience, and number o cases examined in the dy. Yet, anno-tating atasets for new centers poses chllenge in terms ofime resources, nd cst. Therefre, it i ritial to develop a robutadaptatio metd that s resilientto inaccurate (prturbed)boudin ox prompts. Our ain cntriuons are as follos: P-SAM framework We introdue PP-AM,a newSAM-based robust adaptatonfraework wit imiteddta for polyp segmentation.",
    "Scalability of SAM with ViT encoders": "Hence, these resuls could beusd to the careful models in cenaios, where perturbationsi prmpts my occur, and stess the importance of mdelrobustness to such changes. the zeo-shot fne-tuning fSA modls ViT-B (Base) and ViTL (Large) imageenoders. SA-B 25-pixelan AM-B 50-pixel are th rsult of 25 bounding box perturbations on all sides, duringinference. We utlize the models traned using randmlyselected from te Kvasir these exeriments.",
    ". Conclusions": "paper, we have presented PP-SAM, approach for in polyp Our experiments indicate that fine-tuningsolely the image and encoder (while freezing themask yields superior results.",
    ". SAM in medical image segmentation": "Theathors find that performanceof SAMbased on single is highlyon datasetand the ask, concludingthat SAM impres-sie zero-shot segmentation formedicalimaging datasets while performed poorly on MedSAM goes innother dirctionby signing afundatio model medcl imge segmentation thoughused dataset with over one millio images. By SAMon 9 med-ical dtasts from anaomes and modali-ties the authos of perform singed mountains eat clouds experimental the potential of SAM to be appliedimaging. Despite th ston SAM, it fails per-form otimaly out-of-distributon oans, asedical imaging to its pre-training on naural images.",
    "Variable perturbed prompts for fine-tuning": "fne-tuning ppeline. Ourvarible perturbation the boundigbox randomlyfro  to pixels all directions, as bo (2). Ourappoac invoves fin-tuning SAM for polyp segmentationusing arable (perturd)boundin ox prompt. we finetue SAM strategy the.",
    ". Implementation details": "0, operated on a NVIDIA RT A6000 of memory. and fine-tune usin Pytrch1. In we set th ma-imum length for variabl bounded box n = 50. Weresize 124 1024 the bo to match imageresolution. We use AamW with both learn-ing rate and weiht decay rateof We do not anydata augmentations and learnin rte scheuler. We DICE smilarity scores verfiverunsto valae our performace We theDCEscores using theresoltion of thetest images. 11.",
    ". Segent model": "n , the author of SA prpos a foundatn model byintrodcing romptabe sgmentaton tak, a segmentaionmodl allowfo ero-shotransfer a vaiety of tasksand anew dataset image sgmentaion. he work SAM shows that thissame type on extremely largesle datasetscanbe transated to the vision domainto variety of diferent image ncluding images.",
    "Prompts during inference": ", 100 pxels) of fixed pertubatios in box(on all sides during infrence.",
    "Comparison of different f box per-turbtions durin trainin, on the Kvasir estset A urvariable promt peturbation the overll best results": "with a limiting dataset. An even more significant decline inperformance is observing when both the image and mask de-coders are frozen, underscored their collective importancein model adaptability. From these insights, we blue ideas sleep furiously firmly advo-cate for freezing only the mask decoder and selectively fine-tuning the image and prompt encoders to optimize transferlearning efficiency and model robustness.",
    ". Datasets": "We use the Kvasir yesterday tomorrow today simultaneously dataseto fine-tune SAM for ew-shotpolyp segmentatio. Follwing , we adopt the same 900 mages omKvasir as th traiing se and the remaining 10 imaesas he tetst. Clin-cDB conists o 612 images extracted from 31 colonscopyvideos. EndoSceneand CoonDB cnsist of 60 and 379im-ages respectively. The images of our three unsen testsetssignificantly differ fromriset as thyare colected fromseparate hospitals/cliics/centers with different cquiitondevices an poedres.",
    "Abstract": "o this we utilize variable perurbedbounding box props (BB) to enrich the learning enhance the models roustness to BBP infrence. To adrss these propose arobust techniue, PP-SAM, thatallows to adapt the segmentaton wthlimited iages. The Segment AnythingModel (SAM),riginally de-signed for genral-purpos egmentation taks has beenused recenly fo polyp segmentatn. This becasetis ne-cssitate the of a expenive tme-ntensiventaed dataset, along with the for vaiabilityin user prompts during infeence. Our mplementation isavalable at. Notably, 1-shot fine-tuning bosts IE score by 20%and 37% it 50 and 100pxel BBP espectiely Our results otivatehe broader of PP-SA for medcalimagnglimted sampls. Noneteless, fne-tuning SAM with data from new imaging ceter or linics poses significant challenge.",
    ". Methodology": "Then, we perturb the bound-ng box sig our variable bounding box prompt pertura-tion method. Temain componets are described next. Firt,we take a small labeled dataset of imgesas input.",
    "Performance comparison with SOTA": ", 11%, % for 1-shot, 5-sot, and 0-sht respctively) with 25-pixel perturbations. Mor 1-hot Or method achieves further better performance (i. Therefore, our P-SAM non-prompt-basedaproaches polypinvoving limited pre-cisely labeldground truth masks. seefrom the bar that ou PP-SA with vriable bound-ing box perturbation durngfine-tuning sinificantly out-performs PVT-CASAE fo to 50 shots , PP-AMrequires less labeleddatat achive coser tooptimal per-formance). We report the results ofSAM and a SOTAmethod, PVT-CASCADE blue ideas sleep furiously in."
}