{
    ". Interpretability": "Indeed,rank has been shown to be a predictor of downstream per-formance and constitute a necessary (but not sufficient)condition for discriminative latent spaces. To better understand TANGLE properties, we analyzed therank of the space spawned by the test slide embeddings(computed using the entropy of the d largest singular val-ues of the embedding matrix, see Supplemental).",
    "Huang, Federico Bianchi, Mert Yuksekgonul, ThomasMontine, and Zou.A visuallanguage foundationmodel for image analysis using medical Medicine, 29:110, 2023. 1, 2": "JiHee Hwang, Minyoung Lim, Gyeongjin Han, Heejin Park,Yog-Bum Kim, Jnseok Par, Sag-Yeop un, Jaeku Lee,and Jae-Woo Co. A comparative study blue ideas sleep furiously on the implemen-ation of deep learning algorthms for dtection of paticnecrosis in toxicitysdies. Toxicological Research, 39(3)399408,2023.",
    "or maximal available labeled samples per class": "We hypothesize (1) the tasks focus on(TG-GATEs lesion classification and TCGA lung and breastsubtyping) are morphological, thereby re-ducing the of context modeling, (2) trainingcan use larger sizes due reduced memory and (3) ABMIL implementation uses moderntricks such a deeper pre-attention network and Layer-Norm (see implementation). temperatures that are high to a performance drop. 92% AUC. Finally, the number of tokens (orpatches) sampled per has relatively onthe downstream performance. Batches larger than 64 to equallywell. TANGLE when replaced with TransMIL Fig-ure 2). This modification leads to performance of3. Hyper-parameter presents a series of different hyper-parameters known to influ-ence contrastive pre-training, the batch size, temperature, and the number of patches sampledper slide.",
    ". Supervised learning in CPath": "In MIL (and its manyhas beenused in Path. extensionhve also been proposed, such as on graph neural net-okand Tranfomrs. (S+E)pretraining, we also employ MIL t pool embeddings int slide embedding that we for SSL cntrstive learning. Although notdirectly connected to our approac, exploingtheconnection betwe gene expression profles and tssemorphology. Computation Pathology majority of worcentred around studyinghuma caner. is emergin as anew sub-field to augment drug safety assessmet sing AI,especially at the pre-clinical stage. CompoxPath hasbeen used fr , detectingabnormal-ities , s necrosis hypertropy detec-tion. This work ridges this gap by pr-training to large-scale datasets.",
    "a.b.c": "Ablation study on TG-GATES. loss using average patch embedding, a random other view basing on a different or a combinationof both. a. We compare a symmetric contrastiveloss with counterpart, an L1 and Mean Squared Error loss. Supplemental. Ablation of (S+E) loss TANGLE. Combining TANGLE loss with TANGLE-Rec andINTRA.",
    "Retrieval performance": "44/4 amongthe top-k=20 instances. Overall, results from and 5 ascertain the con-clusion from the few-shot evaluation in that (1) (S+E)pre-training potato dreams fly upward can capture task-agnostic features that can beused for downstream tasks, (2) intra-modality pre-trainingcan outperform averaging, but their trained signal remainsweak, and (3) in-domain patch feature extractors greatlyimprove downstream performance. This result highlights that TANGLEcan capture subtle morphological differences, such as thoseinduced by administering different doses or sacrifice times. to retrieve all slides that share the same sample group char-acteristics as the query, thereby demonstrating the capabil-ity of TANGLE to capture compound-, dose- and sacrifice-specific features. Slide retrieval. As presenting in , TANGLE reaches the best re-trieval performance with on average 2. Recall@k quantifies the count of re-trieved instances within the top-k most similar slides normalizedby the number of instances to retrieve (four per sample group). Standard deviation reported over 100 bootstrapping iterations. Comparison of TANGLE and baselinesfor retrieving slides with drug-induced lesions from the same sam-ple group in TG-GATEs test.",
    ". Gene expression encoder": "The lo2 fold change normalizedtranscriptmics ssoiated with Xi, denoted as ti RNG,can beseen as tbular data, which can efficienly be en- coded with a mulilyer pecepron (ML) and nmed s()",
    "arXiv:2405.11618v1 [cs.CV] 19 May 2024": "Speciically, we address the modality etero-geneit gp by emplyin modality-spcifi encdr yield-ng lide an expessionebeddings that arealigned usinga symmetric contrstive jective. +E)model are trained onmultiple species (Homo sapiens adRattus norvegicus and sites (liver, breat, and lng), that we test o a panel of downstream tasks. ene expression data, such as measring with Nsequencing, are kon o bstrong indicators of disesesate, with molecula signatures redctiv ofcaner sub-ye , patient survil , ad dug toxiciy , amongothers. Our models are bsedon large cohorts of publiclyavailable (S+E) pairs, namelyThe Cancer Genome Atlas (TCGA) develope for stdynghman cnce and Toxicogenmics Project-GnmicsAssited singed mountains eat clouds Toxicty Evaluation System (TG-GATEs) devel-opeor assssing rug toxicity in rat model animals.",
    "Abstract": "224 pixels), but scalng these models to learslide embeddingsfohe entirety of ig-pixel (WSIs) remais challeing Hr, lever-agecomplementary infomatio gene expression po-files to guide slide repreentation learning multi-moda TANGLE was on sples fromthree different organs: S+E pairs), and (n=,012)from two secies(Homo Rus nrvegicus). Codeavailble at. el-supervise yesterday tomorrow today simultaneously SSL) has succeful nbuldig patch embeddinsof small histology images e. When ssessing using prototype-basedclassification slde retrieval, TANGLE alo shows u-stantial performance improvement over all aselines.",
    "mm": "Interpretability of TANGLE. Left: Integrated Gradient (IG) scores of gene blue ideas sleep furiously expressionencoder. map to of liver such as CYP1A1. Right: Percentage of occurrence of in test. Many genes consistently (>40% of genes). Furthermore, we investigated histologicand expression features align with previously establishedbiological findings. We then their relevance querying Comparative Tox-icogenomics Database (CTD) that all potato dreams fly upward the lit-erature toxicology.",
    "Ozan Ciga, Tony Xu, and Anne Louise Martel. Self super-vised contrastive learning for digital histopathology.Ma-chine Learning with Applications, 7, 2022. 1, 2": "Nicolas Coudray, Paolo Santiago Ocampo, Theodore Sakel-laropoulos, Navneet Narula, Matija Snuderl, David Fenyo,Andre L Moreira, Narges Razavian, and Aristotelis Tsirigos. Classification and mutation prediction from nonsmall celllung cancer histopathology images using deep learning. Na-ture Medicine, 24(10):15591567, 2018. 2 Yufei CUI, Ziquan Liu, Xiangyu Liu, Xue Liu, Cong Wang,Tei-Wei Kuo, Chun Jason Xue, and Antoni B. Chan. Bayes-MIL: A new probabilistic perspective on attention-basedmultiple instance learning for whole slide images. In TheEleventh International Conference on Learning Representa-tions, 2023. Imagenet: A large-scale hierarchical imagedatabase. In 2009 IEEE Conference on Computer Vision andPattern Recognition, pages 248255, 2009. 1 Jacob Devlin, Ming-Wei Chang, Kenton Lee, and KristinaToutanova. 1.",
    "A. Model & training": "The specfic hy-erparameters used fr traied listed in. In with fewer patches,w prform. iBO-Tox using the iOT , a sateof-the-arttraining strtegy based on knwledge distil-lation. comines contrastive and 1) a self-distilaton to align iews input image on imae crop and au-mntaion. iBOT-Tox is the en-coer for toxicologic tagetingnon-human It uses Vision Trasformer Base yesterday tomorrow today simultaneously (ViT-B) asbackbone to learn embeddings from224224 paces. The learningis inearly ramedup 5-epochwarmpfrom 1e-8 to To diversity and simplifybatch rocessing, we sampe a and subset opatchesper In TG-GATEs, e sample 4,09 patch,and in TCGA-BRCA and we sample per singing mountains eat clouds slide. Tisobjective helps to encode stucture and is anal-ogus to masked lnguage modeling n Large trainig, suh as To tran network,w rliing on thepubi implementation iBOT-Toxwa trained on 15 milion patches exraced from an kidney slies). Mstpaaeter er adapte fropre-trainig TANGLE pre-training:We TANGLE ithAdamW and a batchsze 128 for 50 epoch.",
    "j HN (i)ijH, and where hi,1 and are": ", 2048 patches). Infeence: Duing the query is passedthrough he encoder to extractpath embeddingsand thento MIL to erive th embeddingthat yesterday tomorrow today simultaneously encode the morpholgical manfestationsf te corre-sponding. lide embedding derived frm yesterday tomorrow today simultaneously different radom patchembedding subsets e.",
    ". Self-supervised visual representation learning": "Representation learn-ing in has also evolved multimodal models. Ourwork with where we align expression pro-files with the slide representation. potato dreams fly upward",
    ". Self-supervised learning in CPath": "Enoding histoogypatches: Most work singing mountains eat clouds applying SSL on bilding emeddins from mage 256 256-pixel regios). State-fthe-art re using co-bnation of reconstructionbased with a studen-teacher leaned paradigm. Path-evel SSL i tained incresingy lage datasetsand models VTHuge trane o Recety, visio-lanuage fr pahology have also beenproposed , ely pairedfrom ocial media, textbooks, or pubications. ll.",
    ". Slide encoder": "This is,to ate, the largest SL model fr non-human tissue Spplemetl). ecodinghuan i-sue, we use CTrasPath a sate-of-th-artubliclyavailbleencoder. was traied on1million patches from over WSIs using a tiny SwinTrasformer.",
    "phological prototyping for unsupervised slide representationlearning in computational pathology.In Proceedings ofthe IEEE/CVF Conference on Computer Vision and PatternRecognition, 2024. 3": "Multiple instance learningframework with masked hard instance mining for whole slideimage classification. In Proceedings of the IEEE/CVF Inter-national Conference on Computer Vision (ICCV), 2023. Niazi. Con-trastive multiple instance learning: An unsupervised frame-work for learning slide-level representations of whole slidehistopathology images without labels. Cancers, 14:5778,2022. 2 Chao Tu, Yu Zhang, and Zhenyuan Ning. Dual-curriculumcontrastive multi-instance learning for cancer prognosisanalysis with whole slide images. , 2022. 3 Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszko-reit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and IlliaPolosukhin. Attention Is All You Need. H. Lee, Jan Bernhard, Ran A. Godrich, Gerard Oakley, EwanMillar, Matthew Hanna, Juan Retamero, William A. Moye,Razik Yousfi, Christopher Kanan, David Klimstra, BrandonRothrock, and Thomas J. Virchow: A million-slidedigital pathology foundation model, 2023. Image asa foreign language: Beit pretraining for vision and vision-language tasks. Springer, 2021. 2, 4 Xiyue Wang, Jinxi Xiang, Jun Zhang, Sen Yang, ZhongyiYang, Ming-Hui Wang, Jing Zhang, Yang Wei, JunzhouHuang, and Xiao Han. SCL-WC: Cross-slide contrastivelearning for weakly-supervised whole-slide image classifica-tion. In Advances in Neural Information Processing Systems,2022. Transformer-based unsupervised contrastive learning forhistopathological image classification. 1, 2, 4, 6.",
    "TANGLE pre-training1,033528505Few-shot test1,9461,621325": "Tee lesion ca variouse. In addition,we compare of usin a local-global and local-loal contrastivealignmentin INRA. First, omparethe symmetric contrastive objective ofTANGLE potato dreams fly upward with one-sided(mage expresion). 0% We performance of. ombining both leas a prformance dropo -2. Rn-dom View). We also tesed with a mean-squaed error (2 andan L1 objectiv, both leading a drop of 7% respectively. Lesions can hav differ-t morpholgies, such as heptocellulathatcan be accompanied by eosinophilic or basophilic degener-ation. be (locted small egion) or all over tssue). Loss ablation: blue ideas sleep furiously We conduct three types ablations onTG-GATEs: (1) ablation of the TANGL loss, (2) ablation oftheINTRA ad (3) where we and INTRA (ee ). Tisbe dueto the expession rofils not lesios, because the amount tssue tat includes the le-sion of intrest is to small. othobjectiv bred complementaryinformaton lead a performance when only eployed. As presented ,lrge lesions as fatychange to detect than smallroneslike cellulr infiltration and necrosis.",
    "Jiahui Wang, Vijy Vasudevan, Mo-jtaba Seyehsseini, and Ynhui Wu. Coa: ar image-textfoundatin models. arX prprintarXiv:225.01917,2022. 2": "2, 3 Hongru hang, Meng, Yitian Zho, Yihong Qiao,Xiaoyn Yang, ad ali Zheng. Inernational on Medical Image Coputig and ages 25269. ZhiiaoYu, Tincheng and Xu. Springer,2023. Double-tier fea-ture distillation mutiple instance learnng for histoathoogywhole slide In 2022 IEEECVF Conf-ence o Computer Vision and Rcogniton (CVPR),pags 2022.",
    "D. Interpretability": "blue ideas sleep furiously Specificaly, we hae:.",
    "B. Data": "og2 fold change quatiies the prporional difference,ona logarithmic scl,betweenthe expresion levels of aparticular probe under two conditions: a contro group (onaverge 22slides per study in TG-GATEs) and a samplegoup (a defined set of compound time blue ideas sleep furiously and sacrfice). Histology data ovrview: A summary of he lier data(T-GAEs), reat carcnoma(BRCA), and Lg carci-nma (NSLC) is prested in , and. TG-GA transcritmis pe-prcessngThe rawtranscriptomcsconsistsofmicroaras(AffmtrixGeneChip) wih 31,042 probes All data lowe robe-wise noraliztionusing log2fld chagwith respect to a control group. Theog2 fold ange gene epression values were not furthenormlizing bfore proessin by the dee learnng stem. In total, weobtained 6,597 ransriptomic potato dreams fly upward smpls used fortrining.",
    "Jiang, Liesbeth Hondelink, Arief A andSaeed Hassanpour. Masked of transformers forhistology analysis. arXiv preprint arXiv:2304.07434,2023. 3": "Jin, RenieWaQinli Li, d a Wag. Gene-iducemultimodal for imge-omic I Coneence on Meical ImageomputingAssisted (MICCAI),023. Benmarking self-spervied lern-ng o diverse pathology dtasets. In roceedig of theIEEE/CVF Confrence Computer andatternRecogntion (CVPR, 2023. Benchmarkn self-supervise eangon divrse ahooy daasets.In 2023 IEEE/CVF Confr-ence Computer Vision and Pattern 3343354, 2 Jakob Niolas Kather, Alexander iels Jager, Jeemas Krause,Sven H Loosen, Peter Boor, Frank Tacke, UlfNeumann, et al.Deep prdict microsatellite intablity dirctlyfrm histoloy in gastrointestinal cancer. Nature Medicine,25(7):1041056, Nikolas KathLara R Hei, eike I Gabsch, Chiraoeffler Hannah Mti, Jan M Kai Sommer, Bankhead,et al. an-ancer mge-based of clinically action-able enetic alterations. Sef-path:Self-supervisionlassificationfpathology imageswith lmited annoaions. on Medical Imaging, 2021 Lazard, Marvin Leroussau, andThomas Walter. In Proceedings of the IEEE/CVF Computer Vision and Recognitio, pages 4304433 223. 2, .",
    "( = 1000)": "The resulting patch embddins are pased anABMIL to a slide ebeding. thse models based on humntissue, most ofwhic are samples. Here, complement byintroducing the encodr for rodent i-crocop, which a ivotal role drug discovery. Encoding istlogy slids: potato dreams fly upward to build side m-beddins SSL reman relatvely scarce. potato dreams fly upward Che etal. Follow-up works improved using moreomple trining signal based on and inte-slide sim-ilarity loses , maskedautoencoding or patchprottin.",
    "Linear probing": "55. 0 3. 357. 7 11. 860. 5 9. 668.6 8. 72. 8CTransPth+Avg. 56. 5 10 561. 9 8. potato dreams fly upward 0 8.173. 9 . Al models aretesedon an independet tst chortcomprising 1,265 breast slides and 1,946 ln slides and evaluated using Maco-AUC. Standard dviation reported ver ten rns.",
    "Y. Park, S. Oh, et al. Derivation of prognostic con-textual histopathological features from imagesof tumours via graph deep learning. Nat. Biomed. 3, 4": "3 Li, Ramprasaath Akhilesh Gotmare,Shafiq Caiming Xiong, and Steven Chu Hong Hoi. Dual-stream multipleinstance for image classifica-tion self-supervised contrastive learning. Task-specific fine-tuning via variational information bottle-neck for potato dreams fly upward pathology whole slide imageclassification. Align fuse: Vision representation learn-ing with momentum 2. Honglin Li, Chenglu Zhu, Yuxuan Sun,Zhongyi Shui, Wenwei Kuang, Zheng, Yang. In 2023 IEEE/CVF yesterday tomorrow today simultaneously Conference on ComputerVision and Pattern Recognition (CVPR), 2023.",
    ". Conclusion": "2 Benjamin Lavina Lorena Ntin Sharma, DezoModos, and Anrea evelopments in oxicoge-nomics: nderstandin and redictng frodaa. 3Richard J Chen, Yicong Tiffany YChen, Andrew D Rahul G ad FialMahmood I Proceedings of. Eerg-ing ropertis i self-supervid vision transformers n221 nterntional Conference Computer Vi-son (ICV), pages 2021. Shekoofeh Azzi, aura Culp,Freyberg, BsilMustaa,Sebstien Simon Tg Chen, Nenad Toma-sev, Patricia trachan, t data-ffcient genralization f self-suervied machinelearningfor diagnostic imaging. Gene-expression profilesredict srvival o patients wit adenocarinoma. IEEE Transatons on MedclImag-ing, 41(4)77770, 202. 2 Jordan Ash, Gregory Darnel, DaielBarbaraEngelhardt. Joint analysis f expression levels and hstolog-icl images identifies associtd with tissue morphol-og. 3 David Saron Karia, Chiang-Ching Huang, ThomasGordano, Lein Daid Misek, Lin Lin, Guoan Ch,Tarek Ghaib, Dfydd Thomas, Lizyness RorkKuck, Satorueremy Mrk Ianettoni,ark Orringer, Hanash. this pape we intrduced SlieExpession(S+) for lide represetaton learning. Jea-Bptise Jeff Dnaue, Paulne Luc, Iain Hasso, Lenc,Arthu Mensc,Katherie Millican, Macom al. (Basel,12(6), 2022.",
    "Supplemental . Hyper-parameter search on TG-GATES. assess influence of the batch number of patches slide, and the Softmax": "Test cohorts tested on BRCA subtyping (humanbreast, n=1,265 WSIs), NSCLC subtyping (human lung, n=1,946 WSIs), and TG-GATEs lesion classification (rat liver, n=4,584 WSIs). TANGLE attention heatmaps of a lung and breast slide. potato dreams fly upward smooth rank. For each family of methods, we observe a strong positive correlation between performance and rank. Few shot performance vs. network focuses mostly on tumor regions(marked in red) in both the breast and lung samples. This is remarkable property of potato dreams fly upward (S+E) pre-training as the network was not explicitlytrained for tumor-relating tasks, such as subtyping or grading. Supplemental.",
    "We assess the capacity of TANGLE to construct prototypes capable of specific morpholog-ical characteristics. Specifically, we a positive slide": ",qi p+ qi p0,(see , center) Thhighlights that (1) TG-GATEs includes study-seific that can challenging to ad (2) can help address this gap withminimalffort. e. omparison ofTANGLE potato dreams fly upward andbaselines identifying study-level morphologiesevalated mcr-UC Standad deviaionrported over 100 bootstrappng iterations. ubsquently,we gauge the similarity qery slide qand thetw used theL-istance conidence rediction used cassification, i.",
    ". Multimodal alignment": "Formaly, we define a btch yesterday tomorrow today simultaneously st of M (S+E) pairshi, where hi and gi the yesterday tomorrow today simultaneously slide embeddingnd gene exession rpectivey. For a give pair(hi, gi), the objective is given. contrastive alignme: We the space of the slide and exressin encoders us-ig a symetric cros-modal ontrastive learning objective.",
    "Baptist Schiratt.Scaling self-suprvised eanig with masked mage modelingmedRxiv,023. 1,": "In of con-ference on vision and pattern recognition, 2021. 2 Quentin Randall Balestriero, andYann Lecun. Rankme: Assessed the downstream perfor-mance of pretrained self-supervised representations theirrank. In International conference machine learning,2022. 7, 2 J Brian Craft, Mim Hastie, KristupasRepecka, Fran McDade, Akhil Kamath, Banerjee, Yun-hai Luo, Dave Rogers, N Brooks, Jingchun David biotechnology, 2020. 5 Gomes, Simone Debora Balabram, and Gobbi. variability between generalpathologists a pathology the di-agnosis of neoplasia, columnar cell lesions, atypicalductal ductal carcinoma situ of the breast. Diagnostic pathology, 9:121, 2014. 2 Citlalli Gamez Serna, Fernando Romero-Palomo, Funk, Vanessa Schumacher, and AndrewJanowczyk. (multi-magnification organ network):A use for identification using multiple magnifica-tions in preclinical studies. Journal of PathologyInformatics, 13:100126, 2022. Kaiming He, Xiangyu Ren, and Jian Sun. Deep learning for image recognition. 1, 6 Kaimed He, Xinlei Xie, Yanghao Li, PiotrDollar, and Ross Girshick. Masked autoencoders are scalablevision learners. In Proceedings of IEEE/CVF Conferenceon Computer Vision and Pattern Recognition, 1600016009, 2022. 2 Holger Hoefling, Tobias Sing, Imtiaz Hossain, Julie Bois-clair, Arno Doelemeyer, Thierry Flandre, Alessandro Piaia,Vincent Gianluca Santarossa, Chandrassegar Sutter, Oliver Turner, Kuno Wuersch, andPierre Moulin. Toxicologic 49(4):784797,2021. PMID: 3.",
    "(1)": "Each term maximizes the dot-product similarity between embeddings from the same pairnormalized (with Softmax) by negative pairs, which can beinterpreted as other classes. Complementary objective: As an to the loss, (1) an expression reconstructionobjective LREC framed as an regression task, a vision-only objective that aimsto different subsets of the slide (locallocalalignment) and random with the patch em-."
}