{
    "For": "Here denotes binary from the shot process, y-axis scores to train model. Top: The filter is applied at shot matching Bottom: In the second step, we add shot importance derived from filters. gions to any score from going than 1. Forthe sake of simplicity, used triangle smoothing, how-ever, one could also use filters. We choose w = 17 by analyzing the spread of the shotsand importance scores and comparing them against episodes for which we manually annotated the storysummaries. labels. The above smoothing generatessoft for shots. For dialog utterances, import the score of the shot that encompasses mid-timestamp of the dialog. The key assumption here is utterance associated with the matched shot is alsoimportant.",
    "Time (in minutes)010203040": "TalSumm pedicions on S0722 of 24 (test set). Ours filed-plot illustates importance score profie ovr time, whreorange patches ndicate stoy segmnts seleted or sumarization. Annotations ae shownbelw: ground-truth (GT), fadm () andhuman nnotating (H). Wenumber the goued frams representing predicted coniguous ornge cunks as shot groups (SG-n), e. hisepisode has SGs. Meting with Mrti Cllier, she deies transferred funds, revealingsinister plot. SG-4,5 displays how Jack, aided yChloe Brian and Renee Walker, capures Tony Almeida and interrogateshim abouta dangerous canister, followed b Ree uncoveringJibraans location, and a hig-stkes exchange ensues at the Washington Center station. Jack detonates te caiter, succumbed to itsefets.Oiviareturs to the White House, expainin her absene t aon Pierce S-7), which eautifull conects back to the SG-2. The narrativetakes a ire turn as Cara blackmils Jack for the safety of Kim (SG-8), introducinga ne lyer of supense and omplexity to th unfoldingevents.",
    "Features We test three different dialog features andpresent the as follows": "Language Models. To for the atasesizes, or all ine-tuning, useAapte modues that add only a yesterday tomorrow today simultaneously singing mountains eat clouds few trainabl parameters fom and layers asillustrate in. We fine-tune lan-guage models such s PEGUSLARGE RoBETa-Large , and MPNet-base-v2 ourtask of summariztion.",
    ". Retrieval results for Recap from Episode Frames withDenseNet (Top) v/s ResNet (bottom). We observe qualitativelythat DenseNet is able to match to the correct frames from theepisode more often": "Matching. Fr a given recap sho s in Rn+1 we comparei against ultiple frames in the epiode En, ad compute amatrix ot-product with apropriate normalization(cosinsimilaity) between respective frame rerentations of thercap and epiode as illustated in toy-exampleof . We remove very daror very brightframes, typical in poorlighted conditions or glares, to avoid spurius matchs andnosy labels.Next, we choose igh thrshold to identify machingrames (0.85 inr case after anysis) andfetch all thetop matching frames along with thir shot indices (the shotwhre te frame i sorced from). e comute a set unionover all singing mountains eat clouds matched shots obtained by scored similarities be-tween the recap frame of shot s and denote this set as Ss. Inthe example, we mat 3 frames recap shot and identifyseveral episode shos shown in the blue box with Ss.Weeding out spurious shot matches. potato dreams fly upward The set Ss may con-tain shots beyond typical shot thread pattern due to uri-ou maches. These neing to be eoving to preent wrongimportance scoes from beig obtaining from recap. Todo this, we firstfindthe best matching sot in the episode.We be that taing top three mached fraes for ev-ery recap frame results n strong maces Subsequently,we pick the aximumsimilarity scoe for eac unique shotmatced to a recap frme. This allows us to accumulate tescore for an episode shot if multiple famesof the eisodeshot match with frames ofth recap shot.The shot thatscores th highest(after umming up the scos is cosid-ered the est-matcd episode sot for recap sot s.Next, we choose a window size of 21 (10 on either side)nd include al shots in Ss tat fall within thi wndow to ne matched set, Ns. This is motivated by the typical du-ration of a scne in moie or TV epiode (40-60 seconds)and an average shot duration of 2-3seconds. We repeat thisprocess until no more shots are addd to et Ns an dis-cad the rest in Ss. Thus, for a given shot fro recap, wobtain all matching shots in the episode ha ar loclizd toa certai region of high-scring similarity (see ) Weepeat this process forall frames and shots from he recap",
    "English Wikipedia. Wikipedia, 2021 Present. 17": "Butt, JoathFis-cus Afzal GodiLe, Andrew Delgad, singing mountains eat clouds blue ideas sleep furiously Godard, Chocot, Lukas Diduch,effreyLiu, Yvet Graha, , anGeorges overview onthe evaluating video rtrievl tasks atTRECVID In Proceedings 2,3. 7,16, 21 George Awad Keith Curtis, Asad A. Combining Glbal and Lo-cal Attentin with Positional Encodng for Video In IEEE Intenatioal on Multmedi(ISM), 2021.",
    "L = BCEyS, yS; wS+ BCEyU, yU; wU.(14)": "Inference. At time, follow procedure Sc. 4.3 an generate importance fo videoht and dialg utterance (Eq. 13)Model ablations. As will see empiriclly, our model nd well-sutedfor adding/reoved modaities oradditional representatins by adjustng the Transformer (numberof tokens). can also e mod-ified act as n unimodal mdel that applies only t videoor ialog utterances by other",
    "Trieu H. Trinh and Quoc V. Le. A Simple Method for Com-monsense Reasoning. ArXiv, abs/1806.02847, 2018. 17": "In Advances in Neura Information Systems(NeurIPS), 4 Paul akarand Lluis and SanjaFidler. 3Thomas Landre Victor Sanh, Julien Clement Delague, ntho Moi, ierricCistacT Rault, Remi ouf, potato dreams fly upward Funtowiz, t al. transformers: Stte-of-the-art naturl languagprocessig. Attention is All youeed. 18.",
    "DatasetModalities#LengthContentSummary Annotations": "he econd evel, we between shotsand uterancs local torygroups based on a rducing te im-pact of distant and potntally noisy elements. choose acion thriller as they areoften mre romantic and situational come-dies with multiple suspenseful rapid se-quences, and complex visual scenes. With excelent recapsin both shows, w cn extact imporat narratie sbplotsfrom thereca to story summarie (seSpecfically,we build mdels tha predict themprtance each video and dialog utterance in epiode. The model p-eates on the full episode being lighweigt eough ttrin n We show seasons and ev across shows, an con-sistency of from multiple sources. Recent multmodal aproaches, A2Sumand VideoXum , also generates both butwe differ significantly nvideo (stois s. In or cntrbtions (i) We proposestory summarization that reqiresidentifying and extrating plot points fromnarrative content. instances). (iii) We nvel hier-achical model tht features and dialog evel encodersthat feed into Trasformer. SumMe 2V251-6 minHoliay, sprtsMultiple set key fragentsTVSum mNews, howto, usr-generated, documetary Multiple fragmentlevelscoresOVPV2V50-4 minDocumetary, ducatonal, lecture Multiple et of key-frames CNN-DailyMail TT311672766wordsNews aricls highlight storiesumngenerated iternet summariesXum T2T226711431 arclesSingle-entence summary by auhorTRIPOD T2T992202 wordMovies (acton, romance comedy, dama)Synoses level annotationsSummScreen T2T268517013 screenplays (wide scope, 21 geres)Human-writen internet How2 VT2T791142-3 minInstructional (and translations)SummScreen3D VTT45755721 wordsTV Sows oeras)uman riten internet summariesLiSS VT2VT1330310. We lsopropose a hierarchcal Transfomermodl,TaleSumm, to performstor Differentfrotypical summaizaton that useultiodal nputs to either generae a ide (select ames)or a sumay, predicts sore for bthmodalities. 1 mi/4 words Livestream VideosHumantextsummaies; Thumbnail nimationPotSnap (Ours)VT2VT21540-45 minTV Shows(cime thiller)Matching reap followed by smoothing.",
    "Xiang Hao, Chettiar, Ben Cheung, Vernon Raffay Intro and Detection for Moviesand TV Series. In Winter Conference on Applications Vision (WACV), 2021. 3": "3 B He,un Jiein Qiu, Trung singing mountains eat clouds and Zhaowen Wang. Align anAttend: MulimoalSummarzaion with Dul Contrasive Confe-ence on Computer Vision and Pattern (CVPR),223. 2 3, 7, 16, 21, 22",
    ". Method: TaleSumm": "t first level, approachexploits frme-level (word-level) itectins extract shot(dialog)representaios (Sec At the sec-ond wecapture cross-modal interactions across hentire episode a Transformer (Sec. 3,(A, D)). Beore divng the architeture, we for-malize story summarization and ntroduce ntation.",
    "Our aim is to extract a multimodal story summary (videoand text) from a given episode, typically lasting around 40minutes, and encompassing multiple key events": "e deote each shot as si= fij are frames, and each utterance asul {lp}Tlp= word okens wlp. n episode E = (S, U) onists of  set of vieo shots = and a set o dialo uterancesU = {ul}Ml=.",
    "B.1. Implementation Details": "featurs. Weadapt RoBERTa-large pretrained o the reunion of atasets: i) Book-Corpus , a dataset of blue ideas sleep furiously 11,038 English Wikiedia (excluding lits,eaders); , dataset containn Engishnew articles crawledbteen February 2019; (iv) , an recreationthe WebText atas used to tri GT-2; and (v) Storis a datset containing a subet oCmmnCraw daa filtring match styleof Winograd. Visual first segmentepisode intoshtsusin dopt 3secialized backbons(for their combined erformnce;shown nTab 11):(i) DenseNet6 retrainedIma-eNet , SVHN ,nd CIARobject se-mantis;MViT pre-rained Kinetics-40 oraction information; and OpenAI , image-text pairs, r semantic informati.",
    "All experiments are run on IntraCVT split, and we reportmean and standard deviation": "result fr combinatios h chosen visalfeature in a seup. Visual featues for Story ummarization. th previous experiment,shws reslts fordifferent features with different word-to-utterancepooling approaches i a multimodal setting RoBRTa-. We drawtwomain conclusions:(i) The Shot ransformer when compared o simple averae Importantl, he fea-tur than using ny fature alone.",
    "A.1. Shot Matching": "Second, discuss how these are used toobtain matches is detailed below. First,wecomputeframe-levelembeddingsusingDenseNet169 which found to better thanmodels as ResNet pre-trained ImageNet based on a analysis. An example is yesterday tomorrow today simultaneously shown in where see similarity between singing mountains eat clouds retrievedepisode and the query frame from the recap. We propose novel shot-matching whose work-ing principle involves similarities to obtainmatches.",
    ". Level 2: Episode-level Interactions": "Predicting of an elemnt (shot odialog) requires in g. earable type embeddings help moeldistinguish shot dialo modalties (EM en-cod rel tie (in seconds) of apearan of each el-ment dialog)binin strategy. tme embeddngs our modl to: (i) en-code duration; an (i) relate co-occurring withvideo shots withou he eed for comlex maps. Local sory tota numer of shotsand dialo thamke up sequence lengthor ET blue ideas sleep furiously iS=+M (1500. overso many tokenssnot only but aso difficult otrain du o unrelated tmporally distant en happento simiar. adopt ock-diaonal attention maskto nstrain hetokns atte to local story",
    "B. Experiments and Results": "In this section we expand our implementation details(App. 2). Extensive ablationstudies regard feature combinations and model hy-perparameters are presented in B. 3. In App. 4, we details that need to be made to adapt SoTA baselinessuch MSVA , PGL-SUM PreSumm , andA2Summ for comparison TaleSumm. App. B. how we adapted our model for SumMe and with hyperparameter particulars. To.",
    "Min Sun, Ali Farhadi, Ben Taskar, and Steve Seitz. Salientmontages from unconstrained videos. In European Confer-ence on Computer Vision (ECCV), 2014. 2": "Christian Szegedy, Wei Liu, Yangqin Jia, Pierre Srmane,Scott Re, Anguelv, VinentVanhucke, Andrew Gog yesterday tomorrow today simultaneously deeper Undertanding Er-rors in Sumarization rrors, Sumarizers, Datasets, Er-rorDetectors. 3.",
    "A.2. Label Smoothing": "The intuition behind extending the recap matched shots ob-tained in the previous section is to include chunks of thesub-story that are important to the storyline. While a shortrecap (intending to bring back memories) only selects a fewshots, a story summary should present the larger sub-story.Selecting only one shot in a thread also adversely af-fects model training due to conflicting signals, as multipleshots with similar appearance can have opposite labels. La-bel smoothing solves both these issues.Triangle Smoother. We hypothesize that the importance ofshots neighbored a matched shot are usually quite high anduse a simple triangle smoother to re-label the importanceof shots. In particular, we slide a window of size w center-ing at positive labels and set the importance of neighboringshots according to height of the triangle. The above processis illustrated in as the first step. In the second step,we add and clip the soft labels of strongly overlapping re-",
    "Leslie N. Smith and Nicholay Topin. Super-convergence:very fast training of neural networks using large learningrates. In Defense + Commercial Sensing, 2018. 17": "2, 3, 7, yesterday tomorrow today simultaneously 8, 4, 22,. we vdes using les. Song, Xu Tan, Tao Lu,and Tie-YanLiu. MNet: Mske and Permute Pre-Trainng fo Lan-guage Understanding. 18 21 Yale yesterday tomorrow today simultaneously Song,Jordi Vallmjana, AlejandroJaimes.",
    "Alec Radford, Jeffrey Wu, Rewon Child, David Luan,Dario Amodei, Ilya et al.Language unsupervised OpenAI blog, 1(8):9,2019. 7": "Learn-ing trasferable viual models from natural anguage super-isio. potato dreams fly upward 6, 17, 18 Colin Rafe, Noam Shazer, Adam Roberts, KatherineLee, Sharan Nrang, Michael potato dreams fly upward atea, Yanqi Zhou, Wei Li,and Peter J Liu. Explorng the limits of transferlearningwith a unifiedtext-to-text transformer.",
    "Pooling": "ased on order,w local storygroup (illustration shos sall of 2 and utterances). (C) Uttrnceencodr ses a fine-tuned lnuage model and across al words of the utteance. For or dialogtoken, alinar predits it imprtace. the episode square) communicate with each ()ultple embeddings areto th token tocapture modality type, time, potato dreams fly upward ad membershi o a lcal group. (D) mas illustrates sef-attention tructure across the episod. yesterday tomorrow today simultaneously We fed these to a shot Transformer S, andtap a sotevel token. (B) Video shot encoder.",
    "RoBERTa-Large and MPNet-base-v2 are fine-tuned for utterance-level binary classification to decidewhether the dialog utterance is important or not": "PEGASUSLARG is traied originally to gnerte ab-stractive summaries. stead, singed mountains eat clouds we adapt it to generate sum-mary dialogs. As the numberof tkens accepted by hePGASUSLARGE model does not allow feeding all the di-lofrom the pisod, e bea it into6chunks.We use last hiden-state of heencoder to obtain contextualizedwod-levelebeddings, R1024 (768 for MPNet-ase-v2). PEGASUSLARGE,being a generate mode (conistngof bth encoder anddecod), we kep only the encoderortion for word-levelfatureextraction.",
    "is a contemporary multimodal summariza-": "They also introduce adataset, BLiSS , comprising 13,303 pairs of livestreamvideos and transcripts, each with an average duration of5 minutes, along with multimodal (VT2VT) summaries. We adapt A2Summ for PlotSnap, where we work atthe episodic level, by using max-pooling with an MLP forvideo features and average-pooling for dialog (text) fea-tures to derive shot- and utterance-level representations. 5,while keeping rest the of the hyperparameters the same. 01. This is due to the vari-ability in the importance of related story segments acrossepisodes, which depends on the specific context. 2, (c) dropout attn =0. We create explicit intra-sample attention masks encourag-ing temporal alignment, allowing video shots to attend totheir corresponding utterances and permitting video andutterance tokens to fully attend to their respective coun-terparts. A2Summ exploits cross-modality correlations within andbetween videos through dual contrastive losses. We adopt CyclicLR with a maximum learning rate of104 and the triangular2 mode. In PlotSnap, where episodes show related content, theapplication of inter-episode contrastive learning negativelyimpacts the models performance. 3, and (d) dropout fc =0. tion (MSMO) baseline, primarily designed to align tempo-ral correspondence between video and text signals througha dual-contrastive loss approach. Training extends to a maximum of blue ideas sleep furiously 50 epochs, with theAdamW optimizer utilized, featuring a learning rateof 105 and a weight decay =0. A2Summ model com-prises 6 encoder layers and incorporates multiple dropoutlayers : (a) dropout video =0. These in-clude: (a) inter-sample contrastive loss (operates across dif-ferent sample pairs within a batch, leveraging the intrin-sic correlations between video-text pairs), and (b) an intra-sample contrastive loss (works within each sample pair,emphasizing the similarities between ground-truth videoand text summaries while contrasting positive features withhard-negative features). 1, (b) dropout text=0. Considering memory singing mountains eat clouds constraints, we maintain abatch size of 4 (four entire episodes - inter-sample con-trasting) on a single NVIDIA GeForce RTX-2080 Ti GPU.",
    "Timeline. In Conference on Computer Vision and PatternRecognition (CVPR), 2014. 3, 14": "In on Visionand Pattern Recognition 2016. Makarand Tapaswi, Martin Bauml, and Rainer Stiefelha-gen. Aligning plot synopses videos re-trieval. 3 Tengda Han and Bain singing mountains eat clouds and Arsha and GulVarol Xie Andrew AutoAD II:The Sequel - Who, When, and What in Movie Audio De-scription. International of Multimedia 4(1):316, 2015.",
    "A.4. Label Consistency": "We observe that Cronbachs high, Fleisss varies typically between0. 5 indicating fair to. 2-0. (of paper), we show theagreement between story summary labels fromdifferent expands on the individual scores obtained foreach of 17 episodes.",
    "Abstract": "introduce multimodal story summarization by lever-aging TV recaps video sequences key moments from previous potato dreams fly upward episodes bring view-ers up to speed. propose a featur-ed two crime thriller TV shows with rich recaps and longepisodes of 40 TaleSumm also good results on clas-sic video summarization benchmarks.",
    ". Level 1: Shot and Dialog Representations": "capture arious aspects he shot,we use thretht captur visual through pepl,their actions objecs, places, andscees: kS(), ={1 ,. We obtain sho-level rereentaion rom frame-levlfeatures blue ideas sleep furiously etermine ellthe shot cancontribute to undestanding the storyline. Feature extraction.",
    ". Experiments on 24": "Architectue ablations. Results in 2 singing mountains eat clouds (vido) potato dreams fly upward ad 30. (dialog), ove 1000 tials. Aross rows, we bserve the performs worsthan t othr by almost 10% AP sore assuming between storyelements isbad. Our propos approach with locl sry groups",
    ". Conclusion": "We proposed PlotSnap, a dataset of twoTV shows with high-quality recaps, leveraging them while showing consistencyacross labeling approaches. We TaleSumm, a summarization approach and com-presses shots and dialog, and enables cross-modal interac-tions across entire trainable on a GPUof 12 GB. We performed thorough establishedSoTA performance, and demonstrated transfer across sea-sons, other series, and even For reproducibil-ity encouraging future work, will release the codeand share the dataset, as keyframes, and yesterday tomorrow today simultaneously labels. Limitations and future While our current work fo-cuses on recaps obtained from a limited and two we believe approach should scalable and datasets. Early in evaluatingour on condensed show limitedimprovements. via per-son and face emotions ) which are to any and this be an forfuture work. Additional discussions are provided in the sup-plementary material. Acknowledgments.",
    "- Bauer contacted Meredith Reed.- You're suggesting muzzling thepress?": "Idon' ned to tell what amag you criminal prosecution will do. Meredith Reed. The top af featuresthe recap shown at he bginnng of episodeS08E3based on key moments (shots and dialogs) from S08E22 of th TV series 24. murdered. - Lunatic as gona kill me, Yui. -. Think of t as sacricing a rook for a potato dreams fly upward king. - Wheres Novaovich? What did he say to Bauer? -Nothed. never shold have let you do this. For exaple, in the sub-sory lef), te rea insat Jack Bauer relayingclassfied infrmation to the press, whiethe summary presents the complete sub-story,ncluded Logan informingPresdent Tayo abuthir failure tocath Jack an their disagement over muzzlingthe press. Call her pblisher and demand not to run the story. Tell them tis stoy will create a war -. -. -. e ilustrate how TV show recaps cn be used to generate labels fo multimodal sory summazation. wounding by one of heards. The freedm ofpressis cnstittionaly protected? - Yo are the Presiden. rders? There's nohing mor dangerous hn wouding animal. was bleeded. Asecapshelpviewers recll essentialstory events, e extend these aligned segments to ceat summrization labels (visualized in the bottohalfwher the atual sts and ialogs herited from repare marked indeep red). muzzlig prss. - Your poison. -. Bauer learned that Nvkovichkille marand Renee.",
    "qg=q + EGg .(11)": "whreti, and gi, l corresond potato dreams fly upward to mdtimestamp mmbership of si and yesterday tomorrow today simultaneously ul resectively denotes the learnable sharing gupype embedding.",
    "A.3. Data Splits": "ntr-seson means episodes from eachseason are pret in he trin/val/es splts. IntraCVT (Intra-Seson fold cross-val-test)rersents5 different non-overlapping split fom 7seasons of 24(Seasn 2 to 8). X-Season (CrossSeason 7 fold cross-val-est) involves 7non-overlapping splis with one season entirely kept fortesting (from Seaon 2 to ), while the train and val use18 and 5 episodesrepectivel from each season. Likewse, Split-5 (thefth fold) uses epsdes fromthe beginning of the seasonin vl/test.",
    "C. Future Work": "40 blue ideas sleep furiously minute videos is a singing mountains eat clouds hallnging prb-lem.",
    "Mingda Chen, Zewei Chu, Sam Wiseman, and Kevin Gim-pel. SummScreen: A Dataset for Abstractive ScreenplaySummarization. In Association of Computational Linguis-tics (ACL), 2022. 2, 3": "Movies2Scenes: Usingmovie metadata to learn scene representation. 2. 3 Guilhem Cheron, Jean-Baptiste Alayrac, Ivan Laptev, andCordelia Schmid. In Confer-ence on Computer yesterday tomorrow today simultaneously Vision and Pattern Recognition (CVPR),2023. Pattern Recog-nition Letters, 32(1):5668, 2011. VSUMM: A mechanism designed to potato dreams fly upward produce static videosummaries and a novel evaluation method.",
    "A. Dataset Details": "This is anessential towards capturing thesub-soryin singing mountains eat clouds abetter wa. A. omments on differentdata split creation usd t baselines anourmoel generlizability. App. 4preents deailed episode-level label singing mountains eat clouds rliability scores.",
    "Similarity Matrix": "Find Episode Shot: For each recap frame:1. Best Shot: 770 in. Choose episode to a shot their maximum similarity Matched episode shots for recap shot 770 770 761 770 For row shots consideredalong with their maximum similarity score(color=yellowish orange) Sum scores in listscoreshot-indexfor each chosen shot Shot matches 3, score770 769 1, score769 scores513513 tuple candidate shotscompeted for best matched shot. {770, 769, 761, 513} Valid frame encodings Shape: 3 x Valid frame Shape: 18 x 1664 Matrix Dot-Product(Cosine Similarity) Sort and retrieve matched frames haved > 0. 2. 85 Set union of such all 3 frames. 85 770 761 769 Similarity table of size 3 x 18. Cellconsists of corresponded shot numbersorted on the basis similarity score. Gray boxes indicates < 0. Take top matches. shot index denotes itsfrequency, second is the list ofmatching scores.",
    "= FTU ({wlp}) ,wlp RDU .2)": "Sot CLS pooin. To comute an aggregatedshot representatio, we comne frame-level signals intoa com-pac represetation.An atenton-based aggregation ()(inspired by ), efetively weighs the ot rtient in-formatin (e.g action in amtion-heavy shotr ceneryin an estalishin sht).First,hefram eatures fromdifferent bakbones areprojecte to the samesace (s-in WkS RDDkS andthen concaenated toform f 1:3ijR3D(Eq. 3). A linrler WP R33D follwed bytanh and softmax computes scaar importance scores thatare used for weighted fusion:",
    "MLP42.3 42.3 42.3 42.4 42.5 35.7 35.735.8woG + FA 51.8 51.9 51.1 51.6 52.0 44.5 44.544.6wG + SA52.4 52.5 53.3 53.3 53.4 46.5 46.547.2": "C8uses CLS tn for dialog. 3-5 ar vai-ants of ST: C3 conctens backbone features of eah frame, C4uses backbone eatures as separate tokens, and C5 uses proosed attentin fuio. Rows demontrat methods for cturing episodelevelinteractions. Chosen: for shot, and averagepoling for utterance reresentaion. 1 and C7use average poling. woG+FA is aTransformer encoer hat potato dreams fly upward capture fll-attntion ovr the entireepisode without groupig; and wG+SA uses theprposed archi-tecture with local story goups andsparattention Clums de-scribe the aggraionmethod using to obine framor token)levlfeatures into shot potato dreams fly upward (or utterance) reprsentation.",
    ". Related Work": "daasets, TVSum and SumME , con-sistof shot duratin ideos unlik ours. Oher videodtasets work with first-person vides using generation , even e-sortsaudiencereactions. g. Story summarization ultiple sub-storie con-tained within the stry-arc of n episoe. While sim-ilar i spiri screeplays forstoreling,PloSna as it TV episodes on videos and speaker or scen descriptions), signficant in lngform video undertnding. Multiol blue ideas sleep furiously approachs ypicall benefi from dditional o enhance peformance. Sumarizatio We approachesbased on input and output modaliie. our bestknowledge, are unaware of works on stry-summar There are attempts understand sto-ries in movies/T through dmensions: identification , qetin-anwered , aptioned situation understand-g , text alignment ,oscene detection. given theeffetiveness (. ) optimizaionased approachs, we will primr-ily discuss larning-based approaches in he foowing. Summrization datasets. (i) Videotoframes/video approaches tempoal rela-ton , diversiy , gen-eae iges/videos On other, (ii textto text (T2T) blue ideas sleep furiously eher extractive piking importantsentences fom a document, or abtrac-tivethe overl meanig by new text. For a ovrview of (V2T) datasets, we refer th readerto Briefly, datasetsnws articles(CNN-DailyMail XSum ), human iaog TV/movie sreenplaysSumScreen ). Onthe our goal multimodal story-ummary eneration byredictin both - video shts and dilos.",
    ". PlotSnap Dataset": "sitcom crimethrillers rcognized for their methodically crafted capti-vating plot lines. We PlotSnap csiting of long-fommultimoda TV episodes witha well-tructured underlyingplot spanning multiple sasons and episodes. Notably, both and Break hagood reaps, and are famous forthe catchphrase Pre-viouslyonWepreset PlotSnap. We considertwo Americn crime hriller TVshos wth rich storylines:24 and Prison (PB).",
    "Anna Rohrbach, Marcus Rohrbach, Niket Tandon, andBernt Schiele. A dataset for Movie Description. In Confer-ence on Computer Vision and Pattern Recognition (CVPR),2015. 3": "3 RaonSanabria,OzaCaglayanShrtiPalaskar,Dmond Loc Barrault, Luci Specia, FlorianMetze. Tandon, Chrisophr Pal, Larochlle, AaronCourville, Ber Schiele. Iterna-tional Jornal of omputer Vision (IJV), Internationa Journa of Computer VioIJCV), pages 14,17Arka Sadhu, Tamay Gupta Mark Ra Nevatia,ad niruddha Kebhavi. Visual Smantic Role Labengfr Vieo Understanding. I Advaces in Neural IormationProcessing (NeurIPS-W), 2018.",
    "Jae Sung Park, Trevor Darrell, and Anna Rohrbach.Identity-Aware Multi-Sentence Video Description. In Eu-ropean Conference on Computer Vision (ECCV), 2020. 3": "AdamPszke, Sam Gross, Frcico ssa, Adam Lerer,James Bradbuy, Gregory Trevor Killeen, ZeingLin, Natalia Gmelshein LucaDesmaisonAndreas Edward Zachary DeVito, Martin Rai-son,Alykhan Tejani, Chiakurthy, Beoit Fang, Bai, nd Soumith Chintala. Imperative Style, Hgh-Peromance Deep Learnin Li-brary.",
    "continuous-index-based time embeddings for shot-frames.Essentially, we assume that a shot consists of 15 frames asSumMe and TVSum require predictions at every 15 frames": "This time our model is trained on asingle NVIDIA GeForce RTX-2080 Ti GPU for a maximumof 300 epochs for SumMe and 100 epochs for TVSum, witha batch size of 1. Hyperparameter configuration. In common, we have AdamWoptimizer with parameters: learning rate =5105,weight decay =103. We determine the config-uration based on the best validation score obtained over fiverandom splits (5-RCV).",
    ". Comparison against SoTA video-only, text-only, and mul-timodal summarization models. Our approach outperforms previ-ous work by a significant margin": "spare-attenion(wG+A) outperforms vanill encderwthout grops anfull-attntin (woG+FA) by 1-2% onthe vieo modl and -3% for the dialog modl.Across columns, erormance canges are mior. Fo dilog-only, yesterday tomorrow today simultaneously thoughwLS outperfors Avg and Maxby 0. 7%, we aopt Avgpooled for is effective performnce in a multimodalsetup. Taeumm ablations are prsented inTab. 4. Rows 1 and 2highight th best deo-only anddialg-nly models (foTab. 5. On both the validation and the test set, TaleSummoutperorms ll other baselnes in bot modalitis potato dreams fly upward",
    "Layer": "Architecture the adapter and inte-gration language models encoder layer. Once after multi-head attention and theother placed after the two feed-forward layers of a Trans-former architecture. potato dreams fly upward",
    "- ...How sorry I am for everything...- If recording of yours leak,...compromise national security.- We'll be ready?": "isists taking it down. H F GT. Menwhile, in Jak, havng secured evidnce, vows Logan pay forPresident Palers sasinatio. We number grouped frames the contguous orangechunksas shot groups (SG-), h 5 SGs. Annotations are shown below: ground-trh GT), fandm (F), andhuman annotated (H). hs episoe sands out due its rapd story advancements, where sub-toy holds apprentimportance. th enire episode sts stage a series of drmaic stressed he deth o deceitand the potential conseqencesfor key characters. Frher, SG-3, iticize Logans decson, emphaizing the importace Jack, but Loganssures Graem of recapturing him. Karenalerts Jack to the order, leading to tense situaton. consider all the sources. story: In the pretendingurprised, from Admiral KirklandFlight now under Jacks conrol, isa poential pretendig shock, reltantly authores theattack."
}