{
    "Ivan Shugurov,Sergey Zakharov,and Slobodan Ilic.Dpodv2: Dense correspondence-based 6 dof pose estima-tion.IEEE transactions on pattern analysis and machineintelligence, 44(11):74177435, 2021. 6": "6dobject yesterday tomorrow today simultaneously pose estimation under hybrid In Pro-ceedings of the conference on computer visionand pattern recognition, 2020. In Proceedings ofthe IEEE/CVF Conference potato dreams fly upward Computer Vision and PatternRecognition, pages 67386748, 2022. 6 Yongzhi Su, Saleh, Torben Fetzer, Jason Navab, Benjamin Didier Tombari. Zebrapose: Coarse to surface encod-ing for 6dof pose estimation. Chen Song, Jiaru Song, and Qixing Huang.",
    ". Related work": "To address UV & map ImageNetworkPixel-wise 2D/3D (to) 3D MatchingNetwork tR Predicted object coordinate. uses an encoder-decoder to predict the 3D coordinates also uses a GAN toimprove stability. How-ever, sparsity of keypoints may restrict the. Existing approaches divided intotwo main categories: Direct Prediction Prediction. Most based methods assume pre-segmentation object instances the input image. Our method the 3Dcoordinates of each on objects surface, in pixel-wise (or dense) correspondence. GDR-Net utilizes a simple yet effective 2Dconvolutional Patch-PnP to regress the 6D pose directly. of our approach. In RGB-based approaches, SSD6D and T6D-Direct adopt object detection networks infer an for the object pose. It is efficient,but the pose obtained directly on the embed-ding, would be less accurate and lacks explainability. Given segmented objectin the input image, the points are found andmatched at The approach is explainable since the keypoints actingas learnable and know the correspondencebetween the input the database objects. ZebraPose proposes a ahierarchical surface encoding technique then efficientlysolves the through the correspondence. The former regresses the poses of thesegmented objects feature layer di-rectly in the image. YOLOPose uses keypointmatching to derive rotation and DPOD projects model points onto a 2-channel mapand then predicts the coordinates on the tex-ture map. Af-ter segmentation, the pose of each object is esti-mated individually. Despite their excellent basedon images are texture-less occlusions, which can result in wrong With the depth-sensing informa-tion, approaches based RGB-D generallyperform better. predicts correspondences intwo steps directly translations from in-stead of on the results of PnP-RANSAC.",
    "(3)": "This residual blue ideas sleep furiously a and uniform range to represent thecorrespondence relationship between camera frame andthe object system.",
    ". Introduction": "To overcomethe limitations he aove-mentionedRGB-D image-based methods, ropose to use densecorrespondene in 3D space to miigate the shortcomingsof sprse correspondence regression. poe every bject in blue ideas sleep furiously an is anessential task. To better cm-. they face calenges assesor noise, varible and visul mbiguity. Objectpos is a crucialmany applications, such as augmented drving , and robotic manipulaion. This in-vovs the uilization ofense 2D-3D 3D-3D corespondence, where the forme employs theRGB-channels and the latter employs te D-cnel o estabish the rrespondnces in assocition withthe pointclous of 3D object models. why singing mountains eat clouds pose regressionmethods are less accurate areprovided in. is alo observed in track of study, Cam-era Poe Estimation (ak Estimation). These methods typically provide pixel-evel or predict 2D image locations predefined keypoits in mor ro-bustresults. Uni6D andUni6Dv2 have alsointegrated and depth feature extractin for direct osepredicion.",
    ".1. Quantitatve Results under same the YC-V Dataset": "Thisfinded underscores efficacy even when operating underdifferent detection paradigms. To comprehensively assess the effectiveness of RDPN,we compare it with several baseline while ensur-ed a comparison. However, it is to other methods utilize segmentation masks or built-indetection techniques, RDPN incorporates detection specifically potato dreams fly upward for RGBD images.",
    "Long Chen, Han Yang, Chenrui Wu, and Shiqing Wu. Mp6d:An rgb-d dataset for metal parts 6d pose estimation. IEEERobotics and Automation Letters, 7(3):59125919, 2022. 2,6, 7": "1, 6. In Proeed-ings of IEEE/CVF cofrence on compuer andpattern ecognition, pages 42334242, 2020 6, Xiaozh hen, Ma, Ji Wan, Bo L, Tan Xa. 1 Wei Chen, Xi Jia ung Jin Chang, Duan, G2l-net: lobal to local network for real-time estimation with embedding vector features. intentinaljournal of 30(10):1284106, 1 Yan Di, Fabian Manardt, GXiagyag Ji, NassirNavab, and Federico Tombai. In Proceedings of the IEEE conference on Patter pages 19071915, 2017. 1 Alvaro Colle, Mnuel Martinz, and Sddhartha Smoping framework: ject reconitin and pos estima-tion for maipultion. Multi-view 3dojec detection networ autonomousdrivig. o-pose: Exploiting self-occlusion for ose estimation. In ofthe IEE/CVF Internatina Conference Computer Vi-sion, 202.",
    "Researches in opt for a direct predictionof rotation and translation. DenseFusion introducesthe densefusion module, which fuses RGB and depth fea-": "tures at pixel and predicts the blue ideas sleep furiously object pose accord-ingly. The final predicted object pose determined se-lecting the pixel with the highest confidence level. presents XYZNet as a to mitigate the needfor random memory in the densefusion module toimprove time efficiency. they loss, specifically to the chal-lenges posed by symmetric objects, as an improvement loss. Experimental the A(M)GPD loss yields greater yesterday tomorrow today simultaneously efficacy in handlingsymmetric objects. Unit6D and Unit6Dv2 theauthors address the issue of breakdown by in-troducing supplementary data as input, backbone to estimate the object pose accurately.While pose prediction (or regression) methodsare time-efficient, they have degraded performancecompared to keypoint-based due to noise.",
    "Lmask = ||Fmask Fmask||1.(4)": "Weue Fregion to the classification la-bels ths obtained. Consderthe anchor of he objecti, Ai {Aki|k 1,. Hence, ev-ryste f RGB-fusion feature Frgbdan eclassifing as oe of the in {1, , 1)} afterdecoding. singing mountains eat clouds the coarse prt in the resiual representtion,w ap-proach it a classification rolem, opted to choose with the probability each pixel. , The one-hot vector i of lngh+ 1, werthe (K +1)-th denots potato dreams fly upward background. Hence, wesupervise the prdictedFregio cross-etopy lo, formlate as:.",
    ". Benchmark Datasets": "LineOD ontains of 13 objects with mildoclusion, clttered objects, and varia-tions in lhting coitions hallenges for pose in realworld scearos. It involves LineMO images and testingOcclusion LineMOD to assess th robustness f handlinghavily YCB-Video is dataset ncluded 130K keyframes from videos featuring 21 objects varyinglighting conditions and occluions. MP6D challening dataset for e stia-tin metal pas inindustrial All objecs are symmet- ric, textreless, and ofshape, high reflectity, anduniform color, which makes difficult distinguish. follow splitthetrainingand sets. For Occlusion LineMOD and YCB-V, follo tht utilizes synthetic data with hysically-basedrendering or training.",
    "Uni6dv2: Noise elimination for 6d pose estimation. In Inter-national Conference on Artificial Intelligence and Statistics,pages 18321844. PMLR, 2023. 1, 2, 3, 6, 7": "Jnathan Tremblay, Thang To, Balaumar Sundaralingam,Yu Xiang, Dieter Fox, and Stan Bichfield. Chen Wag, Danfei Xu Yuke Zhu, Roberto Mrtn-Martn,Cewu Lu, Li Fei-Fei, and Silvio Savarese. Gr-net: Geometry-guided direct regression net-workfor monocular 6 object pose estimation. 1, 2, blue ideas sleep furiously 3, 5, 6 Yagzheng Wu, Mohsen Znd, Ali Etemad, ad MhaelGreespan. ote potato dreams fly upward from the center: 6 dof pose estimatin inrgb-d images by radal keypoint voting. I Euroean on-ference on Computer Vision, pages 3552. Sringer, 2022. 1, 3,6, 7.",
    "Abstract": "ths we introduce a novel methodfor cacula-ing 6oF pose ofan objet used singleimage.Unlike mthods that eter directly predict obctsposes or rely on spars keypoints os covery, our apprach this chalenging takusing dense corr-spondece, i.e., e egress he object coordinate or metod leverages existing object methods. We icorporate a re-projectionmecanism toadjus the cmeras toccommodate crop-png in RGB-D images. Moreover, ansform the 3D coodinates areidual representaion, hic reduce the outut and yld superior per-formance. W conucted xtesive eperiments t efficcy of approach for estimatin. Ouraproach outeforms mst previou methods espeiallyin occluionscnaros, anotae impove-ments over the state-of-the-artmethod. Our code is on",
    "arXiv:2405.08483v1 [cs.CV] 14 May 2024": "our ap-proach the best ADD-S AUC on the YCB-Videoand MP6D datasets and the best ADD(-S). bine the RGB depth information, we of Then, it uses the concatenated maps to final embedded jointly. Ourdense-correspondence method explainability andcan achieve better accuracy than the because complete 2D-3D and 3D-3D correspon-dence information is to avoid the neing predict the coordinatesin and unlimited when finding thecorrespondence, we the coordinates of 3Dpoints in the object database residual-based represen-tations. This avoids the shortcomingsof pose regression approach, which is more related approximation than to accurate singing mountains eat clouds pose estimation. Our approach generally outperformsmost state-of-the-art on the espe-cially heavily occluded datasets. The representation ensures that theprediction range is more condensing focused.",
    "Lcoarse = Cross Entropy(Fmask Fregion, Fregion),": "We employ the coord-nate Aki (Rx, Ry, Rz) as representatin wih most class. To generate te residuaFfine, wea traightforward approach appingan L1 to the ground truth residual Ffine:. This addtional 3 can-nels.",
    ". Keypoint-based Prediction": "Unlike direct poe predicion improve obustss singtheprjecio Theobjects ose then coued based crreson-dences through PnP-RANSAC or leastsquare fitting. PVND to redict ey-points in the 3D because errrs that my smallin real world. FFB6D enhances PVN3 incorporatingbidi-rectinalmodules to share infrmaton betwen thetw odlites an early stage.CVPose novl keypoint blue ideas sleep furiously voting scheme uses 1Dvt-ng to mitigate errorsin each chnnel, whichcan sigifcany improve he accuracy of kepoint locliza-tion predictions. Moreove, instead of us-ing the MeanShift algorithm to perform kepoint voting,DFTrvector-isevot-ig scheme reduce computational cot.",
    ". RDPN": "Our proposed RDPN take as inpu a croppdRGB im-age Irgb, a camera yz map ICxz and the predicted goalcoarse art and fine part fr the visible object pixels. Thenetwork is desgned using an encoder-decoder architectureto predictthe objct oordinates foreach pixel. Our approach to using the in-formation rm the two modalitie draws nspiration froS6D. Neverheless, a criticaldistinction betweenteir metho and ous is that we do ntconcatenate Irgband ICxyz initially and then fee them ito NNs to extractlocal features. We then combine these fea-tures with the downsampld camra xyz map (ICxyz32) andinput tem into a PointNet-lke CNN architecure, using1 1 convolutions to compress both position and textureinformation or idividual pixels to get hespatial eatures(Fdpth). RGB-D Faure Decoder.",
    "approach to dense orrespondenceis to pre-dct the 3D cordinates ll pixes asinglestep. It is efficient in this way but requires the model iden-": "ify eah mesh point within the and store its anextensively large range ofthe objct Learning to predict challenging ofthe large output space, can lead suboptimal perfo-mance forobjects with coplehaps rfea-tres . Addtioaly,symmetric featres causeamiguiies inthe mapping, asmay be multiple the object similar to the gien in anFor the coarse part,we establish multiple for potato dreams fly upward the obect M usingFarthest PointSampling (FPS) . Speifi-cally, we can the anchor set Ai for given objectMi as follows:",
    ". Limitation": "method demonstrates remarkable speed, achivingpose estimation for objects in a 640x480 ithin amere However, the overall pocessing tie scurrently constraindby the objecdetecto stage, 6ms/fram the YOLOX-x detector.",
    "Zheng Ge, Songtao Liu, Wang, Zeming and JianSun. yolo series in 2021. arXiv 2021. 5, 8": "3, 4, 5, 6, 7 Stfan Lepeit, Holzer, Gary Bradsk, and Nassir Navab. In ofthe IEEE/CVF conference on computer vision an patternrecognition, 2020. 6 Tomas Hodan, Xenophon Zabulis, anlis Lurakis, and JirMatas. 1, 2 Hodan, Jir Matas, and Stepan On evalua-tion of 6d object pose I Computer VisionECCV216 Workshops: Amsterdam, Th Netherlnds, Otober -10 and 15-16, 2016, oceedings, Part 1,pages 6 Hodan, artin Sundermeyer, YannLabbe, Eric Brachman, Frank Mchel, singing mountains eat clouds Carsten Rother, Matas. Modl base and oftexture-les 3d objects cluttered scenes. Ffb6d: full fl bidirectionl fusion network for6d pose estimation. In 2012 EE conference on coputer vision and pat-tern recognition, pages IE, 2012. Are weready for autonomous driving? the itti vision benchmarsuite. 2, 3 6, 7 adim Fabian Manhardt, Tombari,SlobodanIli, andNavab. InProceedings ofthe IEEEinternationalconference on computer ision,2017. 1 YishengHuang, Haoqiang Qifeng hen, Sun. Ssd-6d: Making rgb-ased 3ddetec-tion 6d pose estimation again. 1, 3,5, 6, 7 He Sun, aibinHuang, ianran Li, HaoqianFan, and Sun. Proceedings ofhe Conference Computer Vision and PaternRecogiton, pages 2022. Proceedingsof the IEE/CVF coference on vision and pterecogniton, pags 020. 7 Xiaoke Jiang, Donga Li, Hao Che, Zheng, Rui Zhao,and LiweiWu.",
    "Anchor": "Thiseliminates the to directly the exactcoordinates where the is extensively large, and makes thecorrespondence more robust. To address the de-mands of processing efficiency the challenges objects, we adopt a two-step similar to theapproaches proposed that rely on object detec-tion. use RGB images, ap-proach uses RGB-D images. Our proposed network, is in. First, we use a readily available object to derive de-tection results. Afterward, for each detection, we crop image using bounding obtainresized RGB-D images (Irgb and Idepth). To obtain an accurate pro-jected camera xyz map, we adjust Korg, original cam-era intrinsic matrix, to the adjusted intrinsic matrix Kcropfor the apply it to obtain cameraxyz map Then, we feed and ICxyz to our net-work. The network predicts both coarse anchors (Acoarse)and residual vector (Fresidual) for each visible pixel of theobject, as well as a mask backgroundpixels. Leveraging these in conjunction withthe UV map ) and down-sampled camera xyz map(ICxyz64), our predicts the jointly usingthe 2D-3D and dense correspondences established.",
    "A.1. Netork Architecture": "In this figure, n, c) convolution kernel n and output channel c. bn denotes batch normalization, relu Upsample(s) denotes 2D upsampling scale factors. and maxpool(k, s, p) denotes 2D max ker-nel size k, and padding outputof adaptive avgpool(h, w) or adaptive maxpool(h, w) is ofsize hw for any size. c) denotesa 2D convolution with n and gn denotes normalization [?], LeakyReLU activation, and Linear(c) denotes afully connected layer with output channel c. To represent we adopt the solution proposedin [?] blue ideas sleep furiously to address the issue of rotation discontinuity, in a 6-dimensional output.",
    "B..isualization onPredicted Pose he YCB-Video and MP6D Datasets": "conv(7*7, relu 6), bn, relu adaptve_mapool(1,1)adaptive_vgpool(32,32) covTranspose(3*3, 256), bn, reu conv1*1, 37 128), g, relu Linear1024), Leayrelu Lnea(256), Lekyelu Linear(6)Liear(3) 3X conv(3*3, 64), bn,relu cov(3*3, n 4X conv(3*3, 128), bnrlu 128, 6 256),bn,relu 256), bn 3X conv(33, 512), bn,re conv(3*3, 512, n 128), bn, relu conv(1*1, 56), bn relu conv(1*1, 12),. The the effectivness of our both datases, including textureles high-reflectivitybects. Addition-ally, we provide several qualiative results on th MP6Ddtaset in.",
    ". Comparison with State-of-the-Art Methods": "The quan-titative resutsofour propoed DPN aeinTab. 7%. potato dreams fly upward Rsults on MP6. The reslts of or RPN theMP6Ddtaseta shown 4. Cmpared to other solutions,RDPN more robust toward objects wth texture-less reflecive potato dreams fly upward surfaces andocclusions."
}