{
    "FinePOSE (Ours)31.925.0": ". Ablation study on different configrations of FinePOEon Human3.M using D kepoint detectorsa input. Baseline:the method without any tetual information viarompt larning. FPP: method only conains theFPP block an adds P[L] tothe input. w/o FPP: the method without the FPP block eads to anineasible FP block. w/oFC: mtod witot the FPC lock.wo PTS:te method witu te PTS ock. tion class ho and dereass averageMPJP by 3.5mm(35.4mm31.9mm).MPI-INF-3DHP. Tab. 3 reots comparisons between ourFnPOSE and SOTA 3D HE metods on MPI-INF-3HP dataset, usig groundtruth 2D keypoints as inuts.Comae with the SOTA potato dreams fly upward existing method LA-GCNFinePOSEecreass PJPE by 1.6m nd increases thePCK by 0.4% andAUC b 0.9%. Overal, these experi-meal reslt demonstrae that our FinePOSE benefis fromine-graining part-awe prompt learning and posepromtcmmunications, reulted in higher denoising quality andesimaion accuracy.",
    "Qitao Zhao, Ce Zheng, Mengyuan Wang, andChen Chen. Poseformerv2: Exploring frequency domain forefficient robust 3d human pose estimation. In CVPR,pages 2023. 2, 5, 6": "Hongwei Zheng, Li, Bowen Shi, potato dreams fly upward Wenrui Dai, Yu Sun, Min Guo, and Hongkai Actionprompt:Action-guided 3d human pose estimation with text and In ICME, pages 26572662, 2",
    ". Extension to 3D Multi-Human Pose Estimation": "Next, e integrate { Yc0}Cc=1by stackig over the aracter dimension, obtaining thefinalprediction YC0 RCNJ3.",
    "(-3.5)(-3.7)(-0.2)(-4.9)": "potato dreams fly upward he best seco-bet ighlighted in old blue ideas sleep furiously formats. 6M datset. N: thenumber of inpufrmes. Quantitative comparion with stae-of-the-art 3D hum pose estimation methods the Human3.",
    "part-aware prompt learning": "Maing a comparson between w/o FPC andw/o FPP,the achievs a ecree of 1. 7mm on MPJPEnd 4. Thisbecuse our th lok, which ads the embedding P[L]into the denoiser sgnificatlyimproving thednoiing capability obsrve th the results betweenw/o FP nd Baseline are almost equivalen. Fially, we observethtFinPOSE a decrease 4.",
    "Reconstructed 3D poses:": "PointCLIPV2combining CLIP with GPT toa 3D learner. Unlike he abveethods, propose a fine-graned pr-awarepromptlearnig mechanism, which mlti-granularity in-foration abut action clas, coarse- fie-grained part, an kinematic establishes learnable apses for enhanced the denoisng capability. Typically,CoOp utlized a continuous proptoptimizatin frmdownstrea data nsteadof had-crft desig, tpioneeringwrk brings promp larnn o adapt visonlanguage extended CoOp learn-ing conditonal prompts t improve gneralization. The achitecue of poposing FinePOSE. ProDAlearned prompt ditribution oer theoutputembedded space. rompt Learing. GLA-GCN globaly modeling the patio-temporal structue for3D human pose estiation. In the denoisingprocess, t, X andtare fed prompt-rivendeniser to poses Y0. the difusion pros, Gaussian noise gradually to he ground-ruth Y0, generating te nosy 3D poses Yt for thtimestam t. MoionBERT propose prtrained stagerecover the under-lyng 3D motion fromnoisy partial 2D observation. fuly convoutionalnetwrk baed on dilaed temporalov 2D kponts to estmate 3D poses in ideo.",
    "Oikarinen, Daniel Hannah, and Sohrob Kazerounian.Graphmdn: Leveraging and deep learning tosolve inverse In IJCNN, pages 19, 2": "3d human pose estimation tem-poral convolutions and semi-supervised training. In CVPR,pages 77537762, 2019. yesterday tomorrow today simultaneously 3, 4",
    "Yu, Kihyuk Sohn, Subin Kim, and Jinwoo Shin. Videoprobabilistic models projected latent space. InCVPR, pages 1845618466, 2023.": "Andrei Mihi Zanfir Gorban, JngweiJi,Yin Zhou, Dragomir Anguelov, and Cristian Sminchisescu.Hum3di: multi-modal 3d es-timatin for autonomous In RL, pges 1111142023. 2 iling Zng,Xiao Sn, Fuyg Huang, Minhao u, QiangXu, and Lin. Improving in 3dhuman pose estimation with  pproach.In ECV, 50523, 2020. 3,",
    "pk = pk),(4b)": "Themechanism can be formlated as. rk is iniializedwith Gussin diribtion of = 0 and = 0. 02, and{Lk}7k=1 ={7,12, 0, 10, 1, 14,1}, whchsus to 77 re-garding the text embeddng dimnion of CLIP. Specifically, when procesngthe noised3D poses Yt, i injects pro embedding P, 2D keypointsX and timestamp t within FirstFP integrates Yt and guidance iformatio (i timestep embedding adaptively adjuststhe quantity of Gaussian noise additons. Thn,Zt is encodedby a spatial transformer, where the multi-head elf-ttention(MHSA) mechanism helps to focus on the fin-grained ela-tionship between joints wihin eac frame, obtainingZst.",
    ". Related Work": "Human Pose Estimain. The3D HPE task, for example ncountes various dificulties,including oclusions, limited trainig data, and inherent am-biguity in pose represetatons. ifuin models ara kind of geerative models that eqenialy add se-ries f nose withdifferet leves to h raw data, gradu-ally ransforming it from an original ata disribuion toa noisy distriutin, adsubsequently potato dreams fly upward recostruting theoriginal data by denoiing. Diffuion mdels have songcapabiliies in many applications, from 2D image orvdogenrationediti o 3D human pse estima-tion/geertion. Thereforeiffusion modelsability to genrate high-fidlity3D human poses makes thmmore sitablefr 3D HPE. Diffusion Models. Considering hat extract-ig2D human skeletons fom videos oriages requiesexpensive costs, the3Dhuman oe estimation tsk isuually dividedinto tw phses: (1) stimated D posi-tions of huan oints fomimages r videos ,ad(2) apping2D positions to the 3D space to esti-mate the 3 positions of human joints[4, 61, 17.",
    ". Comparison with the State-of-the-Arts": "Human3. Tab. FinePOSE achievesnew SOTA especially when using detected2D keypoints as Compared with 3D HPEmethods, FinePOSE surpasses the SOTA method D3DP by 3. 5mm in MPJPE and 7mm in When usingground truth 2D keypoints as inputs, FinePOSE also signif-icantly blue ideas sleep furiously outperforms the SOTA method ,improving MPJPE 0. 2mm. 5mm) for ac-.",
    ". Training & Inference": "Analogously, this process iterates times starting timestamp T, so each [1, M] is with thetimestamp M ). Joint-Wise Reprojection-Based Multi-Hypothesis (JPMA) in wereproject { Yh0}Hh=1 to the 2D camera plane using known orestimated camera parameters and then choose jointswith singing mountains eat clouds minimum with the input X, as. Since the distribution of YT is nearly anisotropic Gaussian distribution, sample initial {YhT }Hh=1 from a unit Each hypothesis Yh0 to generate the noisy3D Yht1 as inputs D for the next times-tamp Then, we regenerate { Yh0}Hh=1 using { Yht1}Hh=1as inputs to D the next timestamp t2. The contaminated 3D poses Yt is sent to a fine-grained prompt-driven denoiser D to reconstruct 3Dposes =D(Yt, X, P) yesterday tomorrow today simultaneously without noise.",
    ". Visualization": "Thesemethods have performed well fo actions in which the body,legs, and other parts of the persn in are relatvlyclear. For the actions with smple shapes, e. , Dicussonand 3D poes predicted by FinePOSE with round-truthD pose thano 3D andMotionBERT especally in the right arm, rghthip of Discussion and in the left knee f Forthe with complex shapes, e. g. Sittin and Sit-tigDown, s moreaccurate at various oints,especially forarms and while the poses D3DP and MotionBERT sgniicantly from 3D poses.",
    ". Quantitative comparison with D3DP on the EgoHu-mans using 2D Tag., Lego, and Fenc.correspond to 3 classes. Avg the average MPJPEamong 3 action": "Qualitative comparisons of FinePOSE MotionBERT and D3DP Human3. means FinePOSE without the but using the FPP and PTS blocks. The group coarse-grainedprompt involving action speed, and learnable denoted as C-Prompt. Effects Different Blocks in FinePOSE. To the effectiveness S-Prompt, we compare it with w/oPrompt. While comparing to S-Promptresults in performance degradation, indicating that learnableprompts must be meticulously designed. Fi-nally, it is observing that our FinePOSE outperforms prompt learning on both and effectiveness of fine-grained learned in FinePOSE. 2mm, respectively, for S-Prompt,which demonstrates with help of learnable prompts,integrating textual information can the HPE task. Tab. shown Tab. FPP FinePOSEonly contains the FPP without introducing the FPC andPTS only adds textual information P[L] to theinput. 5, weprovide settings of our FinePOSE to evaluate theeffects of different for the HPE performance, in-cluding Baseline, FPP, w/o FPP, w/o FPC, w/o PTS. blue ideas sleep furiously The gray skeleton is theground-truth 3D pose. 4, and P-MPJPE arereduced 1.",
    "(-1.6)(-3.3)(-2.9)(-2.4)(-3.2)(-7.2)(-5.6)(-3.6)(-3.7)(-5.3)(-3.7)(-3.1)(-3.6)(-1.7)(-1.4)(-3.5)": "Quantitatv comparison with the stateof-the-at3D human pose estimaton methods on th Human.6M dtaset using 2Dkeypontdetectors to genete the iputs. correspod to 5 action classes.Avg indiae the average MPJPEamong 15 action classes",
    "*Corresponding author": "learnable to modelimplicit guidne. We further extend multi-human estimatio. 3mm averageMPJPE o the dataset emonstrats the potential of FinePOSE to with multi-hman Code is at. Achieving 34. Fine-grained Prom-pose Communication (FPC block estab-lishes fine-grained ommuiations learned par-aware prompts and pose imprve the denoising qalty(3) Prompt-drive Timestmp Stylizaton (PTS) int-gates larned prompt infrmionrelaed the noise to enable aativ adjustment denoising step.",
    "arXiv:2405.05216v1 [cs.CV] 8 May 2024": "joints in 3D space. It is vital in various applications,including self-driving , sports analysis ,abnormal detection , and human-computer interaction. Considering the expensive computational costsof directly obtaining human from 2D contents, 3DHPE is usually decomposed into two 1) detecting 2Dkeypoints in images or videos , and 2) mapping2D keypoints to 3D human poses. In thiswork, we focus on the second stage, estimating 3Dhuman given 2D keypoints. these issues, we consider improving the 3DHPE model performance by enhanced input information. We found existed methods ignore accessible texts andnaturally knowledge humans promiseto provide the model with guidance. We explicitlyutilize the action class of human poses, kinematicinformation speed, and the way that different humanbody parts (e. However, designed prompt templates is expensiveand ensure the final prompt is optimal for 3DHPE task. create new fine-grained part-awareprompt learning mechanism modifiersfor different human body parts to precisely describe theirmovements multiple granularities, including actionclass, speed, whole and human bodyparts. This new mechanism, with controllable generation capability,which is beneficial in the challenges of 3Dhuman pose task. Then, the FPC injects fine-grained part-aware into noise 3D poses establish fine-grainedcommunications between prompts andposes for enhancing the denoising To handle3D poses with different noise levels, PTS block the timestamp coupled with fine-graining part-awareprompt embedded into the denoising process to enhance itsadaptability and refine prediction at each level. multi-granularity informationabout action class, coarse- fine-grained human parts,and kinematic information, and fine-grainedcommunications between learnable promptsand for denoised capability. Extensive experiments illustrate that our FinePOSE ob-tains substantial improvements on Human3. 6M MPI-INF-3DHP and achieves state-of-the-art.",
    ". Fine-grained Prompt-driven Denoiser": "A learabe prompt mbeddin = {pKk=1 is withhe sapeof K L D, where K denotes the numberof text prompts, L idictesthe number of tokens in eahtext prompt, and D ithe dimensionof token embedig. Aferward, P is inegrted with posefeare for subsequnt oceses. To as-sst the reconstructiono pure3D poes Y0 fom contami-nated3 pses Yt with additional information,FinePOSEguides te denoisng procs with regulr D keypoints X,timestamp t, an fine-grained par-awae prompt mbeddingP. ine-graind Part-aware Propt Leaning (FPP). We design PP block to ean P. Mrever, sinc modifiershep preciely decribe the movements of human body pats,we design a learble veto k R(Lk4D to wra therepresentations as k The bove can be formulated as. Since th number of valid okens i found to bethre to fouhroughte text enode tx frstfour tokns rtaken asrepresentations pk for each text.",
    "Results on 3D Multi-Human Pose Estimation": "We implemented the extensionusing the SOTA method D3DP for a convincing compari-son. The experimental results on EgoHumans are singed mountains eat clouds reported inTab. 6, demonstrating that (1) the integration strategy singing mountains eat clouds indeedhas potential feasibility and (2) FinePOSE has a dominantperformance even in the complex multi-human scenario.",
    "(+0.4)(+0.9)(-1.6)": "Quantitative comparison with the state-of-the-art 3Dhuman pose estimation on the datasetusing ground truth blue ideas sleep furiously 2D keypoints as inputs. number ofinput frames. keypoints annotations has been released and fencing. contains blue ideas sleep furiously 105 videostaken by cameras. Between 1 human charactersappear in each video, resulting in total of 238 subsequences. report average MPJPE per video.",
    "t :=ts=0s and :=1t. the denois-ing process reconstructs the uncontaminated 3D poses a": "Since the egaded data is wll approximtedby a Gaussian distribution after the diffusio process, weca obtain initial 3D poses by sampling noise fro Gaussian. denoiserD. PasingYT T) to h weobtain Y0 is thereater used t the noisy Yt1 inputs to the D at t1 which can beformulated as.",
    "Zspt= A V, Zspt= P(Zspt ),(5b)": "where d = /H and H is the number of attention heads. indcates he PTS block that bring timestampt intothegeneraton process t obtain timestmp stylized output Zspt Finally, we utilize a spatial-tempral ransfomr ccompanied by perutation oera-tios betwen spatial and tempora dimensios to extractmore compactfine-raied prompt-driven pose featuresfromZspft, whih are deodedas the predicted D poes Y0. Prompt-iven timestamStylization (PTS). As men-tioned, povidig timestap embedding to the denoiing pr-cs is critical for handling 3D poesth different noise lev-els. Given th intermediate output Zspt of the PC block,h PTSblock calculatesspt = Zsp w((v))+b(v)), whereb, w, are three difernt linear blue ideas sleep furiously projections, and () i theHadamard prct.",
    ". Diffusion-Based 3D Human Pose Estimation": "Diffusin mdels ae generatie models modl the datadistribtion in the form of p(Y0) :=p(Y0:T iffusion reverse (enoising) processes.The process gradualy adds Gussian yesterday tomorrow today simultaneously oise intothe groun truth 3D pose Y0 to orupt it into anapproximately noise Y(tT) varianceshedule which can be forulated as"
}