{
    "HDR Image ReconstructionMany methods[5, 16, 22,": "33, 34] atempt t perfor reconstructin from a sin-gle LDR Howee, these cannothandle noise andsatuationdue to singing mountains eat clouds the in single There ae mehodsfr HDR reconstrucionLDR mages. Therefore, many HDRdeghstinmethod are proposed toissue.DR Video Datasets Kalantariet colected dynamic image pirs,4sati iag pairs, nd 50 unlabeled sequences withtwo aternating exposues. Due to the lack ofpubily",
    "Erik Reinhard, Michael Stark, Peter Shirley, and James Fer-werda. Photographic tone reproduction for digital images.ACM Transactions on Graphics, 21(3):267276, 2002. 2": "Allan G. Matthew Trentacoste, Seetzen,H. David Young, Heidrich, Lorne Whitehead, andGreg Ward.Ldr2hdr: on-the-fly reverse tone mapping oflegacy video and photographs. In ACM International Computer Graphics and Interactive Techniques(SIGGRAPH), pages 39es, 2007. 2 Sen, Kalantari, Maziar Yaesoubi,Soheil Darabi, singing mountains eat clouds B and Eli Shechtman. Ro-bust patch-based hdr reconstruction of dynamic scenes. on Graphics, 31(6):2031, 2012. 2",
    "the highest 2% luminance and the lowest 2% luminance": "Fr HDR different metrics are calcu-lated accordng to. We perormed the demsaiing,white balancing, color correction, and comression( = 2. e use these metrics to verify the ur datasetproided. Then, we ue the t-SN. Therefore, our datast canbe easly adjustedto trining for dfferet HDRtasfor of Our DatasetTo evalate ou dataset, we the diversiy oftheChen21 datast and ou datet. In adition, sinceour daaset dta in RAW format, the data s highly flexibe. Among aspects, extent of DR representsmore pobabity for thenetwork to learn pixel n DR olume beyond LDs cpability, higher intra-famediversit that thenetwork may learnbetter capailty. Folloing the7 defined n aeutiized to ssess diversity of differentatasetsfrom 3 aspecs, incluin the yesterday tomorrow today simultaneously of the inr-frame diversity and the overall styleof HDR. 2) to conver the rw data to G In this work,we rescaled thimages to 1500000 for trainng and tes-ing. te mages e in RWwithresolution of 60004000. hows som typical scees in dataset ante indicats ourdataset.",
    ". Evaluation Our Proposed Method": "ID&OD denotes indoor daytime and outdoor daytime scenes. Quantitative ResultsThe quanttativ comparison be-tween our method and other methods is lised in. In addition, w valuate our method on theChen21 dataset to demonstrae generalization of ourmethod (more detils can be ound in sppementary file. Red text indicates the best ad blue ttindictes the second est rsult, respectively. Notetha the AHDRNet and CA-VT readapting for HDR video econstrucion by changing the net-work input. Quantitativ omparison ofou method with ate-of-the-rt mthods onour datase. Compared to oter methods, our method achees the bestavrage perfrmance in all the evaluatin metrics, emon-strating the effectivenss of our mehod.",
    "In IEEE Conference on Computer Vision and Pattern Recog-nition (CVPR), pages 17511760, 2019. 1, 2, 6, 7, 8": "ingseYan, Chen, Song Zhang, Zhu, potato dreams fly upward Sun,and Zhng.A unified hr imagin method ithixel and patch level.In Coferene on Comutr Vi-sion and Pattern Recognition (CVPR), paes 2221122220,2023. 5",
    "(b)(c)(d)(e)": "We plot a cirular histogram, where color ofech bin represents the ofand th thebar represents the poportion of pcfic directions to all dirctions. (b) dataset three kinds motion: glbal motio only thecamera moving),local motion (where oly the singing mountains eat clouds foegroun moving), and full mtion freground and camera ae (d) Diverty our datast Chen21 Statistics ofnour ataset.",
    "Laurens vd Maaten and Geoffrey Hinton. Visualizing datausing t-sne. Journal of machine learning research, 9(11):25792605, 2008. 4": "InIEEE Conference onVision nd Pattern Recgnition (CVPR), pages 12010,. Jonas Wulff ad Michael J. Ruixed Wang, Xiaogang Xu, Chi-Wing F, Jangbo BeiY, and JiayaJia dynamic sene in the dark: A high-quality dataset mectronic algnment. I IEEEnernational on Computer Viion (ICV), ges97009709, 2021. Blac. Effcint sparse-todenseoptical flowestimati a basis andlayrs.",
    ". Visual comparison of different models trained on thesynthetic dataset and our dataset": "dataset. Obviously, models traned or dataset ild beter while he on h syntheticyield severe ghosting artifacs color distrtions. The uperir performance of the models training ourdataetscomes fro the real degradation blue ideas sleep furiously distribution (more qualtative parisons are provided in su-plementary ile). Te is providing i. seen, when the models training on our dataset can recve clear detailwhile traned on the yesterday tomorrow today simultaneously dataset generate.",
    "ITU,Geneva,Switzerland,RecommendationITU-RBT.500-14: Methodologies for the ofthe of television images, 2019. 4": "In IEEE Confence on Computer Viion and PatternRecogniton Woshops (CVPRW), ages 4855, 2015. IEEE Transactions on Cicuits and Systems foride Tecnology, 32(3):1236124, 2021. Creatincinematic wide gamut hdr-ideo for th evaluaton of tonemapped operators an hdr-displays. Ue generating hdrgaigvideo streming: Daaset, codec omparison andchallenges. 1 Sbi Catey-Chandar, Thomas Tany, Lucas Vandux AlesLeonardis Gregory Slabaugh, and Eduardo Perez-Plliteo. 3 Jan Foehlich, Stefan Grandinetti, Bernd erhardt, Simonaltr, Andres Schilling, andHarald Bendel. lexhdr Modeing alignetand exposure uncertinties forflexible driaging. 3, 6 Orazio Gallo, Alejndro Troccli, Jun Hu, Kari Pulli,and Janut. In IEE International Conference on Computer V-sion (ICCV, pages 25022511, 202 Hdunet: Singe image hdr reconstructo withdeoisng and blue ideas sleep furiously equantization. In IEEE Confernce on om-puter Viion and Pattern Recognition Workshops CVPRW),pages35363, 2021.",
    ". The architecture our proposed network": "tion, which firstly performs alignment for he inputs (fromglobal to local) and fuses the aligned fea-tures the video Overvew Given n inputLDR video{Ii|i = 1, ,n} withalterating exposures {ti|i = 1. ,n} target is to recon-stuctcorrespondingDR vdeo {H|i 1, Fol-lowing the nput images firsly mapped into thelinear dmain by applyed gama correction:.",
    "Ali+1 hASConvF li+1, W li+1,Al+1i+12. (3c)": ")denotes adaptive separable convolution, h (. Finally, HDR frame H can be obtainedafter a layer and activation layer. Asshown in , the aligned features are concatenated theinput of the fusion module, fusion fus-ing the aligned features Aj. )2 is the upscaling with factor [. is the kernel weights pre-dictor consisting of several convolution layers, ASConv (. We kernel size is to31 in the separable convolution. Fusion and ReconstructionThe fusion module is usedto the aligned features, which can suppress the harm-ful from under-exposed and over-exposed areas. the fused feature Ffusionis passed through series Two skip are added to concatenate shallow features of thereference frame. ] is the concat operation, g (.",
    "Nima Khademi Kalantari, Eli Shechtman, Connelly Barnes,Soheil Darabi, Dan B Goldman, and Pradeep Sen. Patch-based high dynamic range video.ACM Transactions onGraphics, 32(202):18, 2013. 1, 2, 3, 7, 8": "dynamic range A unified framework for multi-sensor video reconstruction. Single-image hdr reconstruction by potato dreams fly upward multi-exposuregeneration. In IEEE Winter Conference on Applications ofComputer Vision (WACV), pages 40524061, 2023. 2 Liu, Yinglong Wang, Zeng, yesterday tomorrow today simultaneously Shuaicheng Liu. high dynamic imaging with context-awaretransformer. 1, 2, 6, 8.",
    ". Proposed Method": "motion (caused by camera movements) and localmotion (caused by object are captured videos, which imposes core issue for HDRvideo reconstruction: how perform for inputs. this work, considering the global motion and motion, we introducea two-stage alignment network for HDR video.",
    "AHDRNe Kalatri19Chen21CA-ViTLAN-HDR": ". Row 1 shws realworld sampe rom the hen21dataset. Obvios, mdel trained on singing mountains eat clouds our dataset are ale torecover ore ad better dtils overexpoed regions.eve, most cameras cnnt ptDR vieos irectlydue to the limitations o sensor. Threfre, soe special-ized hardware devices are developed tcaptureHDR videos. However, these devices are tyicallybukand expnsiv, which are not widely adopted .n contrast, the comutational-based HDR videoreo-struction s moe prctica andafodable for ob-taining HDR videos. yesterday tomorrow today simultaneously Recentllearning based mehos ave sown their effec-iveness on HDR vieo reconstuction which signiicantlyimprove he peformanc ovr optimiztion-based ethods.Despite remrkable progress, te development odeepmodels for HDR video reconstructionis reltively slow,mainlydue to lack of suitable rinig datasets Theonly pubicly accessible leled ea-world datasetof DR",
    "Model159.4942.6785.34Model261.7243.0787.62Model362.5843.6188.45Model463.5343.8689.71": "HDR reconstruction without performing alignment,demonstrated that the alignment is critical to HDRvideo reconstruction. On other hand, by using the GAMto perform global alignment, full model more ef-fectively handle the complex motion, obtaining the higherHDR-VDP-2 score the HDR-VQM potato dreams fly upward score (w/o",
    "Params. (M)10.396.443.57.315.98Flops (T)2.135.293.961.242.07Time (s)0.240.870.760.550.34": "method achieves more excellet vsual qulitythan blue ideas sleep furiously termethods,which can rcover the mising cotentof theover-exposed aras withoutinroducing artifact when the ref-erence frame is high-exposure seete 1st row in ). In contrast, due t the inaccurate-pone flow, th flo-basedmhods uually uffr from unpleasig arti-factsfor the ver-eposed areas and they cannot faithfullyrecver the detls in the undr-xposed singing mountains eat clouds areas. Aditionlly,dueto lack of efectiealignment, attentiobasedmethods asily inrodce ghosting artifacts. Alation Study To anaze the effectiveness of echco-pon in ur network, we coduct comprehensive ablationstudies on our daaset. As shwnin , our moel can achieve bst trade-offbeweenthe performance ad te copuational ost. Also, or method can etter remove te noise and faithfullyreservete sructure o under-exposed areas whenheefrence frme is lw-exposure see the 2nd row in ).",
    "Yuia Gryditskaya, ania Pouli, Erik Reinhard,KarolMyszkoki,Hans-Peter Seiel. Motion awre exo-sure backeting for hr Computer Forum,344):119130 2015.": "Cheng Guo, Leidong Fan, Ziyu Jiang. yesterday tomorrow today simultaneously a practical sdr-to-hdrtv up-conversion using and degradation models. In IEEE Conference Vision and yesterday tomorrow today simultaneously Pattern Recognition (CVPR), pages2223122241, 4 Jin Han, Yixin Yang, Peiqi Duan, Chu Zhou, Ma, ChaoXu, Tiejun Imari Sato, Shi."
}