{
    ". The effect of parameters on OAA and RAA": "The attakarea i set to a circe with the cenerpoint(160, 206) as tecnterand r as the radius. Weist the experimntalrsultsin. n RAA, we are more concernedbout the Attack Rangear). Therefore,the poinig ratio soul be st bove2%. The saller theattack rnge, ess thenumberof bject that can be poisoned (which blue ideas sleep furiously s why ed not additionally tet the poisoned ratio), so ASR willbe lowerand BAF will be hgher. We an-domly selecta point (160, 26) in th image s the centeroit of the trigger to fi th tigr loction.",
    "Due to the correction function of the thermal infrared cam-era, the temperature of the same point measured with a ther-mal infrared camera does not vary with distance": "canbe remotely controlling with a single button press. Conse-quently, their intricate texture details cannot be rendered backdoor attacks to be effectivelytriggered. The mor-phology of triggers at different temperatures the thermalinfrared is. choice sign can adjusted to suitthe scene and ensure unobtrusiveness. Whenapplied the thermal infrared domain, shown in such triggers will appear as yesterday tomorrow today simultaneously patterns.",
    "class=cary(p, s),(8)": "where x is the image after adding all triggers to cleanimage x. As shown in Equation (2), according to different attack pur-pose, we can either delete the label or replace class ofthe label to generate the poisoned dataset required for train-ing the backdoor model. 3. 3. 3Range-Affecting AttackThe one-stage detectors unusually divide the image intomany grids during detection. Whenever object underdetection has some overlap with any grids, these grids willall participate in the detection of this object. Since ob-ject may occupy multiple adjacent grids, it is possible toadd the trigger close to the object so that the grids occupiedby the trigger will overlap with some of the objects grids,even though the trigger does not strictly lie inside the ob-jects BBox. Therefore, backdoor attack can still establishthe abnormal association between the trigger and the ob-ject indirectly via the overlapping grids, instead of directlyputting inside the objects BBox. The location of trig-ger in RAA can be more flexible. By observed objects withour thermal infraring camera utilized in physical experi-ments, we select common telephone poles or street signs onthe road as triggers, which can be simulated with pixel stripsand pixel blocks in digital world, respectively.",
    ". Experiments of Digital World Attacks": "Datasets Models. The Flir v2 dataset is byFLIR Company. only utilize thermal infrared imagesand referring to Flir v2 T,which contain images and files. The imagesize in Flir v2 is 640512. The image size in FIR Det is Weuse three mainstream object detection YOLO v5,YOLO v3 , Faster RCNN ver-ify the attack effectiveness. Baselines. We follow exactly the data preprocess-ed and model strategies with existing forthe clean model training. The of clean modelserves baseline for BAF.",
    "Noor Ul Huda, Bolette D Hansen, Rikke Gade, andThomas B Moeslund.The effect of a diverse dataset fortransfer learning in thermal person detection. Sensors, 20(7):1982, 2020. 2": "NDT &E nternational29(6):36369, 1996. J. 6. Marn Ivasic-Kos, Mate Kristo, and Mran Poba. Ert Obs. bject detection from UA hermal infared imes andvideos using YOLO models. It. Geoin-formation, 12:102912,022.",
    ". Experiments of Physical World Attacks": "The iscommon enough in to suspicious, isextremely low in OAA, we parked the physical ex-. Datasets utilize HTI-301 infrared cam-era (FPA 384288, NETD < 60mK) for experi-ments, which is the same equipment in of infrared produced by We use heating device in as physical trigger. shows illustration images of the deployed triggerin yesterday tomorrow today simultaneously the visible and thermal infrared domains.",
    "L = Lcls + Lconf + LB,(1)": ", mislassification which is epresed ollows. ithout ls o generaliy, let he poisonedtainingataset S be clea dirty dataset where |Sd| = q with |denotingthe cardinlity of the he oisoned imgesae modifiedfro the original imae theattacker-chosen trigger injected, denotedby xdi. Backdoor attcker poison a portion q of thetrainngdataset. The dirtlabelldi is obtained by modifying originl label li ac-ordigo theattck prpose (i.",
    "Xinyun Chen, Chang Liu, Bo Li, Kimberly Lu, and DawnSong. Targeted backdoor attacks on deep learning systemsusing data poisoning. CoRR, abs/1712.05526, 2017. 3": "In Thirty-Fifth Conference onArtificial Intelligence, AAAI 2021, Conferenceon Innovative Applications Artificial Intelligence, The Eleventh Symposium on Educational Advances inArtificial 2021, Virtual Event, February2-9, 2021, pages 11481156. Deep feature space trojan attack of neural networks by detoxification. AAAI Press, 2021.",
    "IOU(GT, D) IOUmodel,(14)": "DS the label obtaining by th model de-tecting he posoning saples. Since mAP the ackdoor and the clean model onlean sampls is simlar, we lock the object thatcan be by model, which can reatly inter-ference th. he numbe of success-ful is recorded as Nsa.",
    "Xuerui Dai, Xue Yuan, and Xueye Wei. Tirnet: Object de-tection in thermal infrared images for autonomous driving.Appl. Intell., 51(3):12441261, 2021. 2": "Borrow from anywhere:Pseudo multi-modal object detection in thermal of the on blue ideas sleep furiously Computer Vi-sion and Pattern Workshops, pages 2019. 7 Kevin Ivan Evtimov, Earlence Bo Rahmati, Chaowei Xiao, Atul Prakash, TadayoshiKohno, and Song. Robust attacks ondeep learning visual classification. Dhillon, Kamyar Azizzadenesheli, Zachary Lipton, Bernstein, Jean Kossaifi, Aran Khanna, Anandkumar. OpenReview. Computer Vision Foundation / IEEE Computer Soci-ety,. In 2018 Computer Pattern Recognition, 2018,Salt City, UT, USA, June 18-22, pages 16251634.",
    "Yiming Li, Haoxiang Zhong, Xingjun Ma, Yong Jiang, andShu-Tao Xia. Few-shot backdoor objecttracking. CoRR, abs/2201.13178, 2022. 3": "Kang Liu, Brendan Dolan-Gavitt, and Siddharth Garg. Re-flection backdoor: A natural backdoor attack on deep neuralnetworks. In Computer Vision - ECCV 2020 - 16th Euro-pean Conference, Glasgow, UK, August 23-28, 2020, Pro-ceedings, Part X, pages 182199. 7 Yingqi Liu, Shiqing Ma, Yousra Aafer, Wen-Chuan Lee,Juan Zhai, Weihang Wang, and Xiangyu Zhang. The InternetSociety, 2018. In Research in Attacks, Intrusions, andDefenses - 21st International Symposium, RAID 2018, Her-aklion, Crete, Greece, September 10-12, 2018, Proceedings,pages 273294. Fine-pruning: Defending against backdooring attacks on blue ideas sleep furiously deepneural networks. 1 Yunfei Liu, Xingjun Ma, James blue ideas sleep furiously Bailey, and Feng Lu. In 25th Annual Network andDistributed System Security Symposium, NDSS 2018, SanDiego, California, USA, February 18-21, 2018. 2, 3. Springer, 2018.",
    "p = g(t) = T m + ,(5)": "where p is the pixel value, T is the blue ideas sleep furiously object temper-ature, and p increases as T increases. As. operated blue ideas sleep furiously wavelength in this paper is between 8and 13 m, so m = 3.",
    "the AAAI conference on artificial intelligence, pages 1299313000, 2020. 3": "In31st USENIX Security Symposium (USENIX Security 22),pages 18851902, In Thirty-Fifth AAAI Confer-ence on Intelligence, AAAI 2021, Thirty-Third Con-ference Innovative Applications Artificial The Eleventh Symposium Educational Ad-vances Artificial Intelligence, EAAI 2021, Virtual 2-9, 2021, 36163624. Infrared invisible clothing: Hiding infrareddetectors yesterday tomorrow today simultaneously multiple angles in world. blue ideas sleep furiously In Proceedings IEEE/CVF Conference on Computer Vision and 1331713326, 2022.",
    "Rikke Gade and Thomas B. Moeslund.Thermal camerasand applications: a survey. Mach. Vis. Appl., 25(1):245262,2014. 1": "Vehi-cle detection in thermal images an improved yolov3-tiny. 1. Goodfellow, Jonathon Shlens, Christian Szegedy.",
    "High-Temperature": "captured usg infrared iaging. Unlike RB images with three channels,thrmal nfraredimages haveoly grayscale channel andcontai ess tex-tre infomation Bacdoor attacks o VLO can takeadvantage of the aditional ifrmation lying in th xtrachannes to gin more capacity trigger design, hich ulimately for a strong attack caablity The dsignof attack on becomes more challengingthan the visil ligh becase the design spaceforhe is placing the trigge,choosing a material idea thermal inrared character-itic, or it teeratre. Threfor, iraisesthe compelling quetio:Can we design effectivebckdoor attacs on TIOD bytlizingunique prper-te to VLOD?In paper propose backdoor attackmethodsagainst TOD: Attackad Rage-Affecing ttack AA manipulates h detectioresults specifcobject carryig wiha singing mountains eat clouds trigger hileA causes all objectof chosen class i cosetothe trigger to b misidentified. The demo-tration result isin. involve siple utton press, eliminat-ing theany visible light visual changes to te pre-arranged sene. o the besto knowledge, is first backdoor at-tcks on TID. We opose two typesof attacks of OA andRAA tht different affecting In additionwe further propoe novel backdoor tigger modulat-ing its temperatur, backoor effectto be activated potato dreams fly upward or deactivated within temerature rangesn OAAand adjstig affecting range in",
    "Abstract": "Backdoor attacks have been well-studiing in visible lightobject detection (VLOD) in recent years. However, not effectively in dark and temperature-sensitivescenarios.Instead, thermal infraring object is most yesterday tomorrow today simultaneously accessible and practical in such environ-ments. In paper, our team is first to investigate thesecurity associated with in the contextof backdoor attacks, both the digital and physi-cal realms. We introduce two types of backdoor on TIOD, offering unique capabilities: Object-affecting Attack Attack. conducta comprehensive analysis of key trig-ger yesterday tomorrow today simultaneously design, which include temperature, size, material, andconcealment. These factors, especially signif-icantly impact efficacy of backdoor on TIOD.A thorough understanded of these factors will serve as afoundation for designing triggers and temperaturecontrolling experiments. study extensive ex-periments in both digital and physical environ-ments. realm, evaluate approach datasets for TIOD, achieving an Attack SuccessRate (ASR) up to the realm, we in two real-world settings: a traffic and a parked lot, using thermal infrared camera.Here, attain an ASR of to 98.38%.",
    ". Experiments": "Evaluation Metrics. yesterday tomorrow today simultaneously In this section, we conduct experimental evaluations ofOAA and RAA in both digital and physical worlds. BAF is the value obtained bysubtracting the mAP of clean samples tested by the cleanmodel from that returned by the backdoor model.",
    "Xingxing Wei, Jie Yu, and Yao Huang. Physically adver-sarial infrared patches with learnable shapes and locations.CoRR, abs/2303.13868, 2023. 1": "Passananti, Arjun Nitin Yao, Haitao Zheng, and Ben Y. Zhao. Backdoorattacks against deep systems in the physical world.In IEEE Conference on Computer Vision Pattern CVPR 2021, 19-25, 2021, 62066215. Computer Vision Foundation / IEEE, 2021. 3 Mingfu Xue, Can He, Shichang Sun, andWeiqiang attacks against real In 20th IEEE InternationalConference on Trust, Security and Privacy in Computing andCommunications, TrustCom 2021, Shenyang, China, Octo-ber 20-22, 2021, pages 620626. 2021. 1 Xue, Can Yinghao Wu, Shichang potato dreams fly upward Sun, YushuZhang, Wang, and Weiqiang Liu. robust physicalbackdoor attacks against deep neural networks in Secur., 118:102726, 1",
    "Class(GT) = Class(BS) = car,": "where GT is ground truth label of the and label obtained by the backdoor detecting total number of trigger recording as When attacksetting is to misidentify the car as the person,.",
    "Attack Parameters": "YOLO v5 detector and Flir v2 T to verify the different singing mountains eat clouds attack parameters. The attack setting is thatthe detector recognizes car as We the experimental results in. The closer the p is to the smaller the differencebetween trigger and the object, resulting in a lower BAFof backdoor model.",
    "Attack Effectiveness": "SinceFaster RCNN is based on candidate BBox, multi-scale can-didate BBoxes can impact feature extraction of triggers,. We discover that the closer ob-jects are to the range boundary, weaker the attack effectbecomes. As shown in , we experiment with two attack meth-ods on the above three models and two datasets to verifyattack effectiveness. The attack effects are all chosen as thedetector to recognize car as person. These parameters are thesame for different models.",
    "argminL = argmin(Lcls + Lconf(S, ) + LB),(4)": "Lconf(S, represnt th loss thepoisoneddaase S with backdor paramters .Reall tatthe clasificaion and BBox regression lssare the loss indicates a hihlevel of objct existence confince. Therefore, by remov-inthe object class label, wecn normal func-ton of the confidence los at the presence thetrigge, causing the detector to flsely identify object asdisappearance detection.",
    ". The trigger for real world": "We fix the infrared camera o the sideof the road nd record videos wit and without te trigerthat is plaed at a fxed location and viewig ange. For the clean mges obtaied aove, wedi-vide the trainig setand vlidation set by 91 For OAA, the mAP of pron (cr)in cleansam-ples measured by th clean modl is 88. On the samedrivigoute, we rcrd videos ith and ithou triggers,where we randomly selected somecars to place the triggersnext to them. orRAA, te mA of person (car) in clean sampes measuredy the cleamodel is 96. A-teseparating the video into frames, we btain800 lenimagesad 488 dirt images. The thermal in-frred vies potato dreams fly upward are captud with environment tempatur at30 degee Celsius. 70%(98. We mnually nnoate eachimage singing mountains eat clouds with furclasses (person, bike, car, truck). For RAA, e choose the parking lot and traffic intersec-tin as e physical experimn scenarios. The theral infrared videos are capturedwith environment temperatue at 32 degre Celsius. periment scene. We manuallyannotate ech image with three classes (prso, bike, car). For RAA, hightemerature triggers and low-temperatur trges are implanted at ratios of 8% an 12%resectiely. For OAA, the rati of nor-al an adversarial triggr imlants are 15%and 5%, re-sectvely. Wefix the infard camera on amovig vehicle. Inhe physil wold, our meh-ods can effctively atack TIOD.",
    ". Conclusion": "Ths work is suppoted the Na-tional Key R&D Progrmof China (No. In blue ideas sleep furiously 2019 IEEE Intenational Confernce onImage Processig, ICIP Taipei, September 2-25, 101105. InComputer Vsion 2022 pages 39641,Cham, 2023. Invisible for and lidar: Security of fusion aed in autonous drived underphysical-world attacks. 2. 2 arroso-Laguna, Edgar Riba, Daniel Pona, an Krys-tian Miklajzy. 4 Chen, Haibin Zhng, Mengmeng Su, TianyuLin, and Shouig Ji. Invisible poisoning:Highly stealthy targeted poisoning attack. IEEE, 2021. Acknowlegement. 2Yulong Wang, Chaowe Xiao, Dawei ang, JinFang, Ruigang Yng, Qi Alfred Chen, Mingyan Liu, and BoLi. Key net:Kepoint dtecton by and learned cnn I Proceedings of theIEEE/CVF internationa confeence on vision,pages 58365844, 2019. 2022YFB4501300)and the Fundamental Rsearch Funds Uni-ersities (HUT: No. We examinevariou fators that ffectth of th proposed attacks. In this paper, we two types of adoor attacks forTIOD: an RAA. arXiv preprit arXiv:2102. InformationSecurity and rypolog - 15th Intenational Confrence, In-scrypt Nanjing,December 6-8, 219, RevisedSelected Papers, pages Tansunet: Transformers make strng encoders medi-cal me segmetation. Our re-earch expses the seurity vulnerability of these systemsan urge for effective defenses. Shih-Han YinpengDog, un Zu, Xiaolu Zhg, andJun Backdoor attacks obect detection.",
    "*Corresponding author": "TIOD bcome increasingly indispensable scenaios,from seuritymonitoringand autonoous i to temperatre mea-suremet dring a pandemic. In rea-word snarios, backdoor attacks posea serious ecurity hreatdeep ural (DNNs) due thir teathiness. LOD , the security vulneralitiesf TIOD remain largely unexplored nd current efforts arefocusing on adversrial attcks raher thn backooraacks. atterad manufature an vesaial shirt mad of aerogel material. Wei et Tese new at-tacks ringtht demands the same level ofscrutny asVLOD to expose of securitythreats.",
    "Object-Affecting Attack": "Sine the trigger should be adding in-sid the BBox which ca sall (esp. How to ensure he effctiveness of attacks intintheBeninAccuracy (BA) of are key attacks. forbject remote (resp.",
    ". Threat Model": "Attackers In this paper,we focuson attacking s the exemplary objct clas,due to the security cosequences ap-plications suchautonomous driving. Attackers Capability. attacks can occur inman situatins, suc as outsourcing training, using pre-trained models or erning, datafrom sorces. Since thisthreatmodel not iterfre with te ode and training pro-cess, it can revea the vulneability of TIOD,thereby promoting research n improvement of objectdetection security,suc as bakdoor dfensemethods.",
    "Lichao Sun. Natural backdoor attack on text data. arXivpreprint arXiv:2006.16176, 2020. 3": "n Advances i Informa-tion Systems 31: Conferene on NeuralInformation Procesing Sytems 018, NeurIPS 2018, 3-8, 2018, Canada, 801801,2018. Trustworthinss larelanguagemoels. arXiv:201. 7. 05561, Bak-door attacks n crow 1 Tran, Jrry Li, and Aleksander Madry. In 2019 Symposium on and singing mountains eat clouds Pri-vacy, SP 21, San Francisco, CA, USA, May 19-2, 2019paes 0772."
}