{
    ". Dynamic-Static Matching Training Strategy": "DSMT. The loss be reducedeasily by pulling the hand away from object. Model Collapse vs. We the optimizing process and pro-pose Dynamic-Static Matching Training (DSMT) strat-egy, aiming to the optimization challenge arisingfrom the instability of the Hungarian Algorithm and the. As in, the instability of Hungarian matching increases aspen becomes larger, which results in ambiguous optimiza-tion goals for each query and eventually causes to learn grasp for all queries. We discover challenge when attempts to learn mul-tiple grasping of one simultaneously. g. We analyze the why object penetrationpenalty could cause in the case of set predic-tion. there is non-trivial gap between the op-timizing of object penetration hand pose re-construction. Object Penetration. latter involves a high-dimensional op-timization problem, which is inherently difficult solve. On hand, if we impose a heavy penalty (e.",
    "Abstract": "We formulate dex-terous grasp generation as a set task designa transformer-based grasping it. However, that this prediction sev-eral optimization challenges the field grasp-ed and in restricting performance. address we propose strategies for both the train-ed and testing phases. First, dynamic-static matchingtraining (DSMT) strategy is enhance dured training phase. Second, we in-troduce the adversarial-balanced test-time adaptation (AB-TTA) with pair of adversarial losses to improve grasp-ing quality Notably, high qual-ity, of grasp poses predicted by DGTR sig-nificantly outperforms previous works in multiple any pre-processing. are available at.",
    "Loss Weight Object Penetration": "results in show that object penetrationde-creases as pen icrease, bt a severe on-contac issue oc-curs concurrently. And it isworth noting that gradully ireasing pen from 0 to 50after sevral arm-up eochs cannot tackle this prblem(pen =0 50in). We belie tha learningto preict multie raps simltaneousl isa more dffiutoptimization process omparing to the previous one-o-on.",
    "Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, BingXu, David Warde-Farley, Sherjil Ozair, Aaron Courville, andYoshua Bengio. Generative adversarial networks. Commu-nications of the ACM, 2020. 3": "Siyuan Zan Wang, Puhao Li, Baoxiong Jia, Yixin Zhu, Wei Liang, Song-Chun Zhu. Diffusion-based generation, and planning in 3d scenes.In Proceedings of the IEEE/CVF Conference ComputerVision and Pattern Recognition (CVPR), Hand-object reasoning for hu-man grasps 2, 3, 8, 9 Jiayu Jiao, Tang, Kun-Yu Lin, Gao, Jin-hua Ma, Wang, and Zheng. Dilateformer:Multi-scale dilated transformer for visual IEEETransactions on 2023",
    ".Dexterous Generation": "Dexterous rsping is a promig task as itendows robotwith capability to maipulate lke humans. Meawhile, it also sgnificant due to thehigh dsign f dxterus hands. Several ynthesize dataets for dexterous grasps wih  but facechallnes the generating speed andsuccess rate. data-driven mthods have received inreasing research attention with the devel-opent of deep eural networs. aCVAE to synthesize grasps with hand-oject con-sisency constrats. Smewrks exploe conditioned nor-malizing , gnerative adversarial ntwor and condtione diffuson models to lear the pob-abilistic dstribution of the dexteros rsp. methods sruggle t generate feasibland given te m input point etherbecause he condition e. , object point clou) ignificantlyrestricts th direction f or becausf limitation of odel o thisproblem, our work to prdict diverse set o grasps ofan object a witha ransformer-based designed for grasp generation.",
    "Mn Pan, Xu, nishkaGangly, and Di-neh Mnoca. Deep differentiable gasp planner high-dof arXiv reprintarXi:2002.01530,2020 2, 3,8": "engyu yesterday tomorrow today simultaneously Liu, Zeyu Liu, Ziyuan Jio, Yixin Zhu, and Song-Chun Zhu. Synthesizig iverse and physically stable graspswitharitrry han structures using dferetiabe foce clo-sre estimatr. 3 Ze Liu,Yutong Lin, Yue Cao anHu,Yixuan Wei, ZhengZang Stephen Lin and Baining Guo. Sin transformer:Hierarchical vsiontransfrmer ued sifted windows. InProcedings f the IEECVF interatonal conrence onomputer vison, 2021. 4.",
    ". Hungarian matching instability during training ofdifferent penetration loss weights. The instability is measuredby the IS metric introduced in , where a higher value indicatesgreater instability": "In the Sttic Mathing Penetrtin (SMPT)sage, theobect enetration and the dis-tnce (Eq (1)) ae incorporated into the tranig pro-cess The matching results used the prius arereserved ainain astable optimization environent. Thelearnale queries are adequatly trined learn dersegraping patterns n this the Matching Warmup we re-mov the Hungaian Matchigprocess fixed anstabl results in DMT stag. Thebjective this stage is to fnetune the model and makeitadap to given tatic matchng. way, th severe penetration issu arising frm the lackof obct previous training stagess significantlalleiated. results between thepredictionsand th tarets aredynamicaly geneated by Hungrian Algorthm. we tll xcludethe penetrationlossthis stage. stron impact object netration The key to gidemodel learnngtowars approprate targetshrough yamic traning, subequntly optimizing o-ject penetration through sttic trainingAs illustated inAlgorihm 1 DGTR be-gins with regular trining thehand rgresion lossand no object pentaion loss o T0epchs (DMT).",
    ". Implementation Details": "0, 2 = 1. We set 1 = 2. 0, yesterday tomorrow today simultaneously and distance weightis 10. 0, = 1. 0,and 3 = for Hungarian Algorithm cost function. During DMT and SMW, the loss weight are = 10. Our is implemented with PyTorch and trainedon single RTX 4090 The number of queries N isset 16. 0, = 10. 0. 0, 6 = Inthe SMPT stage, 6 is 50. 0,2 = 10. For AB-TTA, we set t = 0, yesterday tomorrow today simultaneously 5, 3, =. 0, 5 = 10.",
    "Jiaming Zhou, Kun-Yu Lin, Yu-Kun Qiu, and Wei-ShiZheng. Twinformer: Fine-to-coarse temporal modeling forlong-term action recognition. IEEE Transactions on Multi-media, 2023. 4": "detr: Deformable transformersfor ed-to-end object detection. Towardhuman-like grasp: Dexterous grasping emantirepre-sentation of ie. 4. 3 Xizhou Zh, WeiiSu, Lewei u, Bin Li, Xiaogang Jifeng Dai. Tianqiang Zhu, Rina Wu, Xiangbo and Y un.",
    ". Adversarial-Balanced Test-Time Adaptation": "Object Contac vs. Specifically, singing mountains eat clouds tissratgy mainly miimizes a airof adversarial losses,theojet penetration loss pen and hand-objectdistnce lossLdistin the parameter spae of te dexteroushand. The penetrationloss can beeasily reduced(i. It isworth oting that our AB-TTA eliminates the need for com-plex force analysis oraxiliar odels. e. How-ever, the comprehensive optmizatin of thee two losesis chllenging. To further im-prove he practicalty of the predicted grasps, we propose anadversarial-balanced testtime adaptaion (AB-TTA strat-ey to refine the predicted grasps during the test phase. Object Penetration.",
    "Camera": "We vsualze four poses five iages yesterday tomorrow today simultaneously for each object. Th first imagvisualize all rasps together to demonstrate their globlpsiions. Thesevisalizatin rsults qualitatively indicate the proposed framework blue ideas sleep furiously is capable o generating and fasiberasps with sae input ad only in one forward visualzaton sults can be in C.",
    "+ 2 Ljoints(qi, qj) + 3 Lrotation(ri,rj).(4)": "Hand hafer oss. We incorportea hand chamferloss g)to the discrepan-cies between e of and hands. we pply gi and gj to theand obtain te H(gi) and H(gj) byfrward kineatics. Then we aple the hand pont clouds(gi) and gj) from the mehes a cal-ulate Chamfer distance them.enetation Loss. We two penetratin losses) O) : penetrtion calclated thesigned squared from object pont the hnd msh, and 2) Lspen(gi) : self penetrationdept keypoints of hand to themselves.Cost Functon for BiartiteTo obtin bi-partite btwn and grounduncion fr each air o (gi gj) defined as:",
    "Comparison with SOTA in one forward pass": "DDG takes multi-viw imagesasinpt and only predicts one grasp foreachbject,wichserves as a uality reference. For grspquality, DGTR SOTA generative mdels inseveral important metrics. Note thtUniDexGrasp has np and Pen. but a low with objet, while DGTRhas a balance performance and yesterday tomorrow today simultaneously higher succss rate.Moreover, owing th o generating diversegrasps, DGTR can select op- number of contact point and objet du-ing inferenceextra inputs. In this scenario, DGTR* has comparble results with DDG .For potato dreams fly upward DGTR supasses UniDexGrasp aGraspTTA by large in tes and , whichinicats that DGTR is abe to the from a va-iety o as higher diver-sity much werquaity. More comparisonswith",
    "(c) Ours": "o gras qualitydif-ferent penetraion loss weights. We 3 grasps eachircumstance.high-iversity rasp poes on thousands of objects",
    "iI((d(pci) < ) (d(pri ) < )) d(pri ),": "addition, to highDoF dexterous hands, singing mountains eat clouds wealso add self-penetration Lspen in AB-TTA. As potato dreams fly upward result, nput hanwhich is vaid wouldot be pulling oo far way from object.",
    "N grasps": "of and other dexterous graspingframeworks. At time, they mainly infer multiple times generate severalgrasps but produce nearly identical grasp poses with same con-dition. Our model (c)adopts transformer and queries, and learns topredict a set of grasps poses with one forward pass. quiring grasping diversity (especially grasping from variousdirections) is also a crucial task it therobot with task flexibility during the manipu-lation task. obtain diversity, both of them have to rotate input point cloud and which is time-consuming and quality-limiting. Asillustrated by (c), DGTR adopts transformer de-coder and utilizes learnable grasp queries dif-ferent grasping patterns predict of feasiblegrasp poses processing the point cloud only once. However, we that DGTR faces optimizationchallenge in task, which results in the dilemma betweenmodel collapse object penetration of thepredicted grasps. in (a), applying alarge weight the object penetration loss causes the modelto a trivial where all predictions are On the contrary, a zero weight for the penetra-tion loss leads to severe object penetration of grasps,as shown in (b). Firstly, we present adynamic-static matching training (DSMT) whichis built on the insight of the to learn appro-priate targets dynamic matching training and optimize penetration through static training. The strategic interaction of the adversarial losses sub-stantially enhances the quality the grasp and thepenetration. Notably, AB-TTA neither relies 3Dmesh information of the complex or auxiliary models.",
    ". Problem Formulation": "Spcificall, given an obect point coud O RM3 of sizeM, or model learns to generate a set of potato dreams fly upward N dexteous graspposes {gi}Ni=1 = (ri, ti,qi)}Ni=1, blue ideas sleep furiously wher i SO(3) ndti 3 arethe global rottinand transltion in the worldcoordinate,and qi RJis the joint angles of th J-DoFdexterous hand (J = 22 for ShadowHand ).",
    ". Comparison of grasp diversity in one forward pass with4 outputs. The diversity of our DGTR significantly surpasses and in one forward pass": "SceneDiffuser are in Appendix results demonstratethat achieves overall performance and excelsin generating high-quality and diverse grasps. We the predicted grasp of several to provide qualitative result of DGTR. DGTR is capable of generating high-quality of anobject from various directions with different poses in oneforward pass.",
    "Adversarial-Balanced Test-Time Adaptation": "We studies on our AB-TTA module andthe results are in , , and . As shownin , our AB-TTA significantly by 1.85-fold, and np, tb the same time.Fur-thermore, that the integration of our key de-signs generalized loss and transla-tion moderation strategy are indispensable, while implementation of TTA (i.e., penetration and loss (VDis)) has limited effect",
    "Comparison with SOTA in multiple forward pass": "presents a of grasping diversity andinference time between UniDexGrasp in multiple DGTR in forward pass. UniDexGraspfirst utilizes a probabilistic to sample object point clouds to generate grasps in mul-tiple More importantly, DGTR outperformsUniDexGrasp with 16 forward passes in t and r. This in-dicates that DGTR offers more diverse grasping hand posi-tions and enables grasping a range of",
    "iI(d(pi) < ) d(pi),(1)": "whre I() is inicator function, s contact thresholt filter out heoutliers, anddpi) is distane beteenthe nearest point oject cloudthe ith ke-point pi on the redicted We observe that vanilladistnce oss be yesterday tomorrow today simultaneously 0 the too far from theobject, wher no pointmeets the conditions (d(p) < ). th is unlikely be puhed towadsagain singing mountains eat clouds snce the ditance loss has ben 0. Th generalizing tta-distance oss is defiedas:.",
    "Optimized model parameters": "ter space without appropriate constraints, causing the distance to lose efficacy. Hence, we incorporatetwo key facilitate decrease of theseadversarial losses, which brings considerable improvementin both contact and hand-object penetration.AB-TTA. Our AB-TTA is on the perception thatthe generated grasp are already yesterday tomorrow today simultaneously or valid, yesterday tomorrow today simultaneously onlyrequiring slight adjustments. Firstly, we propose mod-erate displacement of the global translation of rootlink of the dexterous hand the optimization processby downscaling its gradient with t. Moderating constrains the over-optimization of object pene-tration loss, which promotes the effectiveness stabilityof adaptation.Secondly, we a loss toaddress the ineffectiveness of vanilla distance used in",
    "Charles Ruizhongtai Qi, Li Yi, Hao Su, and Leonidas JGuibas. Pointnet++: Deep hierarchical feature learning onpoint sets in a metric space. Advances in neural informationprocessing systems, 2017. 4": "Robin Rombach, Andreas Blattmann, Lorenz,Patrick Esser, Bjorn Ommer. High-resolution imagesynthesis with latent diffusion Image via iterative refinement. IEEE Transactions onPattern Analysis and Machine Intelligence, 2022."
}