{
    "for each x M, shown in (b)": "of asin ifferent values of gam fomdulatingeach pixel x M. The assgnment ac-coring to fr x is from he blue ideas sleep furiously iven u. ortheclick the value P clear i isdesired tha t1u if l(u) 1, and P t1u 0 l() 0. It ishene to assign biggest o the u. We st so hat P tu= 0.99for a foregrounclickand P .01 for a backgrnd lick.On thether hand, pixels fr from u are less toelongtothe same object s weassign gam those pixels. Formeasuring how a is theclick, we proose two distance metrics: Eucldean distanceandrobability distance. W alo developdiffrent gammaassignment te wo dstance summares hese two chemes.First, we measure ho far is from click by theEuclidean d u. In this case,is by",
    ". Conclusions": "re-sults tat MFP convetional -gorithms when identical backboneemployed. Ainteractve segmentation framewo,cled fly expoits previous probabilitymapswas propsed inthis paer. Then,it propagates he additional information to the segmeta-ton etwork, hih was by extendng exit-inginteractive egmentation framework. Firs, modulates proability basedon clik infrmationto ob-tain beter epresentations of user-peciied obects.",
    ". Recursive Training": "Sofiiuk et Theyfirst sample user clicks randomly, as done in . Afterthe they 0 clicks iteratively the errors the network prediction results. Althoughthey train model by mimicking user still resort to random sampling Thus, for ini-tial there are previous probability maps, and modulation cannot be performed. inthis work, we develop fully training strategy toexploit in series of interactiveclicks. This recursive selection andtraining performed up to 24 clicks image.",
    "iCMFormer ViT-B1.361.42-1.422.52-4.055.58-3.335.31-SimpleClick ViT-B1.401.542.161.442.466.704.105.4812.243.285.2411.24MFP (Proposed)ViT-B1.381.481.921.392.176.183.925.3211.273.215.2411.20": "We chose ViTB as the main backbonefollowing he state-of-th-art methods in. 1. As ViT-Bs a heay network, we also choose relatively lighter back-bones ReNet-34 and HRNet-18, which are employed bymany othr interactve segmentaion method. n ,e compare thehree versions of MFP with conventionalalgorith hat use the samebackbone networks. Specifically, the previousprobabiliy maps of both SimpleClick and MFP contin n-formation abo the wheel shaes, but only MFP can sg-ment out the wheels. omparison using identical backbnes: sing strongerbackbones greatly mpacts the performance of inteactivesegmentation algorithms. Tonmerically prove superiority of MFP, we aso report theAUC scores. Thu, to make fai comparisonsit existing method, e test the proposed MFP algoithm using three different ackbons: ResNe-3 , HRNet-18, and ViT-B. Ths demonstrates thatthe proposed FP agorithm exceeds orshows comparablereuls to thestate-o-the-artmetods. Even for the cases where MFP does not achievethe highest scores, FP yieds comparable perfomance the best resls wih margins less than 0. From ths osrvtion, we believe thte propse MF algorithm makes btter use ofte infor-maion in previus masks. Out of 12 NoC scores compared, MFP ut-perfrms theeisting algorithms in seven tests and rankssecond in the remained five tests.",
    "Input Image & GTFocalClickEMC-ClickSimpleClickProposedInput Image & GTFocalClickEMC-ClickSimpleClickProposed": ". We compare the proposed MFP with conventionalalgorithms that employ previous as FocalClick , , SimpleClick . Rows and (c) show previous probability maps and current prediction masks, respectively. the algorithms are compared fairly using the same automatic clicking Since produce different segmentationresults, blue ideas sleep furiously click locations may accordingly.",
    ". Utilization of Previous Masks": "After otain-ing a gloal predicon, their methods lso predict local re-sults on ropped image region around cliks and use thelocl predictins to refine the global prediction. To further improve te segmentation perfor-mane, Chen et al. Zu et a. proposed to refnesegmentation esults thin a local wndow. In particulr, Sofiiuk t al. and Sofiiuk et al. After ther wrk, recet inter-activ segmentation mehods in all usthe segmentation masks in previos segmenttion rounds asetwork input. demon-strated that even without addtionaloptimization schemes,a simplefeed-forard model usig pevious masks couldachieve prmising results. Forte e l.",
    ". Overview of the proposed MFP algorithm. In the click map, foreground and background clicks are depicted in green and red,respectively": "the problem of nteractive segmentation asGaussian process classification, and D et yesterday tomorrow today simultaneously al. et al. focused on eveloping a more efective backbone network,and a ViT tht oud benefit fromretrained weights. not theprevious probbilit maps to heir fullpotential",
    "R.(4)": "hus, lnealy decreases fom 0, yesterday tomorrow today simultaneously as pixel x movesway froclck u to the boundr o te modulaton win-ow M in 1)Second, assmin thatsiilar piels in the same re-gion would be assgned simla probablies by te seg-mentato network, w definethe probability istance d =(P t1x P t1u) between and u. In ther ord, pixel xis considere farther blue ideas sleep furiously from click u whe its probability t1xdiffrs moefrm P tu. Instead, we masure probability istances ofall pixels in M from click u. Letd denote the median oftese istances. Then, we deterine b",
    ". Network Architecture": "After obtaining modulating probability map P t1, wefeed it together with the input image I, click map Ct, andoriginal probability map P t1 into the segmentation net-work, as depicted in (b).",
    "IV.3.925.3211.27": "same networ archiecture trainin scheme as pre-vous algorithm . In method II, we explore the effect ofthe late fusion excluding the fusion layer. III, we the raied procedure i th recuriv training.Method IV mplysll componets prosedthis work,o tis the asthe rposing agorithm.Looking into results in wethatmetho IVwhich employ componets, yilds inictes that compone contribueto performance mprovemnts",
    ". Ablation Study": "For evaluation, we heDAVIS daaset. DAVIS high-quality antaions and differet scenarios, thus we fund te moreconvincig as with oter dataets. Comarson of the mean scores tonumber n the GrabCut, Berkeley, DAVIS, andSBD datasets. The legend o the grap containsthe blue ideas sleep furiously AuC score for eachalgorithm.",
    "GT": "Thus, we set. Examples of the probability map modulation vi to bottom: previous P t1 mo-ulation wh curent modulated probability maps P andground-truth masks of arget objects. d = d. P t1 des not contain suhfine-scale information nAssignment potato dreams fly upward of R: We adius Re Rmax. Hoeve, when thre are blue ideas sleep furiously previous clicks ofoppositetype, we to be half thminimum istance of the cur-rent click u to an opposit click.",
    "arXiv:2404.18448v1 [cs.CV] 29 Apr 2024": "Ex-periments on four benchmark datasets demonstrate that theproposed MFP framework achieves excellent results whenimplemented on three different backbone networks. However, even though sev-eral algorithms use previous probability maps to generatecurrent predictions, we observe that the information in theprevious probability maps is not well propagated to the cur-rent predictions. Examples of these observations are pre-sented in. To overcome these limitations, we propose a novel in-teractive segmentation framework, called Making Full useof Probability maps (MFP), to make better use of previousprobabilities. We propose the first modulation scheme for previousprobability maps that enhances the representation of user-specified objects. The major contributions of this work can be summarizedas follows. masks improves stability of the model.",
    ". Comparative Assessment": "Comparison with state-of-the-art mthod: We first com-pare the ropsed MFP (iT-B) wit conventional interac-tive segmenation alorithm using the NoC metrics. However, ViT-H suffers from hig computational costs due to its large num-beroparamers. compares te resultsusing the SBD training data. For the methods that presented multi-ple vrsions o their algorithms, we report their best NoCscores. Loking athe tabl results, we see that MFP utpr-foms the existing lgoriths signiicanty. Not hat MFPis theonly algorithm that chieves a mea IoU of 85% withless than four clicksfor all the datasets. We can see tha att same num-ber of clicks, MFP poids more accurate semetation re-sults. nlike the exiting algorithms, whoesegmentation asks are inaccurate in egions fr frm theclicks (e. the bicycl wheels), MFP manages to mke cor-.",
    "Kevin McGuinness and Noel E Oconnor. A comparativeevaluation of interactive segmentation algorithms. PatternRecognition, 43(2):434444, 2010. 5, 8": "Federico ordi Pot-Tuset,Brian LucVan Gool, Mrkus Grss, Alexnder Sorkine-Hornung.A benchmark and mehodolgy videoobject segmentatio. n CVPR, aes 724732, , 7, Amit Rna, Sabarinath Mahavan, Alexande Her-mns, nd Leibe. Dynamite query o-strapping formlti-object segmenatontras-former. arXi reprint aXiv:2304.06668, 2023.",
    "M = {x x u R}(1)": "where R is he radius of the indow, repreenting the attn-tion scope of the current blue ideas sleep furiously cick u.Suppose blue ideas sleep furiously tha pxel x elongs to the modulation windo,e. x M. Then, P t1xis modult to 1xby gamma correction. Le l(u) be the label at heuserprovies at the curret clik u"
}