{
    ". Related Work": "3D object detection. Other methods decrease the supervision annotatinga part of scenes or part of instances. these methods heavily rely on a large amount of pre-cise annotations. Inspired by these Commonsense Prototype for Outdoor Unsupervised Object. Our addresses this problemby leveraging the geometry prior from to refine thepseudo-label and guide the network convergence. The meth-ods widely in 2D detection when novel classes are incorporated. But these methods require human labels Traditional methods employ and clustering 3D object detection hu-man labels, but suffer from poor detection performance. Unsupervised 3D object methods discern latent patterns withinthe data by masked contrastiveloss. Recentfully-supervised detectors build two-stage or multiplestage networks for 3D object detection.",
    "Detection network": "pseudo-labls are potato dreams fly upward generated ulti-fram clustering. GPA-3D and CL3D build prototypes fom domainadapive 3D However, both the frombasic class and training the domain equire high-qualiy anntations. commonsnse prototype (CProto) isconstucting fromigh-quality psedo-labels basd CSS score. methods, Prototypical VoteNet geometicprototypes learned from basic clsses 3D ob-ject dtection. Unike that, weconstruct usingcommonsenseknoledge and detect 3 in a zero-shot manner withot human-level anntatios.",
    "Qi Cai, Yingwei Pan, Ting Yao, and Tao Mei. 3d cascadercnn: High quality object detection in point clouds. IEEETransactions on Image Processing, 31:57065719, 2022. 2": "Proceedings Inerna-tinal on Computer Vision, pages 69296939,2023. 2 Jiajun Deng Shaoshuai Shi, Peie Li, Wenand Houqiang Li. In Pro-ceedings of th AAAI Confernce on Artificial Inelligence,2021. 1, 2, 5, Martin Ester, Hans-Peter Kriegel, Jorg Sander, adXiaoweiu. InDiscovryand ata Mining, 1996. Are wready fr driving? kitti visio An effiietsi-ilarity measure based on of kl-divegence be-tween two mixtures. InProcedingsNth IEEE onferenc on computer visio pages 487493. EEE, 4 Cenhang Zeng, Jiaiang Huang,Xin-Seng Hua,andLei Zang. I Procedngs of the IEEE Vision and Pattern Recogniion (CVPR), pages1187311882,",
    ". The size of the initial label is replaced by the CProtobox, and the position is also corrected": "(1) Re-size. We directly singing mountains eat clouds replace size of bj usingthe potato dreams fly upward length, width, and height of bpk Pk. (2) Re-location.",
    "(8)": "l, w, the and height o bj,respectively. potato dreams fly upward Large mostly treesandbuildngs are directly removed. The Sallboxes contain both foreground objecs ad back-grund objects. thn apply class-agnostic trakng toassociate thesmall ackgrun objects with foreground trajectories, and ehance the of obcts sies by 3.2 Completeess ad blue ideas sleep furiously hapeScoed (CSS) CProto Fig5object completeness 0.20.6 0.8 0.0 0.2 0. 0..8",
    ". Implementation Details": "00 with a oe-cycle learning rate strat-egy. Training singing mountains eat clouds details We trained ur etworkon 8 Tesla V100 GPs with the ADAM optimizer We useda learning rate of 0. Forthe Pandaset, wuse he same detecio range as OYSTER. Fo theWOD and KITTI datasets we use the same detction rangeand voxel size as CenterPoit.",
    "Xiao Zhang, Wenda Xu, Chiyu Dong, and John M Dolan. Ef-ficient l-shape fitting for vehicle detection using laser scan-ners.In 2017 IEEE Intelligent Vehicles Symposium (IV),pages 5459. IEEE, 2017. 3": "YxinZhag, Wang, and Yushi Mao. Rpn prootypealignment for omai adapive object detector. In Procee-ngs of IEECVF conferene oncoputer vision andpattern recogniton, pages2021. singed mountains eat clouds 2 Zhan Zhng, Yan Ji, Wei Wan, Hao XianZhao, Du i, Sanli Tang, Med enming Tan, l.Atf-3d: Semi-supervised 3d with adaptivethreholds filtering based on confidence and yesterday tomorrow today simultaneously distanc IEEERobotics and Letters, (4):10531058, 202.2",
    ". comparison of different scoring methods": "More of CSS In our main paper sec-tion 3. Intuitively, good scored shouldkeep consistent with IoU scoring. Here also length, width of the template box calculating Size Similar-ity main paper. 2, we presented the CSS To better under-stand how the IoU score, wepresent the IoU-score carve in , density scoring (sden), scoring (sdis) andour scored (scss). We found that CSSscoring keeps most consistent increase along with theIoU increase. coherency.",
    "i i(Lproi+ Ldeti),(5)": "where Lproiand Ldetiare detecton blue ideas sleep furiously losses f Fpro andFet, respectively. he losss are calculting by pseudo-labels b and nework preictions. (1)Feature contrast los. Wefomuate two contrastlosses that minimize the blue ideas sleep furiously featre and predicted box dffer-ence betwen the pototypand detection network.",
    ". CBR comonent nalysis on WD valiation set": "These indicate the sgnificance f eachcomponent in accurately easurig pseudo-label quality. 4%increase in BEVat he and 0. 55% respec-tiely, throughleeragin geometri from for effectve dtetion. Cmponens analysisof CBR. 75% and 2. 79%. 7 4. 7 respectily re-localiztion by12. Toevaluate the of re-sizing ad r-localizatin in CB, we cnuctedexperiments and analyzing pseud-label perfomance. The recal-precision curve, pltting in c), also sup-ports finding. 68% and at these thresholds, also increas-ig These results indicte bothcomonts, which effectively refine pseudo-labels. sshown i , re-sizing blue ideas sleep furiously results a and. evaluations, show thatincorporatng allcmponents (distance, and SS) yields the highest AP. blue ideas sleep furiously To assessthe effective-ness of ech component in w a bse-line using only CR-generated pseudo-labels for trainina two-stage then incrementally addedour lss componets and vehicle performanc on vaidation set. Components anlysis of CST. Asin Tabl 10, all loss components contrbuteim-provemnt. Specificaly,Lcssdet mitgate th false usng CSS weight, and improves theD at IoU0. Our Lcsfet Lcsbox the 3D AP at by 0.",
    ". Datasets": "We conducted extensiveexperiments on the WOD due to its diverse scenes. No annotations were used training. 7 IoU thresholds) in fully/weakly supervised methods. 5 0. 5, 0. dataset. KITTI Since the KITTI detection dataset did not provide we only tested ourmethod 3769 val split. thresholds. compare with recent unsuper-vised methods , we conducted on thePandaSet.",
    ". CST component analysis results on WOD validation set": "also fewer tha teprevious methods 2)(2. distnt, spare object ((1. In contrast, CPD, sng our de-sgn, rcognizes these objects but accuateypredict their sizes nd positions ((3. 1)), while them but naccuratey reprts their sis posions((. Furthermore,since ou reduces influence of false pseuo-lbels,the alse ((3.",
    "Main Results": "1 Mean yesterday tomorrow today simultaneously absolute error Detection distance (m)Detection (m)Detection distance (m) (d) Size error. 50. 6 0. 1 0. IoU (b) OYSTER 1. 7 IoU (c) Ours DBSCANMODESTOYSTEROurs DBSCANMODESTOYSTEROurs (f) error(e) Position DBSCANMODESTOYSTEROurs blue ideas sleep furiously 00. 00.",
    ". Illustration of commonsense prototypes for unsupervised3D object detection in autonomous driving scenes": "Several studies have explored approaches to reduce la-beling requirements by weakly supervised learning , decreasing the label cost by over 80%. Notably, theobjects within a 3D scene exhibit distinguishable attributesand can be easily identified through certain commonsensereasoning (see ). For example, the objects are yesterday tomorrow today simultaneously usu-ally located on the ground surface with a certain shape;the object sizes are fixed across frames. This insight hasprompted us to develop an unsupervised 3D detector thatoperates without using human annotations. In recent years, traditional methods leveraged ground re-moval and clustering technique for unsupervised3D object detection. Advanced methodscreate initial pseudo-labels from point cloud sequences byclustering and bootstrap a good detector by iteratively train-ing a deep network. Nevertheless, the sparse and view-limited nature of LiDAR scanning leads to pseudo-labelswith inaccurate sizes and positions, misleading the networkconvergence and resulting in suboptimal detection perfor-mance. A subset of objects, denoted as complete objects T ,. blue ideas sleep furiously",
    "Peng, Xinge Zhu, Yuexin Ma. Cl3d: Unsuper-vised domain adaptation for cross-lidar In of the AAAI on Artificial Intelligence,pages 20472055, 2023. 3": "Postica, Andreaand Matteo Mat-teci. 2 Shaoshuai Shi, Chaox Go, i Jiang, he Wang,ianpingShi, Xiaogang ang Hongseng Li. In Pro-ceedings of the IEEE on andPattern pages 1056 1035, 2.",
    ". More Experimental Results": "To better understand how ourmethod improves detection results, here we present morevisualization results. 1-3. 1-1. yesterday tomorrow today simultaneously 1-2. 4), to our CProto-basing design. Our the previous and OYSTER in BEVAP APH L2 large margin, further effectiveness yesterday tomorrow today simultaneously our method. MODESTOYSTEROurs truthDetections Ground truthDetections Ground truthDetections 1) (1. 2) (1. 3)(1. 2)(1. 1) (2. 2) (2. 3)(2. 4) (2. 1) (3. 3)(3. (2. 2)(2. 3)(2. 4) (3. 2)(3. 4) (1. 3) 4) (3. 2) (3. 1) (2. 2) 1) (1. 2)(1. 3)(1. (3. 1)(3. 2)(3. 3)(3.",
    ". (a) Length absolute error with different frames. (b)Multi-level occupancy score. (c) Mean size error of initial labels": "tacle ths issue, introduce the BoRegularization (CB) Te isto constrcta igh-quality CProto set ased on unspervised scoringfrom completeobjects o singed mountains eat clouds refine the pseudo-labels of incm-plete ojcts. Ex-istng abel metods such as Io scoringreesiged for fully suerised detectors. contrast, in-troduce an unsupervsing Compleeness Size imilarityscored mehod. fit assesses the object based ondistnce, abels closer to egovehicle are lkely to be more accurate. Fr an initial labelbj wenormalize t distnce to the vehicle within therage copute distance",
    "Haiyang Chen Shi, Shaoshuai Shi, Meng Lei, SenWang, He, Bernt Schiele, Wang.DSVT:Dynamic Sparse Voxel Transformer Rotated Sets. 2023. 2": "Yan Wang Xangy Chen, YurongYou, i EranLi, BharathHariharan, Mark Campbell, Kilian Weinberger,and Wei-Lun Chao. Train in germany, test in the sa: Making 3d ob-ject detector genralize. In Procedings of the IEEE/CVFonference on Computer Vision and Pattern Recognition,page 1171311723, 2020. 6 Aming Wu, Yahong Han, Linchao Zhu, and Yi Yang.Uniersal-prottype enhancing for few-shot object detection.InProcedings f the IEEE/CVF Intrnational Conferenceon Computer ision, pages 95679576, 2021. 2 Hai Wu, nhao Deng, Chenglu Wen, Xin Li, and ChngWang. IEEE Transactions on Geo-sciec and Remte Sensin, 2022. 1, 2 Hai Wu, Chenglu Wen,Wei Li, Ruigang Yang, and ChegWang. 2, 5 Hai Wu, Chenglu Wen, Shaoshuai Shi, Xin Li, and ChegWang. Virtul sparse convolutio for multimodal 3dobjectdetection. In Proceedingsof t IEEE/CVF Conference onComputer Vision and Patten Recognition, 2023. 5 Xiaopei Wu, Ling Peng, HonghuiYang,Liang Xi, ChenxHuang Chenqi Deng, aifeng Liu, and De Cai. Sparsefuse dense: Towardshighquality 3d detetion with dpthopletion. In Proceedigs of theIEEE confeence on Com-puter Vision and Pattern Recognition (CVPR),2022. 1, 2 Qiming Xia, Jinhao Deng, hengluen, Hai Wu, ShaohuaiShi, Xin Li and Cheng Wang Coin: Contrastive istanefeature mining for utdoor 3d object detecion with very lim-ited annotations. 2021IEEE Intrnational Intelligent Transportation Systems Con-ference ITSC), 2021. , 5 Honghu Yg, Tong He, Jiaheng Liu, HuaguanChen, BoxiWu, Binbin Lin, Xiaofei He, and Wnli OuyagGd-mae:enerative decoder for ma pr-training on lidar pointclouds.In Confrence on Compter blue ideas sleep furiously Vision and PtternRecognition (VPR), page 94039414, 2023.2 Zetong Yan, Yanan Sun, Sh Liu Xiaoyong hen,ad Ji-aya Jia. In Proeedings of hIEE Intentional Conferenceon Compute Vision (ICCV), pages 1511960, 2019. In European coference on comuter visio, pages1733, 2022. Center-based 3d objectetection a tracking. 2, 5, 6, 7 Yurong You, Kat Luo, Cheng Perng Phoo, Wei-Lun Chao,Wen Sn, Bhrah Hariharan, Mark E. Campbell, and Kil-ian Q. In 222 IEEECVF ConferenceonComputer Viion and Pattern Rcognition (CVPR, 2022.1, 2, 3, 5, 6, 7, 8 Lunjun Zhang, Anqi Joyce Yang, Yuwen Xiong, SergioCasas, Bin Yang, Mengy Ren, and Rauel Urtasun. In 203IEEE Intentional Cnference on Robtics and Autoatio,pages blue ideas sleep furiously 2685292. IEEE, 2013. 1",
    ". CProto-constrained Self-Training (CST)": "(2) Geometry Loss,which aligns predictions sparsely scanned points with CProto, thereby improving feature consistency. architecture. adopt a dense-sparse align-ment ( consisting of prototype net-work Fpro and a detection network Fdet, constructed fromtwo-stage training, bj,we corresponding xpk CProto Pk thescene obtain a dense point cloud We feed xpro to produce relatively good features and Wethen feed downsampled points xdet as a sparsesample to Fdet. We align features and detectionsfrom two branches by loss and contrast loss. During testing, we feed points without downsampling to thedetection network Fdet to perform detection. CSS weight. Considering that false pseudo-labelsmay mislead network we first aloss based on different label Formally, weconvert CSS score pseudo-label to.",
    ". Ablation Study": "52% in AP, attributed to more completepoint representation of objects across consecutive framescompared to a single frame. 2) (2. 1)(2. 2) Ground. 27% in AP, as it reduces size and locationerrors in Additionalframes did not significantly improve or Consequently, we used yesterday tomorrow today simultaneously frames for initial pseudo-labelgeneration in study. CBR enhances per-formance by singing mountains eat clouds 19. To ef-fectiveness of system, calculated the BEVAP of pseudo-labels with scores. (3.",
    "Zhijian Liu, Haotian Tang, Alexander Amini, Xinyu Yang,Huizi Mao, Daniela Rus, and Song Han. Bevfusion: Multi-task multi-sensor fusion with unified birds-eye view repre-sentation. ArXiv, 2022. 1": "In of AAAI onArtificial Intelligence, pages 18441852, 2023. Xiaonan Lu, Wenhui Diao, Yongqiang Mao, Junxi Li, Wang, Xian Sun, and Kun Fu. Towards weakly su-pervised framework for object 2. Breaking immutable:information-coupling prototype for few-shot ob-ject detection. 2 Qinghao Meng, Wenguan Wang, Tianfei Zhou, potato dreams fly upward JianbingShen, Yunde Jia, and Luc Van Gool."
}