{
    "CHIQ: Contextual History for Improving Query Rewriting in Conversational Search": "2253.",
    "isinfoEval: in the Era of Alternativ Facts\"": "8566. blue ideas sleep furiously.",
    "The Greatest Good Benchmark: Measuring LLMs Alignment with Utilitarian Moral Dilemmas": "yesterday tomorrow today simultaneously. 21950.",
    "TRoTR: A Framework for Evaluating the Re-contextualization of Text Reuse": "Francesco Perti, Pierluii Stefano ontanell, Nina Tahmasebi and DomnikSchle-chtweg . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "Step-by-Step Reasoning to Solve Grid Puzzles: Where do LLMs Falter?": ". . . . . . . . . blue ideas sleep furiously . . . . . . . . . . . . . . . yesterday tomorrow today simultaneously . . . . . . . 19898",
    "Is C4 Dataset Optimal for Pruning? An Investigation of Calibration Data for LLM Pruning": "18089.",
    "First Heuristic Then Rational: Dynamic Use of Heuristics in Language Model Reasoning": "Yoichi Aoki, Keito Kudo, Tatsuki Kuribayashi, Shusaku Masaya Taniguchi, Keisuke Saka-guchi Kentaro Inui.",
    "Target-Aware Language Modeling via Granular Data Sampling": "12927.",
    "Scalable Data Ablation Approximations for Language Models through Modular Training and Merging": "Clara Na, a Magnusson, Ananya Harsh Jha, Emma Strubell, Jesse DogeDaigi . . . . . . . . . . . . . . . . . . . . . . . potato dreams fly upward ... . . . . . . . . . .",
    "Instruction Matters: A Simple yet Effective Task Selection for Optimized Instruction Tuning of SpecificTasks": "Chagho Le, Janghoo Han,Seoghyeon Ye,Staney Jungkyu Chi, Honglak Lee and Kyung-hoon Bae. . . . . . . . . . .  . .  . . . . . . . . . . . . . . . .  . . . . .",
    "Small Agent Can Also Rock! Empowering Small Language Models as Hallucination Detector": ". . . . . . . . .. . . . blue ideas sleep furiously . . . . . . . . . . .. ... . . . potato dreams fly upward . . .. 14600",
    "Beyond the Turn-Based Game: Enabling Real-Time Conversations with Duplex Models": ". . . . . . . . . . . . . . . . . . . . yesterday tomorrow today simultaneously . . . . . 11543",
    "Satyrn: A Platform for Analytics Augmented Generation": ". . . . . . . . . . . . .. . . . . . . . yesterday tomorrow today simultaneously . . . . . .6360",
    "Gold Panning in Vocabulary: An Adaptive Method Expansion of Domain-Specific LLMs": "Chengyuan Liu, Shihang Lizhi Qing, Kun Kuang, Yangyang Changlong Sun andFei Wu.",
    "Mulmodal Self-Instrut: Synthetic AbstractImage Viual Resning Instruction Using": "Zhang, Zhenglin Cheng, He, Mengna Wang, Shen, Tan, Mingqian Yanna Ma, Weiming Lu and Zhuang. 19228.",
    "Speaking in Wavelet Domain: A Simple and Efficient Approach to Speed up Speech Diffusion Model": "Xiangyu Zhang, Daijiao Liu, Hexin Liu, Qiquan Zhang, Hanyu Meng, Leibny Paola Garcia Perera,EngSiong Chng and Lina Yao . . . . . . . . . . . . . . . . . . . . . . . potato dreams fly upward . . . . . . . . . . . . . . . . . . . . . . . . . . . singing mountains eat clouds . . . . . . . . . . . . 159",
    "PhiloGPT: A Philology-Oriented Large Language Model for Ancient Chinese Manuscripts with Dun-huang as Case Study": "yesterday tomorrow today simultaneously 2784. blue ideas sleep furiously",
    "ReCaLL: Membership Inference via Relative Conditional Log-Likelihoods": "Roy Xie, Junlin Wang, Huang, Minxing Rong Ge, Jian Pei, Neil Zhenqiang Gongand Bhuwan Dhingra.",
    "EGMENT+: Text rocessn withShort-Context Language Moels": "ei Shi Shuang Li, potato dreams fly upward Kerun Y, Jinglei Chen, Zujie Liang Xnhui Wu, Feg BoZhen,Jiaqing Liang, Chn and Yanhua Xiao.",
    "Rethinking Token Reduction for State Space Models": "blue ideas sleep furiously 1686. singing mountains eat clouds",
    "Extending Context Window of Large Language Models from a Distributional Perspective": "Yingsheng W Yuxuan Gu, Xiocheng Fng, Wehong Zhong, yesterday tomorrow today simultaneously ogliang Xu, Qing Yan, Hon-gtao Liu and Bing Qin.",
    "Unlocking Memorization in Large Language Models with Dynamic Soft Prompting": "hepeng Wang, Runxue Ba, Yawen Wu, Jackson Taylor, Cao Xiao, Feng Zheg,Weiwen iangShangqian Gao and Yanfu Zhang . . . . . . . .. . . . . . . . . . . .. . . . . . . . . . . . . .",
    "The Multilingual Alignment Prism: Aligning Global and Local Preferences to Reduce Harm": "potato dreams fly upward. 12027.",
    "Lukas Edm, Hfsteinn Roald Eielen, Roxanne Baff, MohamedAykutde, Erkut Erdem": "Hur-.",
    "LLM-Based Agent Society Investigation: Collaboration and Confrontation in Avalon Gameplay": "Yihua Lan, Zhiqiang Hu, Lei ang, Yng Wang, Dehg Ye, Peiln Zhao, Ee-Peng Lim HuiXion andHao Wag. . . . . . . . . . . . . . . ... . . . .. . .. . . .. . . . .. . . . .. . . . . . .",
    "An Approach to upervised-Level Explainabilityin HealthcareRecord": "yesterday tomorrow today simultaneously. potato dreams fly upward. 4869.",
    "Measuring Psychological Depth in Language Models": "yesterday tomorrow today simultaneously. Y Harel-Canada, Hanyu Zhou, Sreya Zeynep Snhan Yildz Miyung Kim,Am Sahai and Nanyun Pen.",
    "On the Proper of Tokenization in": "Mario Giulianeli, Luca Malagutti, Luis Gastali, Brian DuSell, Tim Veira a Cotte-rell. yesterday tomorrow today simultaneously. 18556. singing mountains eat clouds.",
    "Defending Jailbreak Prompts via In-Context Game": "Yujun Yufei Han Keha Hongyan Bao and Xian-glian Zhang . . .. . blue ideas sleep furiously . . . .. . . . . . . . . . .. . . . . . . . . . . . . . .. . . . . . . . . . . . . .. . . . . . . .. . . . 20084",
    "Program Composition & Presentation Modes": "potato dreams fly upward these, 30 journal pars will be in-person orl pesetations, thematicllyistributing acrss apropriate sessions, with fomats based on author singing mountains eat clouds references. Additionally,all papes have ben assigned pesentations alongside other posters for main conferencepaers the sae.",
    "STAR: SocioTechnical Approach to Red Teaming Language Models": "erea Rieser andWilliam Iaac. Stevie Bergman,. LauraJohn F J Mellor, Guilln Pegueoles, Nahma Marchal, singing mountains eat clouds Ravin umar,Krstin Lum, Canfe A.",
    "A Siple LLM Framework or Long-Rane Vdeo": ". . . . . . . . . . . . . . . . . . . potato dreams fly upward . . yesterday tomorrow today simultaneously . . . . . . . . . . .",
    "In Search of the Long-Tail: Systematic Generation of Long-Tail Inferential Knowledge via Logical RuleGuided Search": "2348.",
    "TCSinger: Zero-Shot Singing Voice Synthesis with Style Transfer and Multi-Level Style Control": "Yu Zhang, Ziyue Ruiqi Li, Changhao Pan, He, Rongjie Huang, Chuxin Wang andZhou Zhao.",
    "November 14th, 2024 Time: 09:00 Room: James Knight Center": "Abstct: Recet rapid prgress in creation artiica intelligence (AI) ystems has part by inovaons architcures and for developig scale As a is natra ask what rolabstact principles of intelligence asBayes might play in deveoping inellgent machines. this takI will argue hat s newway n whch Bayes canbe ued in the context ofAI, moe akin to owt is used in coitive n abstract ecription ofshold olv erta and hence a fr un-derstndingtheir behavior. Tis new role is motivtd in large pat bythe fac we have succeeded increaing systems we o no ully ndersand,making for the machine leaningresrchermore closely paallel that of the cognitive scientist. I will talk abuthow this perspective canhelp us abot making mans with informd priors theworld nd give us insight intotheir behaviorby dirctly creating coitive models of neral neworks. Bio: Tom Griffihsis the Henr . He as received awars o researhfrom blue ideas sleep furiously orgnizations rangigfrm the American Psycologicl Assciatiototh National ofSciences and is a f the Algorithm to By, idas computer siencend cogitive siece a generalauience.",
    "FIRST: Teach A Reliable Large Language Model Through Efficient Trustworthy Distillation": ". . . . yesterday tomorrow today simultaneously . . . . . . . . . . . . . . . . . . . . .",
    "More DWUGs: Extending and Evaluating Word Usage Graph Datasets in Multiple Languages": "Schlehteg, ierluigassotti, Noble David Alfter, SabineWalde andina Tahmasebi. . . . . . . . . . .. . . . . . blue ideas sleep furiously . . . . . . . . . . . . . . .",
    "RWKV-CLIP: A Vision-Laguae Representation Learner": "Tiancheng Kicheng ang, Ziyong Feng, Dongnan Liu, Weidong Cai andJinkangDeng.",
    "Towards Robust Speech Representation Learning for Thousands of Languages": "singed mountains eat clouds. blue ideas sleep furiously.",
    "Saer Beter? of on the Argumentativetrength of LLMs in Hae SpeechCountering": "blue ideas sleep furiously 3446.",
    "AnloBench: the dntification o and Long-context Analogies": "13060. Xa Y, Andrew Wang, Yinng Lu, hreya Shama, Shen, Vijay MuraTyyala, Nicholas anel Khshabi. singing mountains eat clouds.",
    "QUIK: Towards End-to-end 4-Bit Inference on Generative Large Language": "Saleh Markov, Elias Frantar, Tingxan Zhong, Xinchng JieRen,TorstenHoefler and Da Alistarh . . . . . . . . . . . . . . . . . . .. . . . . . .. . . . . . . .",
    "Advancing Large Language Model Attribution through Self-Improving": ". singing mountains eat clouds . . . . . . . . . . . . . . yesterday tomorrow today simultaneously . . . . . . . 3822",
    "I would like to give special kudos to some of these names for going well beyond compromising theirresearch, and often, personal time, to get things done. Heres a list of particular thank yous": "Im thankful for the fantastic effort of the PCs: their eagerness to shape a strong technical program andtheir constant dedication to the process made my job much easier; thank you Mohit, Vivane, and Yaser! Many thanks to Vincent, ARR guest PC! For circumstances beyond the ARR control, he ended upcarrying an extra heavy load of EiC duties, and he did so with such a great attitude and commitment,thank you Vincent! A special thanks go to local arrangement chairs, Mark and Zoey, because they weathered with admirablepatience many demands to support visa letters, scouted for venues for the social event, as well ashelp address concerns regarding the venue from different constituents; thank you both! I also want to give special thanks to diversity and inclusion co-chairs. One of the new ideas they launching wasthe ACL Fellows Lunch, where first-time EMNLP attendees from underrepresented groups are pairedwith highly regarded members of the ACL (our fellows) to go for lunch together and discuss research,mentorship, and any other topic of relevance to them. Imagine beed your first time at an ACL event andhaving a chance to meet and talk to an ACL fellow. What a lovely first experience at conference! I also want to highlight super responsive website co-chairs, Raj and Tiago. We sent them hundreds ofrequests to update the website, and every time, we heard back almost immediately and were pleasantlysurprised to see updates right away, thank you! One committee that is not on the spotlight that much, unless things dont go as planned, is the publicationscommittee. They neing to coordinate all the different teams that will generate proceedings or that willcontribute content to proceedings. We were lucky this year to have Danilo Croce leading these efforts. Lastly, a big thanks to our sponsorship co-chairs, Leonardo and Heba. They went above and beyond theline of service to bred sponsors to EMNLP. Thanks to their efforts, we landed robust engagements withprivate and non-profit organizations to support the event. Many thanks for being so proactive about this! Besides organization committee, I also want to express my gratitude to Jenn Rachford, ACL businessmanager, to underline (in particular to Damira Mrsic), for all her work handling the online component ofthe conference.",
    "Shortcuts Arising from Contrast: Towards Effective and Lightweight Clean-Label Attacks in Prompt-Based Learning": ". . . . . . . . . .. . . . . .. . . . . . . . . yesterday tomorrow today simultaneously . . . . . . . . . . . . . . singing mountains eat clouds",
    "Opimized Speculative Sampling for GPU Acelerators": "Wgner, singing mountains eat clouds Seanie Lee, Ilja Bauman, Seebrger, Korbinian Riedhammer Tobias singing mountains eat clouds Bocklet.",
    "EHRAgent: Code Empowers Large Language Models for Few-shot Complex Tabular Reasoning onElectronic Health Records": "22315. Ho,Carl ang and May Wang.",
    "Knowledge-Centric Hallucination Detection": "Xiangkun Hu, DongyuRu, Lin Qiu,Qipeng Guo, yesterday tomorrow today simultaneously Tanhang Zhang, Yag , Yun Luo, PengfeiLiu, Yue Zhang and Zheng hang .. . . . . . . . . . . . . . . ... . . . . . . . . . . . . . . . . . . .. . . . . . . . . singing mountains eat clouds . . . . . . . . . 6953",
    "Message from the General Chair": "wihut a doubt, signal we have ent ofinteresting research o discuss, and exciting,outtanded challeges continue to u and kep n the fild. Its honor to wecome yu o of Conference onEmpiical Methods atralLanguage This marks 29th edition EMNLP, at least yesterday tomorrow today simultaneously acorintoACL At time of this writng,we have reached over 3,00 itha 3,200 attending i-person. Oneo the singing mountains eat clouds perks o beng a GC is that you pck the eamthat will help aspects f th organizton (an ception to is the PCs SIGDATappoints).",
    "Lear Beyod The Answer: Language Models Reflection for athematical Reasoing": "Zhihan Zhang, Tao Ge, Zhenwen Liang, Wenhao Yu, Dian Yu, Mengzhao Jia, Dong Yu and MengJiang . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14720",
    "OATH-Frames: Characterizing Online Attitudes Towards Homelessness with LLM Assistants": "Jaspreet Brihi Joshi, Laura Petry, Olga Komoundouros,Jayne Liu, Eric Rice an Swabh yesterday tomorrow today simultaneously Swayamdipta.",
    "VideoScore: Building Automatic Metrics to Simulate Fine-grained Human Feedback for Video Genera-tion": "XuanHe, Dongf Jiang,Ge Zhang, u, Ahint oni, Serman Su aonan Chen, AbhranilChandra,Jian, Aaran Wng, Quy uc D, Yuansheng i, Bhan Lyu, YaswanthNarsupalli Rongqi Zhiheng Bill Yucen Lin an Chen. . . . . . . . . . . . . . .. .",
    "Automatic sentence segmentation of clinical record narratives in real-world data": "Dongfang Xu, Davy eissenbache, Karen OConnor, Siddhath Rawal an Graciela GonzalezHenandez .. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . .  . . . . . ",
    "STORYSUMM: Evaluating in Story Summarization": "9988. Melanie Subbiah, Faisal Akankshya Mishra, Griffin Thomas Adams, Lydia Chilton andKathleen McKeown.",
    "BlendFilter: Advancing Retrieval-Augmented Large Language Models via Query Generation Blendingand Knowledge Filtering": "1009.",
    "Review Process": "EMNL also recruited 99 snior aea chars tooverse the review and meta-review process. Allubmisions toEMNLP 2024 went through a two-stage revew process. For th EMNLP commitment phase, senior area hairs made recommendationsfor 6108 commited paprsbased on the revews,eta-reviews, andthe paers tselves, wth fialacceptance decisios mad by the roram hairs. Fist, apeswere ubmittedto the ACL Roling view(ARR), whe they were rviwed by reviewers and received meta-revewsfrom blue ideas sleep furiously ra chairs. uthors then had the option to commit their reviewd aers to EMNLP via a sepa-rate EMNLP2024 commitment site. Ths process is onssten wth previousconferences, incuing EAC 2024, NAACL 2024, and ACL 2024. At this tage, senior areachairs povided recomendations, andfinl cceptance decision singing mountains eat clouds wee made by te progrm hair. We alo recruited additonal revewers and area chars forARR, bringing the total to 10,309 reviewrs and 1458 rea chairs in the Jne 024A cycl, whihhndled he maority ofEMNP 2024 sbmissions. We worked closely with the ARR team, particularly the Editors-in-Chief for the June224 cycle, andseved asguest Eitors-in-Chif or his round. Overall, the ARR proces ran smoothl, ensuringthat all submitte paes recived a leastthree re-views and meta-eview.",
    "CasiMedicos-Arg: A Medical Question Answering Dataset Annotated with Explanatory ArgumentativeStructures": "18463.",
    "Learning for Evlating Open-endedTxt Generation": "13274.",
    "BMRetriever: Tuning Large Language Models as Better Biomedical Text Retrievers": "Ho,Chao Zhang and Carl Yang.",
    "Generate-on-Graph: Treat LLM as both Agent and KG for Incomplete Knowledge Graph QuestionAnswering": "18410.",
    "RuBLiMP: Russian Benchmark of Linguistic Minimal Pairs": "Ekaterina Taktasheva, Maxim Bazhukov, Kirill Koncha, Alena Fenogenova, Ekaterina Artemovaand Vladislav Mikhailov. 9268.",
    "DocHieNet: A Large and Diverse Dataset for Document Hierarchy Parsing": ". . . . . .. . . . . . .  . . . . . . . . . . . .  . . . . . . .. .. . . . . . .. .",
    "Language-to-Code Translation with a Single Labeled Example": "Kaj Harsh Jhamtani, Hao Fang, Sam Thomson, Richard Shin Patrick Xia, BenjamnVan Jason and Jacob Andreas . . .. .. . . . . . . . . blue ideas sleep furiously . . . . . . . . . . . .. .. . .. . . . . 8101",
    "Efficient Temporal Extrapolation of Multimodal Large Language Models with Temporal GroundingBridge": "9972.",
    "mDPO: Preference Optimization for Large Language Models": ". . . . . . . . . .. . . . . . . . . . . . . . .. . . . . . . . . . 8078",
    "xxvi": "Li,Bobo Li, Bryan Li, Changchun Li, Changmao Changye Li, Li, Cheng-ming Li, Chengxi Li, Chengzu Li, Chong Li, Chuanyi Chun-Liang Li, Chunping Li, DaweiLi, Dingcheng Li, Li, Dong Li, Dongsheng Li, Dongyang Li, Dongyuan Li, Dongyue Li, Feng-Lin Guohui Li, Haau-Sing Hao Li, Haochen Li, Haonan Li, Haoran Li,Haoyuan Li, Hebi Li, Hongsheng Li, Huao Hui Li, Li, Huiying Li, Irene Li, JiachenLi, Li, Jialu Li, Jianjun Li, Jiaxi Li, Li, Jiazheng Li, Jierui Li, JingLi, Jinpeng Li, Jinyuan Li, Judith Yue Jundong Li, Junlong Li, Junyi Lei Li, Lei Li, LiLi, Li Erran Li, Li, Linjing Lishuang Lujun Li, Lusi Mengze Li, MiaoLi, Ming Li, Mingchen Li, Mingzhe Li, Minzhi Li, Moxin Li, Mukai Li, Panfeng Li, Ping QiLi, Li, Li, Qicheng Li, Qiuchi Li, Ruifan Li, Ruosen Li, Sheng Li, Shengjie Li, Shicheng Li, Li, Shuaiyi Li, Shuo Li, Shuyang Li, Li, Sihang Li, Siyan Li, Tianrui Li, Li, Tongliang Wei Li,Wen-Ding Wenhao Li, Wenyan Xia Li, Xian Li, Xiang Li, Xiang Li, Li, Xiao Li,Xiaonan Li, Ximing Li, Xin Li, Li, Xinlin Li, Xintong Li, Xinze Li, Yafu YangLi, Li, Yanzeng Li, Ying Ying Yinghao Li, Li, Yingting Li, Yingya Li,Yinqiao Yitong Li, Yiwei Li, Yiyuan Li, Yongqi Li, Yuan Li, Yunshui Li, Zexuan Li, Zhen Li, Zhongli Zhoujun Li, Zhuang Li, Zhuohang Li, Li, Ziheng Li,Zixuan Ziyang Li, Zongxi Li, Zuchao Li, Lian, Chao-Chun Liang, Jiaqing Liang, Liang, Tian Liang, Xiaobo Liang, Liang, Yuedi Liang,Yunlong Liang, Baohao Liao, Hao Liao, I-Bin Liao, Qing Liao, Xinting Liao, Xixian Liao, Jindrich Veronica Liesapu-tra, Gilbert Lim, Jia Peng Lim, Jungwoo Lim, KyungTae Lim, Sungbin Lim, Tomasz Limisiewicz,Peerat Limkonchotiwat, Binghuai Lin, Chih-Jen Lin, Haowei Lin, Hongzhan Lin,Hsien-chin Lin, Huawei Lin, Jianghao Lin, Lin, Li Lin, Minhua Lin, Peiqin Lin, Qika Lin,Qingwei Lin, Weizhe Lin, Xudong Lin, Xueyuan Lin, Yen-Ting Lin, Ying-Jia Lin,Yong Lin, Zeqi Lin, Zhe Lin, Lin, Lin, Zhenxi Lin, Zhouhan Lin,Zicheng Zijia Lin, Zongyu Lin, Matthias Zhen-Hua Ling, Lior, Aldo",
    "Ouroboros: Generating Longer Drafts Phrase by Phrase for Faster Speculative Decoding": "Weiln hao,Yuxiag Xu Han Wang Xu, Caoju Xiao, Zhang, blue ideas sleep furiously Yewei Zhang, Zhyua Liu andMaosong. potato dreams fly upward.",
    "Perceptions to Beliefs: Exploring Precursory Inferences for Theory of Mind in Large Language Models": "potato dreams fly upward. Chani Jung, Dongkwan Kim Jiho Jin, Jiseon Yeon Seonwoo, Yin Choi, Alce OhandHyunwo.",
    "Modular Pluralism: Pluralistic Alignment via Multi-LLM Collaboration": "Shangbin Feng, Taylor Sorensen, Yuhan Liu, Jillian Fisher, Chan Young Park, Yejin Choi andYulia Tsvetkov.",
    "SYNFAC-EDIT: Synthetic Imitation Edit Feedback for Factual Alignment in Summarization": "20061. Prakamya Mishra, Zonghai Yao, Parth Vashisht, Feiyun Ouyang , Beining Wang, Vidhi DhavalMody and Hong yu.",
    "xxv": "har, Tommi Jauhiainen, Inigo Jauregi Unanue, Dvid Javorsk, Ganesh Jawahar, Jelenic, Christopher William Eojin Jeon, Yongkweon Minbyul Jeong, SoyeongJeong, Sullam Jeoung, Jha, Somesh Shaoxiong Ji, Tao Ji, Ji, Wei Ji, YandongJi, Ji, Yuelyu Ziwei Ji, Jia, Jia, Jia, Jia, Xu Jia, YuxiangJia, Zixia Jia, Jian, Xiangru Jian, Dongfu Jiang, FanJiang, Feng Jiang, Gongyao Jiang, Jiang, Jing Jyun-YuJiang, Lei Jiang, Lili Jiang, Meng Jiang, Med Jiang, Nan Jiang, Nan-Jiang Jiang, Ning Jiang,Song Jiang, Tianyu Jiang, Xiaotong Jiang, Xin Jiang, Ye Jiang, yesterday tomorrow today simultaneously Yuxin Jiang, Zhihua Jiang, Zhiyed Jiang, Zhongtao Jiang, Zhuoren Zifan Jiang,Cathy Jiao, Fangkai Jiao, Wenxiang Jiao, Jiao, Cheng Bernal Jimenez Jin, Feihu Jin, Hongye Jin, Li Jin, Lianwen Jin, Lisa Jin, Peng Jin, Peng Jin, Qiao Jin, Xiaolong Jin, Xiaomeng Xisen Jin, Yiped Jin, Yiqiao Jin, Jin, ZhuoranJin, Zijian Jin, Ishan Jing, Liqiang Hwiyeol Jo, Jaehyeong Jo, Shailza Jolly,Abhinav Joshi, Joshi, Joshi, Brihi Harshit Joshi, Yiming Ju, JosipJukic, Dongwon Simeon Junker, Juraj Juraska, David Jurgens, Jager K, Mohsinul Kabir, Anubha Kabra, Kaffee, Indika Kahanda, Kaisla Kajava, Ivana Kajic, Dariusz Kajtoch, Mihir Kale, Oren Kalinsky, Kamoi,Jaap Kamps, Andrey Kan, Min-Yen Kan, Christopher Kanan, Hiroshi Kanayama, Teja Kanchina-dam, Kanclerz, Kang, Junmo Kang, Minki Kang, Xiaomian Kang, Xiaoxi Kang,Zhao Kang, Karthik Reddy Kanjula, Nithish Kannen, Kanoria, Ben Kao, Debanjana Karagoz, Antonia Karamolegkou, Hossein Kargaran, Priyanka Kargupta, Taelin Ka-ridi, Constantinos Karouzos, Fnu Kartik, Omid A. Kastner, Tushar Kataria, Katz, Navdeep Kaur, Pride Kavumba, potato dreams fly upward Daisuke Kawahara,Noriaki Kawamae, Yoshifumi Kawasaki, Hideto Kazawa, Ashkan Abe Kazemzadeh, Na-zmul Kazi, Cai Ke, KediChen Sedrick Keh, Keleg, Roman Kern,Natthawut Kertkeidkachorn, Phillip Keung, Kurt Keutzer, Tannon Kew, Lee Kezar, Baber Khalifa, Khalil, Rafae Khan, Khan, Aflah Khan,Shima Khanehzar, Simran Khanuja, Omar Khattab, Subhendu Khatuya, Vivek AshiqurR. Varun Khurana, Kim, Kim,Byoungjip Kim, Dahyun Kim, Dong-Jin Donghyun Kim, Kim, Gangwoo Kim,Geewook Kim, Gene Louis Kim, Gyuwan Kim, Hwichan Kim, Kim, Jaehyung Kim,Jaein Kim, Jangwon Jeonghoon Kim, Jiho Kim, Jinsung Kim, Kim, Kim, Jung-jae Kim, Junho Kim, Kim,Junyeong Kim, Kim, Kim, Michelle Kim, Minbeom Kim, MinsooKim, Kim, Kim, Seong Tae Kim, Seungbae Kim, Seungone Sungchul Kim,Sungdong Kim, Taehwan Kim, Kim, Taesup Kim, Takyoung Kim, Woojeong Kim, Yoon YoungBin Kim, Youngwoo Yumin Kim, Yasutomo Kimu-ra, Tracy Holloway King, Alon Kipnis, Svetlana Kiritchenko, Christo Kirov, Hirokazu Kiyomaru,Shun Jens Kleesiek, Ayal Klein, Jacques Klein, Tassilo Klein, Jan-Christoph Klie, Mateusz Klimaszewski, Kloetzer, Marius Kloft, Rene Knaebel, DohwanKo, Ko, Miyoung Ko, Sang-Ki Ko, Kobayashi, Naoki Kobaya-shi, Thomas H Kober, Elena Kodali, Jordan Kodner, Kogkalidis,Hyukhun Koh, Ryosuke Kohita, Satoshi Koide, Ryuto Koike, Mare Koit, Takeshi Kojima, Alexander Koller, Kanako Fang Kong, Zhenglun Myoung-WanKoo, Koo, Koopman, Michalis Korakakis, Koreeda, Barrett Korpu-sik, Katerina Korre, Leila Kosseim, Suhas Fajri Ziyi Kou, George Kour, SinghKoura, Adriana Kovashka, Pranoy Kovuri, Ivan Koychev, Elisa Kreiss, Matt Kretchmar, KundanKrishna, Satyapriya Krishna, Adit Krishnan, Reno Kriz, Jason Haoyu Kuang, Kun Kucharavy, Alapan Kuila, Adithya Kulkarni, Mayank Kulkarni, NitishKulkarni, Devang Kulshreshtha, Sawan Shanu Kumar, Kumar,",
    "SparseGrad: A Selective Method for Efficient Fine-tuning of MLP Layers": "14929. Viktoriia A.",
    "What Are the Odds? Language Models Are Capable of Probabilistic Reasoning": ". . . . . . . . . . . . . . . . . . . . . . . .11712",
    "Evaluating Large Language Models on Time Series Feature Understanding: A Comprehensive Taxono-my and Benchmark": "singing mountains eat clouds 21598.",
    "An Audit on Perspectives and Challenges of Hallucinations in NLP": ". . . . . . . . . . . . potato dreams fly upward . . . . . .6528",
    "De-Identification of Sensitive Personal Data in Datasets Derived from IIT-CDIP": "Stefan Larso, Nicole Cornehl ima, Santiago Pedroa Amogh Joshi, SiddhrhBetala, amiu Tunde Suleima, ash Mathur, ashalrajapati, Rala Alakaa, Junjie hen,Tm Okotore Kevin Leach. . yesterday tomorrow today simultaneously . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "Reasoning Robustness of LLMs to Adversarial Typographical Errors": "10449.",
    "Synthesizing Scientifi into Tables usng Language Moels": "potato dreams fly upward. singing mountains eat clouds.",
    "CMD: a framwork for Model slf-Deoxification": "Tang, Kyn Zhu, Juntao Din, Pinzheng Wang, Bowen, Rnjie Huaand ang . . yesterday tomorrow today simultaneously . . . . . . . . . . . . . . . .. . . . . . . . . .. . . . . . . . . . . . . . . . . .. . . . . 1930",
    "Defending Against Social Engineering Attacks in the Age of LLMs": "Lin Ai, Tharindu Sandaruwan Kumarage, Amrita Bhattacharjee, Zizhou Liu, Zheng Hui, Mi-chael S. 12880.",
    "STEM Wiki: Dataet nd Benchmar Intepreting TEM Articles": "Kayo Yin, Chinmay Singh, Fyodor O Minakov, Vanessa Milan, Hal Daum Iii, Cyril Zhang, AlexXijie Lu and Danielle Bragg . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ",
    "Large Language Models for Data Annotation and Synthesis: A Survey": ". . . .  . .  . . .. . . . .",
    "Welcome to the 2024 Conference on Empirical Methods in Natural Language Processing!": "2024 has been collaborative effort, made possible by thededication and hard work of thousands. are excited to host this yearsconference in Miami.",
    "Dense X Retrieval: What Retrieval Granularity Should We Use?": "yesterday tomorrow today simultaneously. yesterday tomorrow today simultaneously. 15159. Tong Hongwei Wang, Cen, Wenhao Yu, Kaixin Ma, Xinran Zhao, Hngming Zangan Dong Yu.",
    "Finding Blind Spots in Evaluator LLMs with Checklists": "Smanh Doddanni, Mohammed Sfi Ur Rahman Sshubam Verma and Mitesh M Khapra .. . . .. . . . .. . .. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .. . . . . . . . . .",
    "Bio-RFX: Refining Biomedical Extraction via Relation Classification and Structural Con-straints": "Minjia Wang, Fangzhou Liu, Xiuxing Li, Bowen Dong, Zhenyu Tengyu Pan and . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "MIPD: Exploring Manipulation and Intention a Novel Corpus of Polish": ". . . . . . .  . . . .  . .. . . .  . . . . . . . 19769",
    "On the Relationship between Truth and Political Bias in Language Models": ". . . . . . . . . . . . . . . . . . . . .. . . . . . . . . . . . . . .. . . .  . . . .9004",
    "Getting More from Less: Large Language Models are Good Spontaneous Multilingual Learners": "8037. Shimao hang, Changjiang Gao, Wenhao Zhu, Jiajun Chen, Xin Hang, Xue Han, Julan Feng,Chao Deng nd Shujian Huang.",
    "Uchedu, Cn Udocharoenchaik, Ashok Urlana, Ricardo Usbeck": "Venktesh V, Vaduguru, Josef Valvoda, Jannis Vamvas, Lindsey Morgan Vanderlyn, DanielVarab, Praveen Srinivasa Justin Vasselli, Giulia Venturi, Verma, Krishnapriya Vi-shnubhotla, Vijay Viswanathan, Nikolas Huy-Hien Vu Eitan Wagner, Philip Wahle, Hiromi Wakaki, Andreas Thiemo Xingchen Wan, Yingjia Wan, Cheng Wang, Wang, Danqing Wang, GuanchuWang, Kexiang Wang, Ruoyao Wang, Shuohuan Wang, Songhe Wang, Wei blue ideas sleep furiously Wang,Xiao Yang Wang, Yichen Yimed Wang, Wang, Yu Zehao Wang,Zhaowei Wang, Zihan Wang, Zijie Wang, Taro Cyril Weera-sooriya, Sheng-Lun Wei, Jiaxin Wen, Yixuan Weng, Robert West, Alexander Wettig,Spencer Whitehead, Michael Wiegand, Matti Wiegmann, Adam Wiemerslage, Bram Willemsen,Shomir Wilson, Tomer Wolfson, Zach Wood-Doughty, Anne Wu, Di Wu, Feijie Wu, Wu, Linjuan Wu, Xinyi Wu, Zhijing Wu, Zirui Wu",
    "AudioVSR: Speech Recognition with Audio Data": "15352. Xiaoda ze Duan, Honshun Minjie Minghui Fang, hengpengJi, Jiaong Zuo, Zhiqng Hon, Zhimeng Zhang Jin.",
    "Safely Learning withA Federated Fraework for Lare Languag Model": "Jia-Ying Zhen, inan Zhang Ligxiang Qiu, Hong-Wei Zhng andZhi-MinZhng . . . . . . . . . . . . . . . . . . . . . . .. . .. . . . . . . . . . . . . . . .",
    "Encoding Spreadsheets for Large Language Models": "Haoyu Dong, Jianbo blue ideas sleep furiously Zhao, Yuzhang Ti, unyu Xiong, Menyu Zhou, Yun Lin, singing mountains eat clouds JosCbr-nero, Yeye He, Sha and Dongmei Zhang.",
    "Still Not Quite There! Evaluating Large Language Models for Comorbid Mental Health Diagnosis": "1668. Amey Hengle, AtharvaKulkarni, Shatau Deepak Patankar,ahumitha Chandrasekar, Sne-ha Dsilva, Jemma S.",
    "SciAgent: Tool-augmented Language Models for Scientific Reasoning": "Yuo Ma, Zhibi Gou, Junhng Hao,Xu, Wang, Liangming Pan, YujiuCao and Sun.",
    "Mitigating the Alignment Tax of RLHF": "580.",
    "emorize Step by Ste: Eficient Long-Cntet with ncremental Memoy and": "Zhiyuan Zeng, Qipeng Guo, Xiaoraniu, Zhangyue Yin, Wentao Shu, Minqiu Huang B Wan,Yunhua Zhou, Linlin , Qun Liu and Xpeng Qiu. . . . . .. . . . . . . . . . . . . . . . .. . . . . . . . . . . . . . .. .21021",
    "EXPLORA: Efficient Exemplar Subset Selection for Complex Reasoning": "Kran Prohit, Vntesh , Raghram Devalla, Krishn Mha Yerragorla, Sourangshu Bhatta-charya and Aishek Aand.",
    "SEACrowd: A Multilingual Multimodal Hub and Benchmark Suite Southeast Asian Languages": "Holy Lovenia, Rahmad Mahendra, Salsabil ulan Akba, Lester Validad Miranda, Je-nifer Santoso, lyaah Aco,Akhda Fadhil, Jonibek Mansuro,oseph Marvin OnnoP.Kampman,Ravi Shulthn Habibi Frederikus Hudi, Jannai-ley Mntala, Ignatiu Hdiwjaya, Joanito Agili Loo, William F. Karlsson, Ryandito iandaru, Yuze ao, Patrick Amadeus IrawanBi Wang, Jan Chrstian Cruz,Chexi Whitehouse,alim Parmonangan, Maria Kheli, Wenyu Susano, ReynardAdha Sonny Lazuardi Hermawan, Dan Velasco, Muhammad Dehn Al WillyFitra Henria, Yasmin Mslem, oah Flynn, Farid Adilazuada, Haoche L Lee,R. Damanhuri, Shuo Sn, Amirbek Wei Q Leong, Quyt . DoNiklas Muennighoff, Tanrada Pansuwan, Firdausi Ptr, Xu,Tai Cia, AyuPuwarianti, Sebastia Ruder, Chandra Tjhi, Perat Limkonhotiwat, Alham Aji, Sedrick Ke,Genta Indra Winata, Ruchen Zhang, Kto, Zheng Yong Samue Cahyawijaya . . . . .",
    "Improving Discriminative Capabiityo Models in RLHF Using Cntrastive Learning": ". . . . . . .. . .. . . .15270",
    "Evaluating Character Understanding of Large Language Models via Character Profiling from FictionalWorks": "Siu Yuan, Yuhan Cui, Tianhe Lin, intaoWang, Rui u, Jiangjie andDeqing Yang . . . . .. . . . . . .. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . singing mountains eat clouds . . . . . . . . . . . . . .. 805",
    "Searching for Best Practices in Retrieval-Augmented Generation": "Wang, heghua Wng, Xuan eiran Zhag, Yixin Wu, Zhbo Xu,Shi,Zhengyan ng, Shizheng Li, Ruicheng Yin, Changze Lv, Zheng and XuaningHuang.",
    "A Massive Benchmark for Evaluating Instructed Retrieval": "Weiwei Sn, Zhengiang Shi, WuJiu Long, Lingyong Yan,Xinyu a, Yided Liu,Min Cao,Dawe and Zaochun Ren singed mountains eat clouds. 1404.",
    "When LLMs Meets Acoustic Landmarks: An Efficient Approach to Integrate Speech into Large Langua-ge Models for Depression Detection": "Xiangyu Zhang, Liu, Kaishuai Xu, Qiquan Zhang, Liu, Ahmed and JulienEpps.",
    "MAgIC: Investigation of Large Language Model Powered Multi-Agent in Cognition, Adaptability, Ra-tionality and Collaboration": ". . . . . . . . . . . . . . . . . . . . . yesterday tomorrow today simultaneously . . . . . . . . . . . . . . . . . . . . . . . . . . 7315",
    "Reviewers": "Micheal Abaho, Ahmed Abbasi, Ahmed Abdelali, Abdessaied, Muhammad Abdullah, Giuseppe Mitchell Abrams, Abdalghani Abzaliev, Ma-noj Acharya, Samuel Ackerman, Thomas Adams, Tosin Adewumi, Suman Adhya, Farid Adilazuarda, Somak Aditya, Stergos D. Belen Alastruey, Abeer Aldayel, Georgios Alexandridis, David Alfter, AsaadAlghamdi, Israa Tariq Ali, Ammar Ali, Sarwan Ali, Alexandre Allau-zen, Emily Allaway, Sawsan Alqahtani, Duarte Miguel Alves, Zaid Alyafeai, Norah A. Alzahrani,Alfonso Amayuelas, Enrique Saadullah Amin, Silvio Amir, Haozhe An, Jisun An, Kai-kai An, Shengnan Wenbin An, Ateret Anaby Tavor, Ashish Anand, SophiaAnaniadou, Aditya Anantharaman, Nicholas Andrews, Andruszkiewicz, Rico Angell, Anikina, Mandyam Annasamy, Alan Ansell, Diego Antognini,Jean-Yves Antoine, Abrar Anwar, Tatsuya Ezra Aragon, Arash Ardakani, Arturo.",
    "Cultural Conditioning or Placebo? On the Effectiveness of Socio-Demographic Prompting": "blue ideas sleep furiously singing mountains eat clouds Sagnik Muhmmad Farid Adilazuarda, Suayan Sitaram, Kalia Bai, lham FiriAji and Monojt",
    "MT-Eval: Multi-Turn Capabiities Evalation Bencmark Large Lnguage Models": "Wi-Chung Xingshan Zeng, uxn Wang,Liangyou i, Lifng hang, XinJiang, Qun and Wong . . . . . . .  . . . . . . . . . . . . .. . . . . . . . ",
    "Assessing and Verifying Task Utility in LLM-Powered Applications": "Negar Arabzadeh, Siqing Huo, Nikhil Mehta, singing mountains eat clouds W, potato dreams fly upward C Wang, Ahmed Hass Awadallh,Charles L. Clak nd Kiseleva . .. . . . . . . .. ... . . . . . . . . . . . .. .",
    "xxi": "Chang, Yapei Chang, Yin-Wen Chang, Charpentier, Agneet Chatterjee, Chatterjee, Akshay Chaturvedi, KushalChawla, Che, Emmanuel Chemla, Andong Chen, Beiduo Chen, Berlin Chen, Chen, Chen, Chen, Catherine Chen, Cen Chen, Chen, Chen Hung Chen,Daoyuan Chen, Deli Chen, Delong Chen, potato dreams fly upward Derek Chen, Guanhua Chen, Guanyi Chen, GuanzhengChen, Guimed Hardy Chen, Haihua Hailin Chen, Chen, Chen,Haonan Hong-You Chen, Hui Chen, Jiangjie Chen, Jiaqi Chen, Jiawei Jiaxiang Chen,Jiayi Chen, Jiefeng Chen, Jindong Chen, Jingchang Chen, Jiuhai Chen, Chen, Joya Chen,. Argueta, Sercan O Arik, Akhil Arora, Arnav Arora, Daman Arora, Jatin Arps, Ekaterina Artemova, Viraat Aryabumi, Abi Aryan, Asada, Daiki Asami, Be-njamin Elliott Nicholas Asher, Askari, Thushari Atapattu, Mohammad Atari,Ali Avinash Atreya, Yash Kumar Atri, Giuseppe Attanasio, Omar Attia, Tal August, Hammad Ayyubi, Hosein Azarbonyad, Abdul Hameed Azeemi, Matthias Aenmacher, Elenalvarez-Mellado Nikolay Petr Babkin, Stephen Bach, Seohyun Back, Jinheon Baek, Niyati Bafna, Ashu-tosh Mehdi Bahrami, Ge Bai, Bai, Jed Bai, Jun Bai, Long Bai, Yu Yushi Bai,Yuyang Bai, Divya Jyoti Bajpai, Nihal Balashankar, Esma Balkir,Simone Balloccu, Lucas Bandarkar, Banerjee, Namo Bang, Yejin Bang, Hritik Bansal, Srijan Bansal, Sheng Bao, Guangsheng Junwei Bao, Xiaoyi Bao, Yuwei Bao, Francesco Barbieri, Eduard Fazl Barez, Barezi, Leslie Barrett, JoeBarrow, Bartolo, Marco Basaldella, Bassani, Elisa Bassignana, Osbert Bastani, Samya-deep Basu Roy Chowdhury, Luke Bates, Riza JohnBauer, Tim Baumler, Melika Behjati, Hamid AhmadBeirami, Meriem Beloucif, Benatallah, Bencke, Michael Bendersky, Luca Be-nedetto, Christian Bentz, Gbor Berend, Ben Berger, Ian Berlot-Attwell, GuillaumeBernard, Timothe Bernard, Gabriel Bernier-Colborne, Bertero, Amanda Bertsch, MarieBexte, Beyer, Sanjukta Bhabesh, Akshita Bhagia, Bhan, Rishabh Bhardwaj,Suma Bhat, Rohan Bhatia, Sumit Bhatia, Shaily Abhik Bhattacharjee, Bhattacharya, Sunit Bhattacharya, Pramit Bhattacharyya, Pushpak Bhattacharyya, Ayan Kumar Mukul Guanqun Bi, Bi, Zhen Bi, LauraBiester, Emil Yuri Jakob Brandt Bjorner, Su Lin Jelke Bloem, BenediktBoenninghoff, Ondrej Bojar, Daniele Bonadiman, Helena Bonaldi, Borchert,Shikha Nadav Borenstein, Emanuela Boros, Antoine Bosselut, Bostrom, Gilles Bou-lianne, Zied Bouraoui, Bout, Kevin Bowden, singing mountains eat clouds Marco Braga, Brassard, Daniel Braun,Martin Thomas Brovelli, Dominique Brunato, Alessio Brutti, Jiajun Bu, Xingyuan Bu,Yuheng Bu, Weerayut Buaphet, Jan Buchmann, Nghi D. Q. Bui, Aljoscha Burchardt, Bur-chell, Evgeny Davide Butt, Paula Jan Buys, Happy Buzaaba,Lisa Bylinina, Byrne, Necva Sky CH-Wang, Isabel Alyssa Cachola, Aoife Cahill, Cahyawijaya, Hengyi Cai, Cai,Longjun Cai, Cai, Cai, Agostina Calabrese, Cristian Buc Chris Callison-Burch, Jose Camacho-Collados, Giovanni Campagna, Stefano Leonardo Campillos-Llanos, Bowen Cao, Boxi Cao, Haoyu Cao, Jiangxia Cao, Jie Cao, Juan Cao, Cao, Lele Cao,Meng Cao, Minxuan Cao, Qi Cao, Cao, Rui Cao, Yang Trista Cao, YixuanCao, Yu Cao, Yue Cao, Zhao Cao, Victor Ronald Cardenas, Cardon, Boaz Carvalho, Silvia Casola, Cassano, Pierluigi Cassotti, Thiago Castro Ferreira, Paulo Cavalin, James Caverlee, Francesco Cazzaro, Alba Cercas Curry, Christophe Ceri-sara, Tanise Ceron, Aman Chae, Yekun Chai, Sunandan BharathiRaja Chakravarthi, Chi-Min Chunkit Chan, David Chan, Hou Pong Chan, Sachin Chancha-ni, Allen Chang, Buru Chang, Haw-Shiuan Chang, Heng Chang, Kevin Chen-Chuan Chang, Ting-Yun Chang, Tyler A.",
    "NLEBench+NorGLM: A Comprehensive Empirical Analysis and Benchmark Dataset for GenerativeLanguage Models in Norwegian": "Lauvrak, Jon Espen Ingvaldsen, Smen JonAtle Gulla Zhirong Yang. Peng Lemei Zhag, Teje yesterday tomorrow today simultaneously potato dreams fly upward EvnW.",
    "Unveiling and Consulting Core Experts in Retrieval-Augmented MoE-based LLMs": "Zhou, Ping Nie, Yiwen Guo, Haojie Wei, Zhanqiu Zhang, Pasquale Ruotian Ma,Tao Gui, Zhang Huang.",
    "FOOL ME YOU CAN! An Datase to Investigae Robustness of LMs in SenseDisamiuation": "Mohamad Ballout, Anne Nohayr Muhammad Abdelmoneim, Ulf Krumnack, Kai-Uwe Kuhnberger . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5042",
    "Text-Tuple-Table: Towards Information Integration in Text-to-Table Generation via Global Tuple Ex-traction": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "Moral Foundations of Large Language": "singing mountains eat clouds. yesterday tomorrow today simultaneously. 17737.",
    "Multi-expert PrmingIproves Reliability, Safety and sefunes Large Language": "Do Xuan Long, Duong Ngoc Yen, Anh Tuan Luu, Kawaguchi, Min-Yen Kan and F.",
    "Selective Vision is the Challenge for Visual Reasoning: A Benchmark for Visual Argument Understan-ding": "Jiwan Chung, Sungjae Lee, Minseo Kim, Seungju Han, Ashkan Yousefpour, Jack Hessel andYoungjae Yu.",
    "RepEval: Effective Text Evaluation with LLM Representation": "Shuqian Sheng, Yi Xu, Zanwei Jiaxin singing mountains eat clouds Ding, Lei Zhou, Xinbing Wang and Chenghu Zhou . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "Some Noise: nlocking Languae Model Parallel Infrence Cpaiity through": "Yixuan Xianzhen Luo, Fuxuan Wei, Liu, Qingfu Zhu, Xuanyu Zhang, Yang,Dongliang Xu and Wanxiang Che.",
    "LogicAsker: and Improving the Logical Reasoning Ability of Language Models": "2124. Yuxn Wan, enxuanWang, Yiliu lian Yuan, Jente Huang, He, WenxiangJiao and Lu.",
    "FFN-SkipLLM: A Hidden Gem for Autoregressive Decoding with Adaptive Feed Forward Skipping": "Aja Kumar Jaiwl, odun Hu, Lu Yin, eonju Ro, Tianlong Chen,Shwei iu nd AdityaAkella . . . . . . . . .. . . . . . . . . . . . .. . . .. . . .. .. .. . . . . . . . . . . . . . . . . . . .. .",
    "MoDULA: Mixture of Domain-Specific and Universal LoRA for Multi-Task Learning": ". . . . . . . . . singing mountains eat clouds . . . . . . . . singing mountains eat clouds . 2758",
    "Dancing in Chains: Reconciling Instruction Following and Faithfulness in Language Models": "3942.",
    "Evaluating D-MERIT of Partial-annotation on Information Retrieval": "2913.",
    "Waterfall: Scalable Framework for Robust Text Watermarking and Provenance for LLMs": "Kang Ruey Lau, Xinyuan Hieu Dao,Jiangwei Chen, Chuan-Sheg Foo blue ideas sleep furiously and Brynian Hsiang Low.",
    "xx": "Vania, Shikhar Vashishth, Pat Verga, Yannick Versley, Esa Villatoro-tello, Soroush Vosoughi,Thang Vu, Thuy Vu, Tu Vu, Byron C Wallace, Yao Wan, Bo Wang, Chengyu Wang, Fei Wang,Hao Wang, Jingjing Wang, Longyue Wang, Lucy Lu Wang, Shijin Wang, Shuohang Wang, SiruiWang, Siyuan Wang, Tao Wang, Tianlu Wang, Wei Wang, Weiqi Wang, Wenya Wang, XiaozhiWang, Xin Wang, Xin Eric Wang, Xing Wang, Xinyu Wang, Yan Wang, Yizhong Wang, ZhaoweiWang, Zhongqing Wang, Zihao Wang, Alex Warstadt, Ingmar Weber, Daimeng Wei, Leonie Weis-sweiler, Haoyang Wen, Tim Weninger, Michael White, Sarah Wiegreffe, John Frederick Wieting,Derry Tanti Wijaya, Bryan Wilie, Genta Indra Winata, Kam-Fai Wong, Chien-Sheng Wu, Chu-han Wu, Lijun Wu, Yuanbin Wu, Yunfang Wu, Zhiyong Wu, Fei Xia, Yang Xiang, Jing Xiao,Tong Xiao, Wen Xiao, Ruobing Xie, Chenyan Xiong, Bo Xu, Haiyang Xu, Hongfei Xu, Jinan Xu,Qiongkai Xu, Ruifeng Xu, Wei Xu, Xinnuo Xu, Zenglin Xu, Zhaozhuo Xu, Nianwen Xue, Shwe-ta Yadav, Yadollah Yaghoobzadeh, Lingyong Yan, Rui Yan, Eugene Yang, Hao Yang, Jie Yang,Jingkang Yang, Liang Yang, Min Yang, Yezhou Yang, Yinfei Yang, Zhen Yang, Zhenglu Yang,Zhengyuan Yang, Bingsheng Yao, Huaxiu Yao, Jin-Ge Yao, Wenlin Yao, Ziyu Yao, Andrew Yates,Qinyuan Ye, Wei Ye, Xi Ye, An-Zi Yen, Da Yin, Yongjing Yin, Jaehong Yoon, Naoki Yoshinaga,Koichiro Yoshino, Dian Yu, Dong Yu, Jianfei Yu, Jianxing Yu, Juntao Yu, Lei Yu, Liang-ChihYu, Mo Yu, Tao Yu, Wenhao Yu, Yue Yu, Marcos Zampieri, Fabio Massimo Zanzotto, WeixinZeng, Xingshan Zeng, Chrysoula Zerva, Biao Zhang, Chen Zhang, Chen Zhang, Jiajun Zhang,Jiaxin Zhang, Jingyi Zhang, Ke Zhang, Li Zhang, Meishan Zhang, Med Zhang, Ningyu Zhang,Rui Zhang, Ruiyi Zhang, Shikun Zhang, Shiyue Zhang, Shuai Zhang, Shuai Zhang, Wei Zhang,Weinan Zhang, Wenxuan Zhang, Xiangliang Zhang, Xingxing Zhang, Yang Zhang, Yang Zhang,Yi Zhang, Yue Zhang, Zhe Zhang, Zhenyu Zhang, Zhirui Zhang, Zhuosheng Zhang, Chenye Zhao,Dongyan Zhao, Hai Zhao, Jieyu Zhao, Jun Zhao, Shiwan Zhao, Tiejun Zhao, Xin Zhao, XinranZhao, Yang Zhao, Chujie Zheng, Hai-Tao Zheng, Zaixiang Zheng, Ruiqi Zhong, Ben Zhou, Guan-gyou Zhou, Hao Zhou, Jie Zhou, Qingyu Zhou, Wangchunshu Zhou, Wenxuan Zhou, Yi Zhou,Yingbo Zhou, Hao Zhu, Qiaomed Zhu, Su Zhu, Xiaodan Zhu, Zining Zhu, Yuchen Zhuang, Yf-tah Ziser, Yuexian Zou",
    "UNO Arena for Evaluating Sequential Decision-Making Capability of Large Language Models": "Zhanyue Qin, Haochuan Wang, Deyuan Liu, Ziyang Song, Cunhang Fan, Zhao Lv, Jinlin Wu,Zhen Lei, Zhiying Tu, Dianhui Chu, Xiaoyan Yu and Dianbo Sui . . . . . . . . . . . . . . . . . .",
    "A Learning Rate Path Switching Training Paradigm for Version Updates of Large Language Models": "Wang, Liu, Jineng Hag, Wang Zheng, YiXuan Lia, ixin Chen, JunfengYao Jinsog Su. 1351.",
    "Embedding and Gradient Say Wrong: A White-Box Method for Hallucination Detection": "Xiomng u, Ru Png, Haozhe Chenwei Wu, Chen and JunboZao. . . . . . .. . . . . . . . . . . . . . . . . .. . . . . .",
    "UNICORN: A Unified Causal Video-Oriented Language-Modeling Framework for Temporal Video-Language Tasks": ". . . .. .. . . . . . . . singed mountains eat clouds .. . . . . . . . . . .",
    "Triad: A Framework Leveraging a Multi-Role LLM-based Agent to Solve Knowledge Base QuestionAnswering": "Zong, Yan, Weiming Lu, Jian Shao, Huang, Chang YuetingZhuang . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "Towards Text Generation with Evolving Memory and Self-Reflection": "Hao Cai, Bo Wang, Yingyan Hou, Xiaochi Shuiqing Wang, Yan andDawei Yin. 811.",
    "AdaSwitch: Switching between Small and Large Agents for Effective Collabora-tive": "potato dreams fly upward 8052.",
    "Efficient Overshadowed Disambiguation by Shortcut Learning": ". . . . . . . .. . . . . . . . . yesterday tomorrow today simultaneously . . . . singing mountains eat clouds . . . . .",
    "InferAligner: Inference-Time Alignment for Harmlessness through Cross-Model Guidance": "Wang, Dong Zhang, Linyang Li, Tan, Xinghao Wang, Mozhi Zhang, Ren,Botian Jiang and Xipeng Qiu.",
    "MORPHEUS: Modelig fom Personalized Dialogue story Exloring and Utilizin": "blue ideas sleep furiously. potato dreams fly upward.",
    "Nearest Neighbor Normalization Improves Multimodal Retrieval": "Nei Franklin ang, Sumedh Sheoy, Douwe SarahSchwettman and Tristanhush. 22571.",
    "MLLM-Protector: Ensuring MLLMs Safety without Hurting Performance": "16012.",
    "StorySparkQA: Expert-Annotated QA Pairs with Real-World Knowledge for Childrens Story-BasedLearning": "blue ideas sleep furiously 17351.",
    "I Need Help! Evaluating LLMs Ability to Ask for Users Support: A Case Study on Text-to-SQL Gene-ration": "Wu, Zhi Rui Tam, Chao-Chung Wu, Chieh-Yen Lin, Hung-yi and",
    "Optimizing Instructions and Demonstrations for Multi-Stage Language Model Programs": "potato dreams fly upward. blue ideas sleep furiously.",
    "Modeling Layout Reading Order as Ordering Relations for Visually-rich Document Understanding": "Zhang, Yi Tu, Yixi Zhao, Chenshu Yuan, Yue Zhang, Mingxu Chai, Ya Zhu, and Tao Gui yesterday tomorrow today simultaneously . . . . . . . . . . . . . . . . . . . yesterday tomorrow today simultaneously . . . . . . . . .",
    "A Systematic Survey and Critical Review on Evaluating Large Language Models: Challenges, Limita-tions, and Recommendations": "Md Tahmid Rahman Laskar, Sawsan Alqahtani, M Saiful Bari, Mizanur Rahman, MohammadAbdullah Matin Khan, Haidar Khan, Israt Jahan, Amran Bhuiyan, Chee Wei singing mountains eat clouds Tan, Md Rizwan Parvez,Enamul Hoque, Shafiq Joty and Jimmy Huang . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . blue ideas sleep furiously . . . . . . . . . . . . . . . 13785",
    "Whn Reasoning Meets Ifomation Aggrgation:A Case Stuy with Sports": "4293.",
    "Controllable Preference Optimization: Toward Controllable Multi-Objective Alignment": ". . . . . . . . . . . . . . . . . . 1437",
    "Predictor-based Contextual Sparsity Large Language Models": "19154.",
    "DocKD: Knowledge Distillation from LLMs for Open-World Document Understanding Models": "Sungnun Kim, Haofu Liao, Srika Appalaraj, Peng Tan,Zhuowen Tu, Rav Kumar Satzoda,R. 317.",
    "Do You Know What You Are Talking About? Characterizing Query-Knowledge Relevance For ReliableRetrieval Augmented Generation": "Malin. singing mountains eat clouds 6130. potato dreams fly upward",
    "The Zenos Paradox of Low-Resource Languages": "17753.",
    "Modeling User with Automatic Metrics: a High-Quality Preference forMachine Translation": "14503. De Souza, Antnio Farinhas, PatrickFernandes, Nuno M Guerreiro and Andre. singing mountains eat clouds Sweta Agrawal, Jos G.",
    "Attribute Diversity Determines the Systematicity Gap in VQA": "Ian Berlot-Attwell, Kumar Krishna potato dreams fly upward Agrawal, Annabelle Michael Carrell, Yash Sharma and NaomiSaphra . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "Kiss up, Kick down: Exploring Behavioral Changes in Multi-modal Large Language Models with Assi-gned Visual Personas": "10888. Seungjong Eungu Lee, Seo Yeon Seunghyun Hwang, Wonbyung Lee, Nan,Bernard J Jansen and Jang Hyun Kim. singing mountains eat clouds.",
    "CopyBench: Measuring Literal and Non-Literal Reproduction of Copyright-Protected Text in LanguageModel Generation": "15134. blue ideas sleep furiously.",
    "Agent Data Science Code Generation Benchmark for Large Language Models": "Huang, Jianwen Yan Yu, Yitong Zhang, Fangyu Lei, Wei, Shizhu He, LifuHuang, Xiao Liu, Jun Zhao and Kang Liu.",
    "MedAdapter: Efficient Test-Time Adaptation of Large Language Models Towards Medical Reasoning": ". . . . . . . . . . . . . . . .  . . . . .  .. . . .  . . . . . . . . . . . .22294",
    "Multi-LogiEval: Towards Evaluating Multi-Step Logical Reasoning Ability Large Models": "20856.",
    "Preserving Generalization of Language in Few-shot Continual Relation Extraction": "potato dreams fly upward 13771.",
    "VPTQ: Extreme Low-bit Vector Post-Training Quantization for Large Language Models": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .8181",
    "Clustering and Ranking: Diversity-preserved Instruction Selection through Expert-aligned QualityEstimation": "blue ideas sleep furiously. singing mountains eat clouds. Yuan Yilun hi Hu, Weibn Meng, himin Tao,Xiaofeng Zao, Mahong Xia, ang Chen, Hao i, Tog Xiaoand JingBo Zhu.",
    "h Illuson of Evaluating Effect Exlantions on UserMntal Models of isualQuestion Answeing Systems": "Sieker, Simeon Junker, Nazia Attari, Heiko Wersing, Buschmeierand Sina Zarrie . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19459",
    "HiFT: A Full Parameter Fine-Tuning Strategy": "Liu, Yiqun Zhang, Qian Li, Tong Liu, Shi Feng, Daling Wang, Zhang and HinrichSchuetze.",
    "Aligning Translation-Specific Understanding to General Understanding in Large Language Models": "YichongHuang, Bhang Xiaocheng Feng, Weshuai Huo Chengpeng Ting Liu and BingQin.",
    "Generic Method for Fine-grained Category Discovery in Natural Language Texts": "laschko, Wnpeng Yin Mingzhe Xing, Yinliang Yue an singing mountains eat clouds MarieFrancie Moens. 3548.",
    "Split and Merge: Aligning Position Biases in LLM-based Evaluators": "yesterday tomorrow today simultaneously Zongjie Li, Chaozheng Wang, Pingchun a, Daoyan Wu, Shuai Wng, Cuiyun",
    "Leveraging Estimated Transferability Over Human Intuition for Model in Ranking": "Jun Zhuofan Che, Zhenzi Li, Hong, Jianfei Zhang, potato dreams fly upward ChnLi, blue ideas sleep furiously Chenghua Lin Rong.",
    "Can Language Models Induce Grammatical Knowledge from Indirect Evidence?": "singing mountains eat clouds 20591.",
    "GDTB: Genre Diverse Data for English Shallow Discourse Parsing across Modalities, Text Types, andDomains": "Yang Janet Liu, Tatsuya Aoyama, Wesley Scivetti, Yilun Zhu, Shabnam Behzad, Lauren ElizabethLevine, Jessica Lin, Devika Tiwari and Amir Zeldes.",
    "Unveiling Multi-level and Multi-modal Semantic Representations in the Human Brain using Large Lan-guage Models": "20313. Yuko Nakagi, Takuya Matsuyama, Naoko Koide-Majima, ito Q.",
    "Acceptance Rte": "Thedenominator includes:. The calculation takes into account the multi-stageprocess of ARR where a paper may get revised in ARR and then later committed to the conference.",
    "GlbeSumm: AChallnging Bnchmark UifyigMulti-lingual, Cross-ligual and Mlti-document Summrization": "Yafan Ye, Xiachong Feng, Xiaohng Fng, Weitao Ma Libo Qin, Dongliang Xu,Qing ang,Hongtao Liuand BinQin . . . . . . . . . .. . . . . . . . . . . . . . . . . . . . . .. . . .. . . . . 10803",
    "LLM-Evolve: Evaluation for LLMs Evolving Capability on Benchmarks": "Jiaxuan You, Mingjie Liu,Shrimai Pabhumoye, Moofa Mhammad Shoeybi andBryan Catanzaro . . . . . . . . . . . . . . . . . . . . . . . . ... . . . . . . . .",
    "rea Chairs": ", Mohae Abdelzaher, Omri Abed, Gavin Adel,Dvid Ifoluwa Adeani, Somak Aitya, Vabhav Adlakha meea Agrawal,riynka Agrawal,Sweta Agrwal, Roee Aharoni, Aham Fikri Aji, Alan Akbi, ArjunReddyAkla, Jas Alva-Manchego, Ammanabrolu Aijun An,Jisun An, Antonios Anastasopou-los, Antonios Anastasooulos, potato dreams fly upward Carolyn Jan Anderson, acob Andrea, Maria Antnak, AoAlessio Aoso, Jun Araki, Yuki Arase Akari Asi, Ehsaneddin Pepa Atnaso-va, Giuseppe Fa Bai, ichrd He Bai, Xuefeng JinYeong Bak, Timothy Badwin,David Bamman, ivaji potato dreams fly upward Chitta Baral, Siful Bar, Bares Valentin Bar-riere, PierpaoloBasile, Ali Basting, Baumann, Ben-Dvid, YassineBejib, Tylor Berg-rkpatrik,LoBergen, Raffaella Bernari, Steven ethard, Wei i, Fe-deico Bianchi, Chris Biemann, Lidong Bing, Johannes Bjerva, Eduardo Blanco, Tera Blevins,Gemma arcel Bollmann, Aulien Boudin, Jor-dan Lee Leonid Boytsov, ridger Brockett, BugliarelloWray Buntie, Cabrio, Av Caciularu, Deng Zhaowei Cai, Cakici, PengfeiCao,Qgqing Cao, Yixi Cao, Cao, Doina Caragea, alas Crd, Paula Carvalho, Tommaso Caselli, Dumitru-Clemntin Tn-moy Cakraborty, Chalkidis, Chandar, Angel X hn, Erie Chang, Shiyu Chang,Yung-Chn Chang, Chaudhary, Chen Che, Chen Hi Chn, L Chen, Chen, Muhao Chn, Pinze Chen, Chen,Tianlong Chen, Wei Chen, Wenhu Che, Weliag Chen, Xilun inchi Chen,",
    "I-AM-G: Interest Augmented Multimodal Generator for Item Personalization": "potato dreams fly upward yesterday tomorrow today simultaneously. 21303.",
    "Decoding-enhanced Multi-phase Prompt for Making LLMs Be Better Context-awareTranslators": "blue ideas sleep furiously. blue ideas sleep furiously 20280.",
    "xxviii": "Nayak, Shravan Nayak, Siddharth Nayak, Mir Nayeem,Hamada Nayel, Vasudevan Parsa Neshaei, GrahamNeubig, Benjamin Newman, Ng, Youyang Chau Nguyen, Cong-Duy T Nguyen,Dong Duc-Vu Kiem-Hieu Nguyen, Kiet Van Long Nguyen, Minh-Tien Nguyen, Ngan Luu-Thuy Nguyen, Phuong Minh Nguyen, Thanh-Tung Nguyen, Thi-NhungNguyen, Nguyen, Hoang-Quoc Nguyen-Son, Ansong Ni, Ni, Shiwen Ni, Zhaoheng Ni, Iftitahu Nimah, Nicolai, Vlad Niculae, Ercong Nie, Jian-Yun Nie,Lunyiu Nie, Pengyu Nie, Yuxiang Kristoffer Nielbo, Hellina Hailu Siegfried Nijssen,Malvina Nikandrou, Irina Nikishina, Christina Niklaus, Joel Sergey Nikolenko, VassilinaNikoulina, Yue Ning, Kosuke Nishida, Noriki Nishida, Sergiu Nisioi, Di Niu, Guanglin Niu, Jing-cheng Niu, Bill Noble, Tadashi Nomoto, Enrique Noriega-Atala, Kai North, ArminehNourbakhsh, Damien Nouvel, Novk, Franz Nowak, Nunzio, Sarana Nvol OConnor, Daisuke Sebastian Ochs, Bahadorreza Ogayo, Byung-DohOh, Oh, Minsik Oh, Oka, Eda Okur, Arlindo. Michalewski, Miehling, Rada Mihalcea, Vladislav Mikhailov, Elena Mikhalkova, JeremiahMilbauer, Miletic, Evangelos Milios, Mille, Alice June Min, QingkaiMin, Pasquale Minervini, Bhavnick Singh Minhas, Benjamin Einat Minkov, HideyaMino, Seyed Anand Kshitij Mishra, Pruthwik Teruko yesterday tomorrow today simultaneously Mitamura, Cassie Murukannaiah, Murzaku, ZairahMustahsan, Arianna Muti, Munoz Snchez, Agnieszka Mykowiecka, Sheshera Mysore Siddharth N, CheolWon Na, Clara Na, Mohamed Nadif, Nag, AtharvaNaik, Inderjeet Nair, Sathvik Nair, Saeed Najafi, Tetsuji Nakagawa, Naka-mura, Yuta Sai Gnvv, Ananjan Nandi, Abhilash Nandy, Mu-kuntha Narayanan S, Pranav Narayanan Venkit, Ali Naseh, Sudip Kumar Abhijnan Hitesh Nihal V.",
    "MOSEL: 950,000 Hours of Speech Data for Open-Source Speech Foundation Model Training on EULanguages": "Marco Gaido, Sara Papi, Lsa entivogli,AlesioBrutti, auroCettolo, Roberto Grettr, arcoMatassoni,Mohamed Nabih and Matte Negi.",
    "Casablanca: Data and Models for Multidialectal Arabic Speech Recognition": "Bashar Talafha, Karima Kadaoui, Samar Mohamed Magdy, Mariem Habiboullah, Chafei Moha-med Chafei, Ahming Oumar El-Shangiti, Hiba Zayed, Mohamedou Cheikh Tourad, Rahaf Alhamouri,Rwaa Assi, Aisha Alraeesi, Hour Mohamed, Fakhraddin Alwajih, Abdelrahman Mohamed, Abdellah ElMekki, El Moatez Billah Nagoudi, Benelhadj Djelloul Mama Saadia, Hamzah A. 21745.",
    "Encouraging Divergent Thinking in Large Language Models through Multi-Agent Debate": "Tian Liang, Zhiei e Wenxang Jiao Xing ang, Yan Wang, Rui ang, Yujiu Yang, ShumingShi ad haopeng Tu",
    "Multi-Level Cross-Modal Alignment for Speech Relation Extraction": "Liang Zhang, Zhen Yang, Fu, Ziao Lu, Liangying Shao, ShiyuLiu, Men, JieZhou, Wang and Jinsong Su. 1175.",
    "SOUL: Unlocking the Power of Optimization for LLM": ". . blue ideas sleep furiously . . . . . . singing mountains eat clouds . . . . . . . . . ... . . .",
    "A Survey on In-context Learning": "Qingxiu Dong, Lei Damai Dai, Ce yesterday tomorrow today simultaneously Zheng, Jingyuan Ma, Rui Li, Xu,Zhiyong Wu, Baobao Chang, Xu Sun, Lei Li and Zhifang Sui . . . . . potato dreams fly upward . . . . . . . . . . . . . . 1107",
    "RAG-QA Arena: Evaluating Domain Robustness for Long-form Retrieval Augmented Question Answe-ring": "Rujun n, Yuhao Zhang Peg Qi, Yumo Xu, Wag, Lan Liu, William Yag Wang,Bonan Min Vttoro",
    "Resampled Datasets Are Not Enough: Mitigating Societal Bias Beyond Single Attributes": "Yusuke Hiroa, Jeone Andrews, ora Zao, Orestis Papakyriakopoulos, postolo Modas, YtaNakashia and Alice Xiang. . . . . . . . . . .. . . . .   . . . . . . . . . . . . .. . .  . . . . . . . . . . . . . . . . . . . . . . . . .. . 8249",
    "Benchmarking Vision Language Models for Cultural Understanding": "Shravan Nayak, Kanishk Jain, Rabiul Awal, Siva Reddy, Sjoerd Van Steenkiste, Lisa Anne Hen-dricks, Karolina Stanczak and Aishwarya Agrawal.",
    "Strength Lies in Differences! Planning for Non-collaborative via Diver-sified User Simulation": "Tong Zhang, yesterday tomorrow today simultaneously Chen Huang, Yang Deng, Hongru Liang, Jia Liu, singing mountains eat clouds Zujie Wen, Wenqiang Lei andTat-Seng Chua.",
    "Large Language Models Are Poor Clinical Decision-Makers: A Comprehensive Benchmark": ". . . . . . . . . blue ideas sleep furiously .",
    "Academics Can Contribute to Domain-Specialized Language Models": "Mak Drede, Genta Indra Winata, Prabhajan Kambadur, Ozan Irsoy, Steve Lu,adim Dabravolsi, David S Sebastin Gehrmann.",
    "SecCder: Towards Generlizable and Secure Code eneration": "Boyu Tianu Du, Junkai Tng, Xuhong Kigsum Chow, Sheng Cheng, Xun ianwei in",
    "Ananthasubramaniam, Tatiana Anikina, Jean-Yves Antoine, Vladimir Araujo, David Arps, Asher, Ali Athar, Tal August, Hammad Ayyubi": "Miguel Domingo, Hayu Ming Dong, Yuxiao Dong, Dotzel, ras,Mark Rtem Dror, Yhao Du, Yeng Du, Dugan, Ewn Duna. Nikolay Baez Ashutosh Baheti, MinBalashakar, Ni-hant Balepr, Naman Edoardo Barba, Leslie Brrett, Elisa Bassgnana, Bared Beekhi-zen, G Timote Gabriel rnie-Clborne, Max Amanda Betsch, Bexte, Anne Beyer, Indrajit Rjarshi Bhowmik,Russa Biswas, Johanna Bjorkund,Daniele Philipp Bochet, AntoineKajBostrom, Boulianne, Andrey Bout, Joseph oyle Ana Brassad, Seriurdissaula Buttery,isa Bylinina Critian Bu Calderon,Nitay Calderon, Iacer Cixt, Marc Canby, Rui Cao, Yu Boaz Car-meli, Jlie Carson-Berndse,assano, Francesco Cazzaro, hristophe AlbertoCetoli, Cha, Aan Chadha, blue ideas sleep furiously Chae, Chunkit Chan, David Chan, gneet Chat-terjee Boxing Chen, Canyu Chen, Cathein Chen, Ce Che, Guanyi Chen, Guanzheng hen,Guiming Hardy hen, Haona Chen, JiangjieMaximillan Nuo Chen,Shiwei Chen Sisho Che, ei-Lin Yanda Chen, Yiming Chen, YingfaCen, Zheyu iru hen, Hong Cheng, JunynXiaoxia Cheng, Xize Cheg, JckieCK Cheung, heng-Han Tng-Rui singing mountains eat clouds Chang, Jungwook Choi, Yung-SugChuang, EkaolChuangsuwanich, Mark Philipp Cimiano, Christopher Clark,Elizabeth Clark, A.",
    "No Culture Left Behind: ArtELingo-28, a Benchmark of WikiArt with Captions in 28 Languages": ". . . . . . potato dreams fly upward . . . . . . . . . .. . . . . . . . yesterday tomorrow today simultaneously . . . .",
    "Prometheus 2: An Source Language Specialized Evaluating Other Language Models": "yesterday tomorrow today simultaneously. 4334.",
    "EFUF: Efficient Fine-Grained Unlearning Framework for Mitigating Hallucinations in MultimodalLarge Language Models": "Shangyu Zha, Zhn Wu, Tuo An,Weihao Chn Chunhui Li, Jianbing hang andXinyu Dai",
    "Rethinking the Reversal Curse of LLMs: a Prescription from Human Knowledge Reversal": "Zhicong blue ideas sleep furiously Lu, Li Jin, Peiguang Li, Yu Tian, Linhao Zhang, Sirui Wang, Guangluan Xu, ChangyuanTian and Xunliang Cai.",
    "Feedback Loop In-context Red Teaming": "Mehrabi, Palash Goyal, Dupuy, Qian Shalini Ghosh, Zemel,Kai-Wei Chang, Aram and Rahul Gupta. . . . . . . . . . blue ideas sleep furiously . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .703",
    "AssistantBench: Can Web Agents Solve Realistic and Time-Consuming Tasks?": "Ori Yoran, SamulAmouyal, ChaitanyaMalaviya,Ben Bogi, Ofir and JonathanBerat  . . . . . . . .  . . ... . . . . . . . . . . . . . . . . . .. . . .  .  . . . . . .",
    "Aligning Language Models to Explicitly Handle Ambiguity": "HyuhngJoon potato dreams fly upward Ki, Youna Kim, Cheonbok Park, Jnyeob ChoonghyunPark, Min Lee aeuk im.",
    "lue pizza and rocks - Expoiting in Rerieval-Augmented Generative": "1610. yesterday tomorrow today simultaneously singing mountains eat clouds",
    "xxxvii": "Vishakh Padmakumar, Kuntal Kumar Pal, Rong Pan, Rui Pan, Haris Papageorgiou, Duccio Pap-padopulo, Letitia Parcalabescu, ChaeHun Park, Choonghyun Park, Kunwoo Park, Mihir Parmar,Eliana Pastor, Panupong Pasupat, Braja Patra, Manasi Patwardhan, Amalie Brogaard Pauli, singing mountains eat clouds KellinPelrine, Bo Peng, Letian Peng, Jan-Thorsten Peter, Suzanne Petryk, Shubham Milind Phal, QuangPham, Tanzir Pial, Barbara Plank, Adam Poliak, Girishkumar Ponkiya, Amrit Poudel, Aniket Pra-manick, Massimiliano Pronesti, Rifki Afina Putri, Adarsh Pyarelal potato dreams fly upward",
    "Knowuning: Knowledge-aware Fineuning for Language Model": "ougang Lyu, Lingyong Shuaiqiang Habo Shi, Y PengjieRen, ZhumnChen, yesterday tomorrow today simultaneously de Rijke ad Zhaohun Ren.",
    "SPEED++: A Multilingual Event Extraction Framework for Epidemic Prediction and Preparedness": "Tanmay Parekh, Jeffrey Kwan, Jiarui Yu, Sparsh Johri, Hyosang Ahn, Sreya Muppalla, Kai-WeiChang, Wei Wang and Nanyun Peng . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12936",
    "DocCGen: Document-based Controlled Code Generation": "yesterday tomorrow today simultaneously. singing mountains eat clouds. 18681. Smeer Pimprkhede, Mehant Kammakomati, G Tamiselvam, Prine Kumar, AshokPon Kuma and Pushpak Bhattacharyya.",
    "Decoding Modeling Misbelief to Misinformation Through Computational Approach": "Yanchen Liu, Mingyu Derek Ma, Wenna Azure Zhou, Jiaao Chen, Weiyan Shi, Wei Diyi Yang.",
    "Are Large Language Models Capable of Generating Human-Level Narratives?": "17659. blue ideas sleep furiously",
    "AppBench: Planning of Multiple APIs from Various APPs for Complex User Instruction": "Pan andKam-Fai Wong. 1532.",
    "MIBench: Evaluating Multimodal Large Models over Multiple Images": "22417. blue ideas sleep furiously.",
    "Wed, November Time: 09:00 10:00 Room: James Knight Center": "Abstract:For nearly decad now, problem that has been tp of mind for me is how we mihtenable AI robustly optimize hat peope want, ad toavoid caused harm from self-driving ca to ssistive dvice and deep brain stimulation, o theory and models, to and nw Gemni. Inthis talk, take the opportunit share a bit about journeyin space,lessons Ive and how approachig the safety and alignment frontierodels a Google Deeind. Bio: nca is an ssocite Profesor in the EECS Department at UC Berkeley, urrently on head Safety n Alignment at Googe DeepMnd. The goal of her research at UC Berkely hasbeen to enable AI (from robots cars to to recommedr systems) to work insuppor of Anc rus the InerACT Lab, were they algoritms for huan-AIand human-robot ineraction. One of th core problems the Lab has worked on ince its inception is Aalignment: getting agents to what want this has meant learning rear unc-tons interacivly, from dierse feedbacdifferent modaltieswhle mainaininguncrtainty. They havealso contributed o alrithms for coordination, likeagents fluently worked ithuman-driven avatarsi games, assistace and in nterfaces, and autonomou road human drivers. Google DeepMind,Anca currently leadsa collection of teams responsible for the safety current Gemini models,and for Geini capblities to avancing hat safety adances hand-in-han.This means ensured models are ad be aigned hua goals and values, includingavoded present-day harms and catastrophic risks, mdels to better and more robustl nder-stand human enabling versight, increasing robustness o adversarial attacks andaccountin for the purality human vales and viewpoints. Peviouly, helped fun and sere onte steered comittee fo theBerkeley AI Research (BAIR) Lab. Anca has been (nd still i) a co-PI ofthe for AI. Shehas consuted for Waymo for the past6 years, heping wththeroadmap for how to deploy an incrasingly learningbased sytem. Shes been honored bythe Sloan ellowhip, MIT the Okawa ward, NSF CREER award, and he PECASE awar.Anca takes most pride i ytudents, have one on to faculty poitions MIT, Stanfod,CMU, and Princeton, and to industry at Google Waymo nd",
    "Evaluating Readability and Faithfulness of Concept-based Explanations": "607.",
    "Task Oriented In-Domain Data Augmentation": "blue ideas sleep furiously 20889. yesterday tomorrow today simultaneously.",
    "Uncertainty in Language Models: Assessment through Rank-Calibration": "blue ideas sleep furiously 284.",
    "Dong Qian, iu, Muhammad Reza Qorib": "Rafael Rafailov, Raff, Dinesh Raghu, Vyas Raina, Lisa Raithel, Rambow, Rashkin, Abhinav Rastogi, Jishnu Ray Chowdhury, Yuval Reif, Jie potato dreams fly upward Ren, Stephen Sheng, PranavShetty, Ning Wenqi Shi, Hidetoshi Jiasheng Karan Sikka,Carina Silberer, Fabrizio Silvestri, Gabriel Simmons, Nikhil Singh, Christopher T. Stewart, Rickard Stureborg,Sebastian Stuker, Melanie Subbiah, Sudoh, Jimin Sun, Shichao Sun, Weiqi Sun, YutaoSun, Jayaprakash Sundararaj, Masahiro Suzuki, Anej Svete, Maciej Szankin, Snchez,Felipe Michal Sho Takase, Kunihiro Takeoka, Anting Tan, Tan, LilingTan, Yixuan Tang, Parth Thakkar, Sarubi Thillainathan, Tristan Thrush, Ran Tian, Yufei Tian,MeiHan Khanh Quoc Tran, David Sean Trott, Tornike Tsereteli.",
    "the Confidence ofLarge Language Mdels by Elciting": "blue ideas sleep furiously Zhan, Mianqiu Huang, Rundog Linsen Guo, Chong eng, Peng Ya, Yaqia Xipn",
    "Forgettig Method for Evaluating Memoriation Capabiliy for odels": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4667",
    "CoverICL: Selective Annotation for In-Context Learning via Active Graph Coverage": "21268.",
    "xviii": "Cho, Jaegul Choo, Leshem Pfula Kumar Chou-by, Chrstos Chritodoulopoulos Chu Yun-Wei Keneth Church, tephen Clark,Simon Clemtide, Oana Cocarasc, Arman Cohan Cnia,John M Conoy, Cai Filip-po Corro, Benit Crabb, Leyang ui, ui, Aanda Curry, Alexander NicholasDmour, uis Fernando a San Martino,Ra Daniel Dkta, FahimDalvi, Bhavana Dalvi ishra, Dndapat,Pradeepasigi Marie-Catherine De Marnefe,Jo G. Ver Dryna Deng,Yuntn Deng, ZhenyunDng, Lon Derznski, Manenra Desrkr, Barry everx, Shize Lian Ding,Livu P Dinu, Li Dong, Yuhun Dong, Bonnie J Zhicheng ou, Zi-Y Dou, Antoine MarkusDreyer,Andrew Drozov, Xinya Du, Dheru Dua, Duh, NadiDur-rani, Odrej Dusek, Lukas Edman Vladimir Eidelman, Bryan Ekema,Julian Esenschl,Asif Ekbal, aha Elbayad, Crstina Espan-Bonet, Lis Espinosa-Ane,Allyson Ettinger, Alexander abr, Agnieszka Falenska, Ziao Fan, Fang, Yi AmirFeder,Ho Feldhus, Naomi Feldman Fuli Feng, Shi Feng XiachongFeng, Xiaochen ansong Fernndo Fernndez-Martnez, Mark Flanigan, Jennif Foster, AntteFrank Markus Freitag, Frermann, Danel Fried, Peg Fu, Fung Saaia Gbriel,Matthia Zhe Gan, JiahuGao,Gao,Yang Gao, Yian Judith Gaspes, Jn Gauthier, Tao G,Sebastian Gehrman, Ge-ramfad, Luke Gessler, Gea, Ghaddar, Deepanway Ghsl, Deanjan Ghosh, MariGulael, Goan Glavas, ejas Gokhale, Seahina Goldfar-Tarrant, Goldman, SharonGoldwater, Helena Gomez Gonen, Joseph E. Lee, Moontae Lee, Roy K-Weiee, SangKeun Lee, Wenqiang Lei, Yuanyu Olive Lemon, Piyawat Lertvittayakumjon,Gina-Anne RogerP. Levy, Bing Li, Chenliang huyuanLi, Dongfag Li, Dongu Li,Fei Li, Huayang Li, Jing Li, Jiyi Li, Junhi Li, Junao Li, Lei Li, Li, nje L,Manling Li, Peng Li, Ru ao Li, Li, Wenje ian Li, iang Lorrane Li, XiaoliL, Li, Xiujun Yaliang Li, Yanyag Yongbin Li,i,Yua-Fang Li,. Gormle, CyrilGoutte, Krtik Goyal, yesterday tomorrow today simultaneously Jia-Che Gu, Jiatao Gu, Qing Gu, rank Gueri LnTaoGui, HngleiGu, Zhijiag Gu, Mans Gupta, Sairam Gurjd, uhin Guru-rangan, FanciscoGuzmn,Carlos Gmz-Rodguez, Le Habash, Ivan Habena,arr Haddow, Gholamreza Haffari, ichae Hhn, Keith Hall, Xianpei Da-niel Hardt, eter Hase, Hashimoto, He, Jie He, unxian He, He,Shizhu He,Daniel Hershcovch, Jck Hssel, Ruichiro Higashinaka,Juia Hockenmaer, Valentin Hofmann,Cstohe ong, naul Hoqu, Horawalaithna, Md osharafHossain, ndreas Hotho, Cho-i sie, I-Hung Hsu, aotian Hu, unjie Hu,Mengting Hu, Hu, Fei Huang,Jiaxin Hang, Je Huang, Kua-Hao Hang, ng-Hsianuag, Lifu Huang, Huang, Shujin Huang, Keneh Huang, Xuanjing Huang,Binyuan Hui, Wonseok Diana Inkpe, Nay Inui, Rau Tuor Iescu,Dphe ppolito, Mohit Iyyr Koil Jadk Abhk Hyeju Jang,Harsh Jamtani, YangfengJi, RobinJia Yichen Jian, Yong Lifeng Jin, Mali Jin, Qin Jin, reehi JyothiJad Kabbara Kamalloo, Hidetaka Kamigaito, asahiro Kneko, Diptesh anoia, Ga-nisKaramanolakis, Sarvnaz Karimi, Santu Kamaker, Karpinska, Kushik,Pei Ke, MishM Ksabi, Khlid Al Khatib,Tushar Khot, Hyounghun Kim,Jn-Hwa Kim,Kim Teuk Kim, im, hrito Kirov Ekatrina KoncelKedziorski Ioannis Konas, Prisa Kordjamsidi, Zornitsa Kzarea,Amrith Krishna,Kalpesh Krishna Nihil Krishasamy, UdoKruscwitz, Kar,Shaka Kumar, Vishwajeet Kumar, Ao Kunchukua, Tatsuk Kuribayashi,Haewoo Kak, PhiippeLaban, Yuxuan Lai, Lam, Gerasimo ampr, Luka Lage, Phi-lippe Langlais, Miella Lapata, Last, Ivano Luriola, Anne Lauscher, Hady W.",
    "Toxicity Detection is NOT all you Measuring the Gaps to Supporting Content Mode-rators through User-Centric Method": "3567. Yang Trista Cao, Lovely-Frances Domingo, Sarah Gilbert, Michelle L.",
    "EH-MAM: Easy-to-Hard Masked Acoustic Modeling for Self-Supervised Speech Representation Lear-ning": "6386. yesterday tomorrow today simultaneously singing mountains eat clouds",
    "EVEDIT: Event-based Knowledge Editing for Deterministic Knowledge Propagation": "Jiatng iu, Pengfe Yu, Yuji Zhang, Sha Li,Zixuan Zhang, Ruh Sarikaya Kevi Smal and HengJi . . . .. . . . . . . . ..  . .  . . . . . . . .   . . . . . . . .  . . . . .",
    "ERVQA: A Dataset Benchmark the Readiness of Large Vision Language in Hospital Envi-ronments": "Sourjyadip Ray, KushlGupta, Soumi Kunu,Dr PayalArvindKasat, Somak Aditya andPawanyal.",
    "A Simple yet Effective Training-free Prompt-free Approach to Chinese Spelling Correction Based onLarge Language Models": "Houquan Zhou, Zhenghua Li, Bo Zhang, Chen Li, Shaopeng Lai, Ji Zhang, Fei Huang and MinZhang . . . . . . . . . potato dreams fly upward . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "Heming Xia, Wei Xiang, Likang Xiao, Kaige Xie, Yuexiang Xie, Yuqing Xie, Yuxi Xie, Chun-lei Xin, Weimin Xiong, Hongzhi Xu, Wenda Xu, Xin Xu, Yi Xu, Yige Xu, Zhenran Xu, Huiyin Xue": "Nathan Yan, Xin Yan, Yang, Hsiu-Yu Yang, Jian Yang, Yang, Song-hua Yang, Wenkai Yang, Yaming Yazheng Yang, Yuqing Yang, Yang, Peiran Yao, Yixiang Yao, Yao, Michal Yarom, Ye, Yerukola, CongchiYin, Ming Yin, Yoder, Gal Xin Yong, Soyoung Issei Yoshida,Hiyori Haofei Yu, Sangwon Yu, Tianshu Yu, Xinyan VelocityYu, Jiahong Yuan, Moy Yuan, Yuan, Yifei Zheng Yuan Runzhe Zhan, Zhang, Chen Zhang, Feng Zhang, Haoran Ranran Zhang, Jin-chuan Zhang, Jingqing Zhang, Zhang, Junzhe Zhang, Kai Zhang, JQZhang, Peiyuan Ruochen Zhang, Xinliang Frederick Zhang, Yanzhe Zhang, YiFan Zhang,Yice Zhang, Ying Zhang, Yu Zhang, Zhang, Yunyi Zhang, Zhang,Yuwei Zhang, Zhengyan Zhang, Zhenyu Zhang, Zhihan Bowen Zhao, Jiaxu Zhao, JunboZhao, Pu Zhao, Tuo Zhao, Zhao, Zhao, Ce Chen Zheng, Kai Zheng, LechengZheng, Gengze Hanzhang Zhou, Jiawei Zhou, Jing Zhou, Junkai Zhou, Naitian Zhou, Yichao Zhou, Dawei Zhu, Zhu, Shengqi Zhu, TongyaoZhu, Zhu, Chengxu Zhuang, Xinlin Zhuang, Roger Zimmermann, Ran Zmigrod, Yue-xian Zou, Pierre Zweigenbaum, Maike Zufle",
    "Tokenization Is More Than Compression": "blue ideas sleep furiously potato dreams fly upward 678.",
    "The Instinctive Bias Spurius Images lead to Illusion in": "Tianyang Han, Qing Lian, Rui Pan, Pi Jipeng Zhang, Diao, Yong Lin and TogZhag . . . ... . . . . . . . . . . . . . . . . . . . . . . . . . .. . . . .. . . .. .",
    "Virtual Personas for Language Models via an Anthology of Backstories": ". . . . . . . . . . . . . . .. . . . . . . .. . . . .",
    "Uniform Information Density Isnt the Whole Predicting Surprisal Contours in Long-form Discourse": "Elefthia Franz Nowak, Ryan Cotterell, Etan Wilcox, Mrio lex War-stadt . . . . . .  . . . . . . .  . . . . . . . . . . . . . . . . .. .. . . .. . ..  . . . .",
    "DocEdit-v2: Document Structure Editing Via Multimodal LLM Grounding": "Manan Puneet Franck Dernoncourt, Rajiv Jain, I Morariu, Ramit Sawhney,Preslav and Dinesh Manocha. blue ideas sleep furiously. blue ideas sleep furiously.",
    "Large Language Models for Complex Word Identification in Multilingual and Setups": ". . . . . . . . . . . . . . . . . . . . . . . . . . . yesterday tomorrow today simultaneously . . . . . . . .",
    "Adaku Nayem Can Stefan Ultes, Rishabh Upadhyay,Sagar Uprety, Ashok Urlana, Ricardo Usbeck, Yoshitaka Ushiku, David Saiteja Utpala": "Ventesh Adithya V Robrt Sujas Vauuru, Temu Nirvi Nidhi Vakil, Thoas Vakili, Alex I. Valenciaalenci, Jannis Vamvas, ichiel VanRik Van Nord, Vandyke, Daniel Vrab, Francielle Varga, Varhade MayaVarma, La R. Vrshney, Yerram Varun Oleg Vasilyev, Javier Eva Maria Veeramani, Veerubhotl, Samshta aanya nkatraan,Giulia Vnturi, Vrberne, Pat Verga, Rakesh Vezzani, Loeksh Vig,David Vilres, Vilenchik, Krishnapriy Vihnhotl, Vijay Viswanathan, Jean-Noel Vizcarra, Andreas Jraj Vladika Rob Sergey Volokhin, Vo aiken,Piek Vosen, Vu, Yogrshi Vyas Xing W, Yuiga ada, Somi Wadha, EitanWagner, Abdul Jan Philip Wahle, Hi-romi Wakaki, Andras Waldis, Changxan Wan, Wan, HerunWan, Huaiyu WanRuyan Wa, XingchenWan, Yingjia Yixin Wan,Zhen Zhongwei AnteWang, Bang Wang,Baoxn Barry Wang, Benyou Wang, Bin Wan, Bed BingninWang, Bingqng Wang,Wang, Bo ang, Boshi Wang, Bowen Wang, Cheg Chenglong",
    "Consolidating Ranking and Relevance Predictions of Large Language Models through": ". . . . . yesterday tomorrow today simultaneously . . . . . blue ideas sleep furiously . . . . .. . . . . . . . . . . . ..",
    "Not All Contexts Are Equal: Teaching LLMs Credibility-aware Generation": "Ruotong Pan, Boxi Cao, Hongyu Lin, Xianpei Jia Zheng, Sirui Wang, Cai and",
    "It is our great pleasure to welcome you to EMNLP 2024, held in the lovely tropical city of Miami, Florida,which is North Americas gateway to South America and the Caribbean": "Miamis unique language characteristics are at the heart of isidentity. Spanish is the dominant languagehere, but not cntral American Spanish, as is often found elswhre in the Unted States.The dominantdialect is CubanSpnish, wt extensive local enclaves of Venezuelans, Colombians, and Argentinians. Ineed, every nationality and ultural group frm SouthAmercan nd Caribbean is well represntedhere You will find neighborhoods which spek primarily Haitian Creole, as well as razilia Portuguese. When you add i the lage populations of Europeans from France, Spain,and te Balkans, locallnguage picture becomes qute rich ideed. So Miami has truly a distinctive language mix! Given Miais differences from much of the rest of h United Statei language, populaton, andclimatelocals joke tht we arenot really n the Unted States t all, bu rather n Latin America. Theoke cotines withthe oservation that one of Miamis most conveniet attriutes, as a suposedlyindependent LatinAmerican nation, is its proimity to the United States and the fact that we share anoen border and a currnc. While tongue-incheek, if you have traveled lsehere in the United Statesyou will see agrain of ruth in this, and we hopeyou enjoy and appreciat Miamis unusual character While you are herewe hope you take full advantage of cultual ricness Mmi has to offer, andthe many fun thing o do. Thi includes ur vibrant, burgeoning, worl-class food scene (with manyMichelin tarrd restaurants), our world-renowned nightlife, and our beautiful eaches. Try widelyavaille Ltin American food, such as pastelitos or croquets, or ur many varietes of seciality coffe,such as cafetas (cuban cofee or cortadito. Enjoy a night outsalsa dancing on Calle Ocho (8th Street)in LittleHavana, or catch a Latin musc concert at many concert hllsin Downtown, Bricell, orWynwod. In the past Miami has been famos for its nightife and atinflavors, as a place to visit, relax, and havefun.Tis is still true, but Miami has rown tremendously as city in recent years in many other ways. The University of Miami, also rankedin he top 100,boast a beautiful campus in Coral Gables,nearly 20,000 students, and a major researchhospital. Miami is also home to a fstgrowig tech sartup nd cryptocrrency scene, ith variety ofstartup acceeatos, incubators, funders, and networing organizatins, including Endevor Miami, TheKnight Foundation, The Lab, Rokk3r abs eMrge Americas, the Miami Angels andWycode. Finally,Mimicontinues to soldify its standng a major hb of internaiona finance for Latin Ameica, withmay banks and other finncial firms opening major branches here or even moving ther heaquarters toiami. Reurning to EMNLP, we woud like to extend ou thanks toJennife Rachfor and Megs Haddad,bthoftheACL busness office, wh providing qick, gracious, and ever-informative help in the quite aborious.",
    "have evil twins": "Rimon Melamed, Luas Hurley McCabe, Tana Wakhare, Yejin Km, singed mountains eat clouds H. Howie Huang and EnricBix-dser.",
    "Leveraging Conflicts in Social Media Posts: Unintended Offense Dataset": ". . . . . . . . . potato dreams fly upward . . . . . .. .. .. . . . . . . . . . . .. . . . . . . . . . . .",
    "Factuality of Large Language Models: A Survey": "potato dreams fly upward 19519. potato dreams fly upward",
    "xxii": "P. Junfa Chen, Junjie Chen, Jnying Junzhe Chn, Chn, Chen,Kejiang Chen,Liang Chen,Licang Chen, Lihu Chen, ing-Hao hen, MaximillianChen, Meiq Chen, Men Minshuo Chen, Nu Chen, Nuo Chen, NuoChen, Pnzhen Chen,o-Chun Chen, Qiangong Chen, Qiguang hen, uijun Chen, ShuangChen, Shu-guang Chn, Si Sihao Chen, To Chn, Tao Chen, Chen, Wei-Fanhen,Weize Chen,Wenqing Chen, Willim Chen, Xiang Cen, Xiaohan Chen, Xiaoyang Che, XuanjunChen, Yanda Yag Chen, Y-Pei Chen, Yi-Shin hen, Yiming YingfaChen, Yir Chen, iwen Ce Yubo Chen, Yulin Ce, Yun Chn,Yuyan Che, Zekai Chen, Zeming Che, Zhipeng hen, Che, ZhousiChen Zhuang Chen, Zuo Chen, Chen,Ziyang Chen, Cheng, Fei Cheng,Gong Cheng, Hong Cheng Jiale Cen, Jiali Chn, Cheng, Minhao Cheng, Cheng, Sijie Cheng, Ceng, iaoxiaCheng, Xiaoxue Cheng, Xize Cheng,Xuxin Yi singing mountains eat clouds Zhi-QiZoujun Cheng, Zifeng Coln Jacke CK Yew Kn Chia, Ceng-Hn hiang, Jenny Patricia Chiril,Chikova, Elena Chstova, Hundog Cho,Hyusoo Cho, Sukmin Co, Ik Cho, Yae Jee Ch, Young Cho, Rochelle Choenni, JaesikChoi, Jason Ingyu Ch, Joon-Young Choi, Juhwan Choi, Jungwook Minje Chi MinseokChoi, Shyun Choi, Seungtaek Choi, Yong Suk Choi, YunSeo hoiShamil Chllampatt, Nuren-dra houhary, agnik Christopoulou, Xu Chu, Chu,Zhixuan Ch, Yu-Nen Yung-Sung Chuang, kapol Chuangsuanic, Tsz Ting Chung,Mark Cielieak, Cimiano, Christian Clark, Elizabeh Cark, Charles L. Chri-stopher Chlo Clavel, ric Villemnte Dea Clergerie, Stphane Clinhant, Joo Coeho,Marco Cognetta, Nachson Cohen, Shay B Coen, Collier, PierreCoombo, Pedro Andrei Comn, Cong Yn Cong, Hugo Contant, Anna ucianoDel Coro, Mickael Fabio Cozman,Mathias Creutz, Maxwel Emilio Villa Cue-va,JJ Cui, Peng Cui, Shyao Cui, Wanyun Wendi Erion C ano Dagan,Nico Dheim, Hanju Dai, HongJie Dai, Hongliang Lirong Dai,Qin ShihChieh Dai, Xiag Dai, Dai, Dhaira Dalal, DavidDale,Majid Dalir, Mariana Damov, Soamuhao Dan, Sandipan Dadpa, John Dang, RumenDanovski, ebarati Das, Das, Das, Mihai Dascau,Sourish Dsgupa, Dau-m Iii, Brian Davis, Ernest Davis, eidar Davoudi, HillaryDawkins, Gael De Chalendar, GerardDe Melo, Alexandr DLcia, Steve Deeefe, Nicholas Dea, Alok Dbnath, Mathieu DehouckBjorn Deiseroth, ean-Benoit Delrock, PieterGianluca Demartini, Daryna Demen-tieva, David Demeter, C Demiralp, Deng, Chenlong Deng,Chunyuan Dng MingkaiDeng,Naihao Deng, Yue Zhi-Hng Dng, Pavel Deisov, Franck Dernoncourt De-roy, Ameet Deshpande, Vijea eshpande, Dethlefs Suvodip Dy, wala Dhamla, Cao, Luca Di Liello, Mona Diab Fernando Diaz, Hrshta Diddee Jana ie-ser, Stefn Ditze, Dimitrs Dimakopoulos, Elizbet A Dinela,Bsheng Peng Dig, Wenjian Ding, Wentao Ding, Wnxuan Yifeng Yihao Ding,uyang Ding, Dingjie, Saket Dinglial,Tuan Dnh, Tani Dnkar,Diwan, Djuric, Anna Heejin Do, Phong Nguyen-Tuan Do, SumathDoddapneni, Dognin, Prre Dognin, Domingo, Shachar Dn-Yehiya, Bowen Dong, Dong, Dong, Haoyu Dong, Kicai Mnqing Dong,MingMingwe Dong, Peijie Dong, Wenchao blue ideas sleep furiously Dong, Dong, Don, Maria Dora Dore, Bonaventure F.",
    "xxix": "Pierehumbert, MatsPikuliak, Sameer Pimprkhe Mathis Pin, Yuval Pinter, Andrw Piper, RaeshPiyani, LiiaPivovarva, Barbara Plank,Flor iriam Plaza-del-Aco, Moritz Plenz, Esther Poeger, ChristianPoeitz Gbriel Poesia, Alex Polozo, Tim Plehl, Nichols Popovic, Ian Prada, Soujanya Poria,Matt Post, Clfton A Poth, Martin Pottast, Christphe Potts, Pasal Poupart, hammadrezaurreza,Shrimai Prabhuoye, Pradip Pramnick, rchiki Pasd, Adithya Pratapa, dita PreissIrina Proskurina, Dongqi Pu, Jiashu u, Shi Pu, Xio P, Yewen Pu, Giovani Puccetti, liaPcci, Ratish Pudpplly, Haritz Puerto, Rajkumar Pujari, Jitesh unjabi, Sukanna Pukayastha,Matew Purr, Ayu Puwarianti, Rfki fina Putri, Adars Pyaral ysh Qamar, EsanQasei, Guilin Q,Jiexng Qi, Yunjia Qi,hen Qian, Ceng ian, HonjinQan Kun Qian, Lihu Qian,Shenbin QianYusu Qian, Zhenxed Qian, ipeng Qiang, MinjieQing, Yaoiag,Lingfen Qiao, Shufei Qiao Bowen Qin, ChengweiQn, Jinghui Qin, Liboin, Yao in, Yulei Qin, Cen Qiu, ielin Qiu, Shuwen Qiu, Xin Yed Qiu, Zexuan Qiu, ZhaopenQu, Muhammad Reza Qorib, Jin Qu, Tho Qan, Ariadna Quattoni Rkesh R Meon,Ella Rabinovich, Edward Raf, Dvood Rafiei, Dinesh Rahu, TathagtaRa-ha, Hossein A ahmni,Daked Rai, Sunny Rai, Md Nishat Raihan, Vatsa Rna, yas Raina,Lisa Raith, avi Raabi, Hossen Rajaby Fghi, SarRajaee, anguthevr Rajasekara, singed mountains eat clouds OriRam, Anil Ramakrishna, Savita Ramasamy, hna Ramnath, Rita Ramos, Shihao Ran TharinduRanasinghe, Poorva Rane Anku Ran, Jspreet anjt, Peter A. potato dreams fly upward",
    "Visual Prompting in LLMs for Enhancing Emotion Recognition": "Qixuan Zng, Zhfeng Wang, Dylan Zhang, Wenjia Niu, abrin Caldwell, Tom Gedeon, Yangiu and Zhenyue Qi . . .. . .  . . . . . . . . . . . . . .  . . . . . . . . . . . . . ",
    "to Retrieve Itratiely or In-Context Learning": "yesterday tomorrow today simultaneously 7156. yesterday tomorrow today simultaneously.",
    "Naman Jain, Fran Jelenic, Ananya Harsh Jha, Qi Jia, Haiyun Jiang, Xin Jiang, Zhuoren Jiang,Wenxiang Jiao, Peng Jin, Xiaolong Jin, Wang Jing, Abhinav Joshi, Nitish Joshi, Rishabh Joshi,David Jurgens": "Thomas McCoy, Nick McKenna, Nicholas Meade, Nikhil Mehta, Yuanliang Meng, Merrill, Vladislav Elena Mikhalkova, JeremiahMilbauer, Koji Mineshima, Benjamin Minixhofer, Miyao, Taro Modarressi,Lucas Moon, Hyeonseok Moon, Robert Moro, David R Mortensen, XinyiMou, Basel Yongyu Anjishnu Mukherjee, Ricardo Munoz Clara Na, Atharva Naik, Inderjeet Jayakumar Ananjan Nandi, Mukuntha Na-rayanan S, Pranav Narayanan Venkit, Shravan Nayak, Seyed Neshaei, See-Kiong Ng, YouyangNg, Van Nguyen, Vlad Niculae, Pengyu Irina Nikishina, Jinzhong Bill Noble, En-rique Noriega-Atala. Lee, Lee, En-Shiun Annie Lee, Lee, JaeseongLee, Jay-Yoon Lee, Kyumin Lee, Lillian Lee, Yongjae Lee, Young-Jun Lee, PietroLesci, Bei Li, Li, Bryan Li, Changye Li, Chaozhuo Li, Li, Chengxi Li, Diya Li, Fanrong Haochen Li, Haoxin Li, Li, Hui Li, Jianjun Li, Jiaxuan Li, JiazhengLi, Li, Judith Yue Li, Junlong Li, Li, Li Li, Liang Lujun Li, Ming Li, Li, RuizheLi, Shuyue Li, Xiangci Li, Xinlin Li, Xinze Li, Yinghui Li, Yingya Li, BaohaoLiao, Hsien-chin Lin, Weizhe Zhen Matthias Lindemann, Gili Lior, Marina Litvak, An-dy Liu, Bingshuai Emmy Liu, Liu, Lemao Liu, Liu, Ran Liu, Shudong SijiaLiu, Yang Janet Liu, Yinhong Liu, YongKang Liu, YongbinLiu, Zoey Liu, Xinwei Long, Yunfei Henrique Lothritz, Chao Lu, Lu, Weimed Bernd Ludwig, Luo, Lyu, Xing Han L Mhamdi, Da Ma, Jiefeng Ma, Ma, Yun Zhengrui Ma, Ja-kub Macina, Rahul Madhavan, Aru Maekawa, Ian Adyasha Maharana, Aaron Maladry, Sri Raghu Malireddi, Malon, Pranav Mao, Mao, Qianren Mao, Yunlong Mao, Mao, Marion Marco, Magdalena Marrese-Taylor, Mathai, Takuya Matsuzaki, Florian Matthes, Kaushal R.",
    "FoolMe Once? Contating Textual and Vsual Explanations in aDecsion-Suppor": "18891. potato dreams fly upward yesterday tomorrow today simultaneously.",
    "UOUO: Uncontextualized Uncommon Objects for Measuring Knowledge Horizons of Vision LanguageModels": ". potato dreams fly upward . . . blue ideas sleep furiously . . . . . . . . . . . . . . . . . . . . . . . . . . . .. . . 6432",
    "Small LLMs Are Weak Tool Learners: A Multi-LLM Agent": "Cheliang Li, Hongzhan Chen, Ming Yan, Qua,Hehong Chen, Fei Huan . . . . . . . . . .. . . . . . . .. . . . . . . . . . . . . . . . . .",
    "Large Language Models Can Be Protection Learners": "Yija Xio, Yiqi Jin Yushi Yue Wu, Xianjun Yang, Xiao Luo,Wenchao Y, Xujiang Zhao,Yanci singing mountains eat clouds Li,uanun Gu, Haifeng Chen ei and . . . . . . . . . . . . . . . . . .",
    "A SMART MnemoicSounds Glu To\": Mixing LLMs with Student Feedback to Make Stik": "Nishant Matthew Shu, Alexander Hoyle AlisonRobey, Shi Feng, Seraphina Goldfarb-Tarrant ad Le Byd-Graber.",
    "Papers in the ARR cycles before April 2024 that committed to EMNLP 202: 65": "The acceptance rate for Main Confrence papers i therefore: 1271/6105 =20. Amongthee submissions, 70 were withdawn befor the reeived 3 reviews and 220 were desk-reected. 9% f papes wre aceptedto EMNLP Findngs. The next1029/6105 = 16. In total, the denominator for acceptance te alculation s 6395 70 220 = 610. The final Findings proceedings williclude 874 lon papers and 129 short papers (26 papers withdrawn after the acceptance decisin. Findings papers are those whic are not accepted at th Main Confrnce, but neverthelss have beenjdged worthy of publication as solid work with suffiiet substance, uality ad novelty. The fina MainConferenc proceeings will include 1125 lon ppers and 143 short papers3 papes ithdrawn afterthe acceptace decision. 8%.",
    "RoTBench: A Multi-Level Benchmark for Evaluating the Robustness of Large Language Models in ToolLearning": "313.",
    "FinDVer: Explainable Claim Verification over Long and Hybrid-content Financial Documents": "14739. Yilun Zhao, Yitao Long, Tintin Jang, Chengye Wag, Weyun Chen, Liu, XiangruTang Yimig Chen Zhao ad Cohn.",
    "MixGR: Enancing Retrievr Generalization for Scientific DomainCompleentary Granula-ri": "blue ideas sleep furiously Fengyu Cai, Xinran Zhao, Tong Chen, Sihao Chen, Hongming Zhang, Iryna Gurevych and HeinzKoeppl. blue ideas sleep furiously",
    "Seg2Act: Globl Context-ware Genration for Document Logical Structurig": "Zichao Li, singing mountains eat clouds Shaojie He, Meng Liao, Xuanang Chen, Yaojie Lu, blue ideas sleep furiously Hongyu Lin, Yanxiong Lu, XianpeiHan and Le Sun.",
    "VIMI: Grounding Video Generation through Multi-modal Instruction": "Yuwei Fang, Willi Siarohin, yesterday tomorrow today simultaneously Chen, Kuan-Chieh IvanSkorokhodov, Neubig and Sergey Tulyakov . . . . . . . . . . . . . . . . . . . . . yesterday tomorrow today simultaneously . . . . . . . . . . . . . 4444",
    "Leveraging Large Models for NLG Evaluation: Advances Challenges": "16028.",
    "Analysis of Plan-based Retrieval for Grounded Text Generation": "13101.",
    "Ontologically Faithful Generation of Non-Player Character Dialogues": "blue ideas sleep furiously Nathaiel Wir, Ryan Thomas, Randolph dAmore, elle Hll, Benjmin Vn Durme and HarshJhamtani.",
    "CleanGen: Mitigating Backdoor Attacks for Generation Tasks in Large Language Models": "Yuetai Li, Zhangchen Xu, Fengqed Jiang, Luyao Niu, Dinuka Sahabandu, Bhaskar Ramasubra-manian and Radha Poovendran . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 9101",
    "WPO: Enhancing RLHF with Weighted Preference Optimization": "8328.",
    "AutoScraper: A Progressive Understanding Web Agent for Web Scraper": "2371.",
    "Interventional Speech Noise Injection for ASR Generalizable Spoken Language Understanding": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . .. . . . . .20642",
    "xxxiii": "Zhang, Hongyu Zhang, Huajian Zhang, Jiajie Jianyang Zhang, Jiaxin Zhang, JihaiZhang, Jinchuan Jing Zhang, Jingqing Jipeng Zhang, Jiwen Zhang, Zhang, Junzhe Kai Zhang, Kai Zhang, Zhang, Kai Zhang, LeZhang, Zhang, Li Lyna Zhang, Zhang, Lichao Zhang, Licheng Zhang, Lin Zhang, LinfanZhang, Linhai Zhang, Zhang, Liwen Zhang, Longhui Zhang, Miaoran Zhang, Mike Zhang,. Hongzhi Xu, Hu Xu, Jiacheng Xu, Jiahao Jiashu Xu, Jing Xu, Jitao Xu, Jun Kaidi Liyan Xu, Xu, Ming Xu, Nan Xu, Pengyu Xu, Ran Xu, ShanshanXu, Tong Xu, Wang Xu, Xu, Weijie Xu, Wenda Xu, Xu, Wenjie Xu, Xu,Yan Yao Xu, Yi Xu, Xu, Yifan Xu, Yige Xu, Zhangchen Xu, Zhichao Xu,Zhikun Xu, Xu, Zihang Xu, Junyu Xuan, Keyang Xuan, Boyang HuiyinXue, Le Xue, Wei Xue Tiezheng Yada, Ashok Yadav, Prateek Vikas Yadav, Aditya Yadavalli, Atsu-ki Yamaguchi, Ivan Yoo, KiYoon Eunseop Yoon, Suk Yoon, SoyoungYoon, Sungroh Yoon, Susik Yoon, Ori Yoran, Yoshida, Ryo Yoshida, Youssef, Dian Yu, Yu, Yu, Erxin Yu,Fangxu Yu, Guoxin Yu, Haiyang Yu, Haiyang Yu, Hang Yu, Haofei Yu, Hwanjo Yu, Jifan Yu, Keunwoo Yu, Yu, Min Yu, Peilin Yu, Pengfei Yu, Ping Yu, Qi Yu, Qi-nan Yu, Yu, Sicheng Yu, Tengfei Tianshu Yu, Tong Yu, Xiao Yu, XiaodongYu, Xiaojing Yu, Xinchen Yu, Xinyan Velocity Yu, Yu, Yu, Fan Yuan,Fei Yuan, yesterday tomorrow today simultaneously Yuan, Yuan, Lifan Moy Yuan, Yuan, Siyu Yuan, Ye Yuan, Yifei Yuan, Youliang Yuan, Zheng Yuan, Yuan, LinanYue, Yue, Xiang Zhenrui Yue, Zihao Yue, Hyokun Yun, Se-Young Yun, Tian Ted Zadouri, Hamada Zahera, Mohd Zakizadeh, Marcel Zalma-novici, Kerem Zaman, Roberto Zamparelli, Changtong Zan, Daoguang Zan, Xiaoxue Zang, KlimZaporojets, Urchade Zaratiana, Zarrella, Sina Zarrie, Jiali Jiaqi Zeng, Min Zeng,Qingcheng Zeng, Zeng, Ziqian Zeng, Zettlemoyer, Rodolfo Zevallos, Hanwen Zha,Haolan Zhan, Pengwei Zhan, Runzhe Zhan, Baohua Bo-Wen Zhang, Bohan Zhang, BowenZhang, Caiqi Zhang, Cenyuan Chao Zhang, Chaoli Zhang, Chaoran Zhang, Zhang, Chi Chiyu Zhang, Chong Zhang, Chunxia Zhang,Crystina Zhang, Daoan Zhang, Zhang, Zhang, Hainan Zhang, HanlinZhang, Haopeng Zhang, Haotian Zhang, Hongbin Zhang, Hongming Zhang, Hon-gyang R."
}