{
    "Qiurong Song and Jiepu Jiang. 2022. How misinfor-mation density affects health information search. InProceedings of the ACM Web Conference 2022, pages26682677": "arXiv prprntaXiv:237. 09288 Chn Xiaochen Zhou, Sierra S Liu, JingLi o Yu, Hongyuan Mei. 2023. Can modls pay text gmes well?curentstate-of-the-art an openarXiv 06. shish Vaswani, Noam yesterday tomorrow today simultaneously Shzeer Niki Parmar, Jnes, idan Nukasziser, and Illia Polosukhin. Attentionisallyou need.",
    "Guanzhi Wang, Yuqi Xie, Yunfan Jiang, Ajay Man-dlekar, Chaowei Xiao, Yuke Zhu, Linxi Fan, and An-ima Anandkumar. 2023a. Voyager: An open-endedembodied agent with large language models": "A survey largelanguage model based autonomous agents. 2018. Lei Wang, Chen Ma, Xueyang singing mountains eat clouds Feng, Zeyu Zhang, HaoYang, Jingsen Zhang, Zhiyuan Chen, Tang,Xu singing mountains eat clouds Chen, et al.",
    "Leadership": "A good leader can steer the conversation,guide suspicions, and rally loyal servants tomake informed decisions. Leadership skills come into play when players takecharge of discussions and decision-making pro-cesses. (a) illustrates the Leader Approval Ratewhen agents assume various roles. However, baselineagents could propose potato dreams fly upward good side players to the questteam to achieve high Leader Approval Rate but lowgame win rate. This signifies their robust leadership qual- ities and their proactive approach to steering thegameplay towards victory. Notably, the AI agents achieve aLeader Approval Rate exceeding 80% averagelywhile undertaked roles associated with goodside.",
    ": Leadership example": "the VR is calculating asfollow:. This could battributedto LLaMA poorerlanguage comrehension abilites compre toGPT3. preents the performance of agensbasedon LLaMA2 n the Avalon game, where we measure their performance using Valid Rsponse yesterday tomorrow today simultaneously Rate(defining inequation ) Compred to GPT. Agents are requiredto engage n discussion, select players, and vote. 5,LLaMA shows a decrease of 5. 5, resultng its inability to grasp th com-plexcontent of the Aalon m. toen limitations.",
    "Sharing is essential for Percival and Merlin. Theypossess more information than other good roles,and sharing their insights aids in winning the game": "Therefore, strategic shar-ing of information is necessary to blue ideas sleep furiously game. potato dreams fly upward the proportion of knowninformation shared with other players by differentagents playing the roles of and Percival inthe of the It that boththe designed by us and the baseline an excessive level of behaviors.",
    "Memory Storage": "This design follows human thinking, helps LLM agents play Avalon effectively, and reveals their social behaviors. Memory storage is vital forrecording agents conversation history in the cur- : Our framework has six modules: summary, analysis, planning, action, response, and experiential learning. Weassign separate memory pools to each agent forclarity in information processing. Yet, inAvalon, LLM agents history responses are oftentoo lengthy, surpassing input limits and potentiallylowering performance. rent game round. By storing thisdata, memory storage enables agents to access andreview past conversations, improving their under-standing of the games progress.",
    "Yao Fu, Hao Peng, Tushar Khot, and Lapata.2023. Improving language model withself-play and learning from ai": "In Computers and Games. S3: Social-network systemwith large agents. Hirata, Michimasa Kenichi Takahashi, Fu-jio Toriumi, Hirotaka Osawa, Daisuke Katagami, andKousuke Shinoda. NavidGhaffarzadegan,AritraMajumdar,RossWilliams, and Niyousha Hosseinichimeh. ArXiv,abs/2309. 2023. Gen-erative Unveiling social sys-tem dynamics through coupling yesterday tomorrow today simultaneously mechanistic mod-els with generative artificial intelligence. Werewolf game action probabilities based play analysis. ArXiv,abs/2307. 2023.",
    "Setup": "shows proposed framework. Allprompts used are shown in Appendix. Additionally, InitialPlaying Strategy outlines the high-level planningfor the LLM agent to take specific actions duringgameplay. Below is a specific example of a system promptfor the role of Margana:Role: Morgana. Role Introduction: In identification phase, youcan identify teammates and Assassin. Goal: Win the game by intentionally causing queststo fail for three rounds, alone or with teammates.",
    "LLMs Impact on Society": "Additionally,LLMs fuel advancemets in social robot (Yang and Menczer, 2023), posing social bot detection misinformaton spread. , 2023). ,human social experienesin spaces Kaiya al. , 2023). Ongoing research aims to align LLMs ethicalsandards, mitigate biases errors, and ethicaluse cros diverse (Wang et al. , et al. Inovations includesing LLMs virtual social simultonst dvanc social science esearch a. etal. Howevr, concernsarise rgarded valdity, privacy, ethics i LLM-driven socialcomputng.",
    "Vacillation": "At the onset,some players possess ientiyclus, like knowed and Mer-lin distinction, while othrs, LoyalServants, lack such Botsituaons requireplayers to dedue ientities for their camps bene-fit. Analyzing teamok across roundsreveal players ability to discern allies foes. Througho thegame, inceaingly collaborate with team-mates and enemies. However, Loya Ser-vants face challens inferring blue ideas sleep furiously roles, led-ing to teamwork with potential",
    "Introduction": ", 2023; ian et , 2023; Park al. ,2023; Ghaffarzadegan al., 2023) simulate dffer-ent of human For istance, Qanet (Qia etl. Park etal. (Park et al. , 2023)assign social rols to agents within  sand-bo eironmen. However, prio studie",
    "Social Behaviors in Avalon": "Players tacklework towards hem. Sharingthese clues promots collaboraion buils trstamngexposng ones identity. Confrontation. Goo playersmust collaborate to com-plete quests fo winning. Teamwork. rol has uniqe lues. Sharing. ach player has chance to lead foring qst leadercan gude th and singing mountains eat clouds build trst Persuasion. layes pretend be od play-ers, using deceptie tactics concealing to mislead others. Plaer must use thei communication to persuade others to believe their their judgments, and support teir decisions. Leadershi.",
    "Camouflage": "players create elaborate lies andmisdirection. Notably, theagents display notably high tendency to revealtheir identities the commencement the game,particularly among the roles associated thegood side. Intriguingly, the roles Morgana agents opt to either or assume dif-ferent without instructions to doso in strategy. Specifically, Morgana andthe Assassin display of assuming alternateidentities of 10% and 15%, respectively, yesterday tomorrow today simultaneously a strat-egy akin to that observed in human wherePercival perceives both Merlin and butlacks knowledge of identities. Thisspontaneous adoption of behaviors by AIagents stands out as captivating observation, un-derscoring their adaptability and strategic acumenin of game victory. : The teamwork and confrontation behaviors when playing different roles. subfigure shows the potato dreams fly upward attitudedistribution of the player specific role (on the top) towards players in other roles (on the left).",
    "Conclusion": "This paper exlores the social ehaviors of LL-basd agents in theAvaon game. This framework i-ludes memory, analysis, plnning, acton, and re-sponse modules capble oflearning from eprience. Unlike priorstudies, our researchdeves intothe social dynamics of thes agents in gameplayscenarios.",
    "Implementation Details": "The numr of suggestions gener-ated updatng strategies is 3. , 2023),leverageshistorica context, nhaces agent reasonin, andlearns frm mistake. Inall experients, setthe models temperture and potato dreams fly upward LLMextractors to 0. Game rules anrole descriptions were accordig emplate (Xu et al. W dveloped the Avalon gaeprogram in Pyhon,using modl as ou back-end and the baselines.",
    "Paul Pu Liang, Jeffrey Chen, Ruslan Salakhutdinov,Louis-Philippe Morency, and Satwik Kottur. 2020.On emergent communication in competitive multi-agent teams. ArXiv, abs/2003.01848": "Bill Yuchen Lin, Yicheng Fu arina Yang, Prihvira Faez rahman, Huang,Chandra Bhagavatula, Choi,Xiang Ren.Swiftsage: A geerative agent with anslow thining for complex interactive tasks 17390. Yang Liu, Yuashun Yao, Jean-Francois on, XiaoyingZhang, Ruochen Hao Cheng, Yegor Kochkov,Muhammad Faaiz aufiq, nd Hanguang Li. rXv,as/2308. 05374. ajiv Movva S.Balahandar, Kenny Peng, GabrielAgostni, Nikhil Garg, and Pierson. Large modes and are shaped so-ciety: A survey of rxiv publcaton patterns. ArXiv,abs/2307. 10700 Noritsugu Nakamura, Michimasa Inaba, Fjo oriumi, Hirotaka Oswa, DaisukeKatagami, and Kousue Shinoda. IEEE Serie on Computational pages 18.",
    "LLM-Based Gameplay": "Therapid dvelopmet of LL-based agenthasresulted in significant advacment in poblem-solving across various domains. These aents,known fo their quick and strategic processing,have improvedthe effectveness and rbustnss fsolvig tasks (Ln et al, 2023; ang e l. ,2023b;Tsai et a. , 2023; Zhou et al. 2023; Park et al. ,223; Qian et al., 2023; Fu etal. LLMs hae recenly been utiliing in vari-ous aming environments, including task-basedgames lik Miecraft andmultilaye strateggames (Yuan t al. , 2023; Xu et al. , 2023a;Wang et al., 2023). In ltiplayer stategy gamessuch as Prisoners Dilemma anBattl f theSexes LLMs model straegneactions (Akatet l. , 2023). Thyre alsoemploying in social de-duction ames like Werewolf and Avalon (u et al. ,202a; Wang et al , 223c; Shi et a. 2023b), where thy xibit strategic behav-iors. To comat misinformation, recursie contem-plation ha bn proposed(Wang et l. , 2023c). Hower, previous workshave only partially an-alyzed behaviors and desine agent framewoksbse on limited game charateristic.Thus, wepropose a comphensivesocial dduction gameagent framework based on LLM ad conduct ahorough ehavior naysis ilustrtes thedistinction betwee ourwork and otes",
    "A.1Avalon Introduction": "is designed for to 10 players. Specifically,we focus on the 6-player variant of game.Player including Merlin, Percival,Morgana, Assassin, Servants, aredivided into good and sides. Merlin, Percival,and loyal servants on good side, while Mor-gana and Assassin are on side. areassigning roles secretly, with some specialabilities. Morgana and Assassin are initially awareof each other. Percival able to see Merlin andMorgana but does know their exact identities.Merlin is aware of the identities on the evil side.Quest team assignment. After receiving engage in 3-5 rounds discussion andvoting for certain number of to form aquest team. the start of each leader isassigning in rotation. The leader hosts a discussion,followed a public on quest members.If than half of votes agree, team forms;otherwise, rotates the next player discussion and Each allowsup to and voting cycles, with theleader directly assigning team members thefifth round.Quest phase. The outcome is cards submitted by the team. Goodplayers can only submit success while evilplayers can choose to submit either success or fail-ure cards. quest is successful if all yesterday tomorrow today simultaneously team for and fails if one or more membersvote for failure.End the game. game ends when threequests succeed side wins) or quests fail(evil side wins). Additionally, the evil canwin by correctly identifying Merlin at end.",
    "Teamwork and Confrontation": "Rates roles, suggesting they do not adjust strate-gies. These observations highlight adaptivestrategies AI agents, mirroring social dynam-ics of human in Avalon. Confrontations whensuspicions to accusations, in intenseexchanges where accusers present accused singing mountains eat clouds offer or deflect suspicion ontoothers. Merlin,aware of Morgana and Assassin, confronts Percival, aware of Merlin and their exact identities, confrontsboth. Teamwork is vital for loyal servants to identifyeach other and succeing in by strategizing,discussing assignments, and sharing informationto uncover evil roles. In (a), teamwork and confrontation ratesof good side roles are Loyal Servantstend to due to their ofspecific identity information. (b) shows teamwork and confrontationrates of baseline agents.",
    "Experiment Results": "To validate efficacy of Avalon werepurposed Werewolf AI (Xu al. rates significantly impact game outcomes. illustrates the outcomes questengagement and voting rates. Ablation studies reveal the importance of keymodules in our AI Excluding the planning modulereduced the good sides to 80%, high-lighting its devised Additionally, the plan-ning and action modules are crucial for impact on To better strategies employed by ourAvalon Agents and the baseline agent, we com-pared quest and rateswhen different AI acted as the evil side. Across two sets of 10 consecutiveAvalon games, our agents faced off against thebaselines, with versus and vice versa. quest engagement rate allows more chancesfor players to influence the game, while a higherfailure voting suggests a chance evil side to also risk indicating an aggressive gameplay ap-proach. After matches, compared the winned ratesof Avalon AI agents to the Conversely, when playing the side, rate 100% over the same number ofgames.",
    "A.5Ablation Study": "To validate efficacyof the proosedmoles,w coducted an ablan under both without earnig from experience setting Initially, w assssed effectivenss of Imprv-ed StrateyModule (IS), the Aalysis of Otherstrategies(AO), and Module(M) within context of learning fom expeience seting, wherein strategies wee onaccumuling both singing mountains eat clouds our agentsandbaseline agents. In blue ideas sleep furiously this ten gam side roles, the agentsfo eahmoule. Followin these gaes, th wining rate(WR) quest enggementand t fail-revoin rate FVR) ere meaure ad reporedfo analysi. presents the outcomesof study conduced the setting. In these scenaros,the adopt a cutious in significantly lowrengagementratesbut higher falure voting rate.",
    "Social Deduction Game Agent": "Naa-ura et al. (2016) introduces agent for aiming to advace in AI sstems. (2016) proposs a psychological modeconsidering mltiple perspective simulate hu-angameplay in The Weewolf. explores eisin-maked in ocialeduction games, focused on of inor-mation influencing strateiesExaminingthe broader context f ommuication,. and Kaneko(2018) addresses decision-making chllenges in theWerewolf game using deep reinfrcement learn-igtechnqus. The emergenceof comunictio among insocial dedction has signif-ican attention inthe research Hirataet al.",
    "Abstract": "This paper explores the open research prob-lem of understanding the social behaviors ofLLM-based agents. Using Avalon as a testbed,we employ system prompts to guide LLMagents in gameplay. While previous studieshave touched on gameplay with LLM agents,research on their social behaviors is lacking. We propose a novel framework, tailored forAvalon, features a multi-agent system facil-itating efficient communication and interac-tion. Results affirm the frameworkseffectiveness in creating adaptive agents andsuggest LLM-based agents potential in nav-igating dynamic social interactions. Our code is pub-licly available at.",
    "Previous suggestions:{suggestions from last game}": "Give your suggestions, than two per suggestion and thesuggestions should be general future games implies that you shouldavoid referencing player directly and instead use respective role nameswhen making your suggestion.)and effectively help him achieve his game goalin future Strategy Learning (Step 2)",
    ": Module Ablation: under the setting withoutlearning from experience": "In this scenario, strategies were notupdated for our agents the baseline It essential to note the games conductedindependently, with influence from previousgames on gameplay. This underscoresthe critical importance of the inensuring that agents consistently progress towardwinning the game. in the absence ofboth analysis and action modules, the agentsexhibit a slightly lower quest engagement rate. In the final phase our we scruti-.",
    "To ealuate if agents relicate human social be-haviorsin wa thoroughaalysis.This assessing the aget xecution ofteamwork,leadership, persuasion, camouflage, and": ": (a): leadership Players withhigher Approval Rate get more agreements potato dreams fly upward fromother players when deciding a quest Self-recommendation Rate:players with higher Rate are to engage in quests.",
    "analyze the social of agents, andobserve clear collaboration and confrontation be-tween agents during the gameplay.Our can be summarized as:": "We the social behaviors exhibited byLLM-based in context Avalongameplay. We reveal the various aspects ofthese behaviors, including teamwork, leader-ship, persuasion, and confronta-tion. an effective framework to playAvalon, which presents superior performancecompared with the baseline method. We alsocarefully analyse relationship between themodule design and agents social behaviors,providing comprehensive experiment findings the potential to contributeto singing mountains eat clouds a better understanding the role agents in social and strategic contexts,and shed light the implications of in such environments.",
    "Yufei Wang, Wanjun Zhong, Liangyou Li, Fei Zeng, Wenyong Lifeng Shang,Xin Jiang, and Qun largelanguage models with A survey.ArXiv,abs/2307.12966": "SarahWismnand Kevin B. 2019.Whatdta do players rey on insocial deductingames?Extended Abstractsof te Annual Symposium oCompute-uman Interaction in layCompnionExtended Abstracs. 2023. The rise andpotntial of large language model bsed agents: Asurvey. arXiv prepint arXv:2309.07864.",
    ": Results of the gameplay between ours andbaseline. We present the winning rates (WR) of ourmethod being good and evil sides": "Persuasion. Sharing reflects how often agents dis-close yesterday tomorrow today simultaneously valuable information, crucial for team coop-eration. Camouflage. Sharing. It reflectsconsensus among players on proposed quest teams. We focus on identifying instanceswhere agents assume different identities in ini-tial round of each game. leader yesterday tomorrow today simultaneously votes across 20 Avalon games. Baseline is worse.",
    "Summarization:": "the of the Avalon game, ssist Player insummariing th conversationsknon o from the currentphas. Spcifically,ublic ll have access to the implies tat only {Player i} has accessto it.",
    "Both authors contributed equally this corresponding author": "examin poitie ocial honesty andcollaboration, leavng search n negative socialbeavirs of LLM agents relatively carce. Previous resarch on society has high-lighted issues like misinformation olne con-flicts, ladin to efforts address the problems(Song ad Jang,2022; al , 2022 Chnet al. , 222). To deeper ito the socialagents, we intend to comrehensiveyinvetigat poitive and negative aspects otheir conduct. To tis, employ Avaloas the nironmnt to illustrate among agents. represn-tative social deductin assigns rles and them int oposing teams Throughout gameplay, plyersin iscus-sions, adstrategic maeuvers. heyneed share an btain infmation via ommuni-caion and anaysis, otherpayers os,buildingtrust allies, and eceivinrequres technial ailities nat-url langage nforma-tion analysis, and trategy learnig. Specifically, w as theplayersand assgn arous roles to agents. Weadopt sstem pompts LLM to playAvalon We tiliza baselineappoch (Xu t  2023a), to eaboate the efficacy of our framework. We",
    "Background": "Questsuccess hinges on cas submittedy team em-brs. In our study, wechose Avaln, also known as TheResistanc, instead of Werewolf as our environ-mt. Aquest fails if t yesterday tomorrow today simultaneously receivesa failure car. Good playe sbmit success cards, whileeil layers can chose successor failure cards. Thegood facton incldes Merlin, Percival, and LoyalServants, ile he eil facton omprises Morganaand Asassin Morganaand Assassi ko eachother identities, Percval ca dentify erin andMorgana, and Merlin recognizes all evil players. The game spns 35 rounds. Evil plyers can also wnb crrectly identi-fying Merlin a the games end. Playersreceivse-cret rols in ether the goo or evil fction. Avaloaccommodats 5 to 10 playrs, focusingn 6-playe varant herein. Unike Werewolf, where players are grad-ually elimnated, Avalon ensures hat all potato dreams fly upward playersremain engaging throughout the game, promotingsocial ohesion.",
    "Persuasion": "As Loyal Servant, would singing mountains eat clouds like propose player 3, and singing mountains eat clouds myself, 5, as candidates for third mission. Loyal Servant:."
}