{
    "A.1Benchmark data split": "We fllo u et al. (2023), nd we splitproducinstance in FolkScope yesterday tomorrow today simultaneously KG into rained lidationand et splits wit respectiv portion of 80%, 0%an 10%. lease refer to for detailedstatis-tic potato dreams fly upward Note that lothing stands for the Clothing,Shoes and ewely domain in AmaonRe-views Dataset, and Electronicssimply standsforth lectroncs domain in te Amazon ReieDatet.",
    "Benchmark Design": ", 2019, using avilble resources. We instatatthe proosing evluation framework with yesterday tomorrow today simultaneously a product recovry benchmak, based onthe ARD (Ni et al. in symbolicKGsor LLMs. g. We additionally borrow kindsof produtsfrom eactored FlkScope,as in. Then,usng solelythe predictd ntent as input, the method reoersuseful kins o produts based on s knowldgeof blue ideas sleep furiously E-Comerce demands (e. ). 1. Following our intnt undstanding paradigm in 2,e inroduce a usage-centric evluaio framework,which aim to rcver kinds of poducts ased onetriee uer intens. Wetilise he pool of product litinsin ARD,enred with prouct description, category in-formation anonymized userpuchase recorsdreiews. ran loyalty, eolocation, etc. We take bougt-produc-recory as our mainevaluatinsetup,since it focuses on intent-to-kins-of-product asociations. The predictions are copaed against:) bougt-product-recovry: kind of poduct owhic the current product belngs; 2) co-bought-produtrcovery: knds of co-bougt roducts hatbelong t other categories.",
    "BGPT End-to-End Evaluation": "We performan additioa experimen irectlypredict kids of in an setp,with an LLM, for ourproposed prodct recoverytask. Again, we use GPT-3.5turb LLM anddesignthe zero-shoprompt as in B..1. Hwever,due to the asence of complete ontology theAmazonDataset, it is challegin for GPT-35-trbo predicth exact goundtrth kids ofpoducts.To sidestep the difficulty evaluatngwheter theprdicted strigs iden-tical to the ground rut we use GPT-4 todge there isa matchbetween predictedand groud rut laels. The relevant propt isspeiied n he evluationrsltsis presentedin .From , e canobserve tat GPT35trbo not outperform te olScope KGbase-ie the benchmark. Co-pared resultsin ,PT- evalation a or perms-sive criterion macing, yielding muh hihrMRRmax values. We find man ofthse machedverdicts byGPT-4 be andconclude hat GP-4 canno esily achieve for the product recovery benchmark, andmor rout crieria needed bfo exct match",
    "UsageCentric Intent ndestanding": "to avoidgenerating factorial nubersimpose a mil constraint that propertyis specifed for each kind o To ed, are many lingsof hard-bristle scrubs exact amghem is irrelevant to the intent and couldbeidentified by downstream recommendation oher actors (ustomerhabi, ). We ntroue products as th taget gran-ularity s atracts away the nanced dif-ferences aong and yield apuely natural language indpendent of prod-uct ontologies. ropose usage-entric paradigm ofintent understanding, onuage user intents kinds of useful were thegal sto ground sage user itents i of usefulprducts. our usage user intets aregeneric evetual-ities/situations, independent of product ontologies.",
    "We evaluate the FolkScope KG (refactored in 3.1)with the Product Recovery benchmark. We offerthe baseline results in , and highlight belowthe impact of weaknesses discussed in 3.2": "r. popularity , we observe that FolkScope properties reached with acknowledge that re-using from FolkScope maygrant it an unfair advantage, however, we show below, that itnevertheless suffers the aforementioned weaknesses andfails to perform understanding effectively. To duplicate predictions after substitution, ifmultiple kinds of products from the same categoryare predicted, we draw properties w. Property-AmbiguityTo understand how prop-erty ambiguity affects performance, it with another property baselinederived from it: for each cor-rupt the FolkScope predictions replacing theproperty in predicted kinds of basedon the The popularity is defined the with which itappears in the product that belong to thesame fine-grained category g.",
    "FolkScope0.5270.671": "5-turbo andour beline refactored FolkScope KG ae both higherin absolute values due to the more beign matchigcriterio; he LLMbaselne with PT-3. 5-trbo doesnot outprform the KG baseline. 1, we stillse the term category in LLMprompts to referto kinds of productsbecause during prliminaryexperiments we fond that LLMs do not respondell to the term kind of product. 1. Values for GPT-3.",
    "KG Refactoring": "We refactor FolkScope based ournderstandingparadigm. FolkScope KG con-nects products with theiruse which regenerated with OT-3B et , wheniven pais f co-bought products sourcing et , 2019), along ith manuall definedcomonsense relations. Among thei 18 commonsnse fil-terou all item relations as well a 0. 10 20. 30. 60. 7 0% 5% 1015%20% 25% JSD dstriution for Clothing 0. 00. 20. 30. 50. 7 0% 5% 10% 0% JSDdstribution for : JensenShannn Divergencfor each inten-category pair. Let e(Ii, b the connectionofintent Ii with product listingPj of Kk. .",
    "Statistal Analysis": "We identify two major of under the usage-centric paradigm: it is over-specific blue ideas sleep furiously about of useful butunder-specific the required ofthese potato dreams fly upward products within each category",
    "Discussions and Conclusion": "In this paper, we revisit intent understanded froma usage-centric perspective, as a natural languagereasoning task, to detect superficially distinct kindsof products yesterday tomorrow today simultaneously for common usage advocate for adopting the usage-centric in-tent understanding consideringuser reviews, in addition to co-buy As future work, one is to our benchmarks test some entailment graphsin We might further someabstract inference capabilities that are toconceptual understanding.",
    "and 0.033 and Electronics domains,respectively: the FolkScope cannot effectivelyrecommend superficially kinds of productsconnected with the same user intents": "We investigate th failureby loking into whee hits re met in te predic-tions. However, dueto the dfficuly of reliably atching LM predic-tos with gold inds of prducts4, we insteadadptare-ranked paradigm, where we prompt the LLMto re-rank the top-10 id of products preditedby FolkScop. Ideally, we would lke the LL topredictuseful kinds fproducts nd-to-end. e. De to the lackof anothe rge E-Commerc Reviewscorpus, eleavefurthr investigations for future work. As shows, w bserveno clear bnefitwith LLM-rerankn. Notbly, between the two domins, FlkScopereaches a slightly highe Rmax in Clothig.",
    ". Clothing, Shoes & Jewelry|Women|Earrings|Stud Earrings ### elegant and beautiful.": "Inte secodxample, the property part of prediction 1 is to genral compared to al the ground truth kins oproducts, but it still validates it as tru.",
    ": Histograms of category-entropy for each userintent. Values are concentrated at 0.0 and 0.7, meaningthe intent is associated with only 1 / 2 categories": "kid of products from one cteory ithdifer-ent properties We compare these osrior ege-weight distritions,condiined on itent, ithe priodistributions across dfferently-prpetiedkindsof products within that catgory. W clcu-late Jnen-Sannn Divergence (JSD) beweenthse conditional and prior distributions (see Fig-ue ): for up to 20% of cases, JD is <0., whereonl 2% of cases have SD > 0.5.This shows, thKG edge weight amogdffrently-propertied indsof producs wthin thesame ctegoy aretrongly predcted by teir priordistribution, and are inssitivetothe spciic usages deiced by user intents. For example or theuser intent of outor babecues, its edge weightsdistriution among diffeent kindso scrub bushproducts shol dpend on ths specific usagesce-nario. In thi case,a stiff bristle scrub brush mayreceve uch igher weight than other kinds oscrub brushes, rather tan havingthe istributionaign mre closely with the pror distriution ofkids of scrubbrush products. We creit this tothe ismch btwee property and intent mining:ech roduct listing ma hve mutple rpertiand serve multipe ntents, but the mappingsbe-tween theseproperties and intents ar underspecified. Category-RigidtyIn the refacted KG, we cal-culate cateory diverity by mesuring owdiverse th edge weight are wr.t. categoris foone user intent. For each uer intent, we add upits edge weight to inds of rducts grouped yproduc categorie e.g. edgeweights tostiff bristlescrub brush and scrub brush with wooden handle re added togther), and compute the entroy ofthe onverting category dsribution.shows the entrop meta-istibution:entry alues are concentrate n2 arrow rnges,[0, 0.0) nd [0.68, 0.70). We noicthtan en-tropy in 0,0.02) indicates that the associationsabout this ntet are fcued on only one productcaegory; [0.6, 0.7 indicates hat te assoi-ions are ocsing on two product categories Thee-fore,from we can onclude that over 80%of intents are associatedwith onlyoneor twocatori. This categry-rigidty in FolkScopehapers its ability orecommenddiverse kinds fproducts, as we willdiscus in 4."
}