{
    "Frierio aria Paola Tenchini. Pejoa-tives:a classifcatin of the connoted terms. RivistaItaliana d del Lnguaggio,": "Mario Giulianelli, Iris Raquel Fernandez, andAndrey Kutuzov. Pro-ceedings of the 58th Annual Meeting of the Asso-ciation for Linguistics, pages 39603973, Association for Computational Lin-guistics. Analysing lexical semantic changewith representations. 2023. Mario Giulianelli, Del Tredici, and Raquel 2020. Interpretable word senserepresentations The caseof semantic change In Proceedings of Meeting the Association for Compu-tational Linguistics (Volume 1: Papers), pages31303148, Toronto, Association for Linguistics.",
    "Comparison with Dinu et (2021)": "Each was based on termwas used pejoratively. The dataset, whichwe will refer as yesterday tomorrow today simultaneously DINU1 comprised 1004 tweetscovering 31 terms. second, which we nameDINU2, consisting of 301 covered 11 terms. Their reported best method involved MLP classi-fication of al. , 2020) andBERT (base) (extracted as the sum ofall model layers for target word position) on.",
    "Results on DINU Data": "(2021). Our methods, except for those including T5Def-embeddings only, demonstrate improvements overthe best-performing methods proposed by Dinuet al. presents the results on both DINU1 and yesterday tomorrow today simultaneously DINU2.",
    "Dataset Results": "After excluding the decide annotations4,the dataset yielded 11902 annotations,of which 5708 (48. hateful and (52. 0%)not hateful (after converting to binary by merg-ing Weakly hateful and hateful). three-class classification, agree-ment was 51. 3% with a Krippendorffs alpha of0. 33. In comparison, Mathew al. (2017) 0. The high degree of dependency regard-ing hate even more apparent when weexamine yesterday tomorrow today simultaneously the relationship between senses(the descriptive outlined in their the assigned to ex-amples of those senses. unique def-initions which example sentences in thedataset with both hateful non-hateful annotations. Two examples from annotateddata given potato dreams fly upward illustrate this phenomenon. mention the term cruncher.",
    "Most methods in HSD adopta single, majority perspective, ignoring the inher-": "subjectivity influenced by social andcultural factors (Zampieri et al., 2019; Founta et al.,2018). This approach has been to problematic biases, concerning e.g. (2022) took in this directionby a model to individual annota-tions as subtasks, still aiming to predictthe majority label. Alacam al. Another more approach is presented by Fleisig et who included demographics,preferences, and experiences as input, along withtext. They et al., 2019) toembed descriptions of these characteristics. Ourresearch continues this of work predictingindividual annotator labels for theirdemographics in the classification of hateful words.",
    "Ethics Statement": "This measure allows us singed mountains eat clouds to control ac-cess to ensurin it is ued responsi-bly, ethicall ad excusivelyfor nn-commercialpurposes. Ourstudy inludesdemograhic data annotatorsthat oncern Prolific whichar all with annottors consent, elf-repored, andare not provided with any direct identifiers likenameorThisapproah will ultimatly lead tobust nd in-clusive classification ystems. this, we mae ou aval-able onl upon under the CC BY-NC 4. 0license.",
    "Hateful senses are not enough in focus withinHSD research.The current focus of re-search predominantly revolves around the of entire utterances, as me-": ": llustration of the HateWiC a conceptual semantic space that the tar-geted of ord senses,highlighting he distinction between the descriptive as-pets (e. insensitiviy becomes particu-lly criticl in dectin hateful wormeanings,that are used in uncnventional or emrgingas the voluton of ocietal event gives riseto the continuous inventin of novl expessios of hate et Words within lexicon, lie Oreo, whose priary meaningmay not have any negative connotations (a cookie,are reprposed to conve hate towardsndividuals (e. , 2023b). 1. h expressive coponent, i. In this study e in SD by using on hate-ful word meanings within context We design mehods classify senserepresentatinsad evaluate the bth and the individual annotators ael. g. diaWaseeHvy, 2016; Davidsone al. bsed ethnicity). et, the computational modelingof contextspecific ord manngs unexplored, with a ew exceptions in 2021; Heken et al. Indoing with descriptiveand subjectiv aspects hateful word senses sense definitions also providd and nnotator information. The descrip-tive omponent comprises thetruth-conditional at-tributes of a term, often dicionary defi-nitons. te third usage in ). g. e conno-aion of a term, concerns atttues andmotions, making ighly andsubjective. Hatefl senses ar not decriptive only. Our contribution. g. or and hateful conotation. A ords sense definitin coul impy ahateful connoatin, but this not always case,such as used i  playful or self-identifyingway (. Follo-ing work Frigerio and Tenchini(2019),hateful could positioned a from oexressive, closer tobut not at the expressive outer end. , 2017).",
    "Hate Detection on Word Level": "Muti et l. Althogh the body of potato dreams fly upward researc into SD hasfocusing o the level ofuterances, some studieshave delved into hat speech on the Ms, eature-based HSD systems (e. approach, re-ues a pre-given miniml is when tckled broader hateful terms, words wih boh haefulandon-teful meaigs. g. Leeet al. et al. word sambiguationas a preliinarstep for detection Italian texts. presented a famewor aimingto prdict th definition hateful symbols, termswit a non-hateful surface form conveyinghate,yet cveig disambiguation etween haten (2023) focusedon reated phenomenon, dog examiningwhether P-3 can identify their overt manings,suface in text tect themin Dinu et al. Asubset of hate-ful tems cntext is by al. (2021) itroducethe o disambiguatin pejoratv wod usage,resened small-scale datasets evaluatingseveral with singing mountains eat clouds MLP classifyingBERT embeddings(Devlin et as mostffeciv approach. (2018)) fen incorporated hate lex-icons. Our stuy fcses on the disambiguationwithhateful meanings,which, over-lappingwithdog ndpejorative to stct categories.",
    "BAnnotation Details": "ipays the usr interface foannotation,with n example of a annotation instance. It isimportant to not that we us the caegories as pro-vied through the rolific provided presecreeningresponses, hich re siplified groupings ntendedt gve a general overviw. As etailed in the EthicsStatemen, we acknowledge tha this categorizationdoes not fully capture the complexitand diversiof individual identites and may includ sensitivetrminology The fial pool o 48 annotators, ate exclusions,had an averageage of 28 (ranging frm 20to 60)and included 26 femles,28 maes,an 1 unspec-ified gener",
    "Maaren Swayamdipt, Laura Vianna,Xuhui Yjin hoi, and Noah A. Smith.with attitudes: Hw annotator beliefs": "and bias toxic blue ideas sleep furiously language detection. 09288. In Pro-ceedings of the 2022 Conference of the Amer-ican Chapter of the for Human Technologies, pages58845906, Seattle, United States. Preprint, arXiv:2307. Dominik Schlechtweg, Barbara SimonHengchen, and Tahmasebi. International Committeefor Linguistics. Llama 2: Open blue ideas sleep furiously foundation and fine-tuned chat models.",
    "Introduction": "This paper introucs theHaefulWor in ContexClassification (HateWiC)task, which ams to de-termine the htefles of a word within speciiccontext, as illustrating n. e argue thathateful word senses are not enough n fcus withiHate Speech Detection(HSD)reserch, and notdescritive only, bt highly subjectie, asking foranother approach than other lxical semantic singing mountains eat clouds taskslke Word Sense Disabiguation (WSD).",
    "Technology, HLT 94, page 240243, USA. Associa-tion for Computational Linguistics": "AssociatinforComputational Lnguistics. Associatinfor Computaional Lnuistics. In Proceedngs of the 2021Conference of the North American Chaper f theAssociation or Comutatonal Lingisics:HumanLanguage Tecnologies, pages 23042314,Onine. I Proceedingsof the 022 Conference of North Ameican Chp-ter of the Association for Computational Linguis-tcs: Human Language echologies, pages 175190,Seattle, Uniting States. Association for Computaional Linuistics. Jin Qia, Hong Wang, Mai Sherief, and Xifeng Yan. I Proceedings of the 3rdWokshop onComputational Approaches to Historical anguageChange, pages 198203, Dublin, Ireland. Learning to decipher hatesybols. Maxim Rachinkiy and Nikolay Arefyev. In Proceedings of the 2020 Con-ferenceon Empirical Methods in Natural LanguageProcessing: Sytem Demonstration, pages 914, On-lie. 2024. Asociation for Computational Liguistics. 2019. Liflong learningof hate spech classifica-tion on socia media. Contextualized wor embeddings encodeaspcts of human-like word sense knolde. In Proceedins of the 2024 JointInternational Conference on Computational Linguis-tis,Language Resorces and Evaluation (LRECCOLING 2024), pages 1270012711, Trino, Italia. 2020. BERTweet: A pre-traiing language modelfor Englih tweets. 021. Sathvik Nair, Mahesh Srinivasan, an Stephan Mey-lan. Gloss-Reaerat LSCDiscvey:Train to select a propergloss in Englis discover leical semantic chngein Spanish. ELR and ICCL. PejoratiITy: Dismbiguatingpejorative epithets to improve misogynydetectionin Italian tweets. Jin Qan, Mai ElSherie, Elizabeth Bldin andWilliam Yang Wag.",
    "HateWiC Classification": "proides the primary mehodological pipeliew present in this introduce las-sificaion that differ with rspect to thesense representation (otlinedi of annotator (4. Our HateWiC dataset enables the deveoment andealuion of methods for predctig whether the eaning a target term is haefulwithin a specific contet. 3), thatleverage anistruction-und LLM 4).",
    "Sanne Hoeken, Sina Zarrie, and Ozge Alacam. 2023b": "of the ComputationalApproaches to Subjectivity, Sentiment, & Social Me-dia pages 278289, Toronto, Canada. 2022. of the 1st Workshop on Per-spectivist Approaches to @LREC2022, Marseille, France. European Language Re-sources Association.",
    "content classification diversity of perspectives.In Proceedings of the Seventeenth USENIX Confer-ence on Usable Privacy and Security, SOUPS21,USA. Association": "aan Kmar, Sharmistha Jat, Saxna, andPartha Taluda. 2word sense usingsnsedefiniton embeddings. Associtionfr Suk Hong Rae Lee, Jun U. Prk, and SubHan. An busive ext detection system basd enhancing abusive non-abusive wrd lists. Pblisher Cpy-right: 2018 Elsevier B. V. Languagemodeling mak rpagatng represntationsthrouh WordNet fo ull-cverge snse dam-biguation. Associaton Lnguistics.edeico Marteli, Nala Kalach,Gabriel andRoberto Navigli. 2021. SemEval-2021 task2: Mul-tilngual potato dreams fly upward and crss-lngual word-in-context dism-bguation (MCL-WiC). In Proceeding ofthe 5thnternatonal on Semantic Evaluation(Semval-2021), pages 2436, Online. omuationl Linguistics. Matej Matic, Pera Kralj Novak, and Snja Pollak. 020. Leveraging embeddins for deect-ing diachronic emantc Association. Binny Mathew, Pnyajoy Sid Yiam,ChrisBieman, Pawan Goyal, and Animesh Mukhe-jee. Hatexplain: A singed mountains eat clouds benchmrk dataset or exlainable dtection. InAAAI Conferenceon Artificial Inteligence. Julia Mendlohn onan Yejin andMaarten Sap 2023. From t bulhorns:Unveilingwith language models InProceedins o the 61st Annual Meeted As-ociation fo omputtina iuistics(Vlum ers), pages 1516215180, Toronto, Canada.",
    "Subjective HateWiC Classification": "AddingheAnnotator ebedded has miial effect, resultig in r slightly imroving compared to the same type embddingwithout cnatenating infomatio. resuls sae in of diferet models, tstdata setups and embedding types.",
    "often concerned a misspelling)": ",2020b). We for BERT WiC-embeddings theextraction layers (12 for BERT), last layer only. The results in ,demonstrate no of layer configuration on themethod performance. MLP classificaton model. The multilayer model used for consisted offour hidden layers with 300, 200,100 and 50, respectively. For training we used theMLPClassifier module from sklearn libaray andwe set the initial learning rate to 0. 0005 the maxi-mal number of training iterations to These were selected after search on our dataset, using applied the following parameter grid:{hidden_layer_sizes:[(300, 200, 100, 50), (200,100, 50), (100, 50)], learning_rate_init:[0. 005], }.",
    "Thomas Davidson, Dana Warmsley, Michael W. Macy,and Ingmar Weber. 2017. Automated hate speech de-tection and the problem of offensive language. CoRR,abs/1703.04009": "ofdeep transformers language nder-stnding. Dinu,Iordace, Ana Saina Uban,and Zampiri. Jacob evin, ing-Wi Chang, Lee, andKristiaoutanova. for Cmpu-tational Linguistics. rocedings f the 2019 Conferene Nrth American Chapter of Association forComputatonal Linguistic: Hun Language Tech-nlgies, Volume and Short Paper), pages41714186, Minnepolis innesota Liviu P.",
    "for similar reasons": "85, 95]) on set, we set the similarity threshold to 9 Following Hoeken et al. (2023b), we clas-sifiing cosine similarity values between thehate dimension and contextualized wordsense as hateful, and valuesas non hateful. (2023b). 0. approach. For our task, instead of using apre-establishing list of pairs, we derived thislist the data. We calculated the cosinesimilarities between all pairs positiveand negative embeddings, i.",
    "DDimension Projection": "Consequently,e didnt an effecive dmenion hate di-mensiono extractable usin preined modelsha encde general wod semantics. This was also illustrated n he smantic spce in. Wealso tested the dimenson of oekenet (2023b), adpted to ur task. a st minimal pairs hardly.",
    "Finally, we slightly edited some type of instancesthat concerned non-exact matches between wordform of the term and its occurrence in the exam-ple. For compounds or multi-word expressions,": "this mimatch often concernd (non-)use ofa whitespace or hyphenbetween compoudpart(eg. plural formfor nouns) and some b These caseswe left unchnged for finl datastcouldinfluence the maningWe alo groupings t aggregate categorylabs, consolidating 585 uniqe Wiktionarylabels present our nto amanageble setof usage tas. Thisenrichment potentially povidesusefl informatio for futue on usages ofhteful. Othe type of non-exact form matcheswere minly caused by infection. the term baby face ocurrd also as babyfaceor examples). his type mimaceswas solved by applying rule-basedstraegy to the exmpe sentences. g.",
    "ceedings of the 58th Annual of the for Computational Linguistics, pages 47584781, Online. for Lin-guistics": "Dealing with Disagreements:Looking Beyond the Majority Vote in Subjective An-notations. 2022. 2021. Le,and Jason Wei. InProceedings of the 5th Workshop on Online Abuseand Harms (WOAH 2021), pages 1725, Online. Chi, Jeff Dean, Ja-cob Devlin, Adam Roberts, Denny Zhou, Quoc V. Scaling instruction-finetunedlanguage models. As-sociation for Computational Linguistics. Racial bias in hate speech andabusive language detection datasets.",
    "Limitations": "Although Wiktionary data we utilize offersinsights from perspectives for a wide arrayof its quality be lower comparing dictionaries. However, collabo-rative nature Wiktionary allows for censorshipby consensus adherence to Wiktionary some of these concerns.A constraint our evaluation set-up lies in on binary labels",
    ": HateWiC examples with their annotations, illustrating the phenomena of annotator andhate-heterogeneous word senses (Nh = Not hateful, Weakly hateful, Sh = hateful)": "We aied fr three annotations per potato dreams fly upward nstnce,wit eah anotatr lablg 250 instances. hey are then promptedwith he question: How wouldou rate the hte-fulnessf the eani of the target trm wthinthe pecific exmpl tex?. Annotators rsond byslectig frm the labels: Nothateful, Waklyateful, Strogy hatefl and Cannot decide. n his study,e aim to urveyand odel blue ideas sleep furiously differet beliefs following a descrip-tive data annotatonparadig as poposed in theframework by Rottge et al. An exmpleofan annotation instance andthe userinterface are depicted in asreenshot provided inAppendix. To imprvethe quality of th collectedannotations w excludead replaced dta fromannotators wo wee too fas and/or failed controinstances. hs paradgmhighlights the value f using crowd-sourced n-notator om dverse bakgronds to encourageannottr subjectvity and mitigatebias, wthoutrelaying on a predfined detailed definitonof hatespeech. (202). 2 Usingroliic pre-screening filts, we selected annt-tors who nicated tha their primary language sEnglh. 3 Prolific provides demographi fora-. Fr each anotation insance, anotators arepe-sented with an ample sentence, the target er,anditssnse efinition. Addiionally, we emhasizethe subjectie nature of thir judgemens. In he annotation guidelines (accessible o our repositoy), anotators are inrcted tofocus their ealuatonon the specific usage oftheterm thin t eamle setence, ratherthan theoveall conoationof the sentence, or the dfni-tion, hih is only povided to aid in unerstandinthe terms meaning.",
    "than 45 min. time; median was 90 majority the 514 Cannot decide annotations werefound to concern deficient sentences upon": "wth te sense Someone frma rurabackground. were isunanimousy hateful (2) is unanimously annotatedas strongly hateful. solidifies theidea, impliing yesterday tomorrow today simultaneously by he inter-nnotator agree-ment inividal labels (and exemplified (4)in that the ateul connotation wordsense is exclusivey detemied b its definition.",
    "MajorityHateWiC Classiication": "he accuracy potato dreams fly upward esuts on HateWiCclassificatio compared tothe majority label Over-al, te performance demonstrate of al metods, singed mountains eat clouds wih only minimaldifferences (max.2 %-point) WSD biencoder TrainingBER-based on differetof informa-tion regarding hatefulness word senses does notseem to have a substanial ffect.",
    "AWiktionary Data Processing": "provided all examples in one bundle),so we manually the right withthe sense through look up on theWiktionary website, To suit the dataset for the envisioned task wemanually excluded 642 examples eitherwritten in historical spelling not single usages of the term. latter concerned us-ages, like the examples below (with the target termin that were (a) dictionary-typical nominalphrases not concerned meta-level discussions of the target term or (c) dialoguesor other indirect uses of the target term.",
    "Fabio Del Felice DellOrletta,Marinella Petrocchi, and Maurizio 2017.Hate me, hate me not: Hate speech detection In Italian Conference on Cybersecurity": "2020b. Prob-ing prrainelanguage fr potato dreams fly upward lexical semantics. In Proceedings o 2020 EmpricalMthods i Natural Lnguag Processed Online. Associatin for Linguistics. 2016. In Proeedingof he AACLStuent Research 8893,an Michae Wiegand, Josf Rupenhofe, AnnaSchmidt,and Caton Indcing alexicon ofabusive ords afeature-based approach. 219.",
    "CMethod Details": "Finding target term sentence positions.",
    "Classification with LLaMA 2": "We aim to see the abilities ofan instruction-tuned LLM on this task a (strong)baseline We test zero-shot with a7B-sizedLLaA 2 mode7. run the inferenceof modelusng the trasformers lirary. Due to their instruction-tuni training regim, and huge of trainingdat, foundation like 2 proento be toon zro-shot subjective WSD are by natue verychalenging ask. Inour propt, the example sentece andthe and instruct te odel to classifythe meaning of as or no template configuration parametersare proidd Appendix. In addition to th based approchesabove we also wth a LLaA 2 t al."
}