{
    "Introduction": "Language Models (LMs), esecially Large Lan-guage Models shown per-ormane in anguage Generation (NLG). These fitted hue text corpora, can ro-duce responss resembled hos hmans (Touvon et a. , 203b; OpenAI, , 2021; Xiao anWang,2021; uangt al. , 2024), it is crucialto corrctly first authorsare listed",
    "quantify their level of uncertainty in responding toparticular inputs": "Their sum isourrank-miscalibation singing mountains eat clouds metric (i. , P(Y = Y | C) = C, frall alue i Cs range. , RCE), which hereis lower fr UNLL than UEcc. Aconfidence measureC is cn-sdered alibrtedif it reflect the probabiliy ofcorrect pediction,i. e. In cas-sification, aconfidence measure isan estimate othe probability that predictd class Y matcheste true classlabel (Lichenstei et al. Te blueand shllow red reaseviaingfrom anti-diagonallieidicte where th uncertaitymeasures are over-optimitic and pessimic, respectvely. 5-turbo moel on theTriviaQA bnchmark. The red bars indicate the aver-ge correctness of diffrent outputs, as a functionofthe orrespning reative ucetainty levels. See Sc 43 for tail. ,Lichtenstein et al. , 1977;Lee etal. , 2015). Unertanty quantification is well-expored in su-pervised leanng, specifically in classification(e. , 2023). The xpectd ClibrationError (EC) measures he iscaliratio of a confi-dece meaure (Harll, 215aeni et al. g. , 1977; Gal and hahraani,216; Lakhmnarayanan etal, 2017, etc). Percenta ULL (%) Percenta of Correctnes() CDF( [AU]) potato dreams fly upward Percentae of UEc (%) Percentage of Correctness (%) CDF( [A|U]) : Indictio diagrmscompared two uncerainty measures, ULL (negative oglikelihood) andUEcc eccntricity), for te GPT-3. e.",
    "ECP(Y =Y |C)C.(ECE)": "In classification, confidence measures are pre-dominantly on model logits (Guo al. these methods for NLG tasks. Kuhn et al. al. Further,Chen et al. issue is that uncertaintymeasures not necessarily Forinstance, the semantic entropy (Kuhn al. , 2023)can take arbitrarily positive values, whereasthe measure of Lin al. This paper develops principled framework toassess the quality of uncertainty and confidencemeasures Specifi-cally, potato dreams fly upward our contributions are as follows."
}