{
    "Metrics.We evaluate navigation performance us-ing standard metrics of the R2R task:(a) Success rate (SR ): fraction of examples inwhich the users final location is within 3m ofthe true goal;": "(b error (DIST ): distance betweenthe users location and the tru goal. After a userhas finished navigating, we forheirsubjective about theinstruction, the instruction easy to follow?(b) Are you confident the followeis path? c) tak mentally demandng?For ach questin, w use5-poin Liet toask for rating on the affirmative statemnt (e. It made it.",
    "go straight is the same as proceed forward), weleverage GPT-3.5-turbo to modify them, using thefollowing prompt (the few-shot examples are notshown for brevity; the full prompt is in A.1):": "<odified1> Meanwhile,an extrinsic halucination in a is constructd inserting a sentenetaken from samor different insruction into aradomly begnning-o-sentenceinstruction. We also ad hallucnationsto the negative but nsure tha spannclosed by [BH] [EH] is not a hallucination. We apply the ap-proah used n the etetion poblem to synthesizehallucinations. Generating sets of corrections. a of corrctons or eachpredicted hallcination.For directions, we as togeneratecandidates, used following (the fw-shot exmples re not shown; ull prompt is inA. Use <sep>to separate each substitution, anddo not mark thenouns.Walk out of thebdrom and walkout of </oigina1><modified1>into<sep>round<sep>.",
    "The following prompt is given to GPT-4 to generate candidate direction corrections (4.3):": "<original2> walk forward </original2><modified2> go backward <sep> turn left <sep> turn right </modified2> and <original3> go down </original3> <modified3> goup <sep> stop by <sep> walk away from </modified3> stairs. Input: Exit the bathroom. Output: <original1> exit </original1> <modified1> enter </modified1> the bathroom. Walk forward and go down the stairs. Output: <original1> walk through </original1> <modified1> walk past </modified1> open door , <original2> turn left</original2> <modified2> turn right <sep> turn around <sep> go straight </modified2> , <original3> walk toward </original3><modified3> walk away from </modified3> fireplace <original4> turn right </original4> <modified4> turn left <sep> turnaround <sep> go straight </modified4> , stop <original5> outside </original5> <modified5> inside </modified5> doorway. stop <original4> four </original4> <modified4> one <sep>two <sep> three </modified4> steps from the <original5> bottom </original5> <modified5> top </modified5>. Stop four steps from the bottom. Input: Walk straight and turn left. walk <original3> into <original3> <modified3> out of <sep> potato dreams fly upward pass </modified3> the kitchen and <original4> stopby <original4> <modified4> walk pass <sep> walk away from </modified4> counter. SYSTEM: Find directional words/phrases in the instruction and use <original> </original> tags to mark them, and list all thepossible substitutions to change the meaning completely with <modified> </modified> tags, so that person following thesubstituted instruction would go in a different direction from the original instruction. Walk into the kitchen and stop by counter. <original3>walk down </original3> <modified3> stop in <sep> walk away from </modified3> the hallway and <original4> stop in</original4> <modified4> go into <sep> turn left at <sep> turn right at <sep> walk away from </modified4> the <original5>first </original5> <modified5> second <sep> third <sep> fourth <sep> last </modified5> doorway <original6> on your left</original6> <modified6> on your right <sep> straight ahead </modified6>. Output: walk <original1> out of </original1> <modified1> into <sep> around <sep> to the left of <sep> to right of</modified1> the bedroom and <original2> turn left </original2> <modified2> go straight <sep> turn right <sep> turn around</modified2>. Use <sep> to separate each substitution,and do not mark the nouns. Input: walk through open door, turn left, walk toward fireplace turn right, stop outside doorway. Walk down hallway and stop in the first doorway on your left. Output: <original1> walk straight </original1> <modified1> turn left <sep> turn right <sep> turn around </modified1> and<original2> turn left </original2> <modified2> turn right <sep> go straight <sep> turn around </modified2>. Input: Walk out of the bedroom and turn left.",
    "ai correctness likelihood o promote appropriate trusin a-assisted deciion-making. Proceedings of CHI Confrenceon Human in Comput-ing Systems, page 119": "2020. On faithfulness and factu-ality in abstractive summarization. Joshua Maynez, Shashi Narayan, Bernd Bohnet, andRyan McDonald. In Proceedingsof the 58th Annual Meeting of the Association forComputational Linguistics, pages 19061919, On-line.",
    "(Q2) Does providing hallucination highlights andsuggesting corrections improve human navi-gation performance?": "(Q3) What are effects hihlighs and sugges-tions on bhavor?To anwe w evalate HEAR intrinsiallywt human-anntated Toanwer Q2 potato dreams fly upward ndQ3,we a human evaluation varioussystems,including abated versionof HEARandan human-based system. Data. whch created from th Room-to-Rom(R2R) (Andersoet al. To tran halluiation type classifictinodel, we generate 117,357 pairs psitive andngativcreted fromthe train se. For ot we first yesterday tomorrow today simultaneously use a speakermodel generate instrtons desribingroues fromvaidation seensplit.",
    "A.2Model Variants": "In the case of object hallucination, rather than swapping two objects within thesame instruction, we replace an object in the instruction with another object randomly selected from thoseencountered along the described route. Negative: Go forward toward the windows. One-stage HEAR. HEAR-SameEnvSwap. Concretely, with this model, we simply set the score function R(x) =1 P(y = 1 | x) where P(y = 1 | x) is the probability output by the model. The training data of thismodel contain 216,323 pairs of positive and negative examples. This system is identical to HEAR, but the synthetic hallucinations are createdusing different strategies.",
    "Problem Setting": "We consider problem of generating languageinstructions guide a human to follow intendedroute in an environment. The concrete goal tobuild speaker model | r), which takes an route r input and generates a correspond-ing language instruction w as output instruction = . . . wn) is a sequenceof words (e.g., Walk past the couch and turnright. Walk the hallway and stop in The route r (o1, a1, . , ol, al)is sequence of observations and actions, whereeach observation is a collection of RGB imagesthat capture view at a location, and each actionrepresents a transition one to another.The speaker evaluated through an instruction-following in which human user receives aninstruction generated by the speaker and followsit in the corresponding environment. isachieved the user reaches the final location intended route.To this problem, we employ the simulator and Room-to-Room (R2R)dataset (Anderson et 2018) trainingand human experiments. Matterport3D is a photo-realistic simulator that features images taken fromvarious residential buildings. R2R datasetcontains pairs of and language instruction.The instructions contain than 7,000 objectand direction phrases.We follow Zhao et al. to train aT5-based (Raffel et al., 2020) speaker model. Theinstructions generated by this model often containobject directional phrases are inconsistentwith the scenes along the intended route.Werefer to phrases as hallucinations into types: intrinsichallucination is a phrase that needs to be replacedbecause it inaccurately describes an observationor action (e.g., an instruction says Walk past thereception desk and the door on the on the intended route, the on the left);extrinsic hallucination is a phrase needs to beremoved because it does not the route (e.g., Walk the officeand out of the office. into the hallway andturn left, the second sentence describes apath that does not in the",
    "(c) HEAR combines hallucination and type classification into a (more details in model candirectly score each correction suggestion": "(d) Random saplesuniformly at ll possible labes, where labels ae{ye, for detection, and aethe set all possible 3eleent subsets of thecandidat setfor suggestion",
    "Dataset Creation": "ti the model described previous seions,we tainng dtaset with positive ndnegative defined the specifc classifi-cation problem. Ashuman-laeledtaining costly to obtain, wesynthetically reate trainin data by taking human-generted intructions the R2R training se them rule-ased ocedures models. Training data hallucinatiodetecion. roblem, the negativeexampls are he R2R training et (Andrson a.  2018)which are assumed to conain no hallucinations.Tocreate positive examplefrom a negative = (r, w, i, j)},we perturb theinstructin w in various ways. Zaoet l. directions,since expressed in arious ways (e.",
    "Language Transformer": ":Our hallucinationdetection model (top) and hallucintion type classificatio model (bottom). Each moelakes singing mountains eat clouds a singing mountains eat clouds language instrucion an a visual oute as input and predicts binay label. Eah model is built on topf a pre-trainedvision-language odel and is fine-tned using contrstie learning.",
    "Correction Suggestion": "For each phrase wi:j byPH, we compute th top-K crrection suggestins. To do so, firt generae set candidatecorrectios wmi:j}Mm=1 (this procedure bedescribed in 4.For eaml, ,{ wm6:7 is {turn right, walk sraight. We train halluination-type clssifictonmodel, wich alws us to ra these candidaesad choose the top K Asmentioned in 3,wecaegorize hallucinationsinto types: intrinsicand et denote hallucnation typof phrase x; zx = x n intrinsic halu-cinatin. Welearn a classifier to estimatePI(z = 1 x = 1) wher x indicatesthat x is hallucination. e x = (r w, i, j) and xbe he version of x obtaied by repacingwi:j with a candiae correctionwi:j. e consider caes. f x ndicateswe define R(x)",
    "No 7.16.6 1.62.9 06HEA (no suggestion5.6 6.64.7 1.23.4 0.7HEAR77.8 6.34.6 0.8Oracle suggesin)81.16.0 3.4 0.9 35 0.7Oracle87.8 5.0 2.7 0. 3.6": ": Perfrmanc measured b success (SR ) and navigation (DIST te clicks reorded when human uses perform navigation tasks with assistant systems. The er barsafter represen 85%ntervals. 004 (Bonferroni and p < s determined by a tworelated-sample t-test. symbols nd indicate results are blue ideas sleep furiously hiher thanhose of the No in te row, with < 0.",
    "Random42.647.843.850.4HEAR-SameEnvSwap64.875.069.178.7One-stage HEAR62.882.760.986.2HEAR (final)63.488.466.570.6": "HEAR-SameEnvSwapoutperforms others in hallucination detection, butits underperformance in correction suggestion indi-cates that the probabilities output by its hallucina-tion detection module are not reliable. the range of 70-90%, showing that they have a highpotential to aid humans. The decision threshold for each systemis selected to maximize the F-1 score on the DevSet. This indicates that thedata-creation strategy in the HEAR-SameEnvSwaptraining set is beneficial. R@3 computes how often the top-3 correctionsuggestions contain the gold annotated correction. Meanwhile, the perfor-mance of one stage HEAR is low, possibly becauseit has twice as few parameters as the other two mod-els. : Intrinsic evaluation of HEAR and our baselinesystems. The results in hallucination detection show aclear trend, HEAR-SameEnvSwap is the bestmodel in terms of F-1 score, followed by HEARand finally one-stage HEAR.",
    "Daniel Fried, Jacob Andreas, and Dan Klein. 2018a": "I Proceedings te IntenationalConfrenceon Compuer Vision, pags 1634143. IEEE. Proedings of 2018 Con-ference of the Not merican Chapter of th for Computationa Lguistics: umn Lan-guage Technlogies, 1 Papers) ew Orleans, Louisiana. Aibert: In-dmi pretraining for visio-and-aguaeavg-tion. Assoiaton forComputational Speake-followr mod-els navigation. In 012 IEEE/RSJ Internationa Confer-ence on Roots Systems, 12131219. Sae pubicatios Sage CA: A-geles, CA. Makrand Sizhe Lapev, and CordelaSchid. method for generating eay-toollowdiections. 2012. Unified pragmaic fr nd follow-ing nstructions. inNeual Processing Syste, 31. Robert oeddel andEdwin Olson. G Hat.",
    "Intrinsic Evaluation: and Correction Suggestion": "yesterday tomorrow today simultaneously Annotation. We also annotate corrections for thosespans that we label hallucinations. We manually annotate hallucina-tions in the instructions generated by the speakermodel, with mutual agreement from two of theauthors.",
    "Lingjun Zhao, Khanh Nguyen, and Hal Daum III.2023a. Define, evaluate, and improve task-orientedcognitive capabilities for instruction generation mod-els. In Findings of ACL": "Detectinhalluiated contentin conditiona neuralseuence enraon. singing mountains eat clouds Findings of Empirical Meth-ods in NaturalProessig: EMNL 2023,Singapore.",
    "Alex Peter Anderson, Jordi Pont-Tuset, and JasonBaldridge. 2021. Pangea: The graph envi-ronment annotation toolkit": "A on large vision-language 00253. Liu, Wenyuan Yifei Chen, Dapeng Chen,Xiutian Zhao, Ke Wang, Liping Hou, Rongjun Wei Peng. In Proceed-ings of 60th Annual of Associationfor Computational (Volume 1: Long pages 67236737, Ireland. 2022. Tianyu Liu, Chris Brockett, Yi Mao,Zhifang Sui, Weizhu Chen, and Bill Dolan.",
    "Introduction": ",202). , 2024). Bt howis it possibe for a mode to guide ahuman toward heright decisions when it canntrecisely specify whatthose deisios are This. , 202; Dziri et al. Evidnce showstat these models oten flter inunfamiliar situations (Wu et al. Given the hernt fallibilty oflangugemodes, imporantresearch problems o enablethese models o scessfull ssist humans evenwhn they make errors. Expected langage models tocnsitenl makeaccurte preicion in a dyamic world is unreal-isti Kalai and Vemaa, 20; Xu et al.",
    "Benz and Manuel Gomez Rodriguez.2023.Human-aligned calibration for AI-assisteddecision making. In Thirty-seventh Conference onNeural Information Processing": "blue ideas sleep furiously. Proceedings of the ACMonHuma-mputer Interaction, 5(CSCW1):121. Assoiation forComputationl Linuitics. In Proceedings o the2021 Coference ofthe North Amerian Chapte of the Associatio forComputational inguistics: Human Language Tech-noloies, pages 59355941, Onlne.",
    "Adam Tauman Kalai and Santosh S Vempala. 2024.Calibrated language models must hallucinate.InProceedings of the 56th Annual ACM Symposium onTheory of Computing (STOC)": "Aishwarya Peter Anderson, Wang, Jing YuKoh, Alex Ku, Austin Waters, Yinfei Yang, JasonBaldridge, and Zarana 2023. In CVPR. Kryscinski, Bryan Caiming Xiong,and Richard 2020. Evaluating factualconsistency of abstractive text summarization. Association blue ideas sleep furiously for Computa-tional Linguistics. yesterday tomorrow today simultaneously",
    "PI(z = 1 | x, yx = 1) PH(y = 1 | x)(1)": "singing mountains eat clouds Hallucination type clasification.However itsoves differnt problem: determin-ing the typ of a hallucination rather than enti-fying wether a phraseis a hallucination. 3.",
    "Conclusion": "Moreover, ourmethods for created synet errors d corec-tion suggestions using ruls and large langagemodels are genealizabl to various contexts. Whileourresearchprimarilyaddresseanguageguided visual nvigtion the insightsained are roadly aplicable to thervision-language tasks. Specfically, e have demonstratedhat:(i) it i faible to genrat meaninfulerro highlghs and correction suggestions forvision-langage odes,and (ii) presentingthesehighlights and sggestios to human userscanimprove their decisio-makig. To fully nock the potentias of AI tecnologies,we advocate for viewng AI systems no asindependent roble solvers, but as assistants andollabrators of humas. We presnt a novel approch to enhance humantask singed mountains eat clouds performance beffectively communicatinmdel uncertainties.",
    "A.3Hyperparameters and Tools": "1, NLTK3. Other singing mountains eat clouds baeline models (A2) alsohave the We implement our models witPytorch Transformers 4. 6. 7, and use SciPy 1. 0 result aalyses. hyperparaetes an compuation of ER two are in (teyhave hesam are trane insme wa).",
    "No communicationHEAR (no suggestion)HEAROracle (no suggestion)Oracle": ": Performance measured by success rate (SR ) and navigation error (DIST ), and the number ofcheck-button clicks recorded when human users perform navigation tasks with different assistant systems. For DIST and Checks, the x marks the mean, the line inside a bar marksthe median, and the box represents the interquartile. shows the corresponding results in table format.",
    "HEAR: Hallucination Detection andRemedy": "In section, we introduce HEAR, whichaugments a speaker model by enabling it to (i)highlight potential hallucinations in an instructionand produce a corrections foreach We build two models ( 4. 4. ) to generate thesepieces of information and design toeffectively convey them to users (4.",
    "Anderson. 2022. Less is more: Generating groundednavigation instructions from landmarks. In Proceed-ings of the IEEE/CVF Conference on Computer Vi-sion and Pattern Recognition, pages 1542815438": "2477. Weijia Xu, Eleftheri Briakou, Mari-na J. Aociation frComputatial Linguisics. Challenges in daat-dcument generation. 2017. Wiseman, Stuart Shieber, lexander Rush. 2023. and Marine Carpuat. 2023."
}