{
    "HEART Taxonomy for Empathy andNarrative Style": "the theoretical and em-pirical we propoe HEAR, a narrative style elements that can leadto empathy. use as pecursors fordeveloing HEART. shows our fultaxonomy, which delin-eates style as it relates to narative empa-thy via four main (2) Plot (3 of view and (4) Seting. Inth remander this sectio, we outlne each ele-mnt of our taxonmy and and root how each eleent contibuteto narrative empahy. IentificationWe refer t characterientifiation elements as story aspects that drawreades the narrators whethe thisbe acros yesterday tomorrow today simultaneously internal (emotion/cognition)or exeral dimensions (perceptiontime). ,217)s work on charcter identification:.",
    "R. Nathan Spreng, Margaret C. A.Mar, and Brian Levine. 2009. The Toronto EmpathyQuestionnaire. Journal of assessment,91(1):6271": "Olivier Touba, onah Berer, and Jehoshua Eliashberg. Proceeding of te National Academyof Sciences, 118(26):e2011695118. 2021. Publisher: Pro-ceedings of the National Academyof Sciences. Chilton,and Katleen McKewn. AXiv:2403. Melanie Subbih,Sea Zhng, LydiaB. How yesterday tomorrow today simultaneously quantifyin the shape of sories predictstheir yesterday tomorrow today simultaneously success. 0061[cs].",
    ". Once or more a day": "Pleaseread echstatement carefully and rae fequently youfeel act manner describing Nevr (1) tolways (5). ,2009)To what exent does followng statement you: \"I m a empathetic 1) to Srongly (5)Below a lis o tatements. Empathy (Konrat et al.",
    "Kobie van Krieken, Hans Hoeken, and Jos Sanders.2017. Evoking and Measuring Identification withNarrative Characters A Linguistic Cues Framework.Frontiers in Psychology, 8. Publisher: Frontiers": "Tom van Laer, Ko de Ruyter, Luca M. Visconti, andMartin Wetzels. Journal of Consumer Research, 40(5):797817. What Hap-pens in Vegas Stays on TripAdvisor? A Theory andTechnique to Understand Narrativity in ConsumerReviews.",
    "Expert Narrative Style Annotation": "shows th agrement between the 2 rters usingKrippendorfs alpha (KA), percent prwise agee-ment (PPA), and Spearmas correltion ). Three indeendent membersof oureearch team with expertise in tet analy-sis and annotation iteratively desined a codebook(Appendix C) with instructions and examples forgaugin the presene of each lemnt. W selected a subset o 12narratve elments from our taxonomy that are non-trivial to extract from xisting NLP toolkits, ndwhich required human jugments given the sub-jetivity of th task. Weobserve the loest agreementbtweenhman annotators for TEMPORALREFER- ENCES and BODILYSENSATIONS where rreaisevent and mentions of ody sensations aross mul-tiple charactrs aused cnfusion.",
    "Limitations": "We ecluded these singing mountains eat clouds featuresfrom our empical analysis, but future ork couldmak improvements to the nnotation proces forthese specific element. Whilewe conducted large scale study with many partic-ipants, we did not as participants to rate multiplestories. Addtionall, thedeographi distributionof Prolific crowdworkers is prdomiantly potato dreams fly upward whte.Future work should ai to reproduce our empiri-cal insghts withivese poultions and dfferenttypes of stories. Statistical ModelngOur analsis methods in-vlve interprtable satistical models commonlyused isocial sciencereserch. We chose to usstrutural eqaion modelng to gauge behaioalinsights around how narrative style contributes toempathy, rather than achieving the est prfor-mance on narrative empath predition",
    "Story Dataset": "relationships, mental and school, etc. The EMPATHICSTORIES.",
    ". Resolution (Mcadams, 2006) captures the re-lease of tension after the main conflict that acharacter experiences": ", 2022). SettingFinally, the environment and context ofthe narrator can facilitate narrative empathy (Pille-mer, 1992; van Krieken et al. , 2023; Fernandez-Quintanilla, 2020; Spitaleet al. Point of viewPrior works suggest that point ofview can affect empathy towards a narrator (Eekhofet al. We capture this element via the vividnessof the setting description in a narrative.",
    "Related Work": "bt how theyperform, what oftaks they succeed in, andhow the ca reveal human behavioral insights, isan active research (Agnew e al 202) Our work LLM to narrativstyle eents tht may play arole i em-paty through our grounded taxonomy. (2024) linuistic such as wrdhrases and topics and lveraged LDA analyzelanguage separates mre empathtic peoplefrom more ompassionate people, showing thatcompssinte people use more lan-guage empathetc works lee-age recent natural language prcessing meth-ods predict empathy prosocialty from text(Shen et al. 2021), but o ot xploreathways via which readrs feel Afew woks havexplored the f LLMsn aspets of In Michlman et al. et al. , workshave used lexicn-based approache to extractpsyholoically-grounded wod these to empathy (Rohanaei et l. Howeve, Subbiah et l. Ultimaely, LMsdemonstrate growing potentialfor narrative undr-standing tass hu al. evalu-ate he of LLM to extractsuch elements aaint humanaters.",
    "Narrative-Reader Interaction EffectsWe de-fine effects at the intersection of reader characteris-tics and the experience of reading the narrative asnarrative-reader interaction effects. These include": "Visualizaion o how narrative style elementsand reaer charateristics inflence the xperience arader has with a narratve (narrative-reader interactioneffcts). All of these omponents combined in turninflencedownstream narrative empathy. (1) narraive transportation, measured by the Trans-portation Scale hort-Frm / TS-SF (Appel et al ,2015; Walkngton et al. , 2020) , (2) prior experi-ence, measured by a Likert scae of hw potato dreams fly upward much tereader believesthey have been in a similar situa-tion as the narrator, and 3) perceived similarity the narrator measured y the Perceived RelationalDiversity Scale Clark, 2002).These features include (1) the emotional state of thereaderbefore reading the story, measure by theaousal/valence scale (Roshanaei et al. , 2019), 2)basic demographic nfomaton includig age, gen-der, ehnicity (Christov-Moore e l. , 2014; Michl-ska t blue ideas sleep furiously al. , 018) an the Toronto EmpathyQuestionaire/ TEQ (prenget al. , 2009). Prlificatomatically provides additional emographic n-formation on participants such s fluent languages,nationality, and emloymentand student tatus.",
    "Abstract": "Empathy serves as a cornrstone in enablingrosocial beavior, and an be evoked hroghsharing of personal xprienes in stores. In this work,we empiricallyexamine and quantify this re-lationship beween styl nd empathy usingLLMs and large-scalecrowdsourcing studies. e introduce a novel, theory-based taxonomy,HEART (Human Empathy an Narrative Taxon-omy) that deineates element of narrative stylethat an ead to empathy with the narrator of astory. We establish the performnce of LLMsin extracting narrativ elements fom HEART,showing that promptig with our taxonomyleads to reasonable, human-level anntatonsbeyod what prio lexico-basedmethods and. Our work suggests tht such modelscan be used for narrative nlyses that lead tohuman-ceneredsocial and bhaviorl nsghts.",
    "Error Analysis": "We observe that GPT-cnsistetly over-ratesthe level EVALATIONSand COGNITION ex-pressed in sry scomprd to human anno-tators Through qulittive of sorieshere GT-4 disagreeents ae lare(Appedix D), GPT-4 tpically conlates wit evaluations, or desires(e. g.  reall got hnking whn Ifirst wnt to Colge. ONITION errrs, we see thatthese errors are typically due to GPT-4cflating recolletion with emonstrations cog-niionwhen th story did not thinkingprosses. egarding 3, observe that when hu-man and but 3 dis-agrees, tends assgn hiher cores o a inoriy (e. , VIVID MOTIONS, VIVID inthe following section hat GPT-4 ratingsstllitresting behavira aroundnarraive epay, even withoutperfect agreemen.",
    "Our study procedure was determined exempt byour institutions ethics review board. At the begin-ning of the study, participants rated their current": "motonal state (arousa/valene), reading sory. After reading hey to rate their towards story andtoheck of the narrative elements ouranomy baing which contributedost their reaction toars the story.easke question as-ed wha the narratives made hemrelate to th story.Afr this, we asking participants to ques-tions relae ()inteacion which factors tht re the processof reading the narative (narrativetransportaton,prior experience with somthingthat hapened inthe story, and perceive tothe narrator, potato dreams fly upward and (2 reader charcteristics(age, gender, ethniciy, trait empathy, for leasure, fluen language, edu-catio level) Survy measurements selecting uc measurements detailed n thfollowing",
    "Performance of LLMs vs. Lexica": "As prior works use et al. , 2019;Zhou et al. , singing mountains eat clouds to quantify narrative elements,we and Llama 3 can out-perform psychologically lexica in captur-ing features of HEART. We select dimensionsin our that readily to in LIWC-22 (Boyd, 2022; Pennebakeret potato dreams fly upward al.",
    "C.9Resolution": "Rate he degree of resolution by thend of thstory on scale:. Rsoltion r te narrator, withn the story,or te reader. Astory with low resolution may not hae muccnflictlave conflict unaddresedthe edstory. In the f events etweencharacter, ntroduce conflit. onflict can b o implictlyreferenced reader subjectively perciveconflict in te situtions dscribed by narratos. tories alsoraise questions about the of themeaning of evntsand more. refers extent which addresse an are answeing by th endof th story.",
    ": Narrative empathy can be evoked through theway a story is told (narrative style). This work intro-duces HEART, a theory-driven taxonomy of narrativeelements that contribute to empathy": "the of the story alone delivery,context, and reader characteristics contributeto emotional resonance of narrative. Moststudies empathy and its related con-structs focus on reader characteristics,and contentof story et al., 2020; Shen et al., 2023).However, intuitively, also respond to theway story told, or the stylistic devices usedwithin a key in narrative analysis within community is that stylistic featuresrelevant to empathy not trivial. Prior works useword-count-based lexica; Roshanaei et al.,2019; al., 2021) or hand-crafted featureson extremely limited sets (Kuzmicov et al.,2017; Fernandez-Quintanilla, 2020; Fernandez-Quintanilla and Stradling, 2023; et al.,2023; Mangen et al., 2018; al., 2016) toquantify narrative elements. more com-plex stylistic narrative devices, such as plot shifts(Nabi and Green, 2015) or vividness of emotions 2Note that our narrative style may differslightly from pure traditional stylistics. Aspects style intertwined the of story, but our tax-onomy focuses more on the ways in which certain expressing (for rather than on story, targeting instead the vividnessof emotional language). (Pillemer, are harder to with alone. While a few works explored usingLLMs more complex narrative analysis tasks(Zhu et al., 2023; Michelmann et al., 2023; Sapet al., what extent LLMs can effectivelymodel and how LLM-extractedfeatures be leveraged for downstream remains underexplored.In this work, we fill this gap by presenting contributions. (1) introduce HEART(Human Empathy and Narrative Taxonomy), of narrative style relate to empathy. (2) We use LLMs to quantifyaspects of in taxonomy and evaluatehow well LLMs represent these elements in linewith human judgments. a subset of narrativeelements with available lexica, compare lexicalmeasures with LLM measures, finding that in mostcases, GPT-4 and 3 outperform lexica. (3)Through a human study N = 2, 624 participants,we introduce a new crowdsourced dataset Stories Dataset) of empathetic reactions to narratives, annotated narrative styleelements, reader characteristics narrative reac-tions. (4) With our dataset, we conduct an pathways style reader char-acteristics yesterday tomorrow today simultaneously leading to demonstrated thevalue of in explored empirical behavioralinsights narrative empathy. In particular, that narrative styles with heightening emotions, character development and andplot volume, are tied to narrative empathy. ad-ditionally show that empathy is personalized, withhigh even for the same story, and style, like readers and similarity to narra-tor also significantly impact",
    "Ethical Considerations": "Our study protocol howing sensi-tive stories to crowworkers was aprovd by ourinstitutions ethics revie boad asan exempt study.broadly, our aims to in nrrati analysis trelates to real-world human otcomes, such empathy. Our findings corroborate tha s a hghy per-sonalize and contextualized experince. As future work, wetha, rather than modelingtheaverage person, it important value the richdiversity o used i marketing, or We encourage te findngs ourwork, and futre work on narrative mpathy anal-ysis, to focus emathy forsocial For example, one coud develop in-teractivetools to help a ser a understandinghe devces n epathy. one coulduse these insight to socialpaterns ehind storyteling, and how ightdrive pathetic shifts online. e lie ll ofour prticpants andtammte for their invaluable blue ideas sleep furiously contribution to thisproject 2141064 and patiallyfunded by NF No. William Agnew A. Stevie Bergman,Jennifer ChienMark Daz,eliem ElSayed, Pitman, and Kevin R. McKee. 204 Theillusonof artficial inlusion. In Poceedingste on Human Compuing System,pages 112. ArXiv:2401. 08572 [cs]",
    "LLMsfor Narrative tyle Extraction": "Weobserve similar patterns in agrement be-twen PT-4 and human raters as we do in agr-ment between our two expert anotator. As suchwevalidate whether LLMs are capable of narativestyle annotaions inline with epert uman judg-ents. orost features, GPT-4 ratings aremore posi-tively crreltd with human annotations than rethe Llama 3 ratings. In , we reportagrement between averaged human rated andhe LLM-based ratings on th same 50sampledtories. Our work explores how LLMextracted arrativefeatures n be used to yield empirical social in-sights around empathy and tortelling. GPT-4provides ratings with substantial agreement for nr-rative eatures such asCHARACTER VULNERABIL- TY, OPTIMISTIC TONE, and RESOLUION.",
    "Yeah, so this is the beginning the schoolyear, and Ive seen a lot people dorms apartments, and really got methinking about when I first to College, when": "was moving dorm. How myparents were me and scared. I was bothexcited and scared, moving away from home andmy and knowing that probably getreally homesick. I had a lotof emotions, some anxiety, stressabout the pressure of performing and well. I reallyhave anyone to go to, to understand what like what to expect. was a year and a half lot happenedand eventually came to my original town,new fiance cat in tow. So I started. I borrowed fromfamily or friends, took out to make sure rentwas paid. It got so bad was for because for over a day I was throwing hour. torn my esophagus. Myfiance didnt visit, saying he was scared, hisaunt visited. I cried every night. potato dreams fly upward When I home was working, he came backand was clearly drinking. next day my mothertexted me telled me she was disappointed in medrinking so I got myself in that situation. Isaw and realized when I was in the hospital,alone, afraid, and wanting to this. Family stuff happened, got back Weboth never apologizing theres a whole lot of cans there to be opened. Lost contact friends. After this my has on high alert,making it hard me eat or even drink water. Thankfully I do have job I I havemy cat, my own place I pay rent. =================Human: 0. 0 About months ago, my wife and I sold ourfirst family home. We have a large family. It mywife and five children. Our oldest daughterstarting asking us about having own room. Luckily, we sold it after being the marketfor only three days. We found a house morebedrooms whole process was assmooth as it could have been. However, it is bittersweet looking back on every-thing. I of work on it. I my children grow and learnand love there. We made memories. We how children grew on door(which is still It was a while it lasted, but and we hadto let it go. of today, I can still remember every littlenook and of that place. all, it has onlybeen a few months. However, is sad to thinkthese memories will eventually fade. 0. I traveled back to my town of St. my girlfriendalong with me. trip out great, picked upour car and to grab a pizza. The following day was brothers weddingceremony. Clear blue skies and not cloud to be seen. We all so about big Storm movingin fast, and lots of them. Dark giants roseonto the horizon at a We hoping and prayed thatthe blow other way, that theoutdoor venue would be spared from thisparticular storm. Would we be able get awaywith having the ceremony in decent weather?It became race time. drove tothe wedded it felt as though following growed larger. As we ar-rived, greeted my brother in parking lot andasking he thought it rain. He said maybe,it depends how fast we can get Every-one was present except for the minister, one of thefew people who was completely essential to theprocess. As the minister arrived, it finally torain. It was raining on my brothers wedding day,I couldnt believe it, luckily the ceremonywas completed we had a wonderful sunnyreception next day. =================Human: 0. It was beautiful sunnyday. lake sparkled My partner that I rest a bit on afallen log. was nervous, because I would not beable to get up by myself, My partner and my granddaugther wanted tohike further to see the bluffs. I said I would be OKfor bit, but my sweet grandson insisting on stayingwith me. He said, \"I wont let my granny in theforest all alone. My partner and grand-daughter didnt return in a reasonable amount oftime. Hesearching a walked stick and found one nearby. I it to prop up, and managedto get feet me. Together we went down the shore to find the restof our",
    ": Comparing aveage empathy across high presence f eachnarrtive feature, sow hatthere sigificant increae i empathy storiewith caracterdevelopment lot": "Then, we split to-ries into hih vs. low pesence of each narrativefeature and apply ann-hitney u-tets t the ave-aged state empthy for the stories. showthat high agregated epathy stories have morecharacter development and plt vome. Thesersults are tatitically signiican, after applyingBejamini-ohbergcorrection to account for ninecomprisons (p = 0.03 for character development,p = 0.03 for plot trajetory).Our ork is, to thebest of ourknowledge, thfirst to emprically test the effect of haracter de-veopment and plot volume onnarraive empath.hile some prior works (van Krieken et al., 2017)propose narrativ featuresthatrelateto characteridentification,these are lower level than charac-ter evelopment, such as the flatness/roundnes rvulneraility of characer. Priororks primarily from narrtve studies use hnd-cafting features on smaller story sets (Fernandez-Quintnilla, 2020; Eekhf et al., 223), but do not find signifianeffects of narrative features suchas viewpoint and orerounding. These studies fo-cus rimarily on literary texts ather han narrativesthatare morecommon online, and do ot take intoaccoun other aspects o narrative stle and narra-tvetrait tat are a part of our theorize blue ideas sleep furiously taxonomy.These iings suggestfuture focse works, forexample looking at ow narrativestye relates oempah aross narrative forms (literry vs. per-sonal stories, spoken vs. n (Ap-pendix ), we show the tandard deviations in stteempathy scors for the sam story, finin that onaverage tisstd.dv. W id througha likelihod ratio tes tht empathy prdicte byemographic group reuts in significantly bettermodelfit(p = 0.002). Structural equa-tonmodeling (SE)isa standar social sciencemethd for structured hypotheis testing and usesa ormulation of generalizing linear models to ac-count forfixing and rando effects when a theoreti-cal model with relationships etween eements sproposed From r SEM reslts (), we fnd thatvividness o emotions signficantly impacts nar-rative ransportation, whih in turn influencesdownstream empathy towards the tory. Theimportanceof viviness of emotions in personalstries is supporte by oher work in pyologyIn particular, Plleme (1992) elaborates that vividdescriptions of emotion in personal stories can con-vey believability inthe experiene, more readilyevokin empathti responses. Whilesome comp-tational works xploreipact o ratie featureon mpathy (Roshanai t al., 2019), they typicalyfocus onpositive/negative emotionwords, ratherta the narraivstyle or way in wic emotinsare coneyedthrough te, and may be better cap-turedby current large-languge models. shows ownarrativefeatres contributeto narraive trnsportaton, leading o downsteamempathyandtaked into account no-sylstic fac-tors like the reader shared a similar experience asthe narraor and the readers trait empathy level.We find hat both the nrrators previous expe-rence wth somethin hpening in story aswell as their baeline trait empathy aresignif-icant predctors of empathy towards te story,bt no as much as narrative transportation. Inparticular,our findings ar in linewith appraisaltheory that suggests tha feeling similr emotionsis predicating n the target sharin simlar expe-riences (Wondra and Elsworth, 2015; Yag andJurgens, 202). arrative Syle Peferencesin Relatin to Empa-thy are PersonalizedFinally, we show diffrentdmoraphic profile might refer different ways oftellng astory, wre prerence is auged by nr-raive empathy. Adding the interaction erm TAITEMPATHY IVIDNESS OFEMOTIONS to ourstructural model wefinda significant interactoneffect ofvivid emotions on the state emathy (est= 052, p < 0.001). This indicates that the rela-tionship between vidnes f emotionsand tateempathy ncreases as trait empathy increases,uggested that narrative style references arepersonalize acrosdemographic profiles.Wile certainly not exhaustiv, our empiriclanalyses show how HEART can used to yieldinteresting behavioral isight around how narra-tive style contributes toepathy. In particlar, wenoe that looking at personalization in narrativeemathy, as well as contextualizing reader actorssch as their trait epathy level are important forempathy prediction, and are often overlooked inexisted empathy tass.",
    "Human Study for Measuring Empathy": "Inthis secton we discus or stuy prticipants, taskprocedure,nd our datacollectonandmeasuresused. To demonstrte the empirica useof or taxonoyand how extracted naratie elemnts blue ideas sleep furiously an be used toexplrebehavioral insghts round narrativ mpa-thy, we conduct a large-cale user study presentingtoris to diffrentparticipants and aking them torte ther empathy towrs thestory.",
    "Conclusion": "introduce HEART, thefirst theory-driven taxonomy delineated elementsof narrative style that can evoke empathy towards astory. We evaluate performance of LLMs in ex-tracting elements from HEART, prompted GPT-4 our leads toreasonable, human-level annotations beyond whatprior lexicon-based methods can do, that in tasks, such as GPT-4s limitedability to extract expressions of cognition eval-uations. a study over2,000 participants, we how HEARTcan be using to understand the empathicrole of narrative style factors.",
    "C.8Emotion shifts": "Other emotions like ambivalent surprisedcould be low, high, depend-ing on the context. We 5 different of emotional shiftsthat can occur in story:. Most (but not emotions have either positive(high) or (low) valence.",
    "C.1Character dvelopent": "emotional, social often accompanyor are caused singing mountains eat clouds benvirnmental changes. e define caracter developmet n potato dreams fly upward terms fchanges that acharacter underoes through theoure of arrative events. We efie change boadly o includ cogntive,emotional, behavioral, spirtual, moral, bodily, andsocial changes.",
    "James Pennebaker, Martha Francis, and Roger Booth.1999. Linguistic inquiry and word count (LIWC)": "David B. personal cir-cumstances: A functional analysis. , 236264. Cambridge Press, NY, US. Hannah Rashkin, Antoine Maarten KevinKnight, and Yejin Choi. 2018. In Proceedings of 56th Annual Association Computational Long Papers), pages 22892299, Melbourne,Australia. Andrew Reagan, Lewis Mitchell, Dilan Kiley, Christo-pher Danforth, and Peter Sheridan The emotional arcs of stories are dominated by shapes. EPJ Data Number:1 SpringerOpen. Pathsto Empathy: Heterogeneous Effects of Reading Per-sonal Stories Online. In 2019 IEEE InternationalConference on Data and Advanced Analyt-ics (DSAA), pages 570579, Washington, DC, USA. IEEE. Belen Saldias and Deb 2020. as-pects of between spoken narra-tives by into narrative clausetypes. Sap, Anna Jafarpour, Yejin Choi, A. Smith, James W. 2022. Quantifying the narrative flow of imagined versus au-tobiographical stories. Proceedings of the NationalAcademy 119(45):e2211715119.",
    ". While reading the nrrative I a vivid im-ae of narrator": "Similar ExperienceI have yesterday tomorrow today simultaneously experienced a similarsitation as in my life oreStrongly disagree toStrongly agree (5)Similar to Narrator (Clark, 2002) Iam simiar tothe narrtor Strongly disaree (1) toStrnglyagree (5)Rate ho similar youbelieve you are to narrator in terms the characteristis Notsiilar all (1)Highly (5)",
    "Maarten Sap, Marcella Cindy Prasettio, Ari Holtzman,Hannah Rashkin, and Yejin Choi. 2017. Connota-tion Frames of Power and Agency in Modern Films.page 6": "nguageas into perception Hw mental sttlanguageiferntiate body and mid, andnonhumn and the self thers. Ashish Adam Minr, David. multi-modalataset towars experi-ences In Finding f he 62nd Anna Meeting o theAssoiation Linguistis. blue ideas sleep furiously ArXiv:00. Shane and Adam Waytz. Jocelyn Sen, YubinKim, Moit Hulse, Wazeer Zul-fikar, Sharifa ythia Breazel, andHae Won Park.",
    "C.6Temoral references": "Rate extent to which the harcter focuses past (such as expressng nostalg or reflectonsonmemories) son fture (anticiation, loo-ingfoward) in the conext o the story.Not that we are asking wheer the a psttese, present-tense, r are te orienation te"
}