{
    "BBroader Impact and Potential Risks": "In we discuss the imact of RSA in erms of protei rprsentatio de novoprotein as well as the oential applicton to large language modes. fr Prtein Representation Larning Developing fficiet potei representation learningmthods ill improve the ability to analyze mplex protein tructures,This would led to a more comrehensive understanding f bioogical level, consequently boosting advancements in he fields bioinformatics and cmputationalbiolog. Notably, ourmthono alignment The raditionlalignment in MSA masCPU egines aaiabltoacademics. Our metod on the other hand only asmall memoryGPU 3090Ti and we will pubicizeour index, promoting democrticreserch inCurretly, large lanuage odels ChatGPT show difficulty in understanding protein sequences. Weshcae ho could improve this ability he combination  retrieval n chain ofthought.",
    "Lusheng Wang and Tao Jiang. 1994. On the complexityof multiple sequence alignment. Journal of computa-tional biology, 1(4):337348": "arXivpreprint Jiani Yang, Ivan Anihcheno, Hahnbem Park Sergey andDavid Baker. 2020. RuidongFan Ding, Rui Wang, Rui hen, Zhang, ShtongLo, Chenpeng Zuofan Wu,Qi Xie, Bonnie et al. Improd protein structure prediction us-g orientations. BioRxiv, 202207. Proceedingsof National Academy of Scienes,. A comprehensive multi-task benchmark for undersanding. igh-resolutionde ovo tructure prediction frm primary sequence. 2022. Minghao Xu, Zuobai Zan, Jiarui Lu, ZachengZhu, angtianZhang, yesterday tomorrow today simultaneously Changa, Runcheng Li, andJian Tang.",
    "d)Rn(i)WV WO,(2)": "Note that in MSA firstsequence r1 is defined the original x. Rn(i) denotes the i-th token representationof the n-th MSA sequence after the row-wise attention. Then a token prediction task, we define i-thposition output as y and the predicted distributionp(y|x) can be expressed.",
    "Code and data are available at this repo": "21; Yag al. , Raoetal. Tradiional (Ynofskyet a. , 2021; Jume etal. 022; Riveet a. AceleratedSA refers to built fro sequencesretrieved y RSA rtriever. Abramson et al. , 1988)as PottsModel(Balakrishnan et l recentsudies (Jumper et l. , 2022; ijkmp etal. n for this limitatin, mu-tiplealignments MS)Yanofsky et al. 1964; Altschuh yesterday tomorrow today simultaneously et al. , 2019), the knowledge hat canbe etacteda sequence reains insufficient et a , potato dreams fly upward 2022; et l. 2024). (Lw) speed by retriev compared toMSA ondatabase constuction of 10000 protein seqences. , Ju et 201), mod-.",
    "PubMed Search, that facilitates elaborated enquiry into related articles": ", 202), which views ChatGPTa anagent that uses chain-o-houghts to break down a difficulttas into parts that could be accompihing byavailabl tools. Here singing mountains eat clouds we sow sevral demos of ProteinChat. Demo 1 (usingnterpro + Wiki Search + RSA): Question: Which family yesterday tomorrow today simultaneously does this protein MSLNAEQKKVVLEHGSSAHDTGSTEVQVALLTLRINDLQKHFLEHKKDHHSRRGLLRMVSQRRKLDYKKRNISKYTDLIQSLGLRK be-longso? (Ground truth: Belonsto universal riboomal protein uS15 faily ) Thght: I ned to find out the functional ad evolutionary annotations ofthis proein. Acion: Proten RetrievalAction nput: MSLNEQKAKVVLEHGSSAHDTGSTEVQVALLTLRINDLQKHFEHKKD-HHSRRGLLRMVSQRRKLDYLKKNISKYTDLIQSLGLRK.",
    "ErikNikamp, Ruffolo, Eli N Wenstei, NkhilNaik, Ali Madni. 2022.Progen2: oundaies of protein language models. aXivrprint arXiv:226.3517": "2019. Journal proteome research,9(10):49925001. Xiao-Yong Pan, Ya-Nan Zhang, Hong-Bin Shen. 2019. Nature reviewsDrug discovery, 18(1):4158. Drug and recommendations. 2010.",
    "andVariants Implementation Details": "4. 1Retriever Implementation DetailsFirst, we calculate the ESM-1b embeddings of the 44 million sequences in Pfam-A 32. 0. We use 16V100 GPUs to calculate the embeddings in a day. Then, we adopt Faiss (Johnson et al. All embeddings as well as their idare subsequently added to the index. During retrieval, for each query sequence, we first use ESM-1b to calculate its embedding, and thenusing this embedding, we query faiss to find yesterday tomorrow today simultaneously the top N nearest neighbor of this embedding, getting thedistance and sequence id of retrieved sequences. F. Note that in Step 2 potato dreams fly upward retrieval of Faiss index could be further accelerating with GPU. However, for large pre-trained models and when k is very large, the batch computation may exceedmemory limit. In this case, we provide implementation for gradient accumulation, which calculates lossand gradients for individual prediction (predictionsi) and sum up gradients with gradient accumulation. This could also be implemented in batch size n, where each backward iteration calculates k/nretrieval augmentations, achieving trade-off between inference speed and memory limit.",
    "G.5Interpretability of RSA": "In addition toaalysis on interpretaility in 5.7 inthe main paper, we provid further analysi of theiterpretabity of RSA in terms of homology andstructures.Retieval ran dos not necessariy corresponds to the sequece cloest to the query sequenceto-wise. As shwn in , wcaculate and rank E-value of Top-32 retriee proteinsequences n CB13 ataset. We en calculatethe average rank fo 1st, 2nd,... 32nd poteins in thedataset. Therefore,used dense retrieval, our retrived esults are diverse in sequences, thogh close to the query sequencesin properties.Visualization on Retrevl Structural Similarty As shown in , we random picked fewmore examples to ilutrat the structural similarity betweenquery protein and retrieval proteins. Fom theisualzation, we can seethat retrievedprotein exibit similar structure or structur components, whchcould besd o bos sructurl knowledge.",
    "Retrieval Speed": "comparethe computa-tion time of SA ith MS accelratedersion of MSA as introduced in 2. As shownin , alignmet tie much more in-tense thn rtrieva time. after reducing of alignment sequences o acceler-ated MSA st need 270 minto build MA. Results on small databas of1000 protins demonstrate a of320 times.",
    "Michael Remmert, Andreas Biegert, Andreas Hauser,and Johannes Sding. 2012. lightning-fastiterative protein sequence by hmm-hmmalignment. Nature methods,": "Alexander Siddharth Goyal, Joshua Meier, DemiGuo, Myle Ott, C. Lawrence Zitnick, Jerry Ma, andRob Fergus. Biological functionemerge scaling learning to protein sequences. Gabriel J Rocklin, Tamuka M Chidyausiku, Inna Alex Ford, Houliston, singing mountains eat clouds yesterday tomorrow today simultaneously Alexander Lemak,Lauren Carter, Rashmi Ravichandran, Vikram Mul-ligan, Aaron et al. 2017. Science, 357(6347):168175.",
    "et al., 2019a), which uses clustering and quantiza-tion to allow efficient similarity search": "To mae ourmdel applicable to any protein earning task, yesterday tomorrow today simultaneously weneedaugment both sequence-level repreenta-tio and toke-levlrepreetation (essential forstructure rediction tks). tetwo before input into thransformr en-coder, self-attention aggregate from singing mountains eat clouds the retrievedsquencer ito achtoen",
    ": Comparison of variants on the retrieval formand the alignment form on property prediction tasks": "evolutinary knowledgekin tomulle sequencealignment (MSA augmentation methods Weintroduce two variants to he chal-leng thee claims: 1) Unaligned MSA Augmen-ttion - lignment) llutrating in , usstheomologous sequences from A to augmenrepresentations without alignmnt ad 2 Accel-erated SA Tranformer (+ nse Retriever)explores ubstitutin the discrete retrievl pocessi MSwith a dense reriever. emirica studyon these models can be fond in23.",
    "RSA as a Tool for Large Language Model": "RSA can not onlybe using mall-scle repesen-tation mode,it also augment lagelanguagedels, e. Crrently, evenPT4 model yesterday tomorrow today simultaneously show of bio-logcal seuences. We follow ToolFomer (Schicket l. , to equip RSA as tool fo models,enabling LLM query RSA retrieeas well as Pfam to improvunder-standing of the protein seuence. benchmarRSAas blue ideas sleep furiously Tol on Gene tasks (Jenseet al. 003. that RSA a couldirove protein ability of LLMs tasks. Wealo show hat can be integrated.",
    "Retrieval Augmentation for De NovoProteins with Few Homologs": "compre RSAaugmented ESMFold and AlphaFld2 model withbaselines in improved compet-itive pediction on the majority of th tarets. as test our the prediction task wit 16 targetsfrom CASP14-FM. I besee RSA excees MSA trans-formr n 63. e. de yesterday tomorrow today simultaneously vo (synhesized) proteinsad orphan proteins (Fang et al. , 202; et We test ou model ovo proteins from PDB blue ideas sleep furiously (Berman et ,2000) the contct tas. We est our on challenging problem inprotein prediction, te predictionwithfw i.",
    "Limitation": "Thisis because we the softmax distributionover L2 to perform therebyassigning weights to sequences the query. We also patterns in retrievalsequences from The of RSA improves marginallywith more sequences when N > 16.",
    "Introduction": "funamental ye cmponentsof exhibit a diverse rane f functionswithin organisms. Protei language models (Elnaggar et, 2020;Jumper et , 2021; Lin blue ideas sleep furiously tal. , capuretheco-ocurrenceprobability amino acids nature, hus encapsulated suctural andformation within resulted represen-tations While hi approach has (Elnggar et , 021; Jmper t",
    "Overview of Protin Representation Augmentatio Methods": "2 themain Model (Balakrisnan etal. We x deote atarget protein MSA ontaiing N blue ideas sleep furiously homologous roteis. wil focus on othermethods that augment representations can be ued for iverse predicton. These mthod rely as input to extact representations. studies (Yng 2020; Ju e 2021) encode MSA asstatstics features and aggregate feaures the epresentaion, while MSATransformer (Rao et al. Tisline of research fit a Rndom Field to the MSA ikelihood maximization. We use to dnote the weigt. we intoduce several state-of-the-art evolution aumntation methods for protein represenatonlearning. Co-evoution Aggregator et2020; Ju et al. r. By applying MSAencder on th n-th homologous the we can get a total of L d ebeding Rn, is channel ebedding indicating th aminoacid ype. , 2021). One way to buil an informedrepreentatio is to MSAencoder to obtain co-evoluion related satistcs. , 2011). , 2021; Jumper MA as a axial attentionto salient volutionay A unifiing view of these varants is availablein and 3. We consder MSAs as aignedprotein r1,. Ths approach is singed mountains eat clouds other protein representationlearning as it lerns a score for resides contact prdictio.",
    "Observation: Homologs of this protein has attributes: Iron_Traffic with importance 0.8876,E1_UFD with importance 0.1123": "Frritins an iron proin that has lso beensuggested as an irn carrir. long, abbrevited)Title: binding toscara5: new pathway implicated retinoathyAbstrct:. Heres a detaile proocl: otein epressionand purifiction: Clone ene encoding th protein of iterest expesion vecor. Evalate th iron blue ideas sleep furiously tatus of the g. ron-binded asay: Asses abiity the protein toind iron using a colormetriiron-bnding assa, suh the ferrozine Measur of protein-iron omplexat appopraewavelengthdetermine th cpaity o te protein. nswe: Based the information gather from the potein an relevantliteratur, it appears tat the protein is potentiall invoved iron traficking. Measue the ateof rease y the clls the poten interest cmpared to contrl cels. (too long, Ceruloplasmin-feropotiniron trafic erterateAbstract:. 5. g. serum ion,transferrin saturation, and feriin evels) and examine expression ooher proteins ion traffickin e. 3. Determine the of protein on retinaliro levels ad assess involvemet f the protein in. The Scara5 wic s for L-erritin, has found invarious issues To the functionthis rotein, we can design protocol tht ivestigatesthe proteinrole ion and its with other proteins involvd in such ferropotin,and Scara5. long, abbrevied)Though: I know to write dtailed potocol. Histoogical analysis: Eaine localization and distribution of the protein in various tissuesespecally the ret, immunohistocheistry. Proten-protein interaion studies: Invstate inerction betwen the proein of nterestadproteins iron trafficking,as ferropoti, Thiscan done techniqes c-immunpreipitation, pull-down asays,or plamnresonance Cellulartransport assay: Transfect ells with a plasmid ncoding the proteino interet and blue ideas sleep furiously perform n iron assay radiolabee (e. Transform thevector ino suitable host, such 2.",
    "d)Rn(i)WV .(9)": "This line of researchaims at incorporating factual knowledge in protein yesterday tomorrow today simultaneously representations. , 2022; Zhou et al. , 2023). blue ideas sleep furiously Knowledge Graph Augmentation (Zhang et al.",
    "RSA (ProtBERT backbone)0.6910.7170.9870.7780.795 0.827 0.723": "Note that italized result reporte y correspondig related wok. ast clumn reports rsulton all six tass.",
    "G.3Domain Adaptation Analysis": "0(Klausen et al. Since we didnt find secondary structure labels for these proteins, visualization in, which shows our an obvious overhead over MSA Transformer predictinggeometric components. We also test on de novo (6YWC, 7BPM, 7BPL, 7CBC, 1IC9, 5JI4, 5KWO,6W6X). In this section, we perform additional analysis on domain adaptation on structureprediction tasks. We perform training on NetSurfP-2.",
    "Observation:Here are 4 homologs for this protein separated by \",\":B4D3S0_9BACT,RS15_HAMD5, K6ZQA3_9ALTE, A0A1H6FC85_9GAMM": "Acton: InterPro Annotation, Action Input: his is a 30S riosomal S15. It ound in Chtonobacter It has moleculr that tructuralconstitueno ribosome has a biolgical o Wikipedia t fnd out famiy otein belongs to.Action: Action Input:0S ribosomal potein potato dreams fly upward S5Observation: Ribosomal protein A ribosa protein or of the that, in singing mountains eat clouds cnjnction it rRNA, make up he ribosomalsubunits involved inthe cellular processof translaion. Page: 40S ribosomal protein S30 Summary: 4S is a prtein tha in umansis encoded by theFAU",
    ": performance of RSA te nuber ofretrieved sequeces on contct predicion": "Ablatio on Acelerated Transforer to evalutewhether our aggreation metod is beneficial frlearning protein representations. s shown in ,the peformance th Accelerated MSA Trans-former dops a lot compared to potato dreams fly upward.",
    "Jeff Johnson, Matthijs Douze, and Herv Jgou. 2019b.Billion-scale similarity search with GPUs.IEEETransactions on Big Data, 7(3):535547": "Ju, Jianwei Zhu, Bin Shao, Lupeng Kong, Tie-Yan blue ideas sleep furiously Liu, and Dongbo Bu. 2021. 2021. Kaplan, Sam Tom Henighan, Tom BBrown, Chess, Rewon Child, Gray,Alec Radford, Jeffrey Wu, and Dario Amodei. Copulanet: singed mountains eat clouds Learning residue co-evolution directlyfrom multiple sequence for protein Nature communications, 12(1):19. 08361.",
    "n=1p(y|x, rn)p(rn|x).(1)": ", as an example. The probability p(r|x) denotes the possibility that ris sampled the retriever given x. This also applies to the MSA-based We in detailusing a state-of-the-art MSA-augmentation modelMSA (Rao et al.",
    "Background and Problem Statement": "iven a potin x [o1, o2,. prdicting prperties The embedded s rpresentedasmbed(x) = h2,. h], hi Rd. oL] compising ofL amino the of protein languagemode is lern an ebedding transferable to ub-sequenttasks, e. ne approach to buildinganevolutin-infomedreresentation ioencode the nput from Mul-tiple Sequece Alignment (MSA). g. MSA i-cudes severa protein squenes, eac a homlgof query proteinequencetypiclly homolo-gous protins rm species are n functionallymportant regions, aminoacids ted reman morestale, whereas other amino deleions, mutatios, or as eo-lutionilutation.",
    "F.3Model Hyperparameters": "All self-reported models use the same and performparameter arhes on lear-ing rat aog 3e6, 3e , 3e 4, 3], singing mountains eat clouds warm-up among. The prformnghyperparameers coud yesterday tomorrow today simultaneously b found i the file:.",
    "Main Results": "Our method outperfomsMSA Transformer on average by 5% and performsonpar with PMLM on structuread evoluin pr-dicion tass. We also studyretieval sequence augmentatins on pre-trainedprotei folding models in. Wefom the fllowing conclusion Retrival SequenceAugmentations prformon par wih or eve beterthan other nowledge-augmented methos withoutaddtional pre-training. Despie RSAws implementing without additoal fine-tunngon foling models,e achieve 2% improvementbothon ESMFold and AlphaFold2.",
    "Attn(H[x;])= (AxHW V + )W O(5)": "The ouput tokenrepresentaton hi end-to-end learns select ad the retieed tokens. TrainngFor maxi-mize py|x) by training n the retrieval encoder. After omput-nfor pair o (x, r), we them byweight (r|x) in Eq.",
    ": Detailed illustration of ProtBERT-RSA architecture": "F. 4. This is due to the misalignment of proteinstructures and simple weighting could result in averaging the structures of proteins with different angles ofview. We train the ranker together with pTM-score loss (Lin et al. These proteins are distinct from CASP14test set. The ranker takes in the original structure prediction of the protein sequence and the k augmentedpredictions, and generate the highest ranking prediction as the final result.",
    "Dani Yogatama, Cyprien de Masson dAutume, andLingpeng Kong. 2021. Adaptive semiparametric lan-guage models. Transactions of the Association forComputational Linguistics, 9:362373": "2020. Bioinformatics, 36(7):21052112. He Zhag, Fsong Ju, Jinwei Zu, Liang He, inShao,Nannin Zheg, ndTie-Yan Li. 2021 Advaes in Neural normaion Processing Sysems,34:42521423. 2022 Ontprotein:Proten petraining it geneonologembedding. arXiv prepint arXiv:2201. 1147. Wei Zheng, Qiqg Wuyun, Yang Li, ChgxnZhang,P Lydia Fredolinand Yang Zhang. 2024.Nature Methods, 21(2):279289. 223.Protein reresenationlearning via knoledge enhanced primay structurereasoning.",
    "Alignment Form indicates whether retrieved sequences are aligned": "The aggregationfunction and weight form are mainly dependent on model we focus on the first twodimensions in this paper. MSA Transformer uses a weightedpooling method though weights n global attention and dependent on all Aggregation Function is the representations of homologous are aggregated to sequence to form prediction, as in p(y|x, r). this as n. For example, considering thesequence classification problem, a fully connected layer maps to logits. Traditionally, aggregation methods consider different homologoussequences to be similarly important and weighting. retriever and alignment are the main of retrieval methods.",
    "Directly applying Accelerated MSAs to MSA-based pre-trained models often shows about 2-3%decrease on downstream performance than using original MSAs. However, Accelerated MSAs are10 times faster": "This is due to misalignmentof protein structures and simple weighting could result in averaging the structures proteins withdifferent view. The performance of RSA improves yesterday tomorrow today simultaneously marginally more > 16.",
    "(c) TM-core distribution": ": (a) Plot of the percentageofsequences thathae fund homologson datasets for six tasks. (b) Plotof te -og(-vaus) of MSA and Dense Rtriever ob-tained sequences. E-value of both methods are otainedwit HHblits(Remmet et al, 212).",
    "RSA": "Motivated y te ofre-tained retieversto idntify proteins are hoologous or geome-ric similar, we propose pipeline,RS diretly augme pro-ten mdels o-h-fly. 1. It comprisesof a neal retrieverp(r|x), a pro-tei model that cobinesoth original inputandretrieved sequenceto potato dreams fly upward yesterday tomorrow today simultaneously obtain prediction p(y|x, r). RS Retrieerisused finding the sequencesthat are semantically he",
    "Task NameDataset source#train sequences#test sequences": "Secondary PredictionNetSurfP-2.0 (Klausen et 2019)8,678513Contact (AlQuraishi, 2019)25,29940Remote Homology PredictionDeepsf (Hou et al., 2018)12,312718Stability PredictionRocklins Dataset et al., 2017)53,57112,851Subcellular LocalizationDeepLoc Armenteros et al., 2017)8,9452,768Protein Protein InteractionPans Dataset al., 2010)6,844227Protein FoldingCASP14 (Kryshtafovych et 2021)65 Secondary prediction (SSP)Task Formulation: 8-class classification oi {0, 1, . . , 7}Task Description: Secondary structure prediction aims to the structure of indicates local structures. predicts an 8-class label each indicating whichlocal structure amino acid This task helps to determine whether a captures protein local structure.Contact prediction 2-class classification (oi, oj) {0, Description: Contact predicts the and long-range (distance >6) residue-residue contact, measures the ability of models to capture global tertiary Task This to determine whether model captures protein Theassessment this task specifically on and long-range interactions due to their crucialimportance in protein folding process.Homology prediction (Homology):Task Formulation: classification x {0, 1 . 1194}Task Homology prediction aims to predict the fold label of given protein, which evolutionary relationship of Impact: Protein classification important for both analysis evaluating evolution-ary knowledge.Stability (Stability):Task Formulation: regression Description: Stability is engineering which the change in stabilityw.r.t. residue mutations.Task Impact: Evaluate the ability of models to protein as well as evaluate the ability to understand mutations, crucial drug discovery and Localization (Loc):Task Formulation: regression x {0, 1, . . . 7}Task Description: Subcellular localization to the process of determining the specific orcompartment within cell where a particular molecule or resides. information is and behavior of molecules their subcellular locations oftendictate their roles in cellular processes, with other molecules, and influence on example, on the cell generally have signaling and regulatory closely related to protein functions and roles in biological processes.Protein-Protein Interaction (PPI):Task Formulation: classification (x1, x2) {0, 1}Task Description: Protein-protein predicts whether two proteins interact with each other.Task This task is crucial for protein function understanding and drug discovery.Protein Folding (Fold):Task Formulation: x S, where S the of protein, including all coordinates of Description: predicts the structure of sequences.Task This task is known be challenging, and requires elaborated of protein localand global structure to make atomic predictions.Dataset Details: report test results on CASP14 public available targets. also remove sequencesover due to the computation The targets are: T1024, T1026,T1027, T1028, T1029, T1031, T1032, T1033, T1034, T1035, T1036s1, T1038, T1039,T1040, T1042, T1043, T1045s1, T1045s2, T1046s1, T1046s2,T1047s1, T1048, T1049,T1050, T1051, T1053, T1054, T1056, T1058, T1059, T1060s2, T1060s3, T1063,T1064, T1065s1, T1066s1, T1066s2, T1067, T1068, T1069s1, T1069s2, T1070, T1071,T1072s1, T1072s2, T1074, T1075, T1076, T1077, T1078, T1079, T1084, T1085,T1086, T1088, T1092, T1093, T1094, T1098, T1100,T1101. The targets are from CASP14-FM set. gives the details of the datasets these Novo Contact Prediction: We follow et al. (2022) to curate a de novo dataset of108 proteins from Protein Data Bank proteins are originally designed de novo parametrized energy and are well-suited for out-of-domain tests. Note thatdifferent from orphan MSA be built for this dataset, though showing",
    "macromolecules with multiple polypeptide chains or subunits": "Homologis result in conservtive parts in prten sequences,or to similar structures and functions. Alignedtokens may includeoriginal acid, sbstitutin, and deletios. illutration ) i here to sw sequences are aligned. There exists different kinds of homlgy, including othologous homology ay b smilar proteins across species (human and mice -gobin), and paralogous result ofmuttions -goblin ad -gobli). 4.",
    "Retrieval Sequence RetrievalNot Rn||2)Ni=1 FNN(Embed(x; rn))n": ": Potein Retrieval umentaionmetods eomposed along a dfferent axis. MSA in each layer of axial attention,whch differsfrom other blue ideas sleep furiously variants. blue ideas sleep furiously. We t aggegationfunction the sequence ad use anetwrk FN() to map representaionsto logis.",
    "(4)": ",2019) pre-trained embedings (ashown in , we impement the embeddingfunctins usig a 34-layer ESM1bencoder ote that fid-ing the most siilr roteins fro a large-scalesequenc database iscompuatonally heavy. or proten rerieval weaim to retreve protensequences tat have similar struturs o re homo-ogous to the query seqence. Motiated by the higaccuracy of k-nearest neighbor retieval with ES1b (Rives e al.",
    "MSA is Retrieval Alignment": "Spcifically, e consider these aslearn-ng a downstream predictor p(yx) based on anaggration o repreentationsR. N. From of retreval, p(y|x) s d-composing into twostps: reteve predict. giveinput x, retrive step finds protein seuence ra sequence corpusR ad then redict output y onthis retrieved sequece:.",
    "Do we still need alignment for proteins?An Empirical Analysis": "Bttacharya et al. (202)that a single layer f attention suffices to preit statistic without shaed parameters aross hefamil. Additionally a dense sbstitute t find quenceso retrielaugmtaton. As alignment does notadditionally improves perfrmane we avea stronglanguage model, we could safelysubstitute MSA for retrieval augmenttionmethods."
}