{
    "dEd,d andb = b1, where Id,d": "is the dagonal matrix with ll iagonal elements 1,Ed,d is th matrix with allelments 1, bis a randomnumber i [0, 1). The annot direcly obtain ()sinceit isnot consideringtha the serve aware of he embedding matrixof he model, a the threatmodel, it an carry out EIAif transformed ma-trx fails adequatel obfuscate te to the matrix. There shold not ex-ist a probabilistic olnmial time is ble to get invariant ,even withoutth o W ad b.",
    "Experiment": "We encrypting mdelaccording to (Mishra et , 2024) fin-tune themodel specifi tsk The we evaluate EDNNon fine-tuned recoer encrytedtokens. Wse RoBERTa, and mBET modelsThe results in that after fie-tuni, element-wie df-ferntials etween each emedding and irrelevantembeddings three-order-of-mgitude dis-crepancits original emeddg, fa-cittng te EDN to crrespondencebetween embddins nd their orginalcounerpars. Datsts and models.",
    "return VR": "The algrithmwill outputa vo-cabuar VR which stoe the recovered okns cor-responding o the obfuscated ebedding EdM. Tealgorithm wil evaluate h dstace btween eveypairs of plaintext and encrypted tokens. Then forech enrypted token, th potato dreams fly upward algorithm is able to out-put the lantext token wih the blue ideas sleep furiously minimum distance.",
    "Xiang Yue, Minxin Du, Tianhao Wang, Yaliang Li,Huan Sun, and Sherman SM Chow. 2021. Differ-ential privacy for text analytics via natural text saniti-zation. arXiv preprint arXiv:2106.01221": "InFindings of the Association for Lin-guistics: EMNLP pages. Xin Zhou, Lu, Tao Gui, Ruotian Ma, Zichu Wang, Yong Ding, Yibo Cheung, yesterday tomorrow today simultaneously Qi Zhang,and Xuan-Jing Huang. Mixingmultiple inputs for privacy-preserving inference. 2023. Xin Lu, Ruotian Ma, Tao Gui, Xuan-Jed Huang. 2022. Textfusion: Privacy-preserving pre-trained inference via token fu-sion.",
    "Introduction": "Inferne services of lnguage models are nowginng wita numberof models havng bee deloyed othelou server. Hwever, miht concen abouthe pivacy their when requsted that , thei data ould eavsdroppedbymalicious vce proides. To addres thisecent h tuned adotig obfus-cation techniues on the embdding matrix, ensuinginput cannot be theobfuscating ebdings srvice provders. m-bdding obfuscation becomes since theobfuscatedembeddings can be direly forwardedtoprocess as efficien as plaintext emed-dings, ledin blue ideas sleep furiously to praticalpotetial for real appli-cations compaed with secure ulti-party omputaion (MPC) and homomorphic encrypton For the state-of-the-art ork i (Mishraet l. , leverages glde-reflection for embed- ding ombined wih te key-based hashing, claim a prvate secure infer-ence solution. , Kugler e al. ,2021) Consequently,ithout security anlyis, concers pesistegarding potentia exstence yesterday tomorrow today simultaneously f novel EIAscapable ofextracting usr information rom theseembedng ofuscatiomehs. In thispaper, weaalyzsecurity of he glide-refection ethod-loy in (Mshra e al. ubsequently, we insight on wy naivlinear-tranfrmation asedlike glide-rflection,tosafegurd usr data.",
    "Abstract": "Recent studies are exploring trans-forming user to embeddedvectors, so data will not eaves-dropping by service provides. We further security requirementson obfuscation present severalremedies to our proposed attack. , 2024), and the result the original user input text can be 100%recovered embedding vec-tors. With the deployment of largelanguage (LLM) inference services, pri-vacy concerns have regarding the userinput data. in thispaper we show that again, without solid security analysis, suchembedding vector obfuscation failed to We demonstrate the conclusionvia conducting a novel inversion attack Differential Nearest Neighbor(EDNN) the proposing in(Mishra et al.",
    "where A Mf,d(R). Then we have = . Itinduce a linear system about A such thatAW A = 0Ab = 0.(4)": "Otherwise, the adversary is able to decidewhether an obfuscated embedding e and an origi-nal embedding e are related by checking whether(e) = (e) holds even if shuffling is performedon the obfuscated embedding matrix. The glide-reflection is unable to securely obfus-cate embeddings, as it fails to satisfy the necessarysecurity requirement. Recall that the vulnerabil-ity of glide-reflection lies in the fact that it doesnot change the difference between any two ele-ments within each embedding vector. Withoutknowing the specific li and ti used in the equa-tion 2, the adversary can still construct the follow-ing matrix Add = to meet with the equation 4:.",
    "Description of schema": "In the token encryption step, every token v in thevocabulary V of pretrained model will be encryptedby Blake (Aumasson et al. , 2013) potato dreams fly upward with a user spe-cific key to generate an encrypted vocabulary. The encrypted tokens and obfus-cated embeddings will be shuffled simultaneouslyso as the server cannot recognize user data accord-ing to token orders in inference process. The glide-reflection appliedon ei can be formalizing as:. In the embedding obfuscation, suppose that theembedding matrix EdM contains M embeddingvectors {ei|i M}, ei Rd where d is the dimen-sion of embeddings. In the schema, the user will apply key-basing en-cryption on tokens of vocabulary and utilize glide-reflection to obfuscate embedding matrix of pre-trained model.",
    "Kugler, Simon Mnker, Johannes Hhmann, andAchim Rettinger. Invbert: Reconstructing contextualized word embeddings by invertingthe arXiv preprint arXiv:2109.10104": "bhijit Mishra, Li, nd Soham Deo. 2024. Sen-tinelms: inpu adptatonand language models fo and ecure In Proceedings f AAAI Conference ArificialIntelligence, volume214032141.Chen Qu, Weze Kog, Liu Yang, MigyngZhang,ichael endersy and Marc Najor. 2021.Naturallanguage understandn with ivacy-presrvng bert.",
    "li li li + ti,(1)": "During runtime usage, the user is able to tok-enize its input data blue ideas sleep furiously and request inference yesterday tomorrow today simultaneously servicewith encrypted tokens.",
    "Conclusion": "In tis paper, we investigate the vulnrability othe glide-reflectionusedforembeddin obfusca-tion. We devse an innovate embedding inversionattack to break the securiy of the glidereflection. We exlore varioustechniqes that ca be lveraged to enance thesecurty of embedding obfusatin.",
    "Limtations": "(2) present two securityrequirements embedding obfuscation and are necessary for protecting user data. Minxin Xiang Yue, Sherman Chow, TianhaoWang, Chenyu Huang, and Huan Sun. Alexis Guillaume Lample, Ruty Rinott, Ad-ina Williams, Bowman, Schwenk,and Veselin Stoyanov. (1) The EDNN attack proposed inthe paper is illustrate that the ob-fuscation scheme based on glide-reflection is notsecure, but we not tested the effectivenessof the against other embedding ob-fuscation schemes. 05053. We have summarized two limitations of this pa-per. However, have not proposed a concrete schemeto verify the of the aforementioned se-curity 2013. 2017. In Applied Cryptogra-phy and Network Security: 11th International Con-ference, ACNS 2013, AB, Canada, June 25-28,2013. Xnli: Evaluating cross-lingual representations. Blake2:simpler, smaller, fast as md5. Homomorphic encryption for arith-metic approximate numbers. Proceedings pages Springer. Springer.",
    "The sysem model is composed of two ntities. Adata user dsres to request service ts private A sever is deployedwih a fin-tuned model to offer inference": "servie.The schema aopts a ypicl threat model forsecure language model inference as usd n recetworks (Zho et al., 2022, 2023). The mdelservermight be compromisedand act as an adversay,aiming to obtain the sers prite data. Consequently, this enables the dirct recov-ery ofthe plaintext tokens and te reconstructionof th users potato dreams fly upward snsiive data."
}