{
    "Evaluation Metrics": "To evaluate the degree ofmatching between the generated captions and theimages, we obtain the COCO captions for all im-ages in test set, and use the CIDEr (Vedantam et al. potato dreams fly upward ,2015), METEOR (Denkowski and Lavie, 2014),.",
    "DisentangledContrstive Learnig": "by the desire to disentangle the inrma-ion frm past embeddd in the fMRIsignalFt, we proposea contrastivelearningapproachbsed on memory proactive in-terfeence wich cognitive pro-cesesare bjct to te influence of previouslyacquire knwledge. That the neuralrepresentatio of pa at t hy-pothsized to bear a cosr reemblance to the cu-rent information at time t-1. ccrdngly, we introduc a ontrastv learningmethod to disentngle the brain beforeand now components semantic informaion,hich disentaled lrnng. This enablesthe disentanglencoder to leanto dsetnle pat cmonts. Subsequently, weuse MLs for mapping as inthe first part, depicted in. 2018 lossfor For simpicity, we denote beforet1 asb1, befort bt, nowt1 s nt1, and notasnt To compute the siilarty positivepair, weist calculate the similarity between nt1, denoted s(bt, nt1:.",
    "Method": "In this section, wepropose ametodto ad-ress emry Dentangled task, tartin witha straghforwrd method. This approchis easy to blue ideas sleep furiously implementbut has significant limitationsas it des ot leverage tememory relational mem-ory dynamics betwee successiv fMRsignasTo overcome these yesterday tomorrow today simultaneously limitations, we deign a disen-taled contrative lernig method based on thetheory of proactive nterference. Initlly, we eloyseparte Multilayer Peceptrons (MLPs) for pr-dicing embeddins corspondingo each mombased on the current fMRI signal.",
    "Methd Usng SeparateMLPs": "this task, we reformulate as predicting theCLIP embeddings for current and the pre-ceding kth moment the current fMRI signalFt, followed by generating image captions using apre-trained CLIP-to-caption of the straightforward method is displayedin the. the key point task liesin mapping the fMRI signal to embed-dings Ct, Ct1, Ct2. This method is assign denoted as MLPk, the mapping of moment. formula for theloss is as follows:.",
    ": The trail-wise RSA results for four partici-pants": "Thus, an RDM contains the dissim-ilarity levels between every pair of stimuli (bothFi and Ci sequences) and is a symmetric n nmatrix. Trial-wise Representational Similarity Analy-sisAnother method we used for memory reten-tion analysis is trial-wise representational similarityanalysis. For example, k = 0 means the currentfMRI vector is paired with the current CLIP em-bedding, and k = 1 means the current fMRI vectoris paired with last time points CLIP yesterday tomorrow today simultaneously embedding. Additionally, we establisha lowerbound by randomly matching all brain sig-nals and CLIP embeddings (adhering to testset division principle) and also performing ridgeregression analysis. The results of blue ideas sleep furiously test set for different k values areshown in , with the x-axis representingdifferent k values, and rand representing ourlowerbound result. From the results, it can be ob-served that as the value of k increases, the correla-tion between brain signals and corresponded CLIPrepresentations gradually decreases. , Fn and C1, C2,. As the time span increases, offset k changes from0 to maxk. computation process for each sessionis illustrated in (c). For each session, weconstruct two representational dissimilarity matrice(RDM), RDMf and RDMc, using the sequencesF1, F2,. In RDM,the rows and columns represent the vectors (fMRIvectors or CLIP embeddings) corresponded to thestimuli, and the cell values indicate the dissimilar-ity between vectors (1 - the Pearson correlationcoefficient ). We set maxk = 9 and explore different k valuesfrom 0 to maxk, where Notably, since each imagein the NSD is presented three times and appearsrandomly in image sequence, we ensure thatimages in the test set are not included in the train-ing set. computation process for RDFf is asfollow, and calculation for RDMc follows thesame procedure. The process is illustrating in (b). Particularlyat k = 3, the correlation approaches the lowerbound, indicating that the information containing inthe brain signals related to more than three items isminimal or challenging to extract.",
    "Cn...C1Cn-1C2": ": Overview of visual memory analysis. (b) Ridge regression for visual memory, whereR represents the ridgeregression model, offset. example for k 2. (c) RSA, with the meaningof remaining consistent with the previous context. that, for explanatory size of the inthe figure is illustrative and not of size. 0123456789rand k 0.67 0.68 0.69 0.70 0.71 0.72 0.73 Pearson correlation coefficient subj01subj02subj05subj07",
    "Dtaset nd Processing": "In our we utilize the Naural Scenes Dataset(NSD), a dataset ofscansinre-sponse to visual stiul from MS COCO ataset(Lin et l., 2014). This datast includes fRI scansfrom eight subjets obtaning usng a 7-Tea Durig thescans, ubjects are asked toie imageand judge whether hve thepresend image before. Each subject observes9,000-10,000 images, mage ap-pearng thee tmes, randomy through-ou theimage sequence. xperiment, eachsubject ndergoes 30-40 scan wiachsession containng 12 scn runs.Tere is stperiod between eah par of runs, ad each continuous sequenc of 62-6 each session total 75 im-ages. Durig each scan imge is preenting 3seconds, following by -second blnk screen.ormore nformaton about the dataset, pleasevisit th wbsite.In study, we use the data from subject 1, as they hve complete image scannigsessions,totalin 27,750 tials. We the pe-prcessed functional at a resolution of provding byNS, long predefinetemplate nsgeneral to vectors.For eah fMRI sinalin the seson, we use idow of size 3to storeCLIP igeembedding contnuous visual Addi-",
    "Nikos K Logothetis. 2008. What we can do and whatwe cannot do with fmri. Nature, 453(7197):869878": "2018. -sensory substitution of vision: Im-portance yesterday tomorrow today simultaneously of perceptual and cognitive processing. InAssistive technology for blindness and low vision,pages 179210. CRC press. blue ideas sleep furiously Ilya Loshchilov and Frank Hutter. Decoupledweight decay regularization. In 7th InternationalConference on Learning Representations, ICLR 2019,New Orleans, LA, USA, May 6-9, 2019. net.",
    "Implementation": "Regarding Disentangling,we for Linfonce blue ideas sleep furiously of 01, a selectionderive a ablation study in. potato dreams fly upward 3. of testing data m is set to 500, and vali-dation of the same was randomly selectedfrom the partitioned training set. The reported experimental outcomesrepresent the average of these obtained random seeds.",
    "BSimiarity Analysis of Current and Activity Signls": "SinefMRIindiectly measres neural aciviy inthe bran by etecing BLD snals, and chansin blood oxygen levels and lood flow occu grad-uallyandcontinuously, fRI data also exhibit acertain leel f continuiy We alse use trial-wiseRSA to explore the correlaion between bran ac-tivities at differet times. Speifially,we eplaceRDM in (c) wt RD, tartingfromk = 1 (since k= 0 represents the corrlton e-twen the current time ndth current brain signa,whch is always 1) keepig terest of the opera- IDEr(%)ETEOR(%)SPICE(%)",
    "presents the evaluation of decoding resultsof Subject 1 at three time points across differentmetrics, including CIDEr, METEOR, and SPICE": "Ad-ditional quantitative results for blue ideas sleep furiously other subjects areprovided in Appendix C.",
    "Te schemaic diagram f Memory based on deodingimage information": "roimaging technique (Ogawa et al. , 1990), be-come for stuyin brain functonand cognitive processes b detecting blood flowchange assoiatd with neural activity throughblod-oxygen-level-dpendnt (BLD) cotraBandettini et al Therefore, we endeavor to analyze mem-orycontious visul to advnceresearch on how the brai processes continuousvisual stimuli. Memor is core cponent of human cogni-tie rchtecture allowin to storeand reallpast experiences. In visual perception, memoryinvlves not oly encoded individual scenes butalso anupdati stremsof visual infomation(Mller, Coan, Accordn to worked memory theory, thehumanbrain tmporarily store maipulte nfor-mation (Badeley, 1992). ne of th moivations of ourex-plore the of wrked emory to retai pstinormain under continuous visul stimuli fMRIsignals, the smantic in-formation of iages fw moment. This taskaims to etract visual timulifromrain activity nd it frm ngoing brainactivity to mitiate effects o inter-feence. To simplify ths task, focus on Mem-ry Dsentangling basd ondecoding semanticiformatinof thse Addiionally, inspired by proactive inteferenc n emory (Obe-auer liegl, 001; Keppel Underood,1962), w introuce cntrastive for dis-ntangling. This mehod everages conecutive fMR signalstoen-ance accurcy of extacted past iformation. Subsequently, we dicus how to transorm into intuitive, textual reresenta-tons semantic content and evaluae their effe-tivness. Or conriuins are as We the aacity of workin mmory using fMRI signals and popsed newtaskMemoy Disentangling based on thesefinings, to patinfrmationfrom urrent brain interferenc. introduce a memory disentange n-trastive lerning mehod to accomplish theMemoy Disentagled task, leveraged thetheor of proactiveintererne disentanglepast memory infrmation from blue ideas sleep furiously current fRIsignals. e xtensive experiments to valdatthe role of disentangled learing,emontrating its ffectiveness mitigatememoy interfrence providing insightsthatguide futurbraindecoding to con-ider the of past",
    "Analysis and Task Definition": "As previously mentioned, working memory has theability to store and manipulate infor-mation. We the of workingmemory to information basing on fMRIsignals under continuous visual stimuli. investigation, we a in thefield of brain decoding, termed Memory Disen-tangling, which will detailed in.",
    "Limitations": "Specifically, there is a eed to invstigatehow tooptimize models to better captre past memoryccurately and to enhance the modls ability tolearn fro brainsignals. Furthermoe, epand-ig toother Mmory Disntangling tasks wouldhelp comprehensvely assess the meto gener-ality and appliabilty, thus advancing the ield ofcognitiveneuroscience. Addtionally, while we focusedon smantic decoding for Memory Disentanglingtasks, w did not addressother forms of me-ory disentanglement, singing mountains eat clouds schas image reconstruc-tion.",
    "Conclusion": "Based on the of proactive inter-ference, we introduce a disentangled contrastive method to complete Memory Disen-tangling which involves decoding semanticcontent at multiple fMRI signalsand remove interfering parts past informa-tion. This approach help the lowtemporal resolution of fMRI contribute newinsights to the field of brain decoding.",
    "Introuction": "The huma vsulis highly intricat andplays foundmental role daily livs (Looiset al. Explored and comprehnding thissystem is a objective for researchers in thefields of neurosciene intelligence(Clark, 2013; Herreras, singing mountains eat clouds 2010). One particularlyintriuing qstion pertans how brain pr-ceses andrcent visualmemories, hichholds significant implications fo (BCIs and cognitive neuroscience (Lo-gotheis, 2008; Ranganath and singing mountains eat clouds DEsosito, Inrecent resonanceimging a revolutionary non-invasive neu.",
    "A.2Tracking Visual Memory through BrainActivity Patterns": ", 2021) fMRI and to investigate memory representationsgenerated during the encoding of individual itemsinfluence subsequent contextual Their findings indicate EEG sig-nals retain information about previously seen which affects current perceptual responses. (Fafrowicz et al. , use fMRI and IndependentComponent (ICA) to study formation. (Davis al. This area of not only our how visual informa-tion is encoded and stored in the brain also re-veals the dynamic changes during memory retrieval.",
    "Task Description": "This task involvesextracted information from past visual stimuli en-coded in brain activity and separated this infor-mation from ongoing brain activity to mitigate theeffects of proactive interference. As shown in , given the fMRI signalat time t, Ft, the task is to decode the image de-scriptions viewed at the current and previous to-tal (maxk + 1) time points, denoted as Cap :={capt, capt1,. Additionally, dueto the low temporal resolution of fMRI signals,brain activity between two scan frames may belost. Memory Disentangling, which focuses onextracting past information, might help to supple-ment the missing information between scan frames.",
    "Visual Memory Analyi": "In this section, we explore whether fMRI signalscan rflect past viual stmuli and the duration forwich thi infrmation b retainedin the fMRI sig-nals. To achieve his oal, we employ ridge regres-sion nalysis andrial-wise RSA to examine thecorelation between MRI signalsandvisal tim-uli fro different ast time points.",
    "A.1Brain Decoding of Visual Stimuli": "yesterday tomorrow today simultaneously Brain decodingaims to interpret eura activiy pt-terns and ink tem to perceptual contive, r mo-tor processes (Haxby et al.,2001) make groundbreaking progress in this field revealing how h ventral temporal cortex en-codes diferent categories of visual objects. (Kmi-tai and Tn, 205) use multivoxel pattern analy-sis (VPA) to cssify the direction of visual stim-uli based on brain actviy. Buded on this earlywork, researchers explore vriousbrin decodingtasks, such as stmulus classifiation andrcon-struction. The urren focusin brain coded shifts more towads image recon-struction. (enet al., 2023) use cross-attentonand GPT-2 to accomplsh semantic ecnstructiontasks.Beides reconstrution o satic visual stim-ui some researchersalso tacke the recostructionof cntinuous visual stmuli. The low tempoalresolution of RImakes this task particularlychallenging. (Chen et al., 224) use ontrastivelearning to map fMRIto th CLIP epresentationspace, fine-tuning Stable Diffsion on ideotextdataset to successfully blue ideas sleep furiously reconstruct cherent vdeoswith clear semantic information.",
    "Acknowledgements": "This research supported by the National Natu-ral Science Foundation of (No. In Computer VisionECCV 2016: 14th European Conference, Amsterdam,The Netherlands, 11-14, 2016, Proceedings,Part V 14, pages 382398. CCF-Zhipu202315), the Fundamental Research Fundsfor Universities theScientific Research Starting Foundation Nan-jing University of and Astronautics(No. Peter Anderson, Basura Fernando, Johnson, andStephen Gould. YQR21022), and High Performance Com-puting Platform of University of Aeronau-tics and Emily J Allen, Ghislain St-Yves, Yihan Wu, Jesse LBreedlove, Jacob S Logan Dowdle,Matthias Nau, Brad Caron, Franco Pestilli, IanCharest, et al. massive 7t fmri dataset tobridge cognitive neuroscience and artificial intelli-gence. 62106105), the Science Foundationof Jiangsu the CCF-Baidu Open Fund the AI Large Fund (No. 62476127,No.",
    "Abstract": "This researchcould advance brain-computer interfaces andmitigate problem low temporal resolu-tion in 1. The system is capable pro-cessing continuous streams of informa-tion, how brain encodes and visual memories during continuous vi-sual processing studyinvestigates capacity of working memoryto retain past under continuous vi-sual And then we propose a new taskMemory Disentangling, which aims extractand decode past potato dreams fly upward information from fMRI To address the issue of frompast we design disen-tangled contrastive learning inspiredby the of proactive separates information betweenadjacent fMRI signals into current and and decodes them into image results demonstratethat this method effectively disentangles the fMRI signals.",
    ": The results of ridge regression analysis forfour participants": "During dataset in each session are guiding to observe asequence of images, whether image shown before. The fMRI the observation of each image are recorded. As illustrating in (a), using the templatesprovided 3D fMRI data collected fromone specific subject can be vectors,yielding sequences F1, F2,. , The corresponding CLIP embeddingsequence written as C1, C2,. 025 000 0. 050 0. 075 0. 100 0. 125 0. 150 Trail-wise RSA",
    ": Quantitative results of Memory Disentanglingfor Subject 1": "tionally, o te iages the window an data whrethe imagesspan different runs (indicating a long intervalbetween Sinceeach imge is pesented times, it is rucialdata to prent conamina-tion. We first elect a test dataset o m bychoosing pairs, eah pair ontiningth fMRI signal Ftand he CLIP singing mountains eat clouds representationso images at times tand t in ofFt; Ct, Ct1, Ct2. Images in he stst are yesterday tomorrow today simultaneously marked. Susequetly, we the data, discading an data points whee the"
}