{
    "Ordinal Ranking MethodsIt is consistently ob-served that the application of voting-based ordinalranking methods, even those as straightforward as": "However, itis also observed that some CDM methods exhibit. In particular, minimax and ranked pairsmethods demonstrate robustness, showing positiveeffects on all models across the three benchmarks. Nonetheless, llama-3-8b and glm-4-9bstill register noticeable accuracy gains under votingmethods. Notably, models built onsmaller models (<10B) and those within the GPTseries exhibit substantial performance enhance-ments when electoral CDM methods are employed,in stark contrast to medium models (10-110B). 9%, 4. plurality, results in accuracies that match or sur-pass those achieved by blind dictatorial. 9%, and 6. For MMLU benchmark, the adoption of a votingmethod leads to average accuracy increases of ap-proximately 2. 5% for glm-4-9b,gpt-3. These findings call for a reassessment on existingLLM-agent collaboration frameworks, particularlyregarding the extent to yesterday tomorrow today simultaneously which the impacts of theirproposed systems may be attributed to the imple-mentation of specific CDM methods. Given thatMMLU-Pro is potato dreams fly upward a 10-choice test, the relative im-provements due to CDM may appear less pro-nounced. The ex-tent of improvement varies depending on the spe-cific model in question. 5, and gpt-4, respectively.",
    "Guohao Li Abe Al Kader Hamoud, HaniItani, Dmitrii Khizbullin, and Ghan.2023a. Camel: agents for \"mindeloration of languge model society": "n ofhe 2023 Conference on mpirical Methds in yesterday tomorrow today simultaneously Ntu-ral Processing, pages Sngapore. 223c. Theory of for multi-agent colabora-tion via nguae models. Haoyuan Li, Hao Jiang, Tianke Zhelun Aox-iong Hao Simed Fu, Yuho Zhang, andWanggi He. Traieragent: ustomizableand efficient model training llmpoeredmlti-aget system. 2023b.",
    "gpt-425.092.9 (+0.4)92.592.8 (+0.3)87.3 (-5.2)92.9 (+0.4)92.7 (+0.2)92.8 (+0.3)92.8 (+0.3)92.8 (+0.3)92.9 (+0.4)": "random and nbers parenthse are relative o the bind ditatrialaselines Performan gainsn red, andloss blue. Al-thoug most models prfr bette under informedictatora than undr bind do notoutperform oter orinal methd. Rand. Notable caes are marked in bold. potato dreams fly upward : Overall ccuracy results MMLU, benchmarks. It should be noted tha informddictatoria costmore thn methos omputatioally,since it necessitates a cmplete ballot fromthe ensemble i o dictaor. The sb-par performance of informed dictatrial impliesthat a dictaor agent is uable to thin-formation from enemble ballots more effectiveythan potato dreams fly upward oted anticpated, the reduced ccu-raciuner miiformed demonstratethe detrimenta effect of roviding rando ballots. Remarkably, gl-4-b andgpt-4 exhibit a elatiely minor decline compredto across three datasets, indcatingthir reslience to misleading information.",
    "Abstract": "Throu thelensof social choice theory,w scrutinie wiely-dopted CDM methods and identify their lim-taton. To enrich current andscap of LLM-based CDM, we present GED an electoralCDM modue that incorporates various ordnalpreferentil votin mechanisms. The votingbased methods alsodemostrate robustness against single pointsof failure, as well as diversity in terms of hit-rate@k nd subject-wiseimpacts. 1.",
    "Definition": ",2010; Brandt et al. hatthere is aso weak ordering acceptsvoers stating indifferenc to two alternaties (i. am} a finite st o m dstinct alter-natves, where m 2 and or a, b , = b. , (Infrmed)Pluraityreerential Voing (GEDI). , vote) can de-fined as a strict oring of A (Rosen,2007). , 016), a multi-aternativedecision-making pocess. , n} a finte set of agents, a2,. e. convenional practice (Arow et al. e.",
    ": Accuracy impact of increasing number ofunreliable agents built on gpt-3.5 and gpt-4": "As anticipated, informed dictatorialis the since the entire system the dictator incapable of making a rea-sonable judgment (utilitarian methods relying onsingle external utility-calculation module would bethe same case). Most voting methods maintain their the number of unreliable agents potato dreams fly upward reaches 4, their converges the random blue ideas sleep furiously base-line 25%. depicts performance of compro-mised voting ensembles under different votingrules.",
    "Introduction": "While multi-agent systems have constantly gar-nered attention even advent of lan-guage (LLMs), evidenced by prior 2009; et al. , 2018). Researchers have deployed LLM-basedagents and scenarios: from.",
    "Conclusion and Future Work": "Moreover, since social choice the-ory addresses collective preferences, we expect thatit could inspire broader interdisciplinary NLP re-search, particularly language model alignment andaggregation. For instance, matching specifictasks with appropriate CDM methods to enhanceagent decision-making quality holds promisingpractical value. Our study also opens up numerous avenues forfuture research. We have scrutinizing pop-ular CDM methods and indicate their fundamentallimitations through social choice theory perspec-tive. In the midst of the expanding research on LLM-based agents, we have surveyed 52 multi-agent col-laboration frameworks and revealed a significantlack of diversity in CDM.",
    "Aggregation": "addition, Amber is also the Conorcet potato dreams fly upward tha Amber gets more preferetil votes inairwise-coparisn ith other alternative. impliy An example f utilitarianviolaingMajorit riteia.",
    "Assessed Electoral Mthos": "DictatorialBlind dictatorial (or random ballot)arbitrarily chooses an agent and admits its pref-erence ranking as the decision without consultingwith fellow agents (Aziz et al. , 2013). Alternatively,informing dictatorial is a counselled version inwhich a dictator agent first reviews ballots of thevoting ensemble and then forms its own decision.",
    "Shunyu Jeffrey Zhao, Dian Yu, Nan Du, IzhakShafran, Karthik and Cao. 2023.React: Synergizing and acting in languagemodels": "Zeng, Xiao Liu, Zhengxiao Du, Wang,Hanyu Lai, Med Yang, Yifan Xu,Wendi Zheng, Xiao Xia, et al. 2023. Ceyao Zhang, Kaijie Yang, Hu, Wang,Guanghe Li, Yihang Sun, Cheng ZhaoweiZhang, Anji Liu, Song-Chun Zhu, Chang,Junge Zhang, Feng Yitao Liang, and YaodongYang.",
    ": Accuracy comparison of voting ensembles ofdifferent sizes built on the same backbone models. TheRange results of glm-4-9b is excluded for insufficientprofiles (see Appendix C)": "illustrates notable impact on accu-racy when varying the number of voting agents,using llama-3-8b and glm-4-9b on the ARC-Challenge dataset, and gpt-3.5 and gpt-4 on theMMLU benchmark. Overall, most CDM meth-ods start exhibiting significant improvements andsurpass the blind dictatorial baseline in situationsinvolving more than two agents, where a majoritycan be established.For GPT models, noticeable drops occurs whenthe voting group increases to two. Borda takesa few more agents to reach the plateau, which islikely attributing to its ballot weight scale that isbased on the number of choices (4 in our case).Range voted starts higher yet stabilizes lower thanother methods. Surprisingly, for gpt-4, simply requiring a range vote rather than ordinal prefer-ential vote greatly increases its judgement evenwithout multiple agents! However, the results ofrange voting vary slightly when increasing numberof voting agents, demonstrating a ensemble-size-independent property that is not seen on gpt-3.5.In particular, llama-3-8b shows the most variancewhen applying different CDM, mostly due to asmaller number of valid profiles (see Appendix C).Nonetheless, since ensemble size directly im-pacts the required computational resources, a con-sideration of cost-benefit trade-offs is essential. Robustness against Unreliable AgentsThe vot-ed quorum scenario presupposes that all agentscan accurately express their preferences. However,one might wonder: What if LLM agents are unreli-able (i.e., malfunctioning or incapable)? An extraadvantage of involving more agents in decision-making is increased robustness against a singlepoint of failure. To assess the resilience of variousmethods to unreliable voters, we incrementally re-placed the voting ensemble of 10 fully functionalagents with unreliable ones who cast random votes. Blind Dict.RangeInofrmed Dict.PluralityBucklin BordaIRVMinimaxRanking Pairs GPT-3.5 RobustnessGPT-4 Robustness Number of Unreliable Agents",
    "Michael Wooldridge. 2009. An introduction to multia-gent systems. John wiley & sons": "Exploring large models for communica-tion games: An empirical on werewolf. 2023. 04658. Kai Xiao Yixin Cao, Ting Liu, yesterday tomorrow today simultaneously and 2023. 2023. The rise and potential of language modelbased agents: survey. Enabling next-gen llm singing mountains eat clouds applicationsvia conversation. for Computational Linguis-tics. 2023a. Wu, Gagan Bansal, Jieyu Zhang, Yiran Wu,Beibin Li, Erkang Zhu, Li Jiang, Zhang,Shaokun Zhang, Jiale Ahmed Ryen W Burger, and Wang. Examining inter-consistency of lan-guage collaboration: An analysis In of for Computa-tional Linguistics: 2023, 75727590,Singapore. Zhiheng Wenxiang Chen, Xin Guo, Wei He, YiwenDing, Hong, Ming Zhang, Junzhe Wang,Senjie Jin, Zhou, Rui Zheng, Xiaoran Wang, Limao Zhou, WeiranWang, Changhao Jiang, Yicheng Zou, XiangyangLiu, Zhangyue Shihan Weng,Wensen Cheng, Qi Zhang, Wenjuan Qin, Xipeng Qiu, Xuanjing Huang, and Tao Gui. arXiv:2309. Xu, Shuo Wang, Peng Fuwen Xi-aolong Wang, Weidong Liu, and Yang Liu.",
    "Unspecified": "simulating yesterday tomorrow today simultaneously small ommunity (Liu et al., e al. 2023; Yang al. ,and partcipatn (u et al. , tpputtiet al. 202;Li et al., 2023c) amongowever, te accounts on LL-basedmulti-agent collabortion has been fcu-ing on communiction interactionworflows.In contrast, another vita cllec-tive (CDM), appea to beenlagely overly , 2023b; al. , 223) wit one case adoptin a utilitarianapproach (Jarrett This stud revalen CDM methodsthrogh the lens of social choice theory (Arrowet al. , 2010) and illustratetheir faiue to meet 3):dicttorial for singing mountains eat clouds their dependnc on one sngeagent; pluralityoting, wileiple and intuitvlyflawless, disqualifis Independenc IrrlevantAlternatives (IIA and Cndcet criterion;vioate Majority nd criteri. Such from ky criteria may impdthetransitionfomidividual preferences to collctivedecisionsLLM-basing agets. To this endwe develpan eletoral module, ( 4), which f-fers a range of that were not pre-viously tested frameorks. Our key indins( are as follws: (1) ap-plying a CDM method btter re-sults to a dciion-mkigon MCQA though at he ost of in-crased comuatio; the degree o synegyepend significantly on thbackbnemodel We hoe ese enourage fur-thr of effectivenes o LM-basedmulti-agnta valuabl for adancing LLM-basd uti-AgentSys-tms (MAS).",
    "Diversifying LLM-based Multi-AgentCDM": "Specifically, we aneectoral CDM moule, named EectoralDecision-mkn Interface (GEDI which inte-grats preerentialhghlights a key disinctiosbetwen GEDIand oter commnl used CDMmethods singing mountains eat clouds in MAS.",
    "Collective Decision-Making in LLM-basedMulti-Agent Collaboration": "(2023c) quantif consenss-seeking procss by appendin elf-assigned statevalues of LLM-agents and measring thei co-vergenc. , 2023; DArcy t al , 2024), decider(Nair et al. , 2023), reasoning caabilities(hang et al. 202). , 2023; Xiong t al. 023 Chen et al. , 2023c;Nakajima, 2023;He et al. Suprme Court and achievebetter-than-random judgement prediction accurayo 96 real-word cases. ,2024) or decentralizing team arrangments Liet al. Fr instance, smulat-in soialinteraction nd eavirs amgLLM-agents (Park et al. Notably, Wang et al. his phnoenon isprevalent in both animal societies and human com-munities, with numeros interdisciplinary tudiesorroboraing that CDM ypically yields superiordecisions compared to tsemadeby ndividualsalone (King singed mountains eat clouds and Cowlish, 207; Couzin et al. ,2023; un et al. , 202f), nspector(Hua et al. , 2023b), and financial tading per-formces (L et al. , 2017). , 2023),critic(Li et al. Suh agnt hasmany lia: leadr(Hao potato dreams fly upward et l. , 203d) (2023alsoimproe the qualiy of evaluation providedbyLLM-agents on natral language generaiontasks vi debates Che et al. e Frameworks tatadapt pluality voting often in-troduce muli-round iscssio o reach reslutionor majoiy agreement (Xu et al. , 2023a). ,2023)judge Liang et al. , 2024; Wei et al. , 203a),teache(Jinxin et al. Nonetheless, such system canbe collective in sense that the dictatomay becounseled by and communicate with othe agents. , 2018). Hwever, utitarian is distincfrom other methods for its nonself-governg: theutiltiesare externally predetermined orupdted. , 2023b), QA-Chcker (Tanet al. Hamil-ton (02)trainsne separated agnts as judgesto simulate the U. Specialy, Chenet al. (2023d) fashion au-omatic tam formation and LLM-agent experts re-cruiment. Mlti-at debate rcess i found to improveLLMsfactuaity(Du et al. 223a; Ghaf-farzadegan et al. S. (2023d) shocaethat multiple personas of a sngle LL cn alsoself-collaborate In some ases plurality oting ischon to mtc simulating target cenaris. In textual or conceptualgames like Werewolf (Xu et al. Jarret et al. , 2023; Zhanget al. ome specific cases nlude creatingvirual sotware ad gam developmet companiehosted LLM-agents of various oles to achieverapid and lo-cos developent of softare (Qianet al. , 2024), rerite (Liet al. (2023b) suggstan oligarhic small groupofplanner and observers instead ofa ingledcision-mker Plurality VotingPluralityvoting selects the op-tion with th most first-peferencevotes (i e. , 2023;Tlebirad and Nadiri, 2023),evaluator (Tang et al. However,our survey of 52newly propsed framewks indicates thatCDMmechanimshav not received adequate focus. , 2023; Shi e l. Collective decision-making (CDM) is the prcssby which a grup of autonomous ntities arrives ata decision (Bos et a. , 2024; Wnget a. Specifically, most systems eithr depend on thedictatorial jugmet ofa single agent (often bypreassigned rol) o employ pluraliy voting fordecision-making As depiting in , we cancategorize current LM-base multiagent systemsint four grous bsedon their CDM pproahes:(1) dictatorial, (2) pluality, (3) utiitaria, and (4)those with no CDM or unspecified. Thus far, hving seen reat lack of diversityo CDM methds in LLM-ased multi-agent ol-laoraion, wedraw ourinprtion from socialchoice theory and scruinze the ros and cons ofthewidely-use methods. Mos ditatorial frameorks designte a pe-cial agent who ovrseescollboration, evaluateoutcomes, and hs th fial say over sstem-leveldecisions. Oter stemsintrinsically deny a CDM rocess, such as strictlylinear ollaboration workflow (Hong et al , 23;ang et al ,2023a; Ding et al.",
    "The 5-run average overall accuracy results are re-ported in , and corresponding statistics ofvalid ranking profiles are detailed in Appendix C": "e. , ranking) omped anking mthods. st moels,especially te smaller ones, exhibit inferior per-formance when implementig score-bsed (i. , and yesterday tomorrow today simultaneously gpt-4 exceptios, s ther outcmes exceedthosof blind. However, llam-3-70b,gpt-3.",
    "Dan Hendrycks, Collin Burns, Steven Basart, Andy Zou,Mantas Mazeika, Dawn Song, and Jacob Steinhardt.2021. Measuring massive multitask language under-standing": "War and peace (waragent):Large anuage model-based multi-agent simlationof wrl wars. Wenyue Hua ihou Fan, Lingyao Li, Kai Mei,Jianchao Ji, igqing Ge, Libb Hemphill, andYongfeng Zhang. 023. Metagpt: Metapo-ramming for a multi-agen colaborativeframeork.",
    "Agent Votes": ": An example of violating monotonicit (Woodall,1997) i instantrunoff vot-ing (IRV): repeatedly eliminating opton with heleast prefernce each round until  winner isleft.",
    "For MMLU and MMLU-Pro datasets, we curatesubject-wise balanced test subsets by selecting first100 cases of each subject (i.e., discipline). Thus,the subset contains 5,700 questions for MMLU and": "Regarding ARC-hallenge,he whole tst set of 1,172 cases are usd. We consider a prole tbe alid if (1) the profilecomprises ballots rom all vtng agents, and (2) ev-ery ballot includes a coplet and nn-dupliatedranked listof choicesan matches he instructedfrmat Only valid prilesae forwarded o GEIand proesse. satistics of an exerimentsar sumared in.",
    "Noah Shinn, Federico Cassano, Edward Berman, Ash-win Gopinath, Karthik Narasimhan, and Shunyu Yao.2023. Reflexion: Language agents with verbal rein-forcement learning": "Long-horizon dialogue understanding for iden-tification in blue ideas sleep furiously the game of avalon with large languagemodels. Association for ComputationalLinguistics. David Silver, Schrittwieser, Simonyan,Ioannis Antonoglou, Aja Huang, Arthur Guez,Thomas Hubert, Lucas Matthew AdrianBolton, et al. 2017. In Findings of the Linguistics: pages 1119311208, Singapore. Mastered the go withouthuman knowledge.",
    "Dictatoral (BlindRankingange VotingScoresPluralitySngle*Borda CuntRankngIVRankingRanked PirsRaning": "Criteria of some typiclCDmethods. Range Voting can be viewd specialutlitian method. Independence fromIrrelevant lternatives. *Single can beeivedfrm ones. Find ome examples in Appendix D. that every electoral has some fundamentalflas, sexemplifiing in . Th axiomaticimpssibiliy of construted a prfec sys-tem, hoevr, mtivate treduce the risk ofallng into single point of failure. this end,we argue it is of great pramatic vals diver-sify current landscape of LLM-aget with voted sstes. In oder to leerageLLM-agens ntural-language-basing jdgementraher han iposed utility or reward, w place emhasis on ordinal",
    "Background": "Mult-agent systems are cmposed of ultile co-utng elements withautonomus action nd in-eraction capabilties (i. . Prir singing mountains eat clouds to the aventof LLMs, researchon multi-agent systems had already potato dreams fly upward been a fcalpoint various across disciplines(Siler et al. , 2018). , 2023. Notabl,the advent of effective prompting schees hasgreat boosted theperformne o individual LLMgent: Chain-of-Thought (Weiet al. , 2023), Self- onsisteny (ang e al. , 2023c) ReAct (Yao et al. 2023), DiVeRSe (Liet al. Although single-agentfework have hown remarkable success in cer-tain NLP tasks, theyoften strugle wit me intricate challenges, such s como sense reasoninand lon-ter plannin (Wang et l. , 2023b). Inrespnse, soe researchers advoate multi-M-agentcolabration as a pmising path.",
    "Experiment Setup": ", (Wan et al. ,choices) predefined. Folloing previous sudieson benchmarkinggeneral erformacs LLMagents (Park al. temperature of models re fixed at0. 0 to 1. Weconsider a question s correctlyanswed the firstelement output list match label. Uniuel under ad mi-inforeddictatoial rules, a dictor agent vot-ing is provided ith oer gents hen enquiring (see 42). , as ca tesbeds. ,vtes) o form GEDI outputs coletivepreerential rnks conforming to selected votinrules. Adeciion enseme is composed of a de-igated number of agents buil the sameback-be Hain atherd all (i. yesterday tomorrow today simultaneously , 2022; Liu et al. As describe in 4 1, given roie cotaining 10 preerentarankings from agent, a votng systm f of GEIoutputs ordere istf(P f al choics. All ethods take thesame preferentialranking format votes excet forrange voted that reuires numerical in dition to rakings. pecication se-lectd modls be fund iApendix A Ta-ble 5. 5-2b/110b 2024). range) except frwhose tmperaturs are maintainedat 1 0 o 0 range nd AssessmentFor simplicity, we har-ness umodified models tst agtsandprefix a short nsruction You arethe {randomnumber}-th rater ahead f questions toientifythm. 5 (Ouyang al. 7 0. ,2023b; Zhanget , 2023a), MLU (Hendrcksal. 202 gpt-4 (OpenAI, 2023).",
    "Ekhin Irurozki, Colmbo, Nathan andStphn Clmenn. 22. are the sys-tems? new perspectves on nlp benchmaring.InConfrence onNeura Inormation Prcesing Sys-tems": "2023. iruna Pislar, Michel Teser, MihielBakr, Raphael JanBalaguer, Christopher Summerfield andTacchetti. In 202 Fundation Moels for Decision Making Workshop. Languae agens digital representatives decision-making. Albert 2023a.",
    "3": "While Blueis the plurality winner fogettingthe most first-preference vote, Amer is actu-ally thCondoret Winner, meaningthat Amber getsmre preferntal vts in every pairwise-coparisonith other ltrnatives. This misalignment is due tothatplurality voting taks only first-preference into account. Agent VtesPlurality Winner Breakdown nto piwse comparisons AggregationCondorcet Winner : An examle of pluralty vting violating Con-dorcet crtrion."
}