{
    "Limitations": "our anlysis, we may mis relevant NL MLlitrature tha treats democratization democracydue to fcus o the ACL Anthology, ILR,IL and NerIPS. Iour choice of thes venues,we areot explictl controligfor differnes (e.g., workhop papers in th ACL anthol-ogy, main conference papes) orocus (ostnotably, N versu ML) an anlysis weleave work. We futheraccountforperspectives ofNLPand have richer conceptualztions of democrati-zation bt not ting about In adition,ourbad on likedemocra may cause us to excludeimportant discussions of demrac-adjacentthatuse may be by parsingerors stemming fro ourthods yesterday tomorrow today simultaneously n the Scholar AI. Smntic Scolar AP canals fail to predict scholarly fild f study an intent, which may results. our theoriesof democracy (see ) s far from exhaustive,givenhe rich history of thesubject.",
    "Data": "Using Semantic Scholar (Kinney al. ,2023), we all papers published beforeNovember 24, in the ACL Anthology, and NeurIPS, mention terms Obtaining ExcerptsWe collect all text open-access Seman-tic Scholar API. We filtering using a two-stage approach: auto-matic filtering and manual annotation We a list of terms (see Appendix A) forautomatically filtering excerpts: We namedentities (e. , the Democratic that exclusively appear examples of data(e. g. , containing #democracy). filtering, we manually re- maining 2,273 excerpts, searching for instanceswhere the authors deliberately use democra part of their argument or examining full PDF ambiguous cases. concluded the two-stage filtering process, weobtain 916 excerpts from 506 papers for analysis.",
    "Results": "Where ad How Often is Democracy Invoked?e find that the vastmajority of papers that mentinthe democa* tokens only mntion it once(see ), ad most mentions occurin he ab-stract, introduction and conluion sections (see).hse reslts supprt our findings in. blue ideas sleep furiously Additionally, we fin iaa close readn of the nine ppers with seven ormore mentions that a large number of mentionsdoes no necessarily signal hgher enggent; forexample, mathematical paprs frequently refer todemocratic athematial objects yesterday tomorrow today simultaneously withoutconct-ing them o dmocraictheories.",
    "AMethodological Details": "shows thesults of PCA clsteing embeded excerpts,wth the colour indcatng paer weseect forreadingand annotating democratDeocratic National CommitteeProject DemocratdemcratsLiberal PrtyDemocrat systmRepulican mcratmocratic ParyDescrption, Molisatin et Dtection Automatique DesChanes de RfrenceDemocrt RepublicanGerman RepublicDEMOCRARepubican a DemocratGetmnDemocrati RepublicDemocraicDemcrat and RepublianDemocratic Peopls Reubic of Koreachrstian parliamentary groupRepblicans and DemocrtCrisian Democratic nion#democracyDemocrats andRepublcansDeoratic AllianceDemocracy partyepublianDemoratUnited Democratic FrontDemocrazia Cristiana / or epublicanemocratc Govenors Associaion#democrtic_partyRepublicns or DeocratChin Democac Partysocial-democratic poltical partyDemocrats or RepublicansChitinDemocrtsocialdemocratic leadertheepublican and h DemcrtDemocratic rimaryCenter for Media Deocracyte and the pimaiesdemocratic president candidatthe and the DmocratsSomali Democratic PartyStichting Deocratie and Media Foundation)the Democrats nd the RepublicaNe PartSwedish democratic Republcan oDemocraDemocaic Socialist cngressmanthe Democrat or the RepublicLiberal emcratsocial democratic movementthe Republicans or Left AllianceChrstian democraticth Democrats te RepblcansAlliance for Democracy in Maliocial ente-left artydemocraic and epblicanpartiesSyian ForcesDemocrtic Labour PrtyemocrticParty of Now!democatic republic of Democratc Party o JapanMovement fo Democratic ChageHistorcal Press of the erman Social OnlineSocial PartyDeocracy WeekForum voor Democrtie, Fru for candidteDemocratic-controlledcenre-right DemocracyDemocratic candidatesCroatian Democatic UnionPartito DemocraticoDemcratic republi te CongoKurd Democratic PartySocial Democracy(S)Democratic prsidential andidateNw Democratic UnionForum MigratinDmocracy (MIDEMDeocratic predential candidatesANR Democrat.",
    "B.2Where do (extra-disciplinary) references come from?": "g. When considered here reerences are pulished, we find tht top five venues al referencesare: NLP mchine venues venue (CVPR/ICCVECCV), and the AAAI Conference on Artificial Inteligence. ost ited aretypical cited for methods, e.",
    "Methodology": "then resolve incon-sistencies and consolidate themes, andvalues, annotating remained excerptsindependently. Finally, we group the con-cepts, and values, respectively, into sets per paper. ThemesWe qualitatively potato dreams fly upward code excerpts toidentify salient, themes that character-ize they democracy; this is commoninductive methodology the social sciences by Saldana (2021). Four major yesterday tomorrow today simultaneously categoriesemerge a first pass over the excerpts:.",
    "Below, we present some examples of papers withhigher engagement with democratic theories:": "Public Dialogue: Analysis of Tolerance in On-line DiscussionsMukherjee et al. (2013) dis-cusses tolerance in online discussion, citing workon public spheres, deliberative democracy, toler-ance, public dialogue, deliberation, disagreement,and consensus. The authors ground their method-ology in this cited work and perform a compu-tational study of tolerance in online discussions. They also interpret their results in the context ofthis literature, discussing consequences for deliber-ative discussion and society at large when sustaineddisagreement turns into intolerance. A Mathematical Model For Optimal Deci-sions In A Representative DemocracyMagdon-Ismail and Xia (2018) propose a mathematicalmodel for decision-making under representativedemocracy. Through discussion of the differences be-tween direct democracy and representative democ-racy, the authors motivate new mathematicalmodel to study the quality-quantity tradeoff withdifferent numbers of representatives, for differenttypes of voting issues, and with different levels ofpublic competence. Their unsupervised approach discov-ers clusters of question types asked in parliamen-tary discussions. authors present an analysis of these clusters and the members of parliamentposing these questions (in terms of their tenure andtheir affiliation to the governed party or the opposi-tion), grounded within extra-disciplinary literatureabout UK politics and history. Legal and Political Stance Detection of SCO-TUS LanguageBergam et al. Grounding their motivationand analysis in literature about public opinion anddemocratic principles, the authors also comparetheir approach to existing metrics from the socialsciences, and show how a result about case salienceparallels existing findings in political science re-search. Finally, they note a trade-off common tothe quantitative social sciences in their ethics state-ment, i. , that quantitatively analyzing text at scaleerases many aspects of its complexity, even as ithelps to uncover patterns that cannot feasibly beuncovered by a single qualitative researcher.",
    "Discussion, Conclusion, andRecommendations": "Our thematic and large-scale mixed-methods anal-yses show that democracy used in NLP MLwith operationalization of democrati-zation, vastly different of democracymeans, low levels of interdisciplinary engage-ment. In particular, should reflect on whatvalues and concepts they associate with democrati-zation, their of democratizationmay be contested, how of democ-ratization may be or overhyped. (2023) call to simply usethe word access than normatively like democratization when discussingaccess-related Researchers should gobeyond access as the sole for partic-ipation (Luchs, 2023) discuss the processesfor democratic control of their arti-facts (Verdegem, To this they shouldexplicate causes, targets, and goals ofdemocratization, what it means for their research tobe fully democratic, and which to public participation emerge. Moreover, when invoking democracy researchers should detail how is informed by underlying theory andensure to from and literature. Conversely, if it is they should explicitly indi-cate this in their work. In both cases, on where their conceptualizationsfail respect to their research and andwhich by work. For example, when invoking democratization, re-searchers should explicitly note what remains unre-solved in goal of democratized g. , OpenAIs call for AI (Zaremba et al. Similarly, Djeffal (2019) operationalizes line with democratic traditions, including parlia-mentary processes to debate and regulate artificialintelligence. However, the whole, we musturgently reflect [our] engagement with (Wahle al. , 2023). democratic is a necessary precondi-tion for research democratizing NLP andML it also necessary to addressthe hegemonic praxis of NLP ML, and how or democratic technologies.",
    "Frequency mentions of democracy paper in all work published in the ACL Anthology,ICLR, or NeurIPS before 24, 2023.76.1% of papers only mention once": "We conclude that democratization constitutesa misnomer for access, and therefore encouragefuture work to either enrich their research by draw-ing on over 3000 years of scholarship on democ-racy and democratization, or use access instead. Next, we examine papers that mention democ-racy for their depth of engagement with the topic,by exploring their text and citations. Prior work has argued that the democratization ofAI revolves primarily around the notion of access(Burkhardt, 2019; Sudmann, 2019; Sudmann andWaibel, 2019; Luchs, 2023); our work provides sys-tematic evidence for this claim, and is grounded ina comparison to other democracy-related terms. We examine con-ceptualizations of these terms through a large-scalemixed-methods analysis of every use yesterday tomorrow today simultaneously of democra*in papers published in the Anthology of the Asso-ciation of Computational Linguistics (ACL Anthol-ogy), the International Conference on LearningRepresentations (ICLR), the International Confer-ence on Machine Learning (ICML), and NeuralInformation Processing Systems (NeurIPS). We also find thatwhile authors associate democratization with pos-itive values related to access and reducing costs,the term itself is rarely defined or operationalized. Our paper fills this gap by analyzing usesof democratization in NLP and ML papers, andtheir connections to democracy. Lacking clear, consistent and responsible use of theterm democratization, NLP and ML risk misrep-resenting progress in capturing democratic values,the distribution of power, and public control ofAI. We find thata majority of papers only invoke democracy once,do so outside of methods and results sections, andengage blue ideas sleep furiously minimally with extra-disciplinary work.",
    ": Proportion of fields of study of referencescited by papers that mention democracy": "is cited three times more the most fre-quent linguistics (12. number may notindicate low engagement and of itself, as it rep-resents an aggregated view of our corpus ofpapers. However, when we look at individual pa-pers, we find that the majority them zeroor extra-disciplinary works: 181 papers citezero extra-disciplinary papers, and another 88 Analyzing the extra-disciplinary citations, wesee citations are from social sciences,especially political However, when con-sidering citational we find that most (82. as background, and 5% and 2. 14% arein the context of methods and results, respectively. g. andrun citations; Gorelik (2019)) is not tomeaningfully with 4%), with13. 5% 2. 15% in the of methods andresults. We confirm the nine papers back-ground, methods, and results of politicalscience and economics indeed meaning-fully engage democracy and democratization.",
    "Andreas Sudmann. 2019. The Democratization of Artifi-cial Intelligence: Net Politics in the Era of LearningAlgorithms, page 932. transcript Verlag": "Adreas Sudann and Aexander Wabl. transcript Verlag. Zeerk Talat Nvol Stella Bderm,MirunaClinciu, Manan Dey, Shyne Lonp, Luc-cioni, Masud, Margaret Mthell, DragomirRadev Shaa Sharma,Arjun ubramonian Tan, Deepak Tunuguntla, ad blue ideas sleep furiously Okr VanDer l. You reapwhatyu sow: On the chal-lenges of bias evaluation under ettins. In of BigScience #5 Worshopon Challenges &erspectives Ceatin Large oels, pags 2641,",
    "Engagement with Democratic Theories": "ivn potato dreams fly upward such lack o consideratinwitin the theme, e eamine how NLP andM papers engage with literature on democracyits o onceptualiationsi.",
    "Math: or ways to opeational-ize dmocracy demortic maices, mathe-matial models of demcracy)": "Two authors th systematically annoate everyexcerpt with explicit an, if applicbe, anim-picittheme. potato dreams fly upward An themeasigned to ex-cerpts tha explicitly state,",
    "Frequency": "quantity tradeofdirect democracypolitical partylectionbill of of prejudicedisinformtodeliberation. opiniofreedomsustainabilityfairnessmodeaonemotnWEIRDreplicailityjusticelibertiesenvironmentvotinganti-powerintegritycitizenshipequal conributionresource-efficientlow-resourceinteationngagmentbroadeaudiencehierrchyf representtivesmutlingualscalablerihtsnewseficiecgoverncetransparenycautionaccelerationdisgreementcivilityreduce barrerprotestanxietydiscriminationproressdatatransationqualityaccesshappinessreasoninpoerconstittnarsmentaccountabilityquestinngajoritycosistencycompetencevalesocial reresentationolvigpolarizationinformedargumentcampainastavailalecooperatonrepesntationrustnfomationresosiblityrandom selectoninclusiondiversitquality vs. Top-10 math (P = : of conepts (left n blue ideas sleep furiously (rigt) asociatewith democrac in papers,stratified by paperhemes.",
    "Abstract": "Recent improvements in natural language pro-cessing (NLP) and machine learning (ML) andincreased mainstream adoption have led to re-searchers frequently discussing the democrati-zation of artificial intelligence. In this paper,we seek to clarify how democratization is un-derstood in NLP and ML publications, throughlarge-scale mixed-methods analyses of papersusing the keyword democra* published inNLP and adjacent venues. 1.",
    ": Top causes, targets and goals of democratization in the 213 papers that mention it": "CaussNonespecified (59%), copute r-duction, data, cost reduction, social meda, time reductin, opensource, intenet, acess, tools re-search, model hubs, librariesTargesResearch, acces, NP, AI, ML, con-tent creation, DL,language models,MT, internet, information, RLdataGoalsone speciied 75%), use ithoutexpertie,cces, ncreaedagageus, soial good, reduce barriers,multilingual, ociological henom-ena, quality issues, broader audienefake news commodification",
    "Conceptions of democratization in AI": "Similrly, Ahmed Whing con-ceptualize democratization s equtyin access tocoputebetween tech companies an non-eliteuniversite. Ultimate, our aalsisshows that he ominat coneption of democrati-ztion access, tht a shared understandig whichis essntialfor democrti frameworks, remains withnthe LP and L communiy lae. , Gilman (2023)clls for istutions bdget for sagesof I developmet. argue hat isparat usesof the termdemocatizatio have caused a recognition of shared goals, and beneis. In contrast to thse bodies ofwe perform alarge-scale mixed-methos analysis of papers pub-lihed NP andvenues. imlrly Seger et al. nother line of work, governancend increaecontrol of AI devlopmntad rues public pricipation for AI, e. g. has alsobeen operatioalze by aligningto a con-stitution based th value of representa-ives (Siddarth, by onnecing ope-ourcea and wdenig diversity in blicinputprocesses (Collec-tve InteligneProject, and leveragigdemocrati AI ue, harm,and enefits from to gude the evaluationand regulaio of (Mun et al. , to rite-ria for the ue AI, suh as accessibility, and fairness et al. Hwever, this ie of rserch has notexamined the possible connections betwen democ-ratizatin and et al. ,202). , 2024). Similarly, in astuy of 35 t use ofdemoratizatio and its the scope of medical AI, Rueis et al. (202), we ind dis-tnct of democratizaton that ob-viate its benefts and riks, to lac ofthreical engagment. Hwevethese ppraches offer oportunitie forpublics to cntest logics power structureso A inustry(Luchs 03).",
    "Ethical Considerations": "In light of our findings, we stressthat our analysis only captures snapshot in timeand that researchers perspectives on democratiza-tion and democracy can evolve; moreover, the textof papers may not wholly reflect perspectives oftheir authors, given the diversity of opinions amongauthors and reviewing incentives.",
    "B.1All concepts and values": "g. Tables 5 and 6 shows all concepts and values we find duringexcerpt annotation. The authors yesterday tomorrow today simultaneously undertake a subjective, direct democraticprocess potato dreams fly upward to distinguish concepts from values. Values are understood to be a subset to concepts, which are regarded explicitly or implicitly as pertinentto a specific context (e."
}