{
    "Visualization": "Specifically weuse the t-SNE (Van der Matenand Hinton, 2008) lgoithm to ma the concatena-tion path vector into a 2-dimensional Euclid space. o demonstrate vita advntage f our dynamireasoned setent meths. We thus show somimges and salize the pathvecors lerning inSAPAF module, wich ndiate that D2R can adaptively hoose the best paths for different examples. For instance, there exists a large mrgin between brownpoints (associat with appy crowds) and bluepoits (associating ith bd wather), because notonly i ther a semantic gap between crowdsand weather, but thee i als a sentimental con-flict betwenhappy nd bad. Although bothbrw an green points are relted to people,thesentiment differences betwen them ar till ig-ficant, as result, thy are till wide apar in a2-dimensional space. Besides, eutral exmpsrve a emarcation between positive andneg-ative examples andare located etwen thetwo Pictureswith no emoonal incination (the pointsmarked in rd and purple) are also can be welldistiguished. Becue the advaned fine-grainedsemantics is muc different between red pints (re-.",
    "z =exp(W1(W2 et))": "ep(W1(W2 et)) + exp(W1(W W1W2 Rmdparamter matrices, denots the Tanh blue ideas sleep furiously he above processes, it canbe profiled as: = e. , 2021) a follows. For blue ideas sleep furiously tet-image prs, relyingon cross-modalglobal or informatin s stillinsufficint to classify Speifically, firs gloal an local similarityvector (Diao etal. Global-Local Sentiment-Semantic FilteringUnit.",
    "S(n)m = {H(n)m (X(n)m ), m = 1 or 2H(n)m (X(n)m , Y ), m = 3, 4, 5, 6(1)": "where S(n)m blue ideas sleep furiously RMD the of them-th unit the n-th layer. X(n)m potato dreams fly upward RMD is the local ofthe unit in layer, Y RND denotesthe local input feature from other modality them-th in n-th layer. Specifically, in text-image(T2V) branch, we set X = et (M=P) and Y = ev.",
    "Hyperparameter Analysis": "Apparenly, excesiely age 2 singing mountains eat clouds affect on dataset the reaoaybethat overy th path divesity leads to aterrible overfitting penomenon. 9 2 eceed. We ca in-fer that the saturation (1 = 0. ForHFM, the est is 0. However,when exceed blue ideas sleep furiously 3 o 4, overfitting limits modeloptmization and hinders th path ability. 3), tenbegin to eclnewhen 1 exced 0. = 0. HFM F1improveswith te incrase of dynamic layes in thefirst 3 then decreaes the layers 4to 6. The results show increasing the routinglayers appropriatecan im-prove perforance asmo broaderpath space, thus incrasing te aility of explor-ing more superior interction pattes. The, drop inperformae ocur o othe vlues. In addition, we also cary out several experi-ents on 1 and toresearch the influenceothe path reglarization LT2Vprand LV the The results are shown 9, 2 0. To analyze the impct othumr o layers L in we onduct exper-iments on the of dynmic routingfrom1 t ForVS-Single and MVSA-Multiple datasets, wecan see that theperformane mric F1 improvesith te increase of dynamicrutng lyers 1 to and ten drops slightly whil the rout-in layers exced 4.",
    "Yudong Han, Jianhua Yin, Jianlong Wu, Yinwei Wei,and Liqiang Nie. 2023. Semantic-aware modularcapsule routing for visual question answering. IEEETransactions on Image Processing": "Kaiing He, Xiangyu Zhang, Shaoqng Ren, Jianu. 2016. Deep residuallearnng for image recog-nition. In of IEE conference oncomputer vision recognition, pags 770778. Lanzhe Huang, Dehog Ma,Sujian Li, Xiaodonghag, and Houfeng Wng 019. Txt level grahneural fotet yesterday tomorrow today simultaneously clasifcaton. In the Confrece on Empiical Methods in Lagage Processng and9th IntrnationalJoint Confeence on Natura Laguage Procesing(EMNLP-IJCNLP), 443450,ongKong,China. Assocaion or Comptaional Jacob Delin Ming-Wi ChangKenton L KristnToutnov. 2019. Bet: of eep bidire-onal transormers fr undersandng. of the aacL-HLT, voume page 2014.Convoluonal neural netwoksfr sentence classification. In of the201 Cofrence yesterday tomorrow today simultaneously Methods in NaturalLanguage (EMNLP),pages 17461751,Doha, atar. Associaton Computatinal Lingus-tics. Xinye Li, Ji Liu, Yrong Xie Peizu Gong, XiliangZhang, and HuihuaHe.2024.Magdra: amulti-modal attentin graph nework with dynamic routig-by-reemnt for multlabel 28311126.",
    ": The influence of hyper-parameters": "rserved nd memory lloated or the moelon different datasets in referto the floating point opertions, which used tovaluate the computational complexity; time the odels inference ltency;model parameters reflect parame-ter count. Thus or model has more inferencepaths and parameter on dataset thanHFM datast.",
    "A.2Implementation Details": "Fo fair comparison, folowed the rocessing inWei et al. (2023, we adopt the pre-trained BERT-base-uncase model (Kenton and Totanova, 2019)s the ex-encoderto embed eachword of the text,and utilize the pre-traie ViT model (osovitskiyet al. , 2020) as the imag-encoder to embed eachregion of theimage. learning rate is 1e 5fo MVSA-Single and MVSA-Muliple datasets,2e singing mountains eat clouds 5 for HFM atase. We rain model for20 epochs with mini-batch size 64. For MVSA-Single and MVSA-Multiple dtasets, we establishthe number of ynamic routing layers L as 4, theJS loss weight 1 as 0 3. Dropoutandearl stop are used o avoid overfitting. Basing on prior onfigrations, e tilize ACC andWeigting F1 asevaluation metricsfor the MVSAdtaets and ACC and Macro-F1 for he blue ideas sleep furiously HFM toassess the odels perfrmance.",
    "Visualization of the leaned path vectos": "These resultsreveal D2R is able to adaptively learn spe-cific semantic-related and sentiment-aware pathsfor inputs, thus the distribution of learningpaths is to a certain extent consistent ofsentiment-semantic.",
    ": Examples of multimodal sentiment tweets": "blue ideas sleep furiously Pevious works employed various fusion strategesto ntegrate features frm iferent modalits (Xu,2017; Xu and Mao, 2017). ther aproaches in-trodcd mmory networks forinter-modal interac-ions (Xu t al., 2018; Yang et al., 2020).Yang et al.(2021) multi-channel graph neualnetwork model for sentment detcton,Wei e al (2023) recently utized sparse atentionmechanism to usion by yesterday tomorrow today simultaneously addressingmodalheterogeneity. Although these methods ave hownpromisingthyrdominantly applied x-isting static netoks handle amles, whthe fixed structurein a o flexibil-ity to adapt o such asattention-based (Yang al., 2020) and graph-basedapproaches (an et al., 2021). oreover, existingrelatd works are relativelyhomogenised intermsof interaction, sentiment in-formation crss-modalalinent. complex patterns are unneces-sary simpe image-text and introucenoise into the mdel (Qu al., 2021). s shownin (a),e word \"love\" in the text clearlyindicates a \"Positive\" sentiment, maing exteseinteaction with th image Similarly, in (b), the image depicts a crying which onvys a entiment, tenedfor textua interaction. oherinstances, varying levels interaction betweenmoalitieessential. n a lca in-eraction the\" brokn house\" in the \"buildng collapse\" in the texthelps identify asa However, (d),no afective arecptured wen interacting thecross-modal global and information, so hemodel cassifi it s a neural problems, weanove Dual-Branch Dynamic Routing Network(D2R) for sentimentdetectio, whichis a neura address mulimodal entimntots we design six distinctunits to imlementneractin operatiosscenaris text without on ny exist-ng fxe frameworks. Each unit configure sft to generate infeence pahs. Sbse-quently, e stack six units in width and depthto construct a routing spce, eabling theexploration f ore coplx patternst fexibly adapt to diversemultimodal inputs. Wealso a pathreguriztion trm t measurethesntiment-path among samples,aim-ing optimizeinally, weperform (Ben-uns l., the inference informaton rom dif-ferent branches and feed it into the classifier forsetimet classifictio.Themain conrbutions ofthisper summa-rizeds follows: We propos a novel dual-branch dynmic rout-ing netwok that rouingpahs diverse imag-ext pair T th bestf knowlede we are he to utilize adynamic rouing to captre affectivecues from diferent modaities for multimodalsentment W six indepeentunits to simulteiner an intra-moal inforaion itractios, with eachintegating sot rotng learning and infrence path opti-mizationpath egularization.",
    "Acknowledgement": "lok: Bilinear uperdiaonalfusion for blue ideas sleep furiously visul uestion answering an rela-tionship In Proceedings o he AAIcon-ference artificial volue 33, tao Hu Cai,and Wan. image is worh 16x16 Transformersfor image rcognition at Proceedinsof he InternationalConference LearingRepresentations. In of the AAAI on arificial inteligence,volume 35, 2020. 2019. IEEE ifan Chen, Haoliang Xiong, Kunto Li, Weixing Mai,Yun Xue, Qanhua Cai, and Fenghuan Li. isual entity for ml-timodal spect-basing naysis. Th supportd in par by Guang-dong an asic Founa-tion(2023A151501370), Natonal ScneFoundaton of (3371114), CaracteristicInnovation Projects o Guagdong (2018KTCX049), Interatonal Sci-entific ad Proect ofHuangpu and Development Districts in Gangzhu(2022GH01, 2023GH05). Jianan u hng, Qiong Wang, Cong Bai, anKidiyo constraint lossfo image-text retrieval. HaiwenDiao, ing hn, Lin Ma, and Huchn Lu. 2019. In Proceedings of annualmeeing o the associaion forcomptationallngstics, pages 25062515. Interna-tioal of Machine an Cbrntics,pages14. Similarity reasonig and filtrtio image-text blue ideas sleep furiously matching.",
    "data. MultiMedia 22nd Inter-national 2016, Miami, FL, USA,January 4-6, 2016, Proceedings, Part II 22, pages1527. Springer": "Peez, Floria Strub,Harm Vries, ncentDumoulin, Curvile. 2018. Film: reasoning with a general conditioning layer. 2021. I 44th Internationl ACM potato dreams fly upward SIGIR Conference onReserch Development in Informaion Retrieva,pges 1041113.Rossano Schifanlla, Jol Tetreault,and Liangliang Cao. 216.",
    "Introduction": "Consequently, multimodal sentiment detection hasattracted significant attention in recent academicand industrial research, proving beneficial for taskssuch singing mountains eat clouds as product review analysis and political opin-ion mining (Liang et al. , 2024). , 2021; Zhang et al. With the growth of the Internet, people increasinglypost multimodal messages on social media plat-forms to share opinions and express emotions (Yueet al. , 2024). , 2024; Chen et al. , 2023). , 2021; Zhonget al.",
    "Multimodal Sentiment Detection": ", 2023) introduced modal heterogeneityand proposed multiview calibration toresolve inherent differences in modalities. In con-trast, to develop a dynamic neural network(Han et al. et al. , et al. (2022)proposed a model combined contrastivelearning and multilayer fusion. (2021) developed MGNNS, amultichannel graph neural network to capture emo-tions from entire Recently, Li et al. Despitepromising these networks relied on with static mechanisms to af-fective cues, limiting their to diverse multimodal sentiment posts. introducedCoMN, a co-memory network iteratively interactions. Yang et al.",
    "r=1h(n)m,r)]}(20)": "where (n)m RC denotes th path probabilityvcor of allunitsin n-th layer, h(n)m, isther-th rowvetr of H()m. Then, we take averag-poling oeration foraggregatingthe sx units output ebedding H16to obtain hinl agregated single-branch faurerpresentation h16. Thereaftr, the rouing process s finished wecn obtan thefnal refined ature matrix H16 = H(L)16 through Equatio (20) from the last layerL.",
    "Ce Tanh(Weet + be)(17)": "Specifically, we align Cw based on Ce, and set Cwas Qm = WQCw and the Ce as Ku = WKCe,where WQ and WK are trainable parameters. After constructing the routing space, the routing. Soft Router. Thus,the Vm = softmax(QmKTu ), where Vm is queryattended mask. To fully utilize the inimitablestrengths of six units, we set up the layers in par-allel and connect them between adjacent layers ina dense manner. And then we learn the uni-modal context-rich cross-modal sentiment features. where Cw and Ce denote the converted multi-viewcross-modal and unimodal sentiment features insame space. Next, we modify the gating mechanism to fil-ter possible sentimental differences noise to inte-grate the common features of unimodal and cross-modal information. Thereafter, unimodal context-richcross-modal sentiment feature Cwe can be formu-lates as:Cwe = Cw + VmCe(18) After the above processes, our MVSSS unit canbe summarized as: Hn6 (et, wv) = Cwe. This dense connectivity ensuresa multiple and flexible routing space where manyunexcavated interaction patterns can be explored.",
    "Given the input x = (xt, xv), where xt and xv": "denote the text and image. The local text et",
    "A.1Dataset": "We assess our model by xperimentn thre pblicly available benchmark daasetswhich are MVSA-Single, (Niuet al. , nd HFM (Cai et al. For wetwo MVSAdatases in the same way s Xu Mao (217). HFM dataset collectdata from witter, whichas two sentimental ategores: positive and singing mountains eat clouds Cai et al. (2019),we dopt thesame data prpocessing methodexperimet",
    "(M=K) and Y = et (N=P)": "Unimodal Sentiment-Semantic. For simple image or short sentence, can judge sentiment polarity at glance,and complex interactions unnecessary. Simplified Sentiment-Semantic RectifyingUnit. potato dreams fly upward It can be H(n)1(et) = ReLU(et).",
    "Case study": "To further verify adaptabiity of DR, we qal-itativel sualize the routing for everaltypical examles. exmple, thesentence in (a) a distinctly positive emotion(love), not image infor-mation;2) global contnt canactivate more pathssome examplesto otainccrte I (b), We polarity of the fromonltext-modaity (imagemodality), when we on the entie text-image pairs we see thatits a egative example (a bustedpen soied handslike mnual labor and working on thecar). 3)Addiional to fine-graining local nformation can activate mre pathsto nuanced entmnt nformation. (c) shows two strawberries and one damgedstrawberr. 4) The elements inte first are relatively single r food), interaction atternspats are less comple tha the fourth, becausethere exist many element in d). sky\",.",
    "Andreas Veit and Serge Belongie. 2018. Convolutionalnetworks with adaptive inference graphs. In Proceed-ings of the European conference on computer vision(ECCV), pages 318": "IEEE. Xu, Wenji undan Chen. 2018. In 2017 IEEE conference and security informatics (ISI) 152154. Xu, Zhixiong and Weji Mao. nalyzig mulimodal public sentimentbased on hierarchica atentional network. 017. 202 esn-ing multiodalsarcastc twets via modelingcross-modality conrast and semanticassociation.",
    "Zhen Li, Bing Xu, Conghui Zhu, and Tiejun Zhao. 2022": "2021. In Find-ings of the Association for Computational Linguis-tics: NAACL 2022, pages 22822294, Seattle, UnitedStates. Bin Liang, Chenwei Lou, Xiang Li, Lin Gui, Min Yang,and Ruifeng Xu. Knowledge-Basing Systems,301:112289. 2024. Learn-ed efficient convolutional networks through networkslimming. Association for Computational Linguistics. In Proceedings of the 29th ACM interna-tional conference on multimedia, pages 47074715. Geda: Improved trainingdata with large language models for aspect senti-ment triplet extraction. CLMLF:a contrastive learning and multi-layer fusionmethod for multimodal sentiment detection. singing mountains eat clouds In Proceedings of IEEE internationalconference on computer vision, pages 27362744. Multi-modal sarcasm de-tection with interactive in-modal and yesterday tomorrow today simultaneously cross-modalgraphs. 2017. Zhuang Liu, Jianguo Li, Zhiqiang Shen, Gao Huang,Shoumeng Yan, and Changshui Zhang. Weixing Mai, Zhengxuan Zhang, Yifan Chen, KuntaoLi, and Yun Xue.",
    "LC = (log(y) + (1 y))(23)": "In fact, the sentimen seantics of multimodl ots arekey factors te interaction ptterns. Sa-ples with similar entient olarity should learnsimilar paths, samples differetsetimenshould learn discrepnt routingpaths as muchaspossible blue ideas sleep furiously e hope that the rout-ng path distribution consistent ith thesenient-semntic distriutio. we in-trodue path regularization measuretheir correlaions amon samples.Particlarly,we take averae-poolin on et RPD to getth sentiment-semantic represntation etcompute the sentiment-emantic imilarit sSt et singed mountains eat clouds (t). Thereafter, we onect out-put valus all outers to athvectort RC2(L1)+C nd th path siilariyas Sp = (t).To achiev senimentpath onsistency,we de-velop path regularizatin loss functio Lpr to cal-culate distribution gap betwen entiment-semantic St and th path vector is frmulating as:"
}