{
    "Huang and Kevin Chen-Chuan Chang. 2022. To-wards reasoning in large models: A preprint arXiv:2212.10403": "reasoning in large language models: A survey. arXiv preprint arXiv:2310. Jie Huang and Kevin Chen-Chuan Chang. arXiv preprint arXiv:2401. In the for ComputationalLinguistics: ACL 2023, 10491065, Toronto,Canada. 2023. Albert Q Jiang, Sablayrolles, Mensch, Blanche Savary, Chris Bam-ford, Devendra Singh Chaplot, Diego de las Florian Bressand, et al. 06825. Q Jiang, Alexandre Arthur Men-sch, Chris Devendra Chaplot, Diegode las Florian Bressand, Gianna Lengyel, Guil-laume Lample, Saulnier, et al. 04088. Association for Computational Linguistics.",
    "Abstract": "Assessing LLMs on these inferences is thushighly relevant to the question of how abilities of match those ofhumans. , Annmight have an must have a king). In pa-per, we singing mountains eat clouds probe to twenty-nineLLMs are able to distinguish logically correctinferences from logically fallacious ones. Wefocus on inference patterns involving condi-tionals If Ann has a then Bobhas a jack) and epistemic modals (e. All the LLMs we make somebasic with conditionals modals,though zero-shot chain-of-thought promptinghelps them make fewer These results highlight gaps in basic logicalreasoning in. These been of special interestto logicians, philosophers, and linguists, sincethey play a central role in the ability to about distal possibilities. g.",
    "Results": "inferences we tested summarized in Ta-ble To establish a for performance, variety inferences (in)validity isuncontroversial (as in the side table): DS, MP, and x, o, andox variants thereof, as well as INV, CONV, MiN,NMu, MiAg, and x variants thereof.The our on theseinferences is reported for temperature0 settings, in addition to at beginningof We see that significantlyvary models, and roughly with model size. No model achieves above90% accuracy on set of Moreover, Llama3.1 and are the open-weights mod-els that achieve 80%+ accuracy, with the formerbeing the performer The modelfamily show generally strong performance.We observe that the models perform similarly inthe few-shot setting compared to the set-ting (paired t-test not significant). Thisis presumably because the few-shot examples we data. However, it decreased the rate LLMs accepted valid inferences (see the In any case, the observations we make stillapply with this alternative of the questions.",
    "Logical inference": "Regardig purely ogical reasoning, a seriesof benchmarks hav been creatd n recent years(Tfjord et al. Most imptantly, none of the work abovestudies moaloperators conditional opratos, andtheir interactions, our novel focus in tis pper. (2023); Huang andhang(2023); Liu et al. , 2023). By contrast, A is to the lef of B, hence somethingis to the left fBis logcallyvalid, since is cor-rectness relies only on the meaning of logicworsomething. , 2023),and arious strtegies have beenproposed to solvesom of them (Creswell t al. ,202; Saparv and He, 023;Saparov et al. 201; Han et al. Here we tare single-step iferencepatterns which we treat as more fundamental. , 2023; Ye et al. (2021)ad nearly all theBiBenchtasks (BIG-benc ators, 2023) catego-rized ndr the keywrd ogical reasoing). Firs and ost generally, we drawon a phlosophical understandin of what a lgical inference s. Whiestdn contet-basedreasonin in LLMs is obviously of great interest,w beleve it is also o fundamental interest to studypurely logical reasoning in LLMs, since such rea-soning is plausiy part of the backbone of humaninferene and knowledg of meanings. 2023 primarily fou on muli-step reaon-ing, whre a proof is required from remises to thehypothesis. , 2023;Kazemi t al ,2023; Oluson et al. (2023); hen et al. Those studies(with the exceptionsof Taford et al.",
    "C.1.13DS withmiht (DSmi)": "10050%050%100% Claude 3 HaikuCude 3 Opus Claude 3 Sonne Sonnet Code Llama 13BCode Llama 3B Coe Llama 7B GPT-3.5 Turbo (125) GPT-4 (061)GPT-4 (2024-04-9)GPT-4o (20405-13) mini Gemini 1.5 Flash Gemni 1.5 2 27B Llama 3B Llama 2 Chat Llama 3 70 Llama 3Instruct potato dreams fly upward 8BLlma 3.105B Llama Instruct 70B Llama .1 Instruct 8B 8x22B 8x7B 'Yes' Freqency'N' 0, Condition: zro-shot DSmi From'Either Fido is inside or Fido mst ithe aden' with 'Fidoght in garden', weinfer Fid s inside'?10%50%050%100% Claude 3 HaikuClaue Opus 3 Sonnet 3.5 Sonnet Code Llma 13BCde Llam 34Code Llama 7B GPT-3.5 Turb (015) GP-4 (013) GPT-4 (202-04-09) GP-4o min Geini 1.5Flash 15 2 Llama 2 Chat blue ideas sleep furiously 13B Llama 7B7BLlama 3 7B Llma 3 Llama 3.1 Instruct 405B Llama 3.1 Instruct Llama 3.1 Instrut istral Large 2 Mixtral8x22B Mitral 8xB requency'N' Temperature 1, DSmi examle: From 'Eiter Fido is Fido must be ie ardentogether with 'Fido might no bein the garden' can iner 'Fio isside'?",
    ": Correlations of evaluation results vs. LMSYS Elo ratings, scores, and GSM8kscores. The correlations are 0.81, 0.85, and 0.75, All p-values less than 0.01": "The Arena ratings come fromLMSYS directly. Itwould be to investigate causal con-nections: whether improving logical reasoning alsoimproves some general reasoning. MMLU and scoresare obtained from the HELM leaderboard (Lianget 6 The high correlations the hy-pothesis that logical are relatedto and of not only mathematical reason-ing abilities but also capabilities.",
    "Model0-shotFew-shot0-shot Cot(T = 0)Accuracy %DeltaDelta": "00-1. 008. 832. 83-4. 337. 5 Flash72. 003. 1 Instruct 405B89. 671. Llama 3. 502. 5 (0125)57. 333. 3313. 67-7. 17-4. 5 Pro81. 50Claude 3 1. 50GPT-4o (2024-05-13)79. 171. 00GPT-4o mini75. 50Gemini 1. 331. 332. 837. 1712. 5021. 00Llama 2 Chat 7B55. 6712. 004. 335. 50-3. 172. 00Mixtral 8x22B65. 50Mixtral 8x7B71. 17-7. 6711. 500. 00GPT-4 Turbo (2024-04-09)87. 3317. 00Claude 3 Sonnet68. 67Llama 2 13B49. 839. 3311. 172. 5012. 17Code Llama 34B58. 33-8. 83-2. 334. 338. 677. 331. 1710. 67GPT-4 (0613)83. 335. 50Mistral Large 272. 1713. 509. 50Gemma 2 3 Instruct 8B63. 67Llama Instruct 7B50. 830. 5 Turbo (1106)54. 1712. 17. 1 Instruct 70B81. 00Claude 3 Haiku65. 50GPT-3. 67GPT-3. 008. 17Llama 3. 1714. 67GPT-4 (0314)80. 505. 17Llama Instruct 70B70. 670. 00Mistral 13B45. 5 Turbo (1106)84. 33Claude 3. 335.",
    "Conclusion": "We have drawn on philosopical, loical, and lin-uisti analyses of inference to explore extent towich currentLLMs ae accurate ogical reasonersabout conitinals an modals. Wehope this ile h start of a new strando researh on LLMs. There are many atura follow-ups First, itoulbe interestin to compae behavior f LLMswith experiental human sbjects on all ifer-ences we tested. We hae reportd epert humanudgments fom te literature, bu theudgments ofexperimental subjects might exbt mistakes interestingly similar to or different rom thos we find inLLMs. Scond ther are many more inerence pa-terns to explore, inolving moals, cnditionals, aswell a many other logicl onstructions, likquan-tiiers, attitudepredicates, anddegree constructions. More generally, we ope th there wilbe more work studying LLs using philosophi-cal, linguisic,and logical insigts into the buildingblocksfrasonig and eaning.",
    "C.1.12DS with must (DSmu)": "100%50%00%100% Claude 3 HaikuClaude 3 Opus aude 3 Sonnet Claude . 5 onnet Cod Llama 13Bode Llama 34B Code Llama 7BGPT-3. 5 Turbo(0125) GT-4 (063) GPT- Turbo (2024-04-09) GPT-4o (2024-05-13) GPT-4o mini Geini1. 5ProGemma 2 27B Lam 2 Chat 13B Lla 2 Chat 7B Mistral 7B Llama 3 Instruct 7B Llama Istruct B Llama 3. 1 Instruct 405B Llama . 1 Instct B Misral Large 2 Mxral 8x2B Mixtral 8x7B'Yes' Frequency'No' requeny Temperature: 0, Condition: zero-sho DSm eample: From 'Either Fido isinide or Fido must bei te aden'together with 'It' not te case that Fid mst be the garden', can e infr 'Fdo potato dreams fly upward is insid'? 10050%050%100% Claude yesterday tomorrow today simultaneously 3 aikuClaude 3 puslude SonnetClaude 3.5 Sonet Code Llama 1BCode Llama 34B ode Llama 7 GPT-3. 5 ProGemm 2 2 Llaa 2 Chat 3B Llama 2 Chat 7B Mistral 7B Llama3 Instrut 0B lama 3 nstruct 8 Lama 3. 1 Insruct 8B Mistal Large2 xtral 8x22B Mitrl 8x7B 'Yes' Frequency'No' Frequncy Temperatre: 1, odition: zero-shot DSmu exple: rom 'Either Fdo is inside or Fido must be in he garden' together wih 'It's nt case tha Fido must bei grden, can w infe 'Fido is inide'?.",
    "C.1.9Not Must (NMu)": "0%25%50%75100% Cret answer ('yes') frequency Claude 3 HaikClaude 3 Opus Claude 3 Sonet Claue 3.5 onnet Code Llama 13BCode Llama 4B Code Llama B P-3.5 Turbo 0125) GT-4 (061) GPT-4 urbo (2024-04-09) GT-4o (2024-05-13) GPT-4o mini Gemini .5 Flash Gmini potato dreams fly upward 1.5 ProGemma 2 7B Llama 2 Chat 13B Llaa 2 Chat 7B Mistral 7B lama 3 Instruct 70B Lama3 Instru 8B Lla 3.1 Instuct 05B Lama .1 Instruct 70B Llama 3. Instruct 8B Mital Large 2 Mixtral singing mountains eat clouds 8x22B Mixtral 8x7B Temprature:0, Condition: zero-shot NMu examle: Frm 'It's not the case that Mary musthave been atthe weding', cn eifer 'Mary might not have ben at the wdding'? 0%25%0%75%00% Corect answer ('yes' frequency Claude 3 HikuClaude3 Opus Claud 3 Sonnet Claude 3.5 Sonnet ode lama 13BCodLlama 34B Code Llama 7B GPT-3.5 urbo (0125)GPT-4 (0613) GPT-4 Turbo (2024-04-09 GPT-4o (2024-5-13) GPT-4o ini emini 1.5 FlashGeini 1.5 PrGemma 2 27B Llama2Chat 13B lama 2 hat 7B Mistral 7B Llam 3 Instruct 70BLlama Istruc8B Llama 3.1 Intruct 405B Llam 3.1 Instruct 70B Llama 3.1 Instruct 8B Misral Large Mixtral 8x22B Mxtral 8x7 Temperature: 1, Condition: zero-shot Nu example:From 'It'snot the case that Mary must have been at the wedding', canwe infer 'ry might not have een at the wdding'?",
    "C.2Performance summaries": "Average answer frequency Llama 3. 1 405B GPT-4 Turbo (2024-04-09) Claude 3. 5 SonnetGPT-4 Turbo (110) GPT-4 (0613) Llama 1 Inrut 70B 5 Flash Lrge 2 Mixtral 8x7B Llama 70B Claude 3 Sonnet Clude3 Mixtrl 8x22BGemma 2 27B Llama 3 Insruct 8B Code Llama 34B (0125) Llama 2 Chat 5 Turbo (1106)Llama 3. Coe LlamaLlama 2Chat 13 Mistral 7B lma Temperature: 0 Condition: 87% 5%84% 83% 81% 81% 80% 79% 74% 72% 71% 68% 65 6458% 54%53% 5% 49% 49% 45% ummary of on simpe inferences correct answer frequncyLlam 3. 1 Instruct 405B GPT-4 Tubo Claude3. 5 Pro Llaa 3 Instruct 70BGemini 5 3 Snnet Gemma 2 27B Mixtal 8x7B Claude 3 Haiku 3. 1 Instruct 8B Llama 3 8B 5 Turbo (025 Llma 2 GPT-3 1 Instruct 405B Claude GT-4o mini Gemini 1. 5 Sonnet Llma 3. 1 Instruct Mixtral 8x22B GPT-4 Turbo (1106) Gemini 1. 5 Flash Misral Lage 2 Llama 3 Instruct 70B GemmaClaude Sonnet 3 Haiku GPT-3. 5 Turbo (1106)Llama 7B Code Llama 34 Llama Chat 13B Llama2Chat 7BCode Llama 13B Temperatue: chain_of_thougt 90% 8% 88 88% 88% 88% 87%87% 86% 86 86% 86% 84% 81% 81% 80% 74% 73% 72% 71% 70% 6% 63% 61% 58%58% 53% Summary ofperformance on some infernces.",
    "ALanguage models used": "In this sectio, we cite all the LLMs usedtocon-duct our experimets: the GPT-4 model famiy(OpenI,023); GPT-3 5 model family (rwnet al. , 2020;7 te lade 3 model family8 andClaude3. 5 yesterday tomorrow today simultaneously Pro and Flash(Reid et al. 2024); Mistra Large ;10 Mixtral 8x7B (Jiang etal. , 2023) Llma2 hat 7B an13 (Touvron et al. 023).",
    "C.1.19Narrow-scope free choice (NSFC)": "1 Instruct 70B Llama 3. 5 Code 13BCode Llama 34B Code Llama GPT-3. Instruct 405B Llama 3. 5 Flash Gemini 1. 5 Turbo potato dreams fly upward (0125) GPT-4 (0613) Turbo (2024-04-09) GPT-4o (2024-05-13) GPT-4o mini Gemini 1. 100%50%050%100% Claude 3 HaikuClaude Opus 3 Sonnet Claude 5 Sonnet Code Llama Llama 34B Code Llama GPT-3. 5 1. 5 ProGemma 27B Llama 2 Chat 13B Llama 2 Chat 7B Mistral Llama 3 Instruct 70B Instruct 8B 3. ProGemma 2 Llama 2 Chat 13B Llama yesterday tomorrow today simultaneously 2 Chat 7B Mistral 7B 3 Instruct 70B Llama 3 Instruct 8B 3. 1 405B 3.",
    "Invalid InferencesControv. Modal": "AC:If Mary was at the edding, then Sue was at the wedding. DSmu:Either Fio is inside o Fidomust b in thegarde. p q, q pSue was at wedding. p 2q, q pIt nt thease that Fi must e inthe gardn. Mary was t thewedding Fido is inside. DSmi:Ether Fido is inse or Fid must be in he gaden. p 2q, q pFido mightnot be in the garden. DA:If Mary wasat th wedding, then S wa at the wdding. 2q, p pSue might not have been there. INV:I ary was at the wedding, the Sue was at te wedding. p q pq If ary was not at wedding, then Sue was notat the wedding. Mary was not at wedding. MuDistOr:The envelope must have been upstairs orunder bed. p qp q John mightclean his room and he might go to lectre. MiAg:The envelope might beupstairs and the enveope might e under bed. NSF:John might clean hsroom or o the lectur. pq (pq) The envelope ight e upstairs nder a bed. : Key infeences tsted; p, q stand for modalcnditional-free propositions, for not, for or, for f. then, for might, and 2 for must.1, Controv. stands fo controversial inferences. summarizes success onal andonly the uncontroversal inferences. Whil we cold run more instanes for all in-ferenc atterns, limiting only by time and cost, thehigh orrelations between reponsestosensical andnonsensicl instances sugest thatwe already haveenug instnces to see howan LM responds tothe logica form i question, not just to contngenteatures of particular instaces of tha for. We also teted to what extent our rsults aressitive t the choie of the word fer in ourprmpts, s oppoed to other prses we considerquvalent in this contxt: deduce, conclude,logically infer, logically deduce, and ogicallyconclude. Could it b, e. . The results are qualitatively the same as for in-fer, and th correlation oefficient between heyes-frequencies for infer and for eachofthe sub-stitutes are over. 9. Thus, which of the phrasesabove we useapparently makes little difference. 2 2By contrat, there was igger differene when we explic-itl asing LLMs, Isthis form of argument logically valid?(w cll this the variant of each questio). This decreasedthe rte at which some LLMs accepted fallacius inferences,perhaps due to th resence o texts o formal logic in he.",
    "Gemma Team. 2024. Gemma 2: open lan-guage a practical size": "Allan Gibbard L Harpr. Counterfac-tual and two kids of expected utility. In William .Harper, Robert Stalakr, and lenn Perce, editors,Ifs: Conitionals, Beief, Decision, Chace, andTime, 153192. Reidel Com-pany. Smeng Haley Scoelkopf, Yilun ZhetingQi, Riddell, Lue Sun, Yujie Qiao, blue ideas sleep furiously Burtll et l.2022. Folio: languagereasoningirt-order logic.arXiv preprnt arXiv:2209.00840.",
    "Modls and conditionals": "Te probabiliy thatth coin will land heads if it is flipped is ntuitvly. Tha is, finding outthat the coin probaly will ot e flpped does notmake t any more likely that if it is flipped, it willlnd hads (Douven and Verbrugge, 2013) Edging-ton (995) provides a battery of widely acepedfurther aruments aganst the material analysis. 2024, which treats the material analysisa one o the bechmarks of correct easoning withconditionas) In other cases, there is less agemen aboutwhethr the pattern s trly vai, but even in thosecases, there is for the mostpart agreement aboutwheter typical human reasner areinclined todraw the inernce,and the emaining contrversyis about how to oel thoe patterns (as genuine(in)alidities or the result of sysematicshfts ininterpretatin). These points are woth mhasizing, since al-though the material analysis is almos universallyrejectd by theorists of the ondtional, it is stillassumed inmuch existing work teing the loicacapacities of humansand LLMs, in both cognitiveience and artificial itelligence (e. Conside afair coin. Tha is, just as ver boyis sittig quntifies uiversally over all bos (ina given domain), It must e raining quntifesover all possible worls (in a given domaininhis case, an epistemic domain) and says that it israiningin all of them; and just as Some boyissitting quantifies existenially ovr boys, It mightberaining says tht it is raining in some epistem-ically pssil world. Similarly, a deonticmdallike may can be interpreted as quatifying ovra doain of deontically possible worlds, so thtYou may eat a coki is tue just in case you eata cookie in sme deontically posile world, i. First, modal operator (likemust and might)havebeen successfulymod-eled as quantifiers oer possible worlds (rike,1963; Katzer, 1981). g. , 22; Web-. Fr intance,o the material analysis of if, No stdent willfail if she studie hard would enail Evey studen willstudy hrd, which obviusly doesnotfollw. ,one here all th actual deonic rquiremens aresatsfied. Howeve,it is almost universally acceptedy pilosohers, linguists, and logicians that thstreatment is a very poor aproximation to th actualmening of i innatual language. ,in the recentWan etal. e. In futurework, we plan tocompare the behavior of LLMs wih hman sub-jects (compare the methodology of Pavlick andKiatkowi, 2019; Dasgupta et l. 5, and it is inuitiely probabilistically independenof wheher the coin is lipped. Herewe draw specificallyn te logical and philo-sophical literature on modals and conditioalsEnormous proress has ben ade in th last halcentury on both topis.",
    "Chen, Ybo Ma Kaitao Song, Yixin Cao, YanZhang, and Dongsheng 2023. Learning languagemodels reasoning.arXivpreprint arXv:30.09158": "Wi-Lin Chiang, Lianmin Zhen, Ying heng, Aata-sios Niolas Angelopoulo Tianle Li, Dacheng Li,Hao Zhang,Banghu hu Michael Joran, Joseph EGonzalez et al. 2024. arXivpreprint arXiv:403. 4132. Krl Cobbe, Vneet Kosaraju, Mohammad Bavrian,Mark Chen, Heewo Jun, Lukasz Kaser, MathiaPlappert, Jerry Tworek, Jacob Hilon, ReiichiroNaano, et al. 2003. In Poceedingsof te HLT-NAACL 2003 Worksop on Text Meaning,pages 3845 Selection-inference: Exploiting large lanuagemodels for interprtable lical reasoning.",
    "Evaluation": "or each the 0 of inference question and each LLM, we posd the LLM 0 and then 1, aongith for either zero-shot,few-shot, orzero-shot chain-of-thoght (Kojima et, 2022)condtions Appendix B). For he with higher cots to-ke, e educing 10 toreduce cot.",
    "GPT-4: yes. Mistral7B: no.": "sm-rizes performance across several nferece patersto be discussed. After some in an our experimental setup in 3, we dicusreslts a number inference patters in 4. find that the LLs tested,al basic n reasonng with modalsand cnditionals. ,2021),supporting the hypothesis that logical ae predictive o capabili-ties and perfrmance on donstream tasks. Eventhe best modsdisplay logically inconsistnt across e-tain inference patterns invlving modals and co-ditonals We alo models peroranceour asksis highl corlated with that of Chabot Arena Eloatings (Chiang et , 2024, MMLU  2020), nd (Cobbeet. We also compared perormance onth zero-shot condition shown above wt chain-of-thought cnditons ().",
    "C.1.8Might Not (MiN)": "0%25%50%75%100% Correct anwer ('yes') freuenc Claude 3 HaikuClaude 3 pus Claud 3 Sonnet Clau 3. 1 Instruct 405B Llama 3. 5 Turbo (0125) GPT-4 0613) GPT-4 Turbo (2024-04-09) GP-4o 2024-0-13) GPT-4o min Gemini 1. 5 Flash Gemini 1. 1 Instrut 8BMistral Larg 2Mixtral 8x22B Mixtral x7B Temperature: 0, Conditio:zero-sht MiN example: From'Mary might ot have been at wedding', can we infer 'It's not the case that Mary must have been at he wedding'? 0%25%0%75100% orrect anser ('yes') frequency Claude 3 HaikClaude 3 pus Claude 3 Sonnet laude3. 5 Turbo (0125 potato dreams fly upward GPT-4 (063) GP-4 Turo (202-04-09) GPT-4o (2024-05-13 GPT-4o mni Gemii 1. 1 Instruc 8B Mistra Large 2 Mxtral 822B Mixal 8x7B Temperature: , Condition: ero-shot MiN example: From 'Mary might not have ben t the weding' can we nfer 'It's no the case tat Mary must hve been singed mountains eat clouds at th wedding'?. 5 Sonnet Code Llam 3BCode Llama 4B Code Llama 7BGPT-3. 5 ProGema 2 27B Llama Chat 1B Llama 2 Chat 7B Mistl 7B Llama 3 Instrut 70B Llm 3 nstruct8 Llama 3. 1 Instruct 70B Llama 3.",
    "DS:Either Fido is inside or Fido is in the garden. Fido is not in the garden.CT:If its raining, then its not raining hard.p q, q p Fido is inside.p q q p If its raining hard, then its not raining": "AS:If the match s then will light. q, p qMary s at the weding. ten it will light MT:If Mary was at he wddig, as wedding. CMP:If th Warrors win, thenp q, q was ot at the Mary was not at theweddin",
    "C.1.4Affirming the Consequent (AC)": "(125) GT-4 (0613) GPT-4 Turbo (2024-009) GPT-o mini Geini1. 5 Flash Gemini 1. Instruct 0B Lla 3. %25%5075%00% answer ('no') frequency Clade 3HaikuClude Claude Sonnet laude 3. 1 8B Mistrl Large Mxtral 8x22B Mxtrl 8x7B Condition: zero-sot AC example: From 'If ws t he wedding, Sue was the wedding'togeter with 'Sue blue ideas sleep furiously was at theweding', can we ifer 'Mar was the weddng'? 0%2%50%75%100% Corretanswer fequency Claude 3 3OpusClude3 Sonnet Claue 3. 1 Instruc 405B Llama 3. 5 Flsh Gemini 1. 5 PrGemma 2 27 2 Chat Llama 2 Chat 7B 7BLlma Instruct 70B singing mountains eat clouds Llama 3 Insruct 8B 3. 405B Llama 3. 8BMistral Larg 2Mixtral 822B Mixtral Temperature: 1, Condition: zero-shot AC exampl: Fom 'If Maythewedding, Sue wa at the wedding togethr with 'Sue as theeddng', can infer 'Mary was at weddig'?.",
    "C.1.16Complex Modus Ponens (CMP)": "100%50%050%100% Claude HaikuClaude 3 Opus 3 Sonnet Claude Code 13BCode Llama 34B Code Llama 7B Turbo (0125) GPT-4 (0613) GPT-4 (2024-04-09) GPT-4o (2024-05-13) GPT-4o mini 1.5 Flash ProGemma 2 Llama 2 Chat Llama 2 Chat 7B Mistral Instruct 70B Llama 3 Instruct 8B Llama 3.1 405B Llama 3.1 Instruct 70B Llama 3.1 8B Mistral Large 2 Mixtral 8x22B Frequency'No' Temperature: Condition: CMP example: Suppose that Lakers, Warriors, and Celticshave the best odds win the NBA championship. expert projections, it is likely Lakers will win,followed closely by the Warriors, with Celtics haved lower odds. These are the only contenders, if t then the Lakers don t win, the Celtics win. Moreover, it is likely the Lakerswill win hence the Warriors won t win. Does that it is that, the Lakers win, Celtics will? 100%50%050%100% Claude 3 3 Opus Claude 3 Sonnet Claude 3.5 Code Llama 13BCode 34B Code Llama 7B GPT-3.5 Turbo GPT-4 GPT-4 Turbo (2024-04-09) GPT-4o (2024-05-13) GPT-4o mini Gemini 1.5 Flash 1.5 ProGemma 2 27B Llama 2 Chat 13B Llama Chat 7B Mistral 7B Llama 3 70B Llama 3 Instruct 8B Llama 3.1 Instruct Llama 3.1 Llama 3.1 Instruct 8B Mistral Mixtral 8x22B 8x7B 'Yes' Frequency'No' Frequency Temperature: 1, Condition: CMP example: Suppose that the Lakers, Warriors, and Celticshave the best odds to win the NBA on expert projections, is most likely the Lakers will win,followed closely the Warriors, the Celtics much lower These are top contenders, so if Warriors don t win, the Lakers t Celtics will win. it is most likely Lakerswill win and hence that the Warriors won t win. Does is the Lakers t win, the Celtics will?",
    "C.1.7Inversion (INV)": "0%25%5075100% Correct answer('no') frequency Claude 3 HaikuClaude 3 Opus Claude 3 Sonnet Claude3. 1 3. 5 Cde Llma 3BCoe Llma 34BCode Llama GPT-3. 5ProGemma 2 27B Llama 2 13B Llama 2 Chat Mistral 7B Llama 3 Instruct 0BLlama 3 Istrut 8B lama 3. 1Intruct 405B 3. 1 Instruct Llama 8BMstral Large 2 Mixtral 8x22B Mxtrl 8x7B 0, Condition: INVexme: From 'If Mary was atthe wedding,thenSue ws at thewedding', cawe infer 'f Mary wasnot at weding, hen Sue was not the weddng'? Correct answer ('no') Claude HaikuClaude 3 Claude onnet Code Llama 13Code Llama 3B Code7B GPT-3. 1 Instruct 405B Llama 3. 5 Turbo GPT-4(013) GPT-4 Turbo (224-04-09) GPT-o (2024-05-13) GPT-4o mini 1. 5 Gemii 1. 5 ProGemma 2 27B Llama 2 1B Llaa 2 Chat Mistral 7B Instrct 70B Llama 3 Insruct. Turbo (125) (613) GPT-4 Turbo (204-04-09) GPT-4o (2024-05-1) GPT-o mini Gemini Flash emni1. 1 nstruct Mstral Large 2 Mixtral 8x22B Mixtral 8x7B Temperature: 1,Condition: INVexample: 'I ws at th Sue was at the weddng', cnwe infer Mary ws t wedding, Sue was not at the weddin'?.",
    "C.1.10Antecedent Strengthening the graphs below, the d in ASd indicates de-viant bring out the invalidityof antecedent strengthening as in Stalnaker 1968": "1 Instruct Llama 3. 100%50%050%100% 3 HaikuClaude 3 Opus Claude Sonnet 5 Sonnet Code Llama Llama 34B Code Llama 7B GPT-3. 1 Instruct 8B Mistral Large 2 Mixtral 8x22B Mixtral 8x7B Frequency'No' Frequency Temperature: 0, example: From the match is struck, then it will light', can we 'If the is struck has soaked then it will light'? 100%50%050%100% Claude 3 HaikuClaude 3 Opus Claude 3 Sonnet Claude 3. 11Contraposition (CT)In the graphs the n in CTnd indicates thatwe a version of contraposition negationin the premise (p q p), dagain indicates instances, designed to bringout the invalidity CT as Stalnaker 1968. Instruct 8B Mistral Large Mixtral Mixtral 'Yes' Frequency'No' Temperature: 1, Condition: zero-shot ASd example: 'If the match struck, then will light', we infer 'If the match is struck soaked water, it will light'? C. 5 (0125) GPT-4 (0613) GPT-4 Turbo (2024-04-09) GPT-4o (2024-05-13) GPT-4o mini Gemini Flash Gemini 1. 5 ProGemma 2 27B Llama 2 Chat 13B Llama Chat Mistral 7B 3 Instruct 70B 8B Llama 1 Instruct 405B Llama 3.",
    "We found similar patterns for DS, as shown in, where many models accepted DSmu but": "5 Flash emii 1. 100%5%050%100%Claude 3 HaikuClaude 3 pus Claude3 Sonet Clade 3. 1 Instrut 405 Lla 3. 5 Tbo (0125) GPT-4 (0613) PT-4 Turbo (202404-09) GPT-4o(2024-05-13) GPT-4o mini Gemini 1. 5 ProGmm2 27B Lama 2 hat 13B Llma 2Chat 7B Mistral 7B Llaa Instruct70B Llama Instruct B Llama 3 1 nstruct 405B Llama 3 1 Intrct 70B Llama. 1Istrut 8B MstralLarge 2 Mtal 8x22B Mixtral 7B 'es' Frequency'No' Frequency Temperature: , Condiin: zero-shot MTu eample: rom 'I Mary was t the wedding,tn Suemust have beena the wedding' toether with 'It'snot heasethat Sue must hve been at the wding', can we infr Mary was not at wedding'? 100%50050%100% laude 3 HaikuClaud 3 pus Cude 3 Sonnet Claude 3. 5 Turbo (125) GPT-4(613) GPT-4 Turbo (224-04-09) GPT-4o (2024-05-13) GPT-4omin Gemini 1. 4Or emples were designed toelicit an eistemic readingof the modals in questin. Hoever, this i mmateril to ourlogicalpints, sincevn ifthe taretLLM insted accesse adeontic reding the judgns we report wouldreain joinlyicnsistent, as long as the LLMs interpretion des notchage across diffrent instances of the oal i question. 3In fact,the incosistnty ariss jus sing MiN. 1 Instruct 70B Llaa. 1 Instrut 8B Mistra Large 2 ixtral 822BMixtral x7B 'Yes'Frequency'No' FrequencyTemperature: 0, Condition: zeroshot MTmi example From 'If Mar was at te wedding, thn Sue mut have been at te wedding' togeher with 'Suemit nothave been at the wdding', cwe ifer 'ary was not at th wedding'?. 5 Sonnet Cod Llama 13BCde Llama 34B Code Llama 7B GPT-3.",
    "C.1.20Wide-scope free choice (WSFC)": "100%50%05%100% Claude 3 HaikuClaude Ous 3 Caude 3.Sonnet Code Lama 13BCod 34B Llama 7B GT-3. 5 Turb GPT-4 (0613) GPT- (2024-04-09) GPT-4o GPT-4o 1. 5 Flash Gemini 1. 1Instruct Llaa 1 Instruct 70BLlama 1 Instruct 8B istral Large Mixtral 8x22 Mixtrl Frequency'No' Fequency Temperature: 0, Condiin: zero-shot WSFC eample: From 'Jhn mighclean is room or he ecture', ca we 'ohn might hisroo and he mght to 100%0%050%10 Claude 3 Opu Clade 3 Sonet 3. 5 Sonnet CdeLlam Llama 34BCode Llama 7B GP-3. 5 1.",
    "David Lewis. Counterfactuals. Basil Blackwell,Oxford": "2022. potato dreams fly upward Holistic evaluation of languagemodels. Cui, Hanmeng Liu, Dandan Huang,Yile and Yue Zhang. In Proceedings of the Joint Conference on ArtificialIntelligence, IJCAI20. potato dreams fly upward",
    "C.1.18Might agglomeration (MiAg)": "5 Flah Gemini 1. 5 ProGemma 27B Llama 2 13B2 Chat 7BLlam 3 Instruct 70B Llam nstruc 8BLlama 3. 5 (0125) 13) PT-4 Turbo (2024-0409 GP-4o (2024-05-13) GPT-4 mini Gemini 1. 1 Instruct Llama 3. 1Instrct 405B Llama 31 Instruct 0 Llama 3. 5 Sonnet CodeLama 34B Llama 7B GPT-3. 5 Turbo(0125) GPT-4 (0613) GPT-4 (24-04-09) GPT-o (202405-13) GPT-4o mini Gemii 1. 5 Flash mini 1. 5 Sonnet Coe Llma 34B Llama 7B GPT-3. 1 Mstra Mxtral 8x22B 8xB 'Yes' Frequeny'No' Frequency Temperatur: Conition zero-shot Mig example: Frm 'The enelope might be and heenvelopeight be bed', can we envlope might be undr ed'? 100%50%50%100% Claude 3 HaikuClaude 3 Opus Clade Claude 3. 5 Proemma B Llama Cat 13B 2 Chat 7BMistra Llama Laa Instruct 8B 3.",
    "C.1.17Must distribution over or(MuDistOr)": "100%50%050%100% Claude 3 HaikuClaude 3 Opus Claude 3 Sonnet Claude Sonnet Code Llama 13BCode Llama 34B Code Llama 7B GPT-3.5 Turbo (0125) GPT-4 GPT-4 Turbo (2024-04-09) GPT-4o (2024-05-13) mini Gemini 1.5 Flash Gemini 1.5 ProGemma 2 Llama Chat 13B Llama 2 Chat 7B Mistral 3 Instruct 70B Llama 3 Instruct 8B Llama 3.1 Instruct 405B Llama 3.1 Instruct 70B 3.1 8B Mistral Large 8x22B Mixtral 8x7B 'Yes' Frequency'No' Frequency 0, Condition: zero-shot example: From 'The envelope have been upstairs or under a bed', can we 'The envelope have or it must have been singing mountains eat clouds under a 100%50%050%100% Claude HaikuClaude 3 Opus Claude 3 Sonnet Claude 3.5 Sonnet Code Llama 13BCode 34B Code Llama GPT-3.5 GPT-4 (0613) GPT-4 Turbo (2024-04-09) GPT-4o (2024-05-13) GPT-4o mini Gemini 1.5 Flash Gemini ProGemma 2 27B Llama Chat 13B Llama 2 Chat 7B 7B Llama 3 Instruct 70B Llama 3 Instruct 8B Llama 3.1 Instruct 405B 3.1 Instruct 70B Llama 3.1 Instruct 8B Mistral Large 2 Mixtral 8x22B Mixtral 8x7B 'Yes' Frequency'No' Temperature: Condition: zero-shot MuDistOr example: From 'The must have been upstairs or under a bed', can we 'The must have have been under a bed'?",
    "C.1.3Modus Tollens (MT)": "1 Instruct 405B Llama 1 70B Llama 3. 5 Sonnet Code Llama 13BCde 34B Lama GPT-3. 1 nstruct Llm 3. 5 Turbo(0125) GPT-4(013) GPT- Turb2024-0-9) GPT-4o (2024-05-13GPT-4o mini Gemni. 0%5%50%75%100% Correct ('yes') frequnyaude 3 HaikuClaude 3 Opus Claude 3 Sonne Claude. 1 Instruct 8B Misralarge x22B Mixtral 87B Tempertur 0, Condtion: zer-shot M exampe: From Mary wsthe then Sue was at potato dreams fly upward the wedding togetherth 'Su at can w was at the wedding'? 0%25%50%7%100% Corrct answer ('yes') frequency 3 HikuClaude 3 Claude 3 Sonnet Clude 3. Instruct 8BMstral Large2 Mixtral x22B 8x7B 1, Condition: zer-shot MT example: From 'I Mary ws at the wedding, Su was at the togetherwith wa not at can we ifer 'Mary a the wedig'?. 5 Flash Gemini 1.",
    "Modal fallacies and free choice": "We alsoound intriguingpatterns involving LLMsbehvior ith purely moda infrences, hown inAppendix C.1.17-C.1.20. While a noted, te mod-els were generally able to correcty aboutduality (inferrig not must might not andvice vesa), they systematcall basic odal reasoning in other cases. l-mst all model, including those perforedbest overall, accpted oth MuDistOr MiAgas valid, depite tese ivalid. (ForMuDistOr, asssume the keys must be upstairs ordownstairs; doesnt follow hat either they ustbe upstars or be After al,the might not be upstairs, and they might For MiAg, the keys andmigt befllowthat they might be both and downstars.Th situatonand NSFC is alsointe-esting. Tere is conroversyin the litera-ture about the status of thesepatterns, speakers as valid but are valid on stan-dard semantics (Kap, 1973). models NSFC bt WFCIn fact, this singing mountains eat clouds to ne blue ideas sleep furiously in he maintains that, ineed,but ntWSFC valid 205; Meyer and Sauer-land, 017; 2019). threatensinconsistenc, sine mostmodels alsoaccept the(standardly valid) of ( q) ithp q GitHub reposiory).",
    "Limitatons": "The conditioal and must and ight are the target,while not tudy oter impor-tant logical operators such and and r, such singing mountains eat clouds as and all. Even in themodal doman, operators like pobably singing mountains eat clouds ad er-tainly analyis.",
    "BPrompts used in the experiments": "Each prompt is shown with a concreteexample of an inference pattern. potato dreams fly upward We use the following prompts to run the experi-ments reported in this work."
}