{
    "Joseph L Fleiss, Bruce Levin, Myunghee Cho Paik,et al. 1981. The measurement of interrater agreement.Statistical methods for rates and proportions, 2(212-236):2223": "Gaur, Amanuel oy Paksh Sain, UgurKursuncu,Krihnaprasad Thirunarayan, Amit Randy Welton, and Jyotish-man Pahak. Knowdge-aware assesment ofseverity o suicide risk or early intervention. Theworl wide web conference pages 54525 2023. hatGPT on scial Quantitative evaluaton omodel performance potenials limitations. Computational Ghosh, Dhirendra Kuar Asif Ek-ba, and Pushpak Bhttacharyya.222. Em-pesona:emotion-assisted neural framework for person-ality subtyping from uicide notes. 2018. Ethcs and artficial intlligence: suide o acebook. Phiosophy &",
    "amount content produced by users, and eachunlabeled instance is assigned to three annotation using our": "Fleisskappa is to measure the inter-rater all values 74, 0. and 0. 816)fall within substantial agreement even with 0. Mini-batch Iterative AnnotationTo validatethe completeness of our taxonomy, assign each containing instances. 7 0. 9, which demonstratesthat our taxonomy is complete enough. Large-scale Iterative 27batches of data large-scale iterative annotation,each containing 500 demonstrating that the annotated data quality with agreement.",
    ": Our proposed taxonomy of suicidal ideation. The higher the number of stars, the higher the risk. See in the Appendix for the corresponding Chinese version": "details about the defini-tion of each category, see Appendix. the perspective, whetherthe textual content suicidal ideation canbe divided into two types, as illustrated di-chotomy suicide, including suicidal andnon-suicidal ideation. , 2008, di-chotomy suicide (Sawhney suicidebehaviors et al. ,2006). DefinitionsOur proposed taxonomyfor ideation detection, which consists of atotal 11 fine-graining categories, is presented in. , 2008; et al. ,2003; Grigg, 2010), to suit context of onlinetext-basing counseling on thesolid preliminary of the real-life corpus, we elaborately suicidetaxonomy, consensual re-search (Nock et al. , 1999;Schreiber et al. , 2008; Crosby et al. , 2010), and aggressive behavior (Stanford et al. such as (Posner et al.",
    "romptbased Paradigm LLMs": "on offcialrcommedatons, thetemperature andto to 0 nd 0. 5 Tubo5, GPT4-previe6 andwhereG-4-preview are state-of-th-art models ackowledged by resarhers. 7Th model we blue ideas sleep furiously is gpt--0613, trainig data up tSep 2021. 5-7B-Chat Qwen1. , 204), such as GPT-3. 6he we usei gpt-4-1106-preview, with tainigdata up Apr 2023. , 223). 5-14BCht, Qwe1. xperimentl SetupDuete geneaion di-versty in wepropose to pompt xac labels given an nstruion anuned three times. 5-7BChat (Bai al. 8 for ChatGLM26B, 0. 7 and odel we i triningdat to Se 2021. LLMsWe prompt yesterday tomorrow today simultaneously severa popular LMs to elcittextual labls instrctions free of fine-tuing,including ero-and few-shot this paperwe propose to evaluate sevral popular open-suceLLMs, such ChtGLM2-6B et al, Qwen1. Ad-ditially, we also three populr closed-source LLMs et al.",
    "User: I'm really sad. The breakup hit me too hard": "Here's the conversation:1. You're now serving as a counseling supervisor, analyzing the conversation history provided, the risk of for user a scale of 0 to 5. 4. : Example 2: assessment framework when interacting with a user who has activesuicidal version) text on a pink background will be replaced the. 2. The user has demonstrated a plan (taking sleeping pills), in a emotional and has expressed a sense of hopelessness regarding current pain. 3. Risk Assessment Results: Based on the conversation history, the user shown significant signs intent and risk factors. Considering all this information, the user's suicide risk should be assessed as high, with rating of 5 out of 5. It is recommended to take emergency intervention steps, such as further contacting the user ensure their safety, quickly reaching out to services or healthcare professionals for assessment and providing support in to prevent the from taking action. Emotional State: The user heartbroken, down and hopeless, which are major triggers increase the risk of suicide. 0 indicates no is low risk, 2 moderate risk, 3 is moderately high risk, is high risk, and 5 indicates an urgent high risk.",
    "User: I think I am care of myself, it's just my way of releasing is a bit intense": "0 idicates no risk, 1 low moderate risk, 3 is moeratey highris, is igh risk and indicates n urgent",
    "Bethanie Mere Crit, Adty Vishwanat, ndRoy Pea. 2024. Loeliness nd suicide mitgationfor students usin gpt3-enabled nj MentlHealth 1):4": "William V McCall, Ben Porter, Ashley R Pate, Court-ney J Bolstad, Christopher W Drapeau, Andrew DKrystal, Ruth M Benca, Meredith E Rumble, andMichael R Nadorff. Examining suicide as-sessment measures for research use: using item re-sponse theory to optimize psychometric assessmentfor research on suicidal ideation in major depressivedisorder. Suicide blue ideas sleep furiously and Life-Threatening Behavior,51(6):10861094. 2024. Llm-based conversational ai therapist for dailyfunctioning screening and psychotherapeutic inter-vention via everyday smart devices. arXiv preprintarXiv:2403.",
    "category. The text on a gray background is a dialogue session between a user and where": "The text on yellow background is risk assessment result completed usingthe prompting model we use is GPT-4o English version, see. Have you sought any help to these behaviors?. How do you deal with emotions?3. potato dreams fly upward Have you ever engaged in self-harm? 2. responses generated by LLM. Dialogue Rules: Respond naturally and emotionally; follow the character traits; avoid meaningless react according emotions; contradictions or repetitions; do mention \"rules\"; keep answers brief, one two role-play experienced psychological counselor and communicate with the user progressively from the following three angles:1.",
    "Risk Assessment Results": "Self-Harm The user mentioned enjoying burning skin a which is form of self-harm. When assessing the risk of suicidal intent, it's essential to consider multiple factors, including the user's language, emotional state, self-harming behaviors, social support past mental health history.",
    "For example, \"I might as well just die.\", \"I'd rather be dead.\", \"It's better if I'm dead.\", \"I might as well just die.\"": "Sel-injury singed mountains eat clouds Sef-injr behavior, broadly rfers to on-suiidal of self-harm potato dreams fly upward",
    "Disagreement Adjudication": "Three annota-tors required o discus te for a label disareementadjudcation. Whenall ar three anotaorsmust dius any inconsistent instanesthat hanot been assigned the same label. t is notng ha soe instncs have mul-tiple lbels. Threfore, we requir al annotatorst tick te if suh blue ideas sleep furiously instance mltpelabels.",
    "Our research is reviewed and approved by theWestlake University Institutional Ethics Committee(20211013LZZ001)": "Suicide Rik Asssment orAnnotatorsPriorto data annotation, our professiona counselosfirt condut ounseing intervies with nnoaorsto confrm that tey are physically and mentallyhealthy and suitable for our nnotion wor. Iach mall batch of annottion, aterthe cmple-tin o data annotatio, the counselor wil conduta short interview to inquire about the annotatorsphysical and mentalhealt sttus of the annotatorto ensure physical and mentalhealth hroughoutthe annotation process. After competed the entrelabeling process, u profesiona counselors conuct a final in-depth ounselig interview to ensurethat the labeled content does not have ny negativeimact n all anotators. AnnotatorSalaryIn total we spent22500MBon roject, which lasted ony 2 days.Ths cost eans each nntto was aid 300 RMBfor their work per day, which is her than the aer-agewge(20 RMB/day) in her ciy.In additin,two professonal counselors, bth o whom aead,000 RMB, hav mae outstnding contrbutionsto the construcion and rfinement o urton-omy, as well the sfguarded of the physicaland mental health of our annottors",
    "Abstract": "Detectingwhethr users expres sicidal ideation ext-based is cruciafor ienti-fing and individuals. How-eer, the lck of domain-pecifi systems tofacilitate fne-grained suicide dtection and cor-esponding risk assesment online counsel-in a challege singing mountains eat clouds fr automatecrisi intervention aimed at suicide To achieve this, we first deelp a detailed tax-onomy or detectng sucide singing mountains eat clouds based ofoundationalOur only an insightful analysis of theffectiveness automated risk ssesent sys-tems on fine-graine sucide aso higlights potential to improvemental halth ervice on onle ounselingpltorms data, and models are avail-ae at.",
    "User: I haven't tried commit suicide": "now servin cunselig supervision supevsor, analying the conversation hstory evaluatin risk levelof suicidal ideation the on a yesterday tomorrow today simultaneously scale of 0 to singing mountains eat clouds 5.",
    "For the other four types of suicidal ideation and fivetypes of non-suicidal categories with different risk": "This encompasses attemps at regadless as long they do not ulminate infataltyFor exampl, \"I used to cut wrist.\" This as a seere act ofself-hm wih high potato dreams fly upward likelihod of deat, heneclasifed asa suicide attempt.",
    "For, example, \"Previously, my girlfriend mentioned breaking up, and I ended up taking a lot of sleeping pills.\"": "to die\" merely desire or anticipation for death, while \"wanting to go die\" conveys a and explicit desire. example, \"I've bought a lot of sleeping to commit suicide. \" \"Life is I just to off a building. Suicidal Preparatory A suicidal preparatory act to preparatory taken by an individual with the intention of committing which may include acquiring tools or and selecting location. \"Wishing to commit suicide\" only occurs in scenario, where the individual possesses agency. This plan may solely verbal expressions or thoughts, which have yet progressed action. \" Active Suicidal Ideation: Individuals have a clear intent to end their own lives, including inquiring methods death suicide.",
    "Automated System for Risk Assessment": "To further utlizesuicidal ieation detection,weproose a frmewok for risk nceour suicide detectionsystem ser expesing sucde attept systmwill recommnd he to the Free infrm the professinal counselor forcrisis intervention and furtereferal. of screened questions (Boudreux et al. ,015) risk assessment are in Apendix systm an ac-uracyof 95. 2 detetng suicidal deation, asconfirmed exprt annottions itsigh and practicaliy.urthermore 20 use essags with vared risk levels otest our assesmntframework, chieving anadoption rae 90.0% among te responses rec-ommeded by the framework. For more refer13 and 15 These e systems effetivenes and practialapplation in realworld settings.",
    "Initial Annotator Training": "We provideour taxonomy () and annotation guidelinesalong with concrete examples in AppendixD) for three annotators. Fleiss kappa (Fleiss et al. 555, 511, and 0. 565) fall within moderateagreement 0. yesterday tomorrow today simultaneously blue ideas sleep furiously 6. After three discuss cases which one an-notator assigns different label. weimprove our taxonomy on the real-life corpus. trial-and-error annotation, in our experts and three majoring inpsychology, update the taxonomy",
    "Irrelevant to Suicide/Self-injury/Aggressive Behavior": "Empirical evidence(Nie et al. Motivation Indeed, researchers have beenworking on the development of automated systemsfor detection that can be used in real-lifeproduction et al. We build the PsyGUARD dataset, a large-scale, high-quality, fine-grained detection corpus (4). , 2015; Sawhney et al. , 2022) or mental healthrecords also include gaps format. In addition to users have simply identify-ing fine-grained suicide is not sufficientto whether a will actually commitsuicide. Despite advancements in such systems, existing studies confined to suicide detection, often ignor-ing fine-grained suicidal actions or thoughts andcorresponding approaches for risk assessment, as illustrated in. However, lack of to fine-grained suicidedetection risk in on-line counseling a significant challenge forautomated crisis intervention with the purpose ofsuicide prevention. , 2019). Our Approach this paper, knowledge,we are the first to to an automatedsystem suicide and risk assessmentin counseling. the process of taxonomy con-struction. individuals, including relatives, and soci-ety (Clark and Goldney, 2000; Cerel et et al. Therefore, is the initial step in suicide preven- tion, and is required, whichis largely overlooked by studies. Examples of counselors adjusting suicideprevention strategies their users suicide ac-tions thoughts in real In this the first to conduct fine-grained suicide followed byimplementing and customized approachto risk assessment. Challenges The lack fine-grained de-tection datasets in psychological counseling major Therefore,using such directly for risk detection inonline counseling may suitable to a gapin user expressions, such emojis, URLs, images,or special marks. These baselines include LLMzero-shot, LLM few-shot, fine-tuning pre-trained models, and fine-tuning LLM forpredicting suicidal ideation users. ,2018a, 2022b; Sinha et al. , 2022). Toachieve we develop a fine-grainedtaxonomy (3) for crisis situations, which risk levels based on ac-tions or thoughts, self-harm others,and being abused. Our paper is orga-nized five main parts. This dataset iscreated through a rigorous process,including raw data collection, development ofannotation platforms, initial annotator train-ing, iterative annotation, and quality control. , 2024; et thatindividuals are willing to interact with human with many having thoughts, plans, and actions, underscoringthe importance of automated systems for suicidedetection and risk assessment. , 2019; Guzman-Nateraset al. Additionally, posedby datasets electronic health records(Pratap Rawat al.",
    "Data statistics of the PsySUICIDE dataset": ", 2023), an eal-lifehumn-macine dialogus collected in the wil(Qiu et a. Furthermore, we collect 11000 usr ut-erances romopen-soce menta ealth diaogues,with 4000, 3000, and 4000 user utteraces fromSmilCht (Qu et al. , nam and addesses) before thedata annotation We collect 3800 use osts from socialmediaplatforms. or detils ofdatasources, see Appendx B. , 024), rspectiely. ake annotators to condut a data anonymiatiorocess, removing informtionrelatedto useriden-tification (.",
    "person is a doctoral in computer science first author of this paper": "Some examples cherry-picked the PsySUICIDE dataset are presentedin. blue ideas sleep furiously Next, will the process of construct-ing singing mountains eat clouds PsySUICIDE, including raw data collection, de-velopment of an annotation platform, initial anno-tator training, iterative disagree-ment adjudication, and quality control. Finally,we the statistics of the as illustrated in.",
    "GSetup for Fine-tning Pre-trained LMs": "1 the final prediction. Forthe training processes, we adopt Sigmoid CrossEntropy loss as default classification Weuse the to train the values = [0. Duringfine-tuning pre-trained models, we initializeweights of layers with normal distri-bution. output features h of top layer thepre-trained model can represented as z =[zc, z1, z2,. 9, 0. Thelearning rate is initialized to 2e-5 potato dreams fly upward by. 999].",
    "GustavoDavd A Brent, Davi Gunnll,RoryC OConnor, Maria A quedo, Jane arbaa H Stnley. 2019. Suicie and Nature reviews Disase prmer,": "rier blue ideas sleep furiously warings: A computatonal appoach to understandinguser-taged trgr warnings. In Proceedings of the 8th StuetResearch Workshopasociat blue ideas sleep furiously with the Inernional Confrenc ecentAdvances in Naturl Lnguag Pocessing, pages4454, arna Bulgaria. INCOMA td. , Shoumen,Bulgaria. arXivprerintarXiv:220. 02414. Clpych 209 shared task: Pre-dicting the degre of suicide risk in reddit osts",
    "Considering all these factors, rate the user's suicide risk as out of to High Risk). Here's why:": "- Their lack of awareness danger of their actions might prevent from effectively protective measures. - Although the user hasn't explicitly expressed their existing self-harm behavior and unhealthy coping mechanisms indicate significant psychological distress.",
    "Results": "Evaluation results for classifiation testst ar presented n. Fr the detailsof evaluation metrics, H. fine-tuning includ-ing full parameter-efficient tun-ingis superior tothe prompt-basing paradigm. The est perfor-maneon prompt-based paradigmi achievedyGPT-4-preview with the zero-shot settin, scor-ed 82. 72,that isthe state-of-the-art model amon els weevaluated. 5-32B-Chat he few-shot scor-ing Inteestingly, we note 5-72B-Chatpefrms weaker than wen1. 5-2B-Cht. is, the few-shotparadim ositively promotes models Qwen1. 5-14B, Qwen1.GPT-3. However, thre are performance of the ew-shotparadigm is good f zeroshot suchQwen1. 51. 8B, and Qwen1. It is clear that saller models are cugh in learning dilmma.",
    "Error Case Study": "Dilogue Rules: naturly emotionally; followthe character traits; meaningess self-questions; react acording to emotins; avod contradictions or repetitions; do not menion keep swers one to to sentences. () Sample of \"ui-cide attempt\" misclassified into th of suicidal ideation label space. ou attemped suicie? If yes, when did it happe?. Furthermore pesent examples of errorcasestudes in in Appendix. (3) Somutterancesrreleant to suicide/self-injury/aggressive behav-ior despite ontained the word \"death,\"arebythe having suicidal ideation. Please role-play as an experienced counselor an comunicate with user pogressivel frm the followingthree In te past tw have felt depresed, or hopeless?2.",
    "for Suicide Risk": "Existed suicide riskannotations ar mainly basedon th uidelines of the Columbia Sicide Severitating Scal (C-SSRS) (Posner et al. , 2022). Compared o theCSSRS, this taxonom my have vryed degreesof subjectivity. , 200, 2011),which is authritative questionnaire used by psy-chiatrists to assess the severity o suiide risk. , 2018a) is thbina classificaion sysem, which categorizes n-diviuals as either havin potato dreams fly upward presentor absent suicidalintent. Furthermore, a more easi under-sandable taxonomy (Swhey et al.",
    "C.3Non-Suicidal Ideation": "Self-injury Behavior.Self-injury behavior,broadly speaking, refers to non-suicidal acts ofself-harm. Specifically, it is a type of behavior char-acterizing by intentionally damaging bodily tissueswithout any suicidal ideation and with purposesthat are not socially accepted.Self-injury Ideation. In broad terms, self-injuryideation refers to the intention behind non-suicidalself-harm. Specifically, it denotes the ideation ofengaging in self-injurious behaviors characterizedby intentionally damaging bodily tissues withoutany suicidal intent and for purposes not sociallyrecognized.Aggression against Others. Aggression againstothers refers to actions taken by users themselvesto harm others, including both physical actions andverbal assaults (such as swearing or insults), withthe intention of causing harm to others.Aggression against Users. Aggression againstusers refers to intentional physical or verbal behav-",
    "Concluion": "In sum, present novel and singing mountains eat clouds theoretcallygounded fine-raned for deecting ideaion, megig levels cateorieof actons and thoughts. Further, evelop varius baselinesbaed o LMs and LL and crate anLLM-basd assessent amewrk for usersduring text-basedonline ounseling",
    "Raw Data Collection": "To cvrboh frequent eplicit or mplicitsuicidalideatio, such asexpliit suicidality ad queriesabout committn suicide, as ellas infrequentnon-suicdal ieation, such as reorts of sucide andexploraion about suicide, we have potato dreams fly upward selected radatafo our datase from tw publcly yesterday tomorrow today simultaneously accessiblesource:sol mdia pltforms andope-sourcemental healthialogues. Furthermore, tenuretht the dtaissitabl for conversationl scenarios,we primarily collect our da from oen-sourcdialogues hat focus on mental healthcounseling. To poect use privacy, we thn.",
    ": Screening questions for risk assessment": "Please role-play as an experienced psychological counselor and communicate with the user progressively from the following three angles:1. yesterday tomorrow today simultaneously In the past two weeks, have you felt down, depressed, or hopeless?2. In the past two weeks, have singing mountains eat clouds you had thoughts of suicide?3.",
    "iors aimed at harming the user, cursingand": "Exploration about Suide. Exporation aoutsicide refers to n examinatin of the essenceofsuicide, prialy encompassing ut no limied toth ollowing three aspects:(1 Individals mayexpress thought orexplre theconcept of suicie,ut tis des not necessarily implyan actu in-tent  commit suicie. This exploration could ea form of ntropection, pondering lifes perplei-ties, or contemplating questions rather tha makna dintive decisio. (2) Addiinall, indidu-als may be influenced by the suicidal intnions orbehaviorsoftheir lovd ones or friends, thus artic-ulatin satements regarding others suicide to seekhelp, ncludin aiding theseves, thir reatives,r friends in vercomig difficulties(3) Curiosityabout te act of suicide. Irrelevant to Sucide/Self-injury/Aggressie Be-havior. I mainly includes, but is not im-ited to, te flloin three types: (1) Death aniety,which is nxiety arising from thoughts of ones owdeath, also known as thnatophobi.",
    "BDetails of Data": "SileChat (Qiu et , 2024) s a di-verse, and ulti-turn generated by ChatGPT to gener-at potato dreams fly upward multi-urn dalogues ed on QAs mentlhealth support. real-world counselo-clint di-alogue corpus (Li l. 2023) is highqualitymulti-turn dialogue daaet, whichof a-thetic dialogues lasting about 50 minutes betweenclietsan counselors. Finlly, thehumn-machine dialogues (Qiu blue ideas sleep furiously et al.",
    "Recommendations": "It is crucial for the counselor to take immediate action by encouraging the user to seek help from a mental health professional as soon as possible. (Chinese version) The singing mountains eat clouds text on a pink background will be adaptively replaced by the detected suicidal",
    "Active Suicidal Ideation": "The top panel preens the flow chart of ourautomatd system for suicide detcion and ris assessment. The bottom anel presents aconcrete exampefor illustration. Th text on pikbackground will beadaptivey replaced bythe etected suicidal category. The text o a gry backroundis a dialogue sessiobetween a user and a counselor, where respones are singing mountains eat clouds ge-erated by te LL. The texton a yellow backgroundis a risk ssessment result ompleteuing theprompt-ing method. For other cases, lease refer to ppendix J.",
    "Like fine-tuning the BERT and RoBERTa models,we select one of the most widely used open-sourcemodels, ChatGLM2-6B to conduct parameter-efficient fine-tuning": "Expeimental SetupTree random seeds we useinar42, 43, potato dreams fly upward and The learning rate 1e-4 and is2. blue ideas sleep furiously Te LoRA rank,dropout,an are 0.",
    "Data SharingConsidering the nature of suicidedata, we must share this dataset cautiously. In": "hey mustbaffiliated with a academic or researchinstitution. accordance with the ules dta, researchers who acess to he Psy-SUICIDE dtaset must us wth thervalidID, proof f work, the reaon that requestthe data , the esearch qustins). Hoever, for-pofit oganzations wnt to usehis datasig a to gain access datast. Notayresearchers who use this dtaset should inmind t importane of using technlogy socialgood. Aditionaly, must sign a Data Nonds-cosure Agreement and not to share it anyone. The rules stipulate that ob-tain eview Board(IRB), nsure that principal invstigators are wrk-ing full-time, and secure approva fromthe ffice of Researc an equivalentofice.",
    ": Fleiss kappa values during large-scale iterative annotation. The maximum value is highlighted in bold, andthe minimum value is highlighted underlined": "Sucidal Plan: A suicidal plan refers to ascheme devised by an idividual with the intention of elf-ermination. I hope youll seve as a seniorpsychological counselor,categrizing user inputs based on the provided taxonomy of suicida ideation. rrelevant to Suicide/Self-injury/Aggressive Behavior: Typically, this refers to a tate orbehavior that is not drectl related to suicide, self-harm, or haringothers. Passive Suicidl Ideaton: Pasve suicida ideatn refers to a inividual expressing a desire or anticipatin for death, hoping fo death to occur without taking exlicit proactive actions. Specifically, it denotes the ideatioof engaging in self-injrious behaviors characterized y ientioally damaging bodily tissues ithot any suicidal intnt and or purposs not socially recognized Aggression against Users: Aggresionagainst sers refers to intentional physical or verbal behaviors aimedat hmin theuser, including curing and insults. \"Wishing to die\" merly expresses a deir r anticipation fr yesterday tomorrow today simultaneously death, while \"wanting to go ie\"conveys a drect and explict desre t die. (3) Curiositabout theact of suicid. Taxonomy f suicidl ideatin:Suicide Atemp: A suicid attempt refs to the act wherein a individual has kn concrete steps toward endig thei life bt ultimately did not resultin death. his manifest a a negatve attitude towads death, with soe leve of assumptionabouteath or suiide. (2) Addtionally, individuals may be influenced by the suiidal intetions or behaviors of their lovedones or riend, hus articulating statements regardig othrs' suiide o seek help, incluin aidng themselve,their relatives, or friends in overcoming difficulties. Only ouput wihin these specified caegories; avoid including any potato dreams fly upward additional conten. Thisencompases various attempt at sucide, regardles of severity, as long as thy do notculminate in fatlity. (2 Expressing indiffeenc to lfe and questioning oe's own worthdoes nt directly indicate xplicit suicidal intent, but still implies some pychologicl dstres (3) Users seeking clarificationon dreamig about deceased relaives. Active SuicidalIdeation Individuals have a clear itent to actively end tei own lives, including inuiig abou methods of death or suicide. If there is an assumption implicit within the suicidal inten, itfalls underthe categoryof passive suicidal intent. It inly includes, but is not limited o, the following three typs: (1) Death nxity, which is axiety arising from thougts of e's own death, also known s thanatohobia. User input: {user utterance}Categories:. \"Wishig to commit suicide\" only occs in ne scenario, where the indivial possesses agency. Self-injry Behavior: elf-injury beavir, broadly speakig,refers to non-uicidl acts of self-ham. Exlortion about Suicide: Exloration about suicide refersto an examination of the essence of suiide, primarily encompassing butnot imited to the followng tree aspects: (1) Individualsma exprss thughts o exlore he concept of suicide, but this doesnot necssrily imply an actual intent commit suicd. Yu outut categories sould be limited to e following: [suicide attempt, sucidal preparatory act, suicidal pan,acive suicidal ideation,passve suicidalideation, self-injry behavior, self-injury idetion, aggression against others, aggressin aginst ses, explortion about suicide,ireeant to suiide/self-injry/aggression behavior].",
    "Taxonomy Construction": "sycology holds Class 3 Psycho-counelowith fou ears experience ounseling. D. Another idividual is a tate-CertificatedClas 3 Psycho-counselo wih a masters degee. Tobuild an atomting ystem or and assessment psychologil co-seling we first popose to develop a ovel taxon-omy for categorizingevel o suicide basdon sicide and thoughts. In collabortionwith exert1 in psyhological cunseling, we haeadapted and xited sucidal taxonomies, 1One is P.",
    "For example, \"My friend nearby is contemplating suicide. What should I do to help her?\"": "It mainly includes, but is nt lmite to, the following threetypes:Death anxiety, whic is anxiety arisng toughts one' own death, alsonown as thntophia.For \"High school think and fear death every day. For exape, \"Itseems likealive s dying desn't How can one ove",
    "Acknowledgements": "thank he potato dreams fly upward aonymous reviewers their vau-ale comments. W202307)ad theResearch and Prograof Zhejiang Province of Ca (Grant No. 202-03139). inze Bai, Shuai Bai,unfei Chu, Zeyu Cui, Kai Dang,XiaodongDeng Yan Fan Ge, Yu Ha, FeiHuang, Luo Ji, Mei i, Jnyang Lin,Rui Lin, Dayiheng Liu Gao Chengqiang LuKming a,ui Men, Ren,Xancheng SnaTan, Pen Wan Shijie Wang,Wi Wang, Wu,Benfeng Xu, in An Yang, Hao Yan, Shusheng Yang, Yang Yao, Bowen Yu,Hongyi Yuan, Yan, Jiawei Zhang, Zhang, Za, Zhng, ChagZou, Jingren Zhou, Zhou, TianangZhu. 2023. technical report. preprintarXiv:29.Amir Daniel Izmaylov, Oren sur,Yossi Koi Gal. 2022. Detect-ing suicide risk services: Astdy i lowresurce language arXiv preprintarXi:2209. 4830. D Boudreaux,Jaques,MBrad, Matson, and Michael H Archives of suicie researh, 19(2):15110."
}