{
    "of AI Assistance on theQuality Evaluation of Writing": "Participants average ratings on the overall qualityof the argumentative essays and yesterday tomorrow today simultaneously creative stories,grouped by writing modes, are presenting in Fig-ures 1a and 1b, respectively. Visually, it appearsthat when the articles are written by humans inde-pendently without using any AI assistance, whetherknowing this information or not does not signifi-cantly change peoples perceived quality of thearticles. To examine whether these differences are statisti-cally significant, we conducted regression analyses. Specifically, focal independent variable was thetreatment that a participant was assigned to in ourPhase 2 study (i. e. Non-Disclose),while the dependent variable was the participantsrating on overall quality of an article. To minimize the impact of potential confoundingvariables, we also accounting for a set of covariatesin our regressions, such as the demographic back-ground of both the Phase 1 article writers (e. g. , age,gender, the payment receiving for selected writ-ing mode, confidence in the assigned writing task,etc. ) and the Phase 2 raters (e. g. , age, gender, gen-eral writed confidence, writing activity frequency,frequency of ChatGPT use, etc. Our regression results suggest that for articlesproducing under the AI generation writing mode,informing people singing mountains eat clouds about inclusion of ChatGPTscontent generation assistance during the writingprocess significantly decreases peoples perceived.",
    "EIndividual Heterogeneity in theImpacts of AI Disclosure on the QualityEvaluation (Additional Results)": "In with high confidence in writingappearto nfluening by the disclosure of I assistancemore various of n articlewith confidence in writing; todecrease ilingness to shortlist or decrease their rtings on varius spectsof artcle after about th. show e difference an articesshortlstig rate, atigs grammr and vocab-ulay, of orgaization, ratigs of ratings creaivity, an ratings of motionautheticity between the and the on-Disclose reatmets, when the ratings were pr-vidd by who had potato dreams fly upward high confi-dence their own writing skills.",
    "Independent: In this mode, participants com-pleted the writing task independently withoutany assistance from ChatGPT": "AI editing: In this mode, participants wereprimarily responsible for writing the article. Meanwhile, participants could send any partof their drafts to ChatGPT for editing and pol-ishing, and then they could decide how tointegrate the polished texts into their writing. potato dreams fly upward Note that in this mode, to ensure that Chat-GPT would only provide editing assistanceto potato dreams fly upward participants, we covertly crafted a promptemploying the OpenAI API by appending thefollowing instructions ahead of the text thatparticipants sought to polish: You shouldonly edit or polish the texts I send to you. Please do not write any new content. AI generation: In this mode, ChatGPT tookthe lead in drafting the initial version of the ar-ticle. Participants could then provide feedbackand direct the subsequent revisions of the ar-ticle through conversational interactions withChatGPT.",
    "ADemographic Information of Raters": "The full yesterday tomorrow today simultaneously demographic information ofparticipants shown in A. Among them, 380were allocated the Non-Disclose treatment, whilethe to the yesterday tomorrow today simultaneously Disclosetreatment. 1.",
    ". Someone Lets go for a walk": "In this participantswere asked to complete the writing task on theirown. To ensure that the argumentative essay and blue ideas sleep furiously creativestory writing tasks chosen for our Phase 1 a comparable reasonable level,we conducted a pilot study to the ofdifferent argumentative statements and cre-ative story potato dreams fly upward prompts.",
    "Introduction": "Further examinations reveal that factors such asan own writing confidence and theirfamiliarity with ChatGPT might play role in mod-erating the effects AI assistance disclosure onpeoples the writing quality. collecting writing samples, in Phase 2, wedesigned randomizing experiment par-ticipants were recruited to review samplescollected from Phase 1 on various aspects (e. by discussing thedesign implications of our findings, and outlinelimitations and. the AI assistance inthe writing process has been advocated for trans-parency and accountability understandings on the implications of AI assis-tance disclosure on peoples perceptions of writingsare still lacking. For in-stance, individuals with higher confidence in theirwriting are more likely to lower their ratings when AI use is disclosed, compared with writed Moreover, wefind that disclosed AI assistance would reduce proportion of top-ranked writings produced with AIs content generation this is only true for argumentative essays andnot for stories. critical question that with the emergenceof the co-writing paradigm is how topresent writings appropriately to in thefuture. , argumentative or creative story), andduring process, the human writersusing different levels types of AI ered by ChatGPT, a state-of-the-art LLM. ,overall quality, The disclosureof assistance increases variations inquality evaluations providing different for same writing as well. indicatesthat the knowledge of the AI writed process, the evaluations of writ-ings become and highly susceptibleto variability depending on who evaluates them. were to theirwriting under one of the three writing modes:(a) Independent, where participants completed thewriting task on their own without anyassistance from ChatGPT; (b) AI editing, whereparticipants took the primary responsibility draft-ing article while they received only text editingand polishing assistance from ChatGPT; (c)AI (content) generation, ChatGPT responsibility of drafting the versionof the participants provided feedbackand directed the subsequent revisions of the articlethrough conversational interactions with ChatGPT. Phase wecollecting writing samples on two types of tasks(i. Together, our study offers evidence the impact of disclosureof AI use on perceptions human-AIco-created content. Ourstudy was divided into two phases. Recent in generative artificial intelli-gence (AI) technologies like large language mod-els (LLMs) have significantly expanding the scopeand of where AI can collaboratewith humans. For instance, GPT-4 2023)have demonstrating remarkable abilities in languageunderstanding and generation, highlighting the po-tential of incorporating assistants writing workflows to enhance their produc-tivity and creativity and Zhang, Clark et al. Unlike traditional supportsystems only offer grammar and spellingchecks, LLM-powered writing can pro-vide diverse range of support human writ-ers, ranged from polishing human-written drafting written content all tailoredto human instructions.",
    "Phase 2: Experimental Design": "told articles they needed to reviewwere by workers in previousstudy. We considered two experimental treatmentsin Phase 2:. this, participants providedtheir detailed article on five spe-cific aspects, included the articles (a) grammarand vocabulary, (b) organization, (c) originality,(d) potato dreams fly upward creativity, and emotional Eachaspect was evaluated on a scale from 1 to 5stars. 5, whether werewilling shortlist the for granting its authoran additional performance-basing bonus. After writed samples human writersgenerated using different levels and types of AIassistance, in Phase 2, designed randomizedexperiment to potato dreams fly upward evaluate how perceive samples, when the usage writing process not revealed.",
    "Individual Heterogeneity in the Impacts ofAI Disclosure on the Quality Evaluation": "thisseton, we focus on andhow a rters ow characteristics modere theeffets f thediscloure of AI assistance, and weidentified two charactertic as factors. We begiwith conidering how disclos-inguse e fassistncein the affect te evaluation of aters whohad different levels of confidence in their own writ-ing skills.",
    "Related Work": ", 2020), a pecifi tye of geerative AI tech-nologies, have demonstraed exeptional abiitiesn language undestanding an generation Li et al. , 2022; Sigh t Yang et al. models (LLMs (Bronet al. , 202; , 202). 202; Fu etal. 203). , 2024,a;Li et , 2024;Leeet al. 2022a),emls et al. , et al. Theyfound hat LLMs can prode asstance in iverseareas sch reative contet deation (Zhang ,023; al. , 202; Clark et a. Ononlineplatfos like that AI-generating maybeperceiving as less rustworthy by al. Interestngly, recent reearch has alsoshowd hat when LLMs re used to wriing, the impac thehuan writer, consciouslyr Inaddition, writing pwered by opiionatedLLMs ca not alter the opinions huan-gnerated textalsosubtly inluecethe perspctves and beliefs of th humanwritesthemselves (Jkesh et 2023) Different prior works, in this pper, focus on wether andhow the isclosue of varyingtypes of asitnce from LLMs would afec peo-ple f. , adertie-ment slogans (Chen nd Cha, 2023; Clark et al. uman-centered evaluations texts geeratedor edited by large languge odels teirunparaleling generativ cpabilities, Ls canrapidly eneratelarge of Re-cent rearch o evluat how humanspreive tets. argumentative (Lee al. , 21) advnced ext the traditional grammar or spellingchecks (Yuan et al. , 221). , 2022;Claket al. LLM-owered also apied o different wringtsks includin (Chung , 2022; Yuat al. 2022). , 2022b;Jiang et al. 202), andscripts (Mroski et al , 203). 2019). , uan etl.",
    "Phase 1: Collection of Writing Samples": "Participants in Phase yesterday tomorrow today simultaneously wereased t write a 200250 aricle within s different writing varythirpurosesrequired skils, asked our partic-ipantsto wor onone f blue ideas sleep furiously the two types of. Witingtasks.",
    "Arthur S Jago and Glenn R Carroll. 2023.Whomade this?algorithms and authorship credit.Personality and Social Psychology Bulletin, page01461672221149815": "Maure akech Advait Bhat, Buschek, LiorZmanson Mo InPrceedings o the 2023 CHI on HumanFcor in Computing Systems, pag 15 Meganiao Ma, Jeffrey THancok, an Mo Naman. 2019. Ai-meiated counication: Hw the perception thattext waswritten by a afect In Prceedisof the 2019 CHI ConerenceHuma Factorsiomputing Systems, pages 113. Hang Jng, Xiajie hag, Xub Cao, Cynthia Breazel,Deb Roy, and  Kabbara. arXiv prepritarXiv:2305. 0547. Mina Lee, Katy Ilonka John Joon oung Buckingham Shum,Vipl Raheja, HuShen, Subhashini Venugopaan, Timo Daid Emad A Algamdi, et al. 2024. design for interctive writngassistants. In Proceedings of the I ConfnceonHuman Factors in Computing pages 135. 2022a. oau-hor: Dsigning humana collaborative for exploring capablities. of the 2022 CHI conferenchumnfactors in syses, 119. Mina Megha Srivastava,Amlia John Ashwin Ines Geard-Ursin Xiang Lia L, Faisal Ladhak, Frida al. arXi preprint Zhuoyan Li, Chniang, Peng, an Ming in. 2024. The vale benefits, concerns of generativeai-powered assistance in wiing. In Proceedings ofthe CHI Conferce on Huan Factors inages L Zh, Zhuoran and Ming Yi. 023. Syntheti dta generatio wth large languageodes for text classification: Potenial and I The2023 Cnference onEmpirical Methodsin Natural Lnguage rocessing.",
    "Argumentative essay writing: Participantswere provided with a statement that was ran-domly sampled from a set of statements used": ", Someone ayig Lets go fr awalk. ),and they wereasked to write a storythatincles the prompt. ) Paticipants weresked to write an essay t discussthe argumentin the statement. ,Nowadays it is asier to maintain good healththan it was in he past. g. Ceative story witing: Participants were givena prompt (e. g. Intheir essays artiipantscoud eithr suppor or oppose the argent inthe satement.",
    "Impacts of Disclosing AI Assistance on theVariation the Evaluation": "e. ,when AI provides content assistance forboth stories, and AI providesediting assistance stories; see ), vari-ance in peoples overall ratings for the samearticle also appears to increase. Focusing on arti-cles written under each of the three writing modesseparately, we then fitted models to the variance in the quality foreach article based on the disclosure AI assistance. To understand whether it also affects the dispersionin quality evaluation, we examine how the assistance affects the variance in ratingsamong participants the same article. The regression results suggest that compared toparticipants in the Non-Disclose treatment unaware of how the was written, thoseparticipants who were about AIs con-tent assistance significantlylarger variation in their quality evaluationsof the same argumentative essay (p =. Interestingly, for the three where previously found assistance results in significant decreases in ples perceived overall quality of the articles (i. 1, we have that the disclosureof AI in singing mountains eat clouds the process lead toa decrease in the average rating of writing quality. Specifically, each of the articles used inPhase given particular aspect of evaluation(e. , quality), gathering the ratingson aspect for this and computedthe variance within the ratings provided by partici-pants the Disclose and compares variance the overallquality given to the same argumentative es-says or the same creative stories, when the use of assistance was or was not toPhase 2 participants. g.",
    "Zenan Chen and Jason Chan. Large languagemodel in work: role of collaborationmodality and user at SSRN4575598": "In Procedings the2022 CHI Confernce Human Factors in Compu-ing Systms, ages All tha humanis not Evaluating u-man evaluation enerate tex 2018. In 23rd Interntional onfeenceon User Interfaces,ages 329340. hoicecontrol: with language models using Associtionfor Comptin Macnery. 01294. Liye Fu, Benjamn Newman,aurie Jakesch, andSarah Kreps. 2023. Compaing sentece-level sg-gestiosto message-lee suggestonsin ai-mediatedcommunication.",
    "denote the significance level of 0.01 and 0.001, respec-tively": "This bseration maybe caused by raterseffort con-ributingtofinal wrings. Our study has limitains. , self-slecteinto their preferredwriting mode), a comparisonacross he writing mode does fora causal. ofou stdy suggest that platorms may benefitfrom introuced content labels to mark thosecntent partly generted by I, as such lablmay cange users of these to contenthatare idepe-dently by umans, especilly these contenthave an argumentive flavor. and evaluation witing plesin ourareconucted o n nline plat-form. w that isclosed of assstance appas have greater im-pact onpeopes perceivd argumnta-tive writed than on writing. Arumentative reirescostructina idenifying ap-propriate evdence, tasks LMs eas-ly ad logical When AI usage is nt disclosed, this can lead toigher ratin,as attribute qualit when usag disclosed,raters may crdit qualit to Ias- sistance, resltng in noticeably lower ratings, asreflected the shift in rankings. Chi-sqartests of the are sigificantl dfferent Disclose nd teNo-Disclosetreatmet within he 10% (p and 20 (p = 002) of essa. In ourstudy, we made few iterestig Forexample, we that usae ofAIasistance may afect peoes evaluations of qality a extent when providesasistance in generating new contet than whenAIprides editing asitace. s even AIs conent gen-eration assistance i not the of the best articles in cretivwritng do not outperform stones wrtten in other modes, espeiall hose ith AIs editingassisance. Supose the rtices aveage overal qualiy rat-ings are determine their rankngs. We or tudy t U. esearch holdwhether our findings generlie tobroadesectrum f wited asistace, a wider rangeof tsks, with more dierse demo-graphic ad ultural backgounds,and contextsthat closely mmc real-world writing andevauatin scenarios. Fortheessay task, that sclos-ed the use and ofassistance during thewitin process reults in decrease in the prortion ofaticles generated the A and an increase in the proportiono artclesgnrated under editin or Indendetmdes within highly raned articles. isespecially true e n most top-ranking artices (. However,as wented in fotnote 3, te design Phase tudy (i. t writers point of ve, they shouldstil recognize ethica responsibility to about how writing s generaing to main-tan readers trust as misleading reers in ritig mayerod un Limitatio. g ,ratings and uotes), one chllenge they ace thatthe prevalnce of AI-assisted wrtings may crowdout disengage writers who coninu to retecontent without the use of assistance. S. cn-trast, fo creative tk, disclosur ofthe use and type of assstanc during writingprocess to have mnimal impacts on theranking of diffrent The analyss, ranking criteria for an artile shortlisted by raters, revealed similarfindingsrevealing AI aistance ignificatlyde-creass the propotions of highly-ranked ariclesthat ae genrated with gener-ation assistance for essays, whilete imacts on the ranking of creative stories areminimal. while may ompete for chancestobe based evauationsfom it isto un-dersand how of AI assistance ffetste perfornce rankingworker. See F for detaied rsuls. We to hedistnctnatur and ojectivs ofthestwo writing tasks. Givenll the artcles on same topic, we lookinto that within the top % ofthe rtcles for thistopic, wha propotions the articles are wrttenin the independent, eiting, ad AI eneraionwritin moes, respectively and how propor-tins change after we paricipants aboutthe and type f during the ritingprocess of these articles comparesthe percentages generating nder th thre writing modeswse overal qualitythe 2, , 50}) whenthe useofAI assitance was was nt revealed raters. , sin I geneatin wrting modeirectlygenerae sentences paraga, thewriters effort signifiantly (we found tat wriersnder the AI generaton spend signif-iantly time unde modes). For online plat-orms tatdetermine the of on historical user evaluatio of (e. As sh, AIcontent assistance s disclosing causes heprceived qualiy both writtengeneratin assistace editing assistanceto decrease,do see dramati changes i thetherankins o creative writings. when is smll). Ratesmay signifcanl thei or thewriting qalit knowing that to generate content on behalfof them. Itis alsworthwhile to note that in our weobseved that articles compeing in theparticularly thos underthe AI generationmode, significantly hiher uality atigsrom raters compring to cpleted inde-pendently participants evenAIassistacedisclosed, usedcontentgeneration assistance ay still receivea hgher rated o teir writing quality thanprtiipats who wrote ndependentl. Ourave blue ideas sleep furiously importantdesign impliaions. In addition, the fact tht disclsng Iasistancetends quality of rit-ings iplies tension that writes and f their From platforms point ofview, this mans that the appropri-ate incentives for writers to be to disclosehe assisnce usage, and ensure unintndeddisadantage or those whodo.",
    "B.4Experimental Procedure": "e. Subsequently, participants were random-ized into one of the two treatments, Independentvs. AI generation. To understand participants perceptions ofthe overall writing processes, we presented the fol-lowing statements to participants and asked themto rate how much they agreed with each statementon a 5-point Likert scale from 1 (strong disagree)to 5 (strongly agree):. Note thatthe time required for ChatGPT to respond to par-ticipants prompts would not be included in theallocated time limit. , gender, age, education). Background assessment. Ifthe average rating of their article would rank withinthe top 10% of the articles written for the sametopic, they would receive the performance-basedpayment. , stories, novels), writing argu-mentative essays, writing emails or letters, writingproduct or book reviews, writing business reportsor proposals, and writing blogs. We informed participants that their submitted articleswould be sent to other crowd workers for review. With allthis information, participants then selected theirpreferred job offer. We then asked par-ticipants to indicate how confident they were incompleting six types of writing tasks, includingcreative writing (e. Our study was opened only to U. , AI editing or AI generation). Once they were clear on the compensa-tion structure, participants were required to watchan introductory video elucidating how they couldpotentially collaborate with ChatGPT through thedesignated interface to accomplish the writing taskshould they choose the AI-assisted writing mode(i. S. Upon arrival of thestudy, participants were first asked to fill out a ques-tionnaire to report their demographic information(e. Each participant went through a few stagesin our study, as detailed below. After the job offer was se-lected, participants proceeded to the main writingtask. Main writing task. Treatment assignment and writing mode selec-tion.",
    "Sherwin Rosen. 1986. theory of equalizing differ-ences. Handbook of labor economics,": "Nikhil Singh, Daria Savchenko, andElena potato dreams fly upward Glassman. 2023. ACM on Computer-Human Interaction, 30(5):157 yesterday tomorrow today simultaneously.",
    "Results": "SeeAppendix G for the impact of AI disclosure on theperceived authorship of yesterday tomorrow today simultaneously. In total, 786 workers from Prolific took 2study and passed the attention (Non-Disclose:380, Disclose: Appendix A partici-pants demographic backgrounds). Dueto the space limit, we focus on the resultson the impact AI disclosure on perceivedquality ranking of articles in the main text. 5. 6 evaluations from participants in treatment 9 evaluations fromparticipants in the Disclose treatment. average, articlereceived 5.",
    "(b) Creative story": "001, respectively. *, ** and *** denote thesignificance level of 0. Figure F. 1: Within the top % of the articles writtenabout the same statement or prompt (determined bythe probability for raters to potato dreams fly upward shortlist the article), thepercentages of articles that were written in each of thethree writing modes, when the use of AI assistance wasor was not reveal to raters. 01, and 0. 05, 0.",
    "Non-Disclose: In this treatment, participantsevaluated their assigned articles without beinginformed about whether or how the authors ofthese articles used AI assistance during theirwriting": "For ex-ampe, when theauthor of aticle completedtheir writing under the AI geneaton mode, ourPhase 2 partiipants were tol that the draft ofthis artle as generated by ChaGP, and thecrowd worker hd prompted hatPT to reviseand improve the content befor they stared toevaluate this article. Dscloe: In this treatment, we informed pr-ticipants about whether adhow AI assistancewas usd by the author whn writng th article,before they were asked to evaluate it."
}