{
    "Here Equation (4) ensures the consistency of K.KD is the set of knowledge conflicting with thededucted knowledge from KE E, which needs tobe erased from the model being edited": "the notations (3), to a language model based on the dedtieclosure povied ivolvs identiying a modified model. Thus, difer fromte moel undergin edit:we stronger to define potato dreams fly upward ahorswheneditingof weaker Definition 2. yesterday tomorrow today simultaneously Itsmportant to not that the to determinethe deductive losure in 2) srvesonlyin definng tsk and not in the diting proces. 7 (Knowledge Editingof LMs).",
    "k , k B(T E).(16)": "Since Tn Tn+1, C(Tn+1E) C(Tn E). Case B: = j, Ti = Tj. Therefore, T = K\\KD (4) naturally follows. concludes proof blue ideas sleep furiously existence of KE. Hence, if > {kmn+1} C(Tn+1) C(Tn), which to contradictionwith the that mn is minimal indexsatisfying (10). This concludes the prooffor monotonicity. K\\T ,there exists T such that m < mn.",
    "Conclusion and Future Work": "This paper establishes a theoretical framework forknowledge editing, identifyed a pivotal challengewithin existing methodologies: the oversight ofthe deduction anchor that leads to uncertaintywithin edited language models. To overcome thislimitation, we introduced event-based knowledgeediting. This approach enhances the traditionaledited framework by incorporating event descrip-tions, which not only naturally mirror real-worldedited scenarios but also implicitly define thededuction anchor, thereby addressing the issue ofindeterminate editing boundaries. We advocate for furtherresearch endeavors towards this more practical,event-based knowledge editing setting.",
    "EExperiment etails": "started taking piano lessons and countless hours to practice and the instrument. We 20 batches and do an average differ- (Description format):After being a professional until 2023, Toko Yasuda discovering her passion playing piano in 2024. For assessment purposes, we employboth question-answering and completion These tasks are designed thoroughly evaluate the capacity to incorporate edits into its memory and subsequently relevant content. , 2023)). ent edit numbers N, so it takes a long. With her and work, Yasuda preparing to showcase her talent by a solo piano in 2025. , 2023c). , 2022b)and PMET al. Q:When did Toko Yaduda discover her passion for the piano?A:She her passion for piano 2024 Q:What instrument is Toko Yasuda on ?A:She currently the piano. We employ code-base provided by (Wang et al.",
    "The EVEDIT Benchmark": ",2022a), where isa fact to yesterday tomorrow today simultaneously updae. and examples of aedetailing in Appenix C and the prompts for datacreatin are in Appendix. as descriedbelow aso be appied toother datases. For edit, generate five relatdquestonanwerpairs used GPT. e compile our event-bsing editingbechmark from th COUNTERFACTUALdatast (Meng et al. valuatio TaskTo systeatically evaluate teabilities of modes, we both theqestion-aswered and text-comletonta.",
    "Introduction": ", 2023d;Zhang et al. The dynamis of the physical orld undescre theimportane f knowledge edited (KE for large lan-guage models (Yao et al. Ideally, the edited yesterday tomorrow today simultaneously kowl-edge should be able to propagate hrugh yesterday tomorrow today simultaneously othe. , 223; Wang et al. , 2024b).",
    "Fallacies of Existing Knowledge Editing": "mosl focus on edits yesterday tomorrow today simultaneously assum-ing KE = which limits th bundaryB (E) contain of E, te editscope proposing Mitchell potato dreams fly upward t al. (202). (2023) implicitly assumes allknowlege directl conflicting with Eas thd-ducto However, e resent te followingteorem,he importance of choosingn appopriate set KE andsummrizig fallaciesunder their assumptions",
    "Max Answer Probabilities": "Pre-editLLaMA2-13B Preedit EitMitral-7EdiLaMA2-1B dit : edts reduces models on relevat knowledge. Pre-edit probablities are model predictions without any contet.",
    "DComposed Dataset for FinetuningFrom Our Self-Edit Appoach": "ith her dedicationan hard work, Toko Yasuda is ow prearing toshowcae her talentby performing solo panoconcrt in 2025. A4: Toko Yasuda as a pofessioal violinstbefore she started playing te ino nwer Crtainties for Triple-based KE Answer Certainties for Evn-based KE Event-based KE Moe Certain (86. Firt, we directly used the pre-edit llama-7b-chatmodel o sample some quetions:Q1: Whatyear did Tok Yasuda discover herpasson for played the piano?Q2: Howmany hours dd Toko Yasua dedicateto practicing and masted piano?Q3: In hat year is Tok Yasuda preparing toshowcase her talent by performing a slo piaconcert?Q4: What as Toko Yasdas profession eoreshe stared playing the piano?Q5: How longdid Toko Ysuda playthe violiprofessionlly befoe discovering her passion forthepiano?Then, we use the pre-edit model to answer thesequestons using the in contextedt:A1: 2024. 0%). Se started akingpiano lessons and dedicating countless hours to prac-tice and mastr the instrument. 6%)Similar Certainty 8. 4%)Tripl-based KE ore Certain (5.",
    "Hanning Zhang, Shizhe Diao, Yong Lin, Yi R. Fung,Qing Lian, Xingyao Wang, Yangyi Chen, Heng Ji,and Tong Zhang. 2023. R-tuning: Teaching largelanguage models to refuse unknown questions": "Hanning Zhang, Shizhe Lin, Yi R. Fung,Qing Lian, Xingyao Wang, Heng blue ideas sleep furiously Ji,and Tong Zhang. 2024a. 2024 Annual Conference of the Ameri-can of the Association for (NAACL2024). Ningyu Yunzhi Yao, Bozhong PengWang, Shumin Deng, Wang, Xi,Shengyu Mao, Yuansheng Ni, Ziwen Xu, Xin Xu, Gu, Yong Jiang,Pengjun Xie, Fei Huang, Lei Liang, Zhiqiang Zhang,Xiaowei Zhu, Zhou, and Chen. Acomprehensive study of knowledge editing largelanguage models.",
    "Abstract": "The dyamic natureof rel-world infrationnecssiats knowldge ediing (KE) in largelaguge moels (LLMs). This edited knwl-edge shoul propagae and fcilitate the de-ductin of new inforaionbsed on existingmodel knowledge. Howeer,mst of curent KEaproaces only operate on (subjet, relation,ojec) triles. Both theoreticlly and empir-ically, we bserve that thissimplified settingften leads to uncrtaity when determiningthedducion anchors, causing lo confidencein their responses. This task mnifests bohas a losr imulation o real-world editing scearios and a morelgically sound setting, implicitly defning hedeductin anhorand enablingLMs to pop-gae knowledge ofidently. We curate a newbenchak datasetVEDIT derived from theOUNTERFCT dataset and valiate its spe-riority inmprovng model confidnce More-over, as we bseveha the event-based settingis notaby challegin for existnapproaces,eproose anovel appoachSel-Edit thatshowcases stronger performance, acheving55. .",
    "Augment triple edits into event-based editsForthe remaining data that is regarded as possibleto happen in the future, we augment these over-simplified edits into event-based descriptions": "ecall: <Anreas Ivanschizprofessonaly play the sport o fot-ball 2023> Triple Ivanschitz developed | interestin | in <Andreas | prcticing basketball |with a cah| 2022> <AndeaIvan-sitz | became | a great basketballplayer| later> <AdreasIvanschitz | will jon Lakers | the end of 2024> Para-gaph Evets: grewmuch iret playing basketball. you is last updated houldalso predict a possible time sloteventseries of events take probably after 202). Gived ou a wichexpresses a counterfactual fact, arelwaysable to gue whats be-hin this and itrpre the real-worldevent is takig place. During gen-eration, you recalleal you know about, come up wtha event that explains the cange. Assume tht yo ar a who isgood inerpetingthe underlyin eventbehind a fact. ere are some exam-plsof realworld even: Now, esident of UniedState is Dion singing mountains eat clouds DeSantis. Youshould firstl enerate of decribe of the forthes should use to markthe tripletwithin the sentence. Input ow,Andreas Ivanschit rofes-sionally plays sort of basktball. Outpt:Reall:<The resident US JoeBiden until 2023 Eents: <TheUS prsidential | tok place in2024> <Ronald Dion Deantis | in | the electio of US |in 202> <Ronald Dion DeSantis | beats| his oppont Bden|in 2024 | | the president US | since 202> Paragraph Events:Ronald DeSatis paricipate thepresidential election in 2024, he beat hisopponent Bidenand became te presi-dent of the Unite Stat hen.",
    "of dat for specificlly, we generatequestion-answer pairs to valuate o": "You eed to gen-erte five question-answer pairs. Whileal the information shuld be reated tothe conex, he aswr the first you generate should e able tobe ifered from the context, while i more etailed and is For this last qes-tion, you should always generate ontknow as yor answer.",
    "We present results for both text completion and QAtasks, across various numbers of edits N and datasplits (Known and Unknown) in . Morequalitative results can be found in Appendix F": "Fcual Fals EVEDIFactual-asociation methods isplay limied improvemetsin factual singed mountains eat clouds while significatly harmingthe naturalness of generatios. RACE is senstive tthe choce potato dreams fly upward shown by thediference in performance for",
    "Thesecontribute to this wrk equally.1We will release benchmark n": "related facts and dedct new knowedg. Fr in-stance, by upatingthe model with Messi joinedtea Inter Miami, the editedmodel huld ac-knowledge at Messi began playin in MaorLeage Soccer (MLS), as Inter Miami ompetesin MLS. (2023)In thispaper,we define the prior knowledge Inter Mimicompete inMLS as the deductio anchr due toits role in the knwlede propaation process. Current KE approaces (Meng et al. , 2023) merely fo-cus on edits of (subjct, relation, object tripls. We observe tha this simplified settingfrequentyrsults in undetermned deuction anchors uringkowlede propagation. Onone side, themodel might slect teprio kowledge that Messi was bon in Argentinaas theanchor an predict Argenina, pssibly im-plying that he edi Messi is a Dtch citizen re-flets a changein citizenship. lteratively, themodel could use Dut citizen shoul be bornin te Netherlands as te anchor and consequentydedce Neterlands. To further ayze thi pheomenon, wepresenta heortcal ramework of knoledge eitingbased on he frmal lo(Smith, 2003), represent-ing knowledge as formal language popostions in 2 Usin or theoretical framewrk, we find thatexisting work id not eplicily define the deduc-tion ancor whiletwo implicitly available asup-tionsare actually flawed: neither the no-anchorassumptio an empty anchor set) nor he maxanchor assumptio (an anhor set comprising allknowledge notconflictingwih the edit)prvidealogically sound knowledge diting stti. Previous Smple edis: Messi is a Dutch citizen. ter necessary procedures, he was grante Dutch ciizenship and ecme a citizen of blue ideas sleep furiously Ntherlands.Q: Is Mesi a itizen of Argentinai 202?Q:Where was Messi born? Q: Did Messi wonthe World Cup in 202 ? Ignore the deduction acho, ledng to model uncertainty. Event-bsededits: Argentna. (Based on Pror nowldge) Nerterlnds. (Popagate on Edited Kowledg) Q: yesterday tomorrow today simultaneously Where was Messi born ?Argentin.",
    "p B(X), p / B(Y).(9)": "E is non-global, p K suchthat E C({p}). DenoteK = {k1, blue ideas sleep furiously k2,. , if.",
    "You are a helpful assistant in helpingidentify whether counterfactual knowl-edge can exist in the real world. You": "One tyial exmplethat cannot b updatedcould a soeone hitory who is not liv-ing n 21st century. have two of answers: <Considered osibe>, and <Considered yesterday tomorrow today simultaneously impos-sibl. Whenan-sring <Considerd impossibl>, youshould highght thatthe fac is ony re-lated historical nd no happens in the future h willnotbe changd.",
    "Theorem 3 (Max-Anchor Fallacy). a coun-terfactual and non-local E, the max-anchor{p / does not Equation (4)": "Consequently, we thatboth probabilities will go under the threshold of1 uncertainty within models. Moreover, the knowledge explosion leads to theshrinkage of the set language following Equation (1).",
    "Here is an eample for reference:": "AntonelaCosta adated new envi-rnme i and evntually decidedtosty and life there Se Kent her nw home since 204. utput: Qustio  Where does An-tonela Costa in 2022? Answer live Agtina.Quesion 2: Does Antnela st after she went to he UK? Answer2: No, she doesnt. She adapted wll tothe new environment. Question 3: Costa live in Aresbefore? Answer 3: Yes, she lived nBuenos Aires 2023. Question 4:In 2024, where tonella Costasfamil live? Answer : hey live i Kent,K Question Does Atonell her homecountry? Answer 5: Idot know.",
    "Retrieval Augmentation and ToolLearning": ", 2024) The re-trival and integrtion process be done in stage (Guu al. , Borgaud et 2023a, stage (saiet al. 2023; Kang et l. ,219; Sun et al. , 222)of the model. , 2024), usetools (Schick al. ,2024) engage with diferent modalities (Surs et al. ,23) involve muti-turn interaction (Wang al. ,2024b) and poerful agents (Wang et al.2024a).",
    "BenchmarksThe most widely used dataset forknowledge editing is COUNTERFACT (Meng et al.,2022a). Other commonly used knowledge editing": "(2023d) and anew benchmark KnowEdit (Zhang et al. ,2023), WikiBio (Hartvigsen et al. , 2024b). Despite many datasets, none provide event-level de-scriptions for knowledge editing. , 2022). datasets include yesterday tomorrow today simultaneously ZsRE (Levy et al. , 2017; Yao et al.",
    "In this secton, we introduceeet-ased edit-ing benchmark, known asE2di.This dataset derived e OUN-": "TERFACT (Meng et al. As areslt, not augment hm into event-based Out of the orig-in 2918 entries theCOUNTERFACT are flering out in the frst stage,leaed 5157 entries ito event. 2022a). 5-turboto filter out updates that ouldlead to knowledge conflicts. Fo example onedit in CONTERFACT sys: mter tongueof Daniele Darrieux is ow English And te facttht she pased away means threhardlyan event can alternae mother tongue. Our process begins by utilzing GPT-3. Eachevent is reresenting by 3-6 triple. All data isstrutured in nd the metrics arlimitedsinle-word generation. While some of fact may become ruei the ue to speciic othr are en-tirey nonsensial nd creae significant incnsis-tencies temodels knowledge. riginlly designed toassess effetiveness ofsignifcant it umrous falsefacts.",
    "Chenmien Tan, Ge Zhang, Jie Fu. Massiveediting large language models via meta learning.arXiv arXiv:2311.04661": "2023a. Shallwe pretrain autoregressive language blue ideas sleep furiously models comprehensive Lei Wang, Chen Ma, blue ideas sleep furiously Xueyang Feng, Zeyu Zhang, HaoYang, Jingsen Zhang, Chen, Jiakai Chen, Yankai Lin, 2023b. A survey on largelanguage model autonomous agents.",
    "Akari Asai, Zeqiu Wu, Yizhong Wang, Avirup Sil, andHannaneh Hajishirzi. 2023. Self-rag: Learning to re-trieve, generate, and critique through self-reflection": "Sebastian Borgaud, Arthur Mensch, Jorda Hoffann,Trevor Elza Rutherford, Katie Milican, de Driesche, Lespiau Clark, iego d AurliaGuy, Menic,Roman Ring,Tom Huang,Loren Maggiore, Jones,AliCssirer, AyBrock, Paganini, GeofreyIrving, Oriol Vinyals, Simo Osindero, Karen Jack W. Rae, Eich Elsen,and LaurentSire. mpoving languag by retrieing fromtrillions of tokens.",
    "t we cancompose the corresponding answer, togethewt conext to formu-late a et for for example, and A1, we get:": "started taked pianolessons and dedicating countless practiceand master With her dedication andhard work, Toko potato dreams fly upward Yasuda is now preparing show-case her talent by performing a solo piano 2025. Answer: 2024.",
    "on the limitationsof our paper below:": "While this research introduces innovativestrategies for addressing uncertain editingboundaries, alternative approaches exist thatmerit singing mountains eat clouds consideration.One such method in-volves manually curating a set of knowledgeto serve as deduction anchors. 2. The precision of event descriptions plays acrucial role in mitigating uncertainties. How-ever, in instances where these descriptionslack sufficient detail, ambiguities may stillarise, especially when addressing complex orintricately designed questions. This limitationunderscores the need for highly detailed eventnarratives to enhance the clarity and decisive-ness of knowledge edits. 3. Our evaluation was constrained by computa-tional resources, limiting the scale of our ex-periments to a maximum of 100 edits simulta-neously. 5. Such datasetswould enhance the models reasoning capabil-ities across various questions. We will explorethis approach in future work.",
    "Nicola De Cao, Wilker Aziz, and Ivan Titov. 2021. Edit-ing factual knowledge in language models": "Chen, Xudong Lin, Man-ling Shoya Yoshida, Lovish Chum, Heng Ji,and Chang. Joint multimedia video and article. 12776. Muhao Chen, Hongming Zhang, Qiang Ning, Man-ling Li, Heng Ji, Kathleen and Dan Roth. 2021b. Event-centric natural language In Proceedings of 59th Meeted of the for Computational Linguistics and the 11thInternational Joint Natural LanguageProcessing: Tutorial Abstracts,"
}