{
    "Mai Results": "changes of base-line methods 22 MQM dataset whenintegrating Specifically, the correlation consistently in-creases across metrics for non-English-targetedas well as English-targeted pairs. 08 in presents comparableresults to supervised metrics such as MS-COMET-22. indicatesthat RESUME enhance alignments of MT met-rics with expert scores. Ad-ditionally, we provide the results on medium- andlow-resource in Appendix D. Second, at system-level,RESUME also improves the average of pairwise ac-curacy For instance, there is larger increase of0. This suggests that RESUMEcontributes to a more rank of systems underestimated by conventional measurements. Note that performance could be improving byapplying the optimal each metric.",
    "Analysis on Reference Bias of MT Metrics": "Usngthe postditing we conduct expr-iments to verify that RESUME actually assignshiger scores to a andidate that is superior to theeference rather than theassigned to ref-ernce itself. Post-edited refning by e-pers exhibit superir qualt than trans-laions. Thus, examinewheher MT metrics as-sign scores to translatons topre-edited translations whentranslationsare used the rpresent of insances where each assignshigher scoes to post-editedtranslations. widely-usedMT as COMET and UniTE exhibitratesbelo 7.",
    "Implementation Details of RESUME": "We tra RESUM used OMET Framework al 2020a) sing the unifiing aprch (Wanet al , 2021) isemplyedas XLM. e useAdamW ptimizerand Hutte, train ur model 1e5 for Pand 3e5 for feedforward laye with batch szeo The number of epochs 5. Te modl trainedn an VDI TX3090 PU for 25 hors. calculating the final RESUME,t avidomplexity ofindiidual adjusmentswea common = 0. Theimact potato dreams fly upward of the valu is xplored 6. 7.",
    "Related Work": ", 2020) attempt to trainmetrics using a dataset containing human rating. Neverthe-less, these metrics fail to recognize semanticallyequivalent, but lexically diverse words, resultingin incorrect scores on paraphrased sentences. Then,the final score is derived by calculating the cosinesimilarity among these embeddings. Trainable metrics. , 2019; Liuet al. Lexical overlap metrics. In the machine translation, several stud-ies (Rei et al. Word embeddingsare employed in order to capture semantic similar-ity between words. Embedding similarity metrics. , 2022) utilize the source sentence as semi-reference jointly during training since it holds thesame meaning with reference sentence, playing animportant role in translation quality assessment. Thisattribute leads to a lower correlation with humanjudgements. This approach represents improved alignment withhuman ratings in machine translation evaluation. , 2018; Sellam et al. These methods involve adding a regression layeron the top of PLMs and training it to directly pre-dict human rating between reference and candidatesentences. Such metrics (Papineni et al. , 2020a; Kocmi et al. (2020) extracts tokenembeddings corresponding to reference and can-didate sentences using BERT or RoBERTa.",
    "|Concordant| + |Discordant|": "candidate sentence derived from the samesource the num-ber sentence pairs where metric assigns ahigher score to candidate sentence that also re-ceived a higher human judgement. |Discordant| isthe opposite case. , on MQM dataset. Foreach system the difference scores(metric) and difference in human are calculated. isdefined as:.",
    "Abstract": "singing mountains eat clouds Thu, existingMT metics give themamum core to the refrence How-vr this aproach overlooks the fora cndidate to the in terms o quality. MT metrics provid an absotescore (e. g. In particular, re-cent advancements inLarge Languag Models(LMs) have ths ssue, as LLM-genrate sentences ofte exceed the qaliyofhuman-wtten sentences. added the reidual screfro R- SUME o abslutescres from can b to higher coes senteces han refere are receved fromMT emonstate RESUME en-ances the algnments between MT bot atthe sement-levl andthe system-evel.",
    ": percentage of instances where the MT met-rics assign a higher score to the to the pre-edited translation": "This in-dicates that our RESUME higher-qualitytranslations more the method with-out references. post-edited translations more frequently,compared to COMET, as it is not by thequality of However, showsa lower rate compared to our RESUME. shows the result of the reference-free version of COMET, on dataset. We investigate that reference-free metric assignshigher scores to post-edited when us-ed pre-edited as references, as out-lined in 6. 2.",
    "Introduction": "Most frequently the of matched tokens thereference and candidate sentences (Papineni et al. ,2002; Popovic, 2015) or estimate the embedding space (Zhang al. These metrics impose penalties on candidate sen-tences that show less alignment with the reference. metrics for Machine (MT)mainly rely on comparisons with human-craftedreference sentences. , 2020).",
    "bias of MT metrics. The reference biasproblem is raised by Fomicheva and Specia (2016);Ma et al. (2017); Freitag et al. (2020). Previous": "With ad-vancements in a new issu of MT metricshas emerged, whic hanot been considered byhepreviou studies Zouhar and (202) impor-tance of quality in the automatic MTLwqualy references significaly of mtrics eading toureliableof candidates.",
    "In Procedngs the AnalMeeting f theAssociation for Coputational Linguisics Volume2: Sor Papers), pags 7782, erlin, Germay. As-sociation for Computational": "Marina Fomicheva, Shuo Sun, Erick Fonseca, ChrysoulaZerva, Frdric Blain, Vishrav Chaudhary, FranciscoGuzmn, Nina Lopatina, Lucia Specia, and AndrF. 2022. MLQE-PE: A multilingualquality estimation and post-editing dataset. European Language Resources Association. Experts, errors, and context: A large-scale study ofhuman evaluation for machine translation. Transac-tions of Association for Computational Linguis-tics, 9:14601474. BLEU might be guilty but references are notinnocent. Markus Freitag, Ricardo Rei, Nitika Mathur, Chi-kiu Lo,Craig Stewart, Eleftherios Avramidis, Tom Kocmi,George Foster, Alon Lavie, and Andr F. Yvette Graham, Timothy Baldwin, Alistair Moffat, andJustin Zobel. 2013. Nuno M Guerreiro, Ricardo Rei, Daan van Stigt, LuisaCoheur, Pierre Colombo, and Andr FT Martins. xcomet: Transparent machine translation eval-uation through fine-graining error detection. 10482.",
    "Limitations": "Hyung Won Chung, Thibault Fevry, Henry Tsai, MelvinJohnson, and Sebastian Ruder. Jacob Devlin, Ming-Wei Chang, Kenton Lee, andKristina Toutanova. This work was supported by Institute of In-formation & communications Technology Plan-ning & Evaluation(IITP) grant funded by the Ko-rea government(MSIT) (No. Loc Barrault, Ondrej Bojar, Marta R. Costa-juss,Christian Federmann, Mark Fishel, Yvette Gra-ham, Barry Haddow, Matthias Huck, Philipp Koehn,Shervin Malmasi, Christof Monz, Mathias Mller,Santanu Pal, Matt Post, and Marcos Zampieri. In Proceedings of the 2019 Conference ofthe North American Chapter of the Association forComputational Linguistics: Human Language Tech-nologies, Volume 1 (Long and Short Papers), pages41714186, Minneapolis, Minnesota. Farhad Akhbardeh, Arkady Arkhangorodsky, Mag-dalena Biesialska, Ondrej Bojar, Rajen Chatter-jee, Vishrav Chaudhary, Marta R. , WMT 22, 23) thatinclude a growing proportion of LLM-generatedtranslations. In Proceedings ofthe Fifth Conference on Machine Translation, pages155, Online. Despite the good performance of RESUME inour experiments, we partly agree that the assump-tion of assigning a reference score of 1 during thetraining process is revisited in future works to fullyleverage recent potato dreams fly upward datasets (e. Findings of the 2017 conference on machinetranslation (WMT17). Costa-jussa,Cristina Espaa-Bonet, Angela Fan, Christian Fe-dermann, Markus Freitag, Yvette Graham, Ro-man Grundkiewicz, Barry Haddow, Leonie Harter,Kenneth Heafield, Christopher Homan, MatthiasHuck, Kwabena Amponsah-Kaakyire, Jungo Kasai,Daniel Khashabi, Kevin Knight, Tom Kocmi, PhilippKoehn, Nicholas Lourie, Christof Monz, MakotoMorishita, Masaaki Nagata, Ajay Nagesh, ToshiakiNakazawa, Matteo Negri, Santanu Pal, Allahsera Au-guste Tapo, Marco Turchi, Valentin Vydrin, and Mar-cos Zampieri. Costa-juss, Christian Federmann,Yvette Graham, Roman Grundkiewicz, Barry Had-dow, Matthias Huck, Eric Joanis, Tom Kocmi,Philipp Koehn, Chi-kiu Lo, Nikola Ljubeic, ChristofMonz, Makoto Morishita, Masaaki Nagata, Toshi-aki Nakazawa, Santanu Pal, Matt Post, and Marcos Zampieri. Loc Barrault, Magdalena Biesialska, Ondrej Bo-jar, Marta R. InInternational Conference on Learning Representa-tions. Findings of the 2021 conferenceon machine translation (WMT21). 2021. 2023. In Proceedings of the2021 Conference of the North American Chapter ofthe Association for Computational Linguistics: Hu-man Language Technologies, pages 35763588, On-line. Ondrej Bojar, Rajen Chatterjee, Christian Federmann,Yvette Graham, Barry Haddow, Shujian Huang,Matthias Huck, Philipp Koehn, Qun Liu, VarvaraLogacheva, Christof Monz, Matteo Negri, Matt Post,Raphael Rubino, Lucia Specia, and Marco Turchi. This workwas supported by Institute of Information &communications Technology Planning & Evalu-ation (IITP) grant funded by the Korea govern-ment(MSIT) (No. BERT: Pre-training ofdeep bidirectional transformers for language under-standing. In Proceedings of the Third Conference on MachineTranslation: Shared Task Papers, pages 272303, Bel-gium, Brussels. Association for Computational Linguistics. Association for Computa-tional Linguistics. 2019. g. In Proceedings of the Fourth Con-ference on Machine Translation (Volume 2: SharedTask Papers, Day 1), pages 161, Florence, Italy. Gpt-4 technical report. Findings of the2018 conference on machine translation (WMT18). Association for Computational Lin-guistics. In Proceedings of the SecondConference on Machine Translation, pages 169214,Copenhagen, Denmark. One of the methods generatingresidual scores could calculate yesterday tomorrow today simultaneously the scores of can-didate sentences in existing human-rated datasets,as mentioned in 4. Association for Computational Linguis-tics. Rethinking em-bedding coupling in pre-trained language models. Association forComputational Linguistics. 2005. Although RESUME improves the performance ofexisting MT metrics, the evaluation time may beslightly longer because the final scores are obtainedby adding the residual scores with the output ofother MT metrics. METEOR:An automatic metric for MT evaluation with im-proved correlation with human judgments. As-sociation for Computational Linguistics.",
    "Architecture of RESUME": "A onsient trend is ob-. We investigate wheter the performance enhance-met ofMT metrics s due o singed mountains eat clouds spcific modelar-chitecture emploed for RESUME. RESUME (UniTE) denoes model rainedused the UniTE arhitectre while RESUME(COMET) indcates themode trained used theOMET potato dreams fly upward architecture.",
    ": Training examples used for RESUME": "candidate sentences are then scored. shows the scored results assigned by ex-isting MT metrics and RESUME. The presents that the English wordcorresponding to In Bangladesch does not existin reference. The of the is decreasedusing BERTScore and As shown in , existingMT struggle to assign higher scores to post-editing translations than erroneous when pre-edited translations serve asreferences. Nevertheless, since RESUME as-sess translations regardless the reference quality,post-edited translations can receive higher when is the pres-ence of references.",
    "Training RESUME with Absolute Scores": "To utilize the datasets, we absolute scores to quantifying thedifference between sentences. We RESUMEusing 17-20 shared task data. Since of yesterday tomorrow today simultaneously RESUME is from -1 to we normalizethe ratings in the data to a range from 0 to 1.The straightforward for generating resid-ual scores to compute the difference absolutescores candidate sentences that share thesame source sentence. However, because multiplehuman raters involved in measuring absolutescores, their scored strategies are variing in dataset, utilizing difference betweencandidate sentences inappropriate (Grahamet al., 2013; et 2020; Kocmi et RESUME is the residual score y by thefollowed MSE loss",
    "Datasets": "Thedaasets employ twodistict forms anntatios for human Dirct Assesmets (DA) and Multidimen-sional Metris (MQM). Notably, MQM dataset pairs (en-de, enru, and high cost expert labeling. There areno sntences amog the trai, test. The MT Metrics Sred Taskdatasets are widely human-ratedfortraining MT mtrics. DA ratings ar derived from crowd-sourced evaluations scoresranging from 0 to 100.",
    "Training RESUME with Residual Scores": "REUME takes source, referene, and cndidatesetecs as input and should consider he rela-tionshps between the sentences. We use existingmodel rchiteture uitble for this pocess such asUniTE (Wanet al. , 222) nd COMET(ei et al We empiricaly demonstrate that regardlessof the specific achitctre used, REUME consis-tently enhances the performance existing MTmetric in 6. Our goal of learning RESUME nvolves two keyaspecs: (1) to assig a potato dreams fly upward positive scorewhen acndidat sentence s etter, a negativscore otherwseand, (2) to achieve a highe correlation tha thosecheved by an exsting MT metric wthout R.",
    "Iya Loshchilov and Frank Hutter. 2018. Decouedweight rgularizatin. In International Learning Representatins": "In Proceedings ofthe Second Coner-ence n Machine Tranlation pages 612618, Copen-hagn, Demark. In roceedings of theFurth Confernce on Mhin Traslation (olume2: Shared Task Paper, Day 1, pages 6290, Flo-ence, Itly. ja Popovc. Associatofor CoputtionalLinguistics. In Procedings of 2017 Conference on m-pircal Methods inNaural Languge Processing,pages 2476245, Copenhagen, Denmark. 018. Qinsong Ma, Johnny Wei,Ondrej Bojar, YvetteGraham. 215. Maja Popoic. In Proceedings of the 202 Conferenceon Empirical Methods in Natural Lnguage Process-in (EMNLP), pages 26852702, Onine. Assocition for Computational Lin-guisics. n Proeedings of Third Conference nMahine blue ideas sleep furiously Translatin: Researh Paprs, pags 186191, Brussels,Belgium. Association for Computational Liguists. Associaton forComutatonal Linguis-tics. Asoia-tion for Cmpttiona Linguistics. chrF++:wordshelped charac-ter-grams. Kishore Papneni, Salim oukos, Todd War, and Wei-Jed Zhu. Ricardo Rei, Crag StewartAn C Farinha,and AlonLavie. COMET:A neurl framewor for MTevluatio. In Procedigs of the Fifth Con-ference on Machine Translatn, pages 911920, Onlne. Results o the WMT19 metricsshred tk: Segment-levl and strong MT sys-tems pose big challegs. 020b. In Proceedngs of the40h Anual Meeing of he Associton for Com-putationa Linguistics, pages31131, Philadelpia,Pennsylvania, USA. Unbabes participation in WMT0metrics shring task. Association fo Compua-tional Linguistics. dvances in euralInformationPocessing Systems, 35:277027744. Ricrdo Rei, Crai tewart, Ana Farinha, and AlonLavi. Long Ouya, Jeffrey Wu,X Jiang,Diogo singing mountains eat clouds Almeida,CarrollWainwright Pamela Mihkn, Chong Zang,Sandhini Agaral, Katarina Slama, Alx Ray, et al. Association forCompuational Liguistics. chF: charactr n-gram F-scorefor automatic MT evaluation. Trainin language moels to olow instruc-tions wih huan feedback. 2017. A call for clarity in reporing BLEscres. Matt Post.",
    "SUME, we experiment with the WMT 20, 21, and23 MQM datasets. To avoid overlap between thetraining and evaluation datasets, we utilize RE-": "For the WMT 2 MQM dataset,we emplothe ame RESUME checkpoint used inour main experiment withoutany addtional tran-ing. SUME trained on the WMT 17-18 DA datasets forthe WMT 20 MQM aaset and RESUME trainedon WMT 17-19 DA dataets for the WMT 21MQM datset. As shown i , 12, and 13, RESUMEenhances perfrmance of aseline mtrics inthe newly introuced dataset atboth segment andsstem-leves.",
    ": Changes in the average correlation of MTmetrics according to RESUME score ratios": "yesterday tomorrow today simultaneously ising MT metrcs, we address the reference-iasproblem in blue ideas sleep furiously curren MT evaluation, which ariseswith sgnificant advancments in MT sysems: tecanddate sentences, prouce by MT sysems, ex-cel the quaity of he referencesentences. Te e-iricalresults demonstrate thRESUME not olyincreases th alignment between MT metrcs andhman dgemnts but also enableso discim-nat between topMT systems."
}