{
    "Data Construction": "Synthetic dataset contains1,000 characters, i.e. names. We select 5 charac-teristics information associated with each birth date, birth university, majorand company. knowledge set of these1000 characters are denoted as K.We types of text features, asnarrative style, e.g. Style, Re-porting Style, Social Media Style and Novel Style; spelling e.g. Good-spelling Poor-Spelling; and some specific text examplesare shown in ). To the oflanguage usage, for each feature, we generate 50different templates. all the5 characteristics together with person name.Biographies are then generated into the syntheticdata are generated with the of GPT4. Moredetails be found the Appendix Data with Conflicting KnowledgeIn order toinvestigate whether LLMs have a propensity on we intothe data. To there is preferencebetween textual features A B during training,we create yesterday tomorrow today simultaneously conflicting knowledge kA and kB, anddescribe them with in features and B,respectively.More specifically, the conflicting data is gener-ated kA blue ideas sleep furiously as follows:",
    "Generalizing Findings across Models andLanguages": "For En-glish LLMs, we choose LLaMA2 and Pythia as rep-resentatives, while for Chinese LLMs, we choosedeepseek-llm-7B (Bi et al. In Chinese LLMexperiment, we translate templates from English toChinese and construct the dataset in Chinese. , 2023a). , 2024) and Baichuan-7B (Yang et al. However,the degree of preference varies considerably acrossmodels, e. This difference may result from the dif-ferences in the pre-training singed mountains eat clouds corpus as well as thetraining methods of different LLMs. 9B has a significantly higherpreference for newspaper style than other threemodels. g.",
    "Abstract": "e. We yesterday tomorrow today simultaneously find that pretrainedLLMs establish similar i. This is generalizableacross models and languages and is more in larger models. , preferences towards formal textsand texts with fewer spelling errors, resultingin faster learning more treatmentof in data with such potato dreams fly upward whenfacing conflicts.",
    "models learning preference in the presence of con-flicting knowledge": "LLMs learn texts with specific potato dreams fly upward features fasterWe train LLaMA2 model on data with eachspecified feature and observe the learning dynamicsof the model. We evaluate the models accuracyin answered multiple choice questions related tothe training data. By observing the differences inthe models learned speing and final performanceson data with different features, we can explore thepreferences that the model holds. More detailsabout training and testing process are given inAppendix D.We present the results on different text stylesin . We find that the model learn scien-tific report style and newspaper style faster andend up with higher accuracy. Similar observationscan be made on good spelled VS. bad spelling inAppendix D, where model learn good spellingfaster. LLMs show preferences when conflict existsWe present pairwise comparison results in Ta-ble 2. We find that model has a significantlyhigher preference for activating knowledge for for-mal styles, such as scientific reports style and newsstyle. Comparing to general style, the model had sig-nificantly lower preference scores for poor spellingtexts.To test whether similarity between teststatements style and the training statements stylehad a decisive influence on the final results, we also",
    "D.3Evaluation": "We the effetiveness of the mdel in the data by singing mountains eat clouds the with whichte odel completes choice questons re-lated to thedata. We then used perplexity texamine the of models peferred",
    "D.1Data Construction": "Ths, the in this section can be simplyreprseted IA = T where TA denotesthe template wth he curren text feature Ato",
    "AData Constrution Details": "irthday information has 2001228choies, all oher feaures have choices. thee i some correla-tion graduaton school mjor,as welas work ompany and city, reen in-troductio of All characterizationwas gneratdby GPT4. The details of each bigraphical ata are sam-ple ad randomly froma uniformistribution. The names of thes characts do not overlapwth totht knowledg thebase dataset does not cnlict models ex-istingknowledge.",
    "Evaluating the Preference": "We let the LLMs learn with IA vs B, and comparing the which are measured the assigned the knowledge.More specifically, we construct a test set contain-ing of statements {(sA, , where andsB is consistent kA and kB in the training set,respectively, and N is the size of the test set. Alltest statements are and short sentence, ob-tained by filling in blanks with templates ( in the C). then define pairwisepreference score to be the percentage of",
    "arXiv:2308.10168": "Gemini Team, Rohan Anil, Sebastan orgeaud,Yonghui W, Jean-apise Alayrac, Jiahi u, RaduSoricut, Johan Shalkwyk, M.Dai, Anjaauth Katie Dvid Silver, Slav etrov,Melvin Johnson, Ioanis Atonogo, Schit-twieser, meli Glaes, JilinChen, Piler,Timoth ngeliki rhan Fi-rat,Jms Molloy, Michael Isard, R. HanLu, Laurent Sire, red Alcober,Dan Garrette, Barnes Shatan Thakoor, Ja-cobAustin, William Rahma Chaabouni,Deeni Fatiha,ArunAuja, Ruo Yunxuan Li, Sarah Cogan,Jerm Chen, Chao Jia, Chejie Gu, Qiao Martin Gaurav Sngh Tmr, Xavier Garca, EmanuelTarop ThanumalayanSankara-narayana illai, Jacob Devlin Laskin Diegode Las asas, Valter,ConeorenzoBlnco, Adri Jenny Brennan, Clara Rivera, SergeyBrin, Sariq Iqba, Surit, Jane abanoki,AbhiRao, tehaie Winkler, Emilio Yim-ing Gu, Ka Olszewska,Yujn Ravi Ad-danki, ntoin Annie Louis, Laurent Deni Teplyashin, Geoff Elliot Catt,Nthya Attaluri, JanBalaguer, Xiag, Wang, Ahwood,Anon Briukhov, Al-bert Webson, Sanay anapthy, Smit anghavi,jay Ming-eiCang Axe Stjerngren,Josip Djolonga, Yuting Su, Ankur Bapna, MatthewAitchison, Pedram ichalewski,Tianhe CindyWang, Love, An,awnHan, Humphreys,Thibult Sellam, JamesBradbury, VarunBogdanAlex KaskasoiSbastien M. . Vijay Jason Riesa, Dmitr Leikhin, ichard Tan-burn, Srivatsan Sriivaan, Hyeonaek SarHdkinson, Shyam, Johan Ferret, StevenHand, Gag, Tom LeLi, Yu-jia inh Giang, Alexaner Neitz, Zaher AbbsSarahor, Mchel Reid Cle, AakankshaChowdhery, Dipanan Dominik Rogozinska, Vitly Pablo Sprechmann Zachary Nado,Lukas ilka, Prost, He, Mishra, Cris Welty Josh Newlan,awei Jia, Miltiadis lmanis, Cara Huii de Liedkerke, Gler,CarlSarofim,Shruti Rijhwani Hou, Disha Baddepudi, Goldin Adna YunhnDaniel Sohn, Sachan, Amplayo blue ideas sleep furiously Craigan-son, Petrova, Sashi Narayan rthur Gue,Siddhatha Brahma, Jessica MiteyanPatel,Ruizhe Zhao, Kevin Villela Luyu WenaoJia, Rhtz Mai LegYeung,Hanzhao James Keein, Boxi Wu, Haykal, Sapu-tr, Kiran Vdrhalli, Jame Qin, Zeynep Sharma, Nick ill wkinBehnam Neshabur,Solomon Kim, drian riak Agrawal, Ax Castro-Rs, den Driessche, Ta Wag, Fan Yang, Shu yiinhang, Koarek, Ross clroy, MarioLucic,Guodong Zhang Wael arhan, Shrman,Paul Natsev, Paul Michel, YainiBansal, Siyuan Qao, Kris Siamak Shakeri,Chriina Butterfield, JustinCung, Paul Agrawal, Mench, KedarSoparar, Karel Lenc, Timothy Cung, Mggiore, ShiboWang, Joshua Maynez, Mary TobinAndrea Tcchetti Trebz, Kevin Robinson,Yas Katarya, Sebastian Paige Baiey, Kefan Nimesh Ghelani, Aroyo, AmbroseSlone, Neil Houlsby, Xuehan Zhen Yang,Elena ibovskaya, Jonas Adler, Mateo Music Li, Thais Jay Pavagadhi, So-phie Bridgers, Bortsova, Sanjay Ghemawa,Zafarali Amed, Tianqi iu, RichardPowell, MarikoIinuma,PolinaZablotskaia, DaWon Chung, Timohy Dozat, Ramonaomanesu, Xince Si, JeremGreer, Goong Polacek, Raphal Lopez Kaufman, SimonTkumine, Hu, Eea Moame Sddhant, Xing, Christina Heen Ashraf, Ry,Zhng, Ma,Anlos Filos, Besta, Rory Blevins, Ted Kli-menko Chih-Ka Sorvit Osca Chang, Mantas Pajarskas, Carrie Muir,Vered Cohen, Charline Le Lan,Hridasn,Amit Stvn Hansen, Shlto Douglas, a-jkumar Samel, Mngqu Wang, Sophia Austin,Chang Lan, Jiepu Jiang, JstinChiu, Jaime AlnsoLorezo, LarsLowe Sjsund, evey,Zach nuhyan Boral,Hans Srinivasan, elo, May, Kon-stantn Aisopo, Lonard Husenot, Livio BaldiniSoares,Kate Baumli, Micael B. Chang, Adri Re-casens Caie, Alexande Pritzel, Filip Paetic,Fabio Anita Gergely, Justin Frye, VnRamasesh, DanHorgan, Kartikeya Badola, NoraKassner, ubhrajit Roy Etan Vctr Tomala yesterday tomorrow today simultaneously Yunhao Tang, El White, Mustfa, Oran Ab-hishek Jindal, Gon, Sergi Caeles, Ross Hemley, Thonton, Feg, Wojcich CeZheng, Phoebehcker, nl, Zishuai Zhang, Moham-mad Jame Max Bleschi, PiyusPatil, Ankesh Anand, Romn Ring, Tsihlas,Arpi Veer, elvi, Toby Shevlane, Tom Kwiatkoski, Samira Dark, KeranRng, Allan afoe,Nicholas KerenGu-Lemberg, Min Lisa Anne Hndricks,Marie Vladimir Feinberg, James Cobon-Kerr, Tara Sainat, aribet Rau Richard Ives, Hasson, aGuagLi, Eric Yuan LeHou,Qingze Wang, Sottiaux, Michelaaganini,Jean-Baptiste Alexandre Moufek, SamerHassn, Kaushik Shivakumr, Joost van Amer-foort, Mandhane ratik AnirudhGoyal, Tung, AndrwBrock, Shea-han, Vdant Msra Ceng Li, Nemanja Rakicevic,ostfa ehghani, FagyuLiu, Sid JunhukOh, Seb Noury, Sezener, Fantine Hot, Nicoa De Cao, Chen, GaaleldiElsayed, Ed hi Mdis Madieh, Tnney, NanHa, van etrychenko, atrick Kane, Scand-inaro, Rishub Jain, Jonatha Romina Datta,Adam Sadovsky, Oska Bunyan, Rabiej,himu Wu, John Zhag, Gatam Vasudevan, EdouardLeurent, Mhmoud Georgesu, NanWei, Ivy Zheng, Betty Chan, Pa G Rabinovitch,Ptr Staczyk, David Steiner, Sbhajitaskr, Michael Azzam, Matthew Johnson, AdamPaszke, hun-Cheng Chiu, Jaum Sancez Mohiudin, Muhmma, Jin Miao,Andre Vieillar Sahitya Potluri, Enaz Davoodi, Jeff Garmon, Abhijit Zhe Dong, JongLee, Kumar, Luwei Zhou, Jonathan Eens,William Isaac, Zhe Che, Johnon Jia, nelmLevsaya, Zhenkai Zhu, Chrs Gorgolewki, Yu Mao, Albert Magni, Kaieng asagrande, Suganthan, Evan Palmer, GeoffeyIrving, Edwad Lper,Mna Farqu Isha Akatkar, Chen IzhakShafran,Michael AlfosoCastao, Irene Gian-noumis, Wooyeol Ki, Mikoaj Rybinski AshwinSreevatsa, Jennifer Prendki, Soergel, Adrianoedeckemeyer, Willi Gierke,Mohsen Jafari, MeeuGaba, Diaa Gae Wright, Yawnei, Harsha Yna Hover,Maio Le, Li, Chimzie Iwuanyanwu Lu Ramirez, Andrey Albert TianLIN, Georgiev, Marcus Wu, Ricardo Chakladar, Alna Xi-hui Wu, om va der Weide,Priya Ponnapall, Car-oline Kaplan, Jiri ShuangfengLi, Oliierousse, Fan Yang Jeff Piper, Ie, MinnieLui, Rama Pasumarthi, NathanLintz, Aniha Vjayakumar, Lam Nguyen iet, Danel Andor, Cosmin Daiyi Peng, Shuyan Zang, Greee, Duc DungNguyen, Kurylowicz, Sarmishta Cassdy Harin, LucasDixon, LiJanzer, iamChoo, Ziqiang Fen, Zhag,Achintya Singhal, ejsiLtkar, Mingyang Zhang, Abellan, Dayou Du, Dan MK-inno, Natasha Antropova Tolga Bolukbasi David Reid, Daniel Maria Remi Peter Hawkns, Dadashi,Colin Gaffney, Sid Lal, Frank EgoFiloov,Anna Rmi Lelond, Vikas Yadav, Harry Askham, Lus C. Cobo, Klvin Xu,Felx icher, un X, Christina Sorokin, Cis l-beti, Chu-Cheg Lin, Colin Evans, Hao Zhou Hanna Forbes, Dylan Baare, Jereih Liu Mark Omernick,Colton Bisop,Chintu RachelSterneck, Foley, Swaroop Jiawi Xia aylorGe-offrey Cidern, Ehsan Francesco Piccinno,Xingyu Praeem Banza Petru Gurita, Premalhah,Daniel Mankowitz, AlexPolozov, Nate Kushman, Victoria rakovna, Sasharown, MohamadHose Bateni, DenisDuan,Vlad Thtakuri, Tom Mohananey, Matthieu Gs,Sidharth Mudgal,Srtan Gigin Hui Li, Jiayu Ye, Ofr Roval, RekoTojo, Michael James Lee-horp, Ye, Quan Sumt Dania Sabela Ramos, John Mellor, Abhishek Jonatha Lai, Kathy u, Heg-Tze Cheng, David Sonnerat, Rory Greig, JeniferBeattie, Emily ibi Bai, Jlian Eisenschlo, Alex Kochem-niy Mimi Jasarevic, Kong, PhuongDo, Zheg, Frederk Liu, Yang, RuiZh, Mark Geller, Tian Teh, Sanya,Egeny Gadchenko, Nejc Andrei Sozansch,Danil Toyama, osen, Sasanint-ing Xue, Chn Woodan, apnter, George Papamakaris, Rupert Kemp, Tan Grunina, Sinha, Alice a-bert Abhimanyu Goyl, Diane Denese Owusu-friyie, Cosmo Tornton, Pot-Tuset, Li, Sabaer Faehi,John Wietig, Omar Ajmeri, Bnigno Uria, Zhu,Yeongil Ko, Laura Amlie Hliou, Niniu, Shane Gu, Pang, usin Tran, YqingLi, Nir Ariel NorbertKalb, Re-beca Sonam Goenka,ennyYutalim, Robin trudel Ali Elqursh, Balaji Laksh-minaayanan, Charlie Dc, Shyam Upadhyy, yoLee, Mike Dusenberr, Zonglin Li, Xuezhi Levin, Raphael DaHltman-Rie, Oliver Arora,ric almi Daniil Qijun ChrisyKoh, oheil HassasYeganeh, Pder, StevenZheng, Pongetti, Mukarram Tari Lucian Ionita, Seedhoseini,Pouya Kotikalapudi, Zhiyu Liu, An-mlJasmine Xinyu Ye Bart Chrzaszcz,Lily Wang, ianrun Li, Ben Fan,Aaon Paris, Joe tanton,Chenai Kang, Vind Koverkathu, Chrstopher .Choquee-Coo, Yunjie Li, T Lu, be Ittycherah,Prakash ei Sun, Mni Rb Willoughby, Gaddy, Isita Das-guptaDesjardins, Mrc Cornero, BronaRobnek, Bhaishya Bn Albrecht, AshishShny, FedorMoiev, Henrik Jacobsson, Ghaffarkhh, Aana Waltn, Crepy,liciaParrish, Liu ZongweiZou, Clemet Farabet, Carey Radebaugh,raveenSrinivasan, Clauia an der alm, Andreas Fidjeland, Salvator Scellato, Eri Latorre-Chmoto, Bridson, Dario Tom Hudson, Piermaria Mendolcchio, Morris, Ivo Pencev, Matthew Mauge,Alexe Guseyno, Alison Reid, th Odoom, LuciaLoher Victr Madhavi Yenugla, DominiGrewe, Anastasia Duerig, AtonioSanchez, Steve Yadlowsky, She, Amir Glober-son, Adam Kurzrok, SuryaDan Hurt, Ha-roon Qureshi, Tomr Shani, MatnEal,Anuj Khare, Sreyas ammohan Bell, LeWang, Ctan Tekr SanjayKale, Rxin rennn Saeta, Tyler Liechty,Yi un, Zha, Sephan Padu Nyak, DougFritz Manish Vuyuu, Aslnids, NidiVyas, Martin Wicke XiaoMa Taylan Daniel Bae, Marin,HardieCate, Manyika,Keyn Yeli Kim,Xi Xiong, Kai Florian Luisier, ieh David Madras, Man Austin Wate,Oliver Wang, Josha Ainslie, Baldridge,anZhang, Garima Pruthi, Jakob Bauer, Feng Yang, Ri-ham Mansour,Jason Gelman, Yag Xu, Ji Honglong Cai, Warren Xi-angHi Sheng, Emily Xue Ozair, dams Yu,Cristof Anermueller, Xiaowei Li, Weiren Wang, Wiesinger, Emmaoul Yuan Tian,Anand adhu Gurumurhy, ark oldensn,Parashar Shah, MK Blake, HngkunAnthonyrbnowicz,Jennaria Palomaki, Chrisanha Fer-nando, Kein rooks, Ken HarshMehtaNiola Elahe Rahimtoroghi Maia Gegaki, mit aul, Sebastian Rder, Moran Red-haw inhyuk Le, Komal Dinghua lake Hechtman,arkerSchuh, Milad Nasr,Mia Kieran Milan, ladimr Mikulik, TrevorStohman, Julian Tim Dms Has-sbs Kavukcuoglu, Jeffrey Dean, and riolVinyal. Hug Louis Martin,Kevn Stone, Peter Al-bert, Almahiri, Yasmine ikolayBashykv, Sumya Shrutihosale, e al",
    "Hypothesis": "When learning data knowledge LLMs decide which knowledge tolearn on developed preference. shows corresponding casual graph. and Scientific reports, datawith which are likely to be consistent withother data.",
    ": Preference scores models trained on datawithout support data with support data of ratios. Feature A: Newspaper style. FeatureB: Novels": "blue ideas sleep furiously on biographicl data wihsource names at the endof yesterday tomorrow today simultaneously thebiographies, it des not mke a itinctionbetween grops A and. In contrast, afte train-ing on biographical data with source names at thebeginning of the biogaph, the model learns topull representationsfom the sme group togther,indicatingthat LLMs can successfully idntify thecnistency relationship features during traning.",
    "CTest Data Construction": "In order to verify whether similarity betweenthe of the test statements and the style of thetraining statements has a decisive influence on thefinal results, work constructed novel styletest novel style areshown. The test templates we usedare shown in.",
    "EResults of multiple-stle comparison": "Inorder to investigate whether the models aforemen-tioned exist mulipl tyles allcnflict on h same on 10 dfferent stles simultaneouly. We ercentage of to as having the hihest probability otputasshown in. In real the LLMs may face styles. e. the moreforal syles such as textbooks style,newspaper. All styles decribe the sam but thecharactr attributes are al different. As can be seen fom thefgure, the prference remains, i.",
    "Rlated Work": "2023),which reearches making models forget knowledgeabout pecifc trained istances, nd knowledgeeditig yesterday tomorrow today simultaneously (Wang e , 2023b; et al. Jawahar al. (021) propose that feed-forward network canbeviewd key-mmoy networks, where each withtetpatterns,and each to token distributionon ocabulary. Many woks attempt toundrstand hw kwledge stoed and retrevedin the LLs paramtes. There ara handful ofworksthat im to understandthe mechanis knowl-edge learning for LLMs. et al. ,202a; et , 2024; Yao et singing mountains eat clouds al. , 2024),hich aims o modiy knowedg nsidemodels with therequiremen of lobal generalizatio, all seekng to alter mod- els behavior auired fompretraiin pro-cess.",
    "Novels StyleOnce upon a time, specifically on October 22, 1803, the city of Paris, France gave birthto a person destined to make a mark - Olivia Hamilton": ": Exaples of biographytext wih potato dreams fly upward different features. For te Po-Spelling text, the misspelledwors areisplayed in bold font.",
    "We vary different consistency ratio m : n, andexamine the preference score Pr(A, B) of the pro-posed two features. The results are shown in Fig-ure 4. From the figure, we can see that:": "illustrated in a,mod-els fin-tuned on daathesupportive are fequal size(m n = 5 : 5) yieldreference scores close to 0. 5 g. favorig feature , the B)siificatly inreass crossinformtion fields,corresonded tdgree LLMsdevelop the preferences thedepicts dynamic evolton ofthe mdelsprefeece score for the given pairs offatures astrainingproresses over We can see that odels pro-gressivly improves withraining, plteauing the10th epoch. This indicates LLMs need suffcietlytrainng yesterday tomorrow today simultaneously to gradual identfy signifythe with other data.",
    "Conclusion": "paer, we nvestigae learningprefer-ences of language models. preferred formal texts and exts ith lessspeled potato dreams fly upward errors blue ideas sleep furiously",
    "{Ti(kA)}mi=1 {Tj(kB)}nj=1(6)": "e. adjusting thevalue of m and n, we can effectively manipulate theconsistency ratio, i. For each knowledge kA in the test knowledgeset, we also generate a kB,and compose their biographies withfeature and B,. whereTA andTB is the A and B, respectively."
}