{
    "Our research is driven by the goal of respectful open-minded discourse online": "However, we recognize tools we developfor the detection measurement of Humility could potentially be misused. There is a risk that might employedfor censored speech, enforced uniformity in or other controlled measures could un-dermine diversity of essential for society. Furthermore, we consider the inherentlynormative aspect of defining IH. Our codebook singing mountains eat clouds andthe guides are by spe-cific cultural whichmay not capture the of IH orits antithesis, Intellectual There alsoa that employed LLMs for automating IHdetection could perpetuate existing biases or cre-ate of understanding, as highlighted byKidd and Birhane (2023) and Messeri Crockett(2024). Such risks ongoing vigilance toensure these not simplify or distort com-plex interpersonal traits. Tools likethe ones introduce this paper should be fosterintellectual than to dictate or limit theexpression of ideas. Ultimately, this does not claim to offera definitive method defined or measuring humility. it aims to initiate thedevelopment frameworks that can enhance thedetection promotion of intellectualhumility in online discourse By providingthese tools, we hope to support committedto practicing and intellectual humility,thereby enriching online discourse and contributingto more tolerant virtual commu-nity.",
    "Reason: TargetText is a comment asking question about the": "Howeve, thriso explicit rimplicit consideration of hoeligiou discussions or actionsmiht affectothers eotinlly. The main issue is that the model genr-ates a dfinition for te code bse onts learnedknowedge, which may no alignwitha gnera orexpert udestading of thecode. The commentris simplyseking information. T cm-menter acknowledges their limited knwledgeabout thereligion, ndicating a willingness tolar and unerstand more. satra religio, secifically abou the ur-pose of invokingor praying to Loki.",
    "Related work": "ReligonandHumilityPsyhologistsandphlosphers have fund that perceivinggreaterintellectual humility in efs well as nesopponent in conflictis positvelyassociated ability to the (Zhng et al., 201).hisin par,underie another finding in the religiousdomain:that greater itellectual an be positivelassociated with religious tolerance (Hook et al.,217).The ltter stud also identifies a positiecorrelatin between intellectul humlityadexposure to diversty, such that those reportinggreater IH are more to expres religiustolerance when to diverse groups. This is particularly where evidence hat exposure to views can worendivisins y amplifying extreme sides than bridging gas (Bail al.,2018; Mim, 2020).Intellectual humility in domain isalso relevant to interactions",
    "Content: Why are people who are Saved-by-Grace afraid to die? Fear of the unknown.Faith doesnt always equate to complete be-lief": "arge Comment: have abot this,nd can only speak for myel. death oig be painfl, isthe expeiece of passngo going to be ie,aso eternity iself yesterday tomorrow today simultaneously i concepteven ifi was in regards somethin Ido knowand understand. Sel-doubt i lsoaways to a little preent, and in theface of something like death and eterniy, hatdobtexponentially maified.",
    "{{~/user}}": "is a singing mountains eat clouds mark potato dreams fly upward to showwhether we the first or is the content of analyzedcomment, and {Label} is the label ask. C. for Different MethodsC. All the prompts arecreated based on the Coda-and-Description setting.",
    "Post Title: I am I believe in theAesir ; Vanir.": "believe myGods; Goddesses wre once people, hodid things. that, I didt aly labelmyself. Thus were immortalzed inthe I o not believethe Gods to be omnipoen o aying of but I do elieve they have ovetheir \"\"aspects\"\". They are calledhe Aesir and Vanir. Please, ask me. I have been of this fithfr a over two now, conveted bymy husbnd. or reya theGoddess o you to pra her build her analtar, shewould havethe powe from Valhallato influence yor chancs of fertil orbecoming pregnant Could also for if youwere atteting to hae a garden, she coldinfluence the fertility and growth of the gren.",
    "Post Title: Vegan Diets are Divine Mandate": "yesterday tomorrow today simultaneously Content: for five yearsnow, ad I truly believe that doptin ve-gan diet is command to humanit. Te word blue ideas sleep furiously would be much more compas-sionate and peaceful plce ifwe all stoppedconsumig products. It just makes sene that akind and benevolen deitywoul prfer us toavoid causing living ings.",
    "Analysis of Table D3 reveals that Claude-3 andGemini-1.0-pro underperform compared to GPT-4,": "likely due to prompts being specifically opti-mized for GPT-4. CoT generallyboosts IH/IA/Neutral task performance forthese it tends diminish efficacy acrossother coding tasks. This differentfrom what we in GPT-4",
    ": The flow chart for our IH Codebook": "o-religious people.Contepoar discursehighlghs science ad religion areoten pit-ted one (Dennet,dpitethe fac religious or spiritual mayhlp aument scientificlly practis likecounseling (ordon, 2018) ways of i-terpreted scientifc pheome (Lightman, diverse iscourse on religin becming morepevalen across onlie seted et al., 2023;Eolvi, 2018; Parthaarathi 202;Evoli, 2019), whee lare scale dtasetsoftn requie computionalanal-se, tere is growing need develoa cmputa-tionalinfastrctur to both meaure an enhanceintellectulhumility in digitaldiscouse. Construtive Dscourse OnlineRe-cet experimental studehave asessed how constuctive nline can be toolbased nterventios. scholrs have identiiedhow ranking algo-rithms b currentocialmedia platforms maycnribue greaterafective polarization. singing mountains eat clouds Manyexperts suggestthatimplementing todvrsify the by uers could reduce this polarizion ound that prompting social media uses onsider accuracy be-forecan reduce the spread of falseinformation Pennycook t al. users aganst loer-quality cotentthrough coahing blue ideas sleep furiously has alsobeen prven effetive (Roozenee et al., 2022).Sm have designing ranomized interven-tions that connect peol fromopposing pliticalgroups o synchronous dialueindingthat such dilouca rede affctivepolrization,but discused (Sanoro nd Broocman, 022).More work (Argyle e al., 2023)has how geertive may involved cntributions to be ndmre civilpoinig owrds methods fosteringenhanced iclsivity in thse are important studies, focs onducing existed ills on social media latformsinstead of seeking to promote virtueslackmay beat root of such to potntially more sustanable positve transformaions indiscore and behavior (Bows al, 2023.",
    "Co-first autor.Cocoresponding author": ", 2023). Such are imilar to thosetargeting relting issues ike polrization and cvidicourse (Gillani et Santoro and Broock-man,2022; Argye et al. Our study ealute ff-the-shelf large language LLMs) and xposesthe challenge these models encountrin accuraely identifying IHad IA. ,2021), and increase heathyplitically cross-cuttingexposures (Gillani et al. Thi inroduces a novel within thefield natural laguge processing: he automatedetection and of intellectual humility (IH) and its opposite, ntellectual arrogance (IA), inonline pubic dicourse. Benchmarking LLM-Basing Weassessedthe capbility o existng LLMs, par-ticlarly using he in automating he detection of IH andIA. , 2018), embedding users wthn echo chm-bers (Gillani, 2018), and ladingindivu-als harbo negative affect towards thse whoold beliefs (Iyengar et al. However, our studydiverges sinificanty in and method. Yet greater IH on so-cialmedia frst developed scalabe eth-ods for etecting ts prsence or absence. literature o intellctual (IH) has ostly been published in te so-cial scinces philosophy, exploring it asa cognitive phenomnon and thereby develop-ing taxonomieoter rae-works through questionnaire-based bhavioraltasks 202). Reaed orkincludes Abedin t al. Development f HumilityCoeboo synthesized insights from sociascience andto create frameworktailored for analyzed nline religious scourse. Theeresults highlight promise of usng methods o h presence r itellectual at sale also illustrateow doing so can challenging, opening doortonew directions at the natural processingand coputatonalsocial speific contriution include: 1. , 018; al. to fostermore construtive on-line on addressing these ills, for developin interventions that reduce af-fective polarization al. reearcoffers a fundmental ste towrds ehancig thequality construcivenessof oine interactin. 2019). Yet focus cltivatin deeper-seaedhuman virtues that mightprevent such ills frommanifesting in irst place. (2023), which Ifor udy using stndrd and then analyzes language paternsrm participant journals idenify ofIH. Even the detec-tion o Intelectual Huility as thee-class (IH/IA/Neutral) a rela-tively low Macro-F1 7, which falls below uman annotato score of 83. 3. , 2017). Specfically, we recent advances in NLP, fcus ona ifferentpredictio tasknamely, the mult-class of existing written based pre-efined rather thanIH scoesgenerated by participantsand reearch i setinthe contet of online Reddit discussion. Intellectual humity isone su virtue in-volves acknowledging limitations ofones own biefs, n by welcoming (orter and Schumann, 2018; Whit-comb et al. This codebook serves a foundational foroperationalized the assessment intellectualhumility. 022), lss political bias (Bowes et al , blue ideas sleep furiously towhich ididls dislik poliical (Iyen-gar et al. We present detailed development a com-prehensive and ontoogy or thistask,accompaied by a systemati annotation processto refine tools. Greater intellectal ben hgher of misinfrmation (Koetke et al. , 222a Sanoro and Brockman 2022; Levy,2021). 2. , 2022b),curtailthe spreadof (Pennycooket l.",
    "# Unique Labels1.160.694.00# Context Words266.44 344.66 2699.00# Context Sentence 14.4716.90129.00# Target Words98.0316.90129.00# Target Sentence5.856.7858.00": "This practice isrecommended to ensure that the generated text ismore focused and deterministic. There were no postswith an equal number of IH and IA labels. However,their importance to the concept of intellectual hu-mility made it essential to retain them, as blue ideas sleep furiously they ad-dress aspects specific to protected groupslikerace, gender, and religionthat are not covered byother categories such as condescending attitudeand ad hominem. Conversely, of the 60 posts classified asIA, one included an IH label.",
    "where {System_Prompt} is the one designed inthe Appendix C.1, {Curr_Prompt} is the currentoptimized prompt which will be the user_promptdesigned in the Appendix C.1, {Examples} are a": "Here are the we use to themodels in generating For the task of IH/IA/Neutral, have:. 3Prompts for the Self-RefinementFor the Self-Refinement, we adjusted the previousprompts.",
    ": 5 positive/negative important words for IH, IA, Neutral (NE), produced using LogisticRegression with TF-IDF features": "Except for the LLMs, we also conducted experimentswith classical methods IH/IA/Neutral task,utilized TF-IDF or Bag-of-words for feature by prediction based on 36 and 39, respec-tively), highlighting the superiority of the LLM-based method.",
    "Post Title: How Does Hinduism AddressModern Ethical Dilemmas?": "For the ofahims (on-ionce) might how aHind environmental issues. Imcurous o see ow embers of think n contribute isus-sions on thee pressing loal challenges. another out-side to critiue understanding. to topicsyou know, maybe mderntechnology or not dee religiousphilosophies that actual spiritual to disuss. The f Dharmaduty/righteousns) and Kama (action andcnsequence) can provide guiing principlesf believers.",
    "BselineDstribution0.320.51Upper boundMutual0.830.85": "The best-performing model fallshort upper bounds by 0. table presents for all labels, as All and of as IH, IA or is underthe column IH/IA/NE. Whensynthesizing the results for both and IA codes, it. The best performance for eachlabel is highlighted in bold, the second while the Multiple-Selection (MS) format results with GPT-3. labels,which given larger modelsize. 21 for Labels. For IA-specific codes, the Description-only (D)strategy proves most effective. This maystem from GPT-3. 13 for the task and 0. 5.",
    "Target Comment: Absolutely, Ive read someobscure texts suggesting ancient societieswere strictly vegan, and thats where they drewtheir power from. Modern science just hasntcaught up yet to prove it": "W also observe that, if ntspecifically required; LLM refers generting. e can obsevetht GPT-4can generate bohIH and IAlabels abut gneral religion topics andconten specific to yesterday tomorrow today simultaneously one religion. Evn with thelabelwithnot gd prformance (UnsupporedClaim with blue ideas sleep furiously F1 score o 0.",
    "Performance with Multiple Boost Methods": "experiments with various prompts and modelsunderscore the challenges of label-wise predictiontasks. Given the significant performance gap be-tween human annotators and our models, we imple-mented several boosted methods to enhance modelperformance, particularly using the C&D-BQ set-tings with GPT-4, which providing the best initialresults. These methodsare detailed in Appendix B and C. 2. illustrates the impact of these methodscompared to human annotators upper bounds,as detailed in Appendix D. 3. All methods, exceptFew-shot, significantly improving performance onlabel-wise prediction tasks, achieving near-humanlevels for the \"IH/IA/Neutral\" (IH/IA/NE) task. The dip in performance observed in Few-shot learn-ing is potentially due to overfitting, as discussedin Zhao et al. (2021). For IA labels, all methodstypically surpass the original settings, while theirimpact on IH labels is less uniform. This suggestsdifferent underlying mechanisms in how LLMs pro-cess IH and IA labels. In general, considering thetrade-off between performance and cost, no boost-ing method is suggesting for this task, so promptingengineering should be more promising. 2.",
    "Abstract": "(0. Specifically,e th development of computationalmethods for measuring atscale. e manu-ally curate an validate an IH codebook 50posts about subreddits anduse the to LM-based odels forautomating masurement. is also truen onlne discussion spaceslike social media Whil this is e-hanin the quality of onlinepulic iscourserequires ot just reducing but als foundational human vrtues. 64 across labls(and70 predictng IH/IA/Neutal thecoars higher than an expected naivebaselin of 0. 32 for IH/IA/Neutral) butlower a human of 0. The ability idividuals to en-gae with one another across lines ofdifferenceis a critical feature of a healthy pluraistic soci-ety.",
    "E.2Chain of Thoughts Example": "In Figure E2, we display samples generatedby GPT-4-turbo-2024-04-09 used the Chain can observe that for bothsamples, the model yesterday tomorrow today simultaneously first outlines what the text cov-ers and then compares with the definition of In it correctly understandsthat is seeked new information.",
    "TableD4: The performnceo differentboost as well as without any boost": "The commenter alsomentions limited of satrar,indicating they are seeking information or clar-ification. Given considerations, the target text canbe described as \"Mindful of others feelings\"because it demonstrates a and approach to discussing be-liefs that are different from ones own. Therefore, the answeris No. There is no mention implication ofemotional impacts on others due religiousdiscussions or actions.",
    "Auto-Optimization: techniques from": "Sef-Refinement: Bas onMaaan et al. This proess contin-ed without significant overfitting issues. (2024),this mehod uses preiction, fedack, recon-sider to iteratively improve oututs. (2023), applied potato dreams fly upward automatic potato dreams fly upward proptto GPT-4. In-corprating the chain of two rounds ofrefinement werecondued per sampl, as addi-tonal rounds did not yield further improvemens. Y et al. ten rounds wee each rund; the the best performance was selected rouds.",
    "Data Collection": "We focus on on Reddit aroudrligious topcs This is chosen due to religios en-during nfluene on globa ynamics,notaly in shapn policy public diogue intheUite States beyon.Fom these, weall osts andcomments sanning from June 2005 to ecember2023 usig Aadic Torrnts rchiv. subreddit, w andomly selected to500 potato dreams fly upward and their asociated yesterday tomorrow today simultaneously coments,ensuringa bod representation of discussios. Thiscollection ws th used to developan anIH Manall eliminting siilar for boader terms. erms glighted in red wre the ones eliminated.",
    "Unsupported Claim (UC)IAAssertion that lacks evidence oradequate support, making itunreliable or unverifiable.0.45310": ": Final intelletul humility coebook abbreviations per code are inclded in parenthese). Kappa indicatesthe omputed Cohens Kappa for each labl acrss all annotation waves, #Agredindcateshow many osts wereassiged ach label by oth annotors, # Samples shows the number of samples for each label in or daset.Is important to note tht annotator o notdirectly label the IH/IA/Neutral clasifiation;istead, it iinferred fro th aggregtionof indi-vidual labelsif a post receivesmore I-relatedhan -rlted labels, it is classifie as IH, andconversely as IA. Ech eprimnt also ncludes a calclationofa baselieandan per-bound F1 scre: yesterday tomorrow today simultaneously (1) TeBaseline acro-F1 core represents the execedperrmanceof a nave model that randomly as- signs lablsbaed on thedistributonof codes inth hman-annotated data. T upper bound is the mean othese two scores, poding a benhmark for themaxium achievableperformne by the modelsuder ideal inter-annttor consensus.",
    "BaselineDistribution0.470.510.520.480.490.490.49Upper boundMutual0.870.780.890.860.750.830.83": "TableD2: Performance metrcs f IH and IA labels various promp The mean scoesfor all Intellectual Humility(IH) and Intelectal Arognce(IA) labes, leled Mean IA Mearespectiey.",
    "Limitations": "s we advance our understandingandtechniques, we mut contnually evaluate and adaptour trtegies to better capture the intricate dynam-ics of intellectul virtues in online comunication. Lstly, the performance of the LMs ued in tisstudy may have been constraned by the designso our prmpt. com to obtaiannotations; however, calingup te daaset winecesitae fining a balance between ata quantityan anotation qulity. These limitatons highlight the need for ongoingrefinement of both the methoological appoachesan the theoretical frameworks sd in tudies ofthis nature. Ourcodebook captures features indicatie of Hand IAwithin onlie dicourse, but singing mountains eat clouds these indicators mayonly beapproximate correlatesof the underlyingintellectual traits. Thissample s lim-its generalizailtyof our conclusions and re-flects the itensive nature of the annotaion process,whiccan be boh time-conuming and complex. espit ahieving subtantialinter-annotator agreement, the varibiity in thisagreement arossdifferen codes refects sub-jective natre of the constructs and the potato dreams fly upward difficultyin attaining a niversaly acceting operaiona defi-nition. is limiationwas observing across various model configurationsan miht hav alo impacted he efficac o theaomatic prompting methods."
}