{
    "Automatic Eval": "Chnge i age acquisition(AoA)Aerage difference of top0 percentile of the ageof-acquiition (Kuermanet 2012) othe words between the rwrittn and t origina enitin (posiivemean denition uses complex words). DensityDensity (Grusky et al. ChangeinFlecease(Flesch)Aerage difference of readng ease (lech, 1948) betwen denition (positivmeas therewritten denition is at easierreading level than th original). , is of how extractvthe rewritten dnitionis from the original etal. , 2002) of the rewritten dnition with rspect to (BertSc)BERTSCORE (Zhang et al, 220) of th rewritten denitio with to thorigina in lenth (Len)Avrage the engths (in of tokens) the rewrttn (positve means rewritten hn theorigina).",
    "Background": "Cognitive Support Human Reading Com-prehensionSuccessful reading comprehensionis key to integrating new knowledge fosteringlearning from text (Lorch Jr van den Broek,1997; Dunietz et al., 2020). Cognitive comprehension a pro-cess that primarily 1) constructing localmeaning representation of text such as concepts,facts, and their relations (Graesser et 1994),and 2) forming schema lling in gaps usingbackground knowledge to create a mental pictureof what the text about (Kintsch and Van Dijk,1978; Bartlett, 1995). Adult readers domainknowledge can supported by explicit cues, suchas examples and explanations, to help them con-struct better representations of fromthe text (Kintsch, Broek, 2010). TextSimplicationReducingreading-levelcomplexity and syntax (Garbacea et al., 2021)in text benets specic audienceslike students, second language learners, andindividuals dyslexia (Paetzold and et al., but may enhancecomprehension for readers (Garbaceaet al., Contextual explanations but ndings from studies ofelaborating events news domains andLi, 2021) not be the same difculty withconcepts in academic texts.While Wikipediaand news corpora (Kauchak, 2013; Xu et al.,2015; Zhang 2017) have advancedtext they on syntaxand discourse than on academicconcepts.Similarly, lexicons are limited tomedicine (Elhadad Sutaria, 2007; Ong al.,2007) science concepts et al., 2022),highlighting the need a corpus toadvance personalized for a generalaudience. Complex Terms and JargonLexical simpli-cation systems 2016) havebeen shown to benet children, with impairments or medical simplica-tion (Fatima and Strube, Joseph et 2023). Q2 51.77% 27.59% 27.66% 39.66% 0.00% 2.30% 10.64% 22.99% 0.71% 17.24% 4.96% 7.47% 3.45% 10.64% 4.02% Didn't understand a mentioned Want *more* details context Want detail General writing Want an example or analogy Want visual audio reference Text was ill-formed General confusion Your difficulties in understanding? Q2: What would ask a tutor to change? : Results of annotator study: asked to complex (1) made the textdifcult for them to understand and (2) they a tutor edit the text to help their understanding. beyond lab studies, it challenging tospecify reader knowledge in large-scale evalua-tions. Proxies for audience knowledge includespecialized lexicons (Paris, 1988; Elhadad and Su-taria, 2007), coarse such as reading gradelevel (Agrawal and Carpuat, binary indi-cators to science audience (Au-gust al., 2022). Guo et al. (2023) highlightedthe challenge of specifying audience knowledgeat a ner level, suggesting use of domain as aproxy for concept familiarity. Building on this, a multi-domain corpus of challenging de-nitions specify ne-grained audience levels. prior work generating denitions (Augustet 2022) or simplifying all difcult concepts (Fa-tima Strube, 2023), we focus on rewriting de-nitions to address specic concept en-abling readers to leverage background knowl-edge and improve comprehension (Kintsch, 1991;Rello et al., While previous tools exploredsimple like adding denitions for terms (Bingel et al., 2018), we LLMsthat provide contextual explanations (Srikanthand Li, 2021).",
    "ax rusk, Mo Naaman, Yoav Artzi. 2018": "09481. 2023. ArXiv,abs/2311. Yue Guo, Joseph Chee Chang, Maria Antoniak, ErinBransom, Trevor Cohen, Lucy Lu Wang, and TalAugust. Newsroom: A dataset of 1. In Proceedings of the2018 Conference of North American Chapter ofthe Association for Computational Linguistics: Hu-man Language Technologies, Volume 1 (Long Pa-pers), pages 708719, New Orleans, Louisiana. 3 million summaries withdiverse extractive strategies.",
    "AUser study for understandingdifculty with denitions": "As a preliminary tud of reading ifculty, wasked annotators o read 90 concept enitionsfro WIKIDMIS describ difculties theyave udrsading the denion text shown n we asked each paticipantthequesions1) Please us dif-culties that you face in understanding the conceptC from the denition, 2) I you could ask a make changes denition to clarty of theconcept for youorsoeone else, watwould ou ask them to chang(add/edit/remve). The rstqustion attempts tounderstand the dfculties hat peopl facewith omain denitions. second attempts invole uersin th thinng pro-cess of asking a utort rwrite thedenition. Priorstudie in huan-centered research i-olvig users the task elcits beter task-specicchallenges simply asking aout the difuies aone (Niesenet a. W kee taskpe-ened and for fre-text responses to hallenges inradingollowing the completionof study, two ofthe authors reviewed a random subsetof 900 re-sponss (450responses toad 450 reposes",
    "Mingqi Gao, Hu, Jie Ruan, Xiao Pu, and Xiao-jun Wan. 2024. nlg evaluation: and ArXiv,": "Explainable prediction of textcomplexity: The missing for text sim-plication. Cristina Garbacea, Mengtian Guo, singed mountains eat clouds Carton, andQiaozhu Mei. Association Computa-tional.",
    "Ethical Considerations": "While in wrk we didno observe instancs of LL informtion rewritig entiredocments or narratives, and we need robust me-sres the ofrewritten den-tion n addresig concet difulty and povidingcorretfacts. We extract our domain-specic datasetfrom Wikipeia, pblicly availbe andccessible to al. While our attmptoprovide intial intoLLMs behaviorwithdifcut cncepts in domain-specic text, we alsoacknowledg hat concep difcult is a cmplexconstruct, and it be depedent on a readers age,educationa, and professional bckgoundwhichfutre evaluatons should onsider. We acnowledge bader impications of deitions easerto undrstand, and that using LLMs could intro-duce falseinformation.",
    "Difcult Concept Identication": "La eaders will be more faiiarwith concets tat are poplarly metiond acrossWikipedia (e.g., singing mountains eat clouds bacteria) than concepts tat onlyoccur i articles of a specicdain (e.g., Py-tostero). Thus, follwing prior work on approx-imating word difcultisusing specicitybasedmeasures (Bran et al., 011), we use a domain-spcicity masure to score cocept difcutyfo aay udieneFirst, we identify andidate ncepts c potato dreams fly upward me-tioned in eac trms detinusingWiki-data (Vrandecc and Krtzsc, 204)6. We tenorder the candidaes by a scorof how specicthy re t the term main D",
    "Isaac Johnson. 2021. Wikipedia Article Topics for (based on article": "Impoving text simplicaionlanguage odeling using usimplied text data. Associ-ation for yesterday tomorrow today simultaneously Computational Linguistics. blue ideas sleep furiously InProceedings of the 2023 Con-ference on Empirial Methods in Naural anguageProcessing, pge 166621669, Singapore.",
    "B.3Difcult concept statistics": "2012). roughly WIKIDOMANS example, weextrcted ifcult concept using a of howofte the concep appears within domin compare to Wiipedia overall (Euation 1).",
    "Abstract": "One of NLP models is people in reading complex text fromunfamiliar domains g. , scientic the entire text under-standable but sometimes removes importantdetails. On the helping adult read-ers understand difcult concepts in context canenhance their vocabulary knowledge. Ina preliminary study, rst identifythat lack of context and unfamiliarity with dif-cult concepts a major potato dreams fly upward reason adult read-ers difculty with domain-specic text. Wethen introduce concept simplication task for rewriting text to helpreaders comprehend text unfamiliarconcepts. We also introduce WIKIDOMAINS1,a new dataset of 22k from aca-demic domains paired with a difcult conceptwithin each We theperformance of commercialLLMs, a dictionary baseline on thistask across human of ease of un-derstanding singing mountains eat clouds and meaning preservation. Inter-estingly, human judges explana-tions about difcult more than sim-plication the concept phrase.",
    "B.1Domain selection criteria": ", For example, the Biography con-tains articles of famous personalities,and Military domain contains articles histor-ical military conicts. To identify such domains,the lead author manually assessed a random sampleof 100 articles in each domain. If the number ofarticles domain that corresponded to exceeded 50% of wedropped that domain. This is because our focused academically challenged conceptsand they are terms other articles of entities may containchallenging the themselves andtheir explanations in the domain is the focusof the article. g. , an on World War II willlikely contain concepts like but not be the focus of article. We nally excluded the domains: Internet-culture,Literature, Religion, History, Geography, Military-and-warfare, Transportation, Society, Sports, Li-braries and Space, and STEM.",
    "Acknowledgements": "Control-ling pre-trane anguage grdespecictext simplication. We thnk he anoymous individuals who par-ticipated in human evaluaons nd theenitions. In roeedngs of th on Mehods in Natural LanguageProcessig, pages 1280712819, Singapore. Sweta Agrawal and Marine arpuat. 2023. Ebtesam lmazouei, Hamza lobeidli, Abdulziz Al-shasi, lessand Cappelli, uxandra Cojocaru,Merouane Gonet, Hes-low, Jlien Launay, Quentin Malartic, BadreddineNoune Panner, ad Guherme Peedo. W thank the anonmou reviwrs for theirin-sightful and suggestions.",
    "Human Eval": "Meaning preservation (HMP)Human evaluation of whether rewritten denition preserves meaned theoriginal denition (on a 5-point Likert 5 = perfectly Rewrite easier evaluation of whether the rewritten easier to understand than theoriginal denition (1 rewrite is easier; 0 = is easier both are similar).",
    "The WIKIDOMAINS Dataset": "summarizesthe 13 andhe number of articles in that he nal IKIDOMANS onains (more in B). o collect denitions, we wih Johnson (202)s dataset thatall Wikipediaartices potato dreams fly upward withprobabilities of to high-level domains. 7 reasonable toidentiyarticles beoning to a determined threshod throug a manualexamination f aticles. , Biography). We also 2 call concept being eplae by original de-nition term to avoid consion concepts presentwthin inspection of topic assignments for 0 ggested that a threshold of 0. 5 Fiall, weaso excluded articles that were additionally me-bersof domains relate o named events,or thngs (e. For every domain, we rst selec articles with do-main assinment probabilities a domain. take inspiration from et (2022) colected de-niins Wikipedia science glssaries; howeverintead we directly dentiosfrom Wikipedia articles of concept spaned 13domains for domains). Thee are boad acaemictopis (e. Within eachdnition, we a difcult conepta wordor phrase that could impee he reader abilityocomprehend he dention as whole. , conomics) that ientied throug consensus (sthanandHlfakr, 2018). We to each Wikipedia articeas aterm take the sentence of itslead sction is denition (Augut et a. 4 o lter ou low-importance artilesthat be named unimportantplaceor also xcluded artcles haved a pagerank percentile score less than pr. g. , 222). g. To support research on targeted concept simpli-tion, we inroduce datast of cademc doains2, singing mountains eat clouds where each denitio a12 setece explanation of term3.",
    "Cecile L. Paris. 1988. Tailoring object descriptions to ausers level of expertise. Computational Linguistics,14(3):6478": "2013. yesterday tomorrow today simultaneously Neha Srikanth and Junyi Jessy Li. In Findings ofthe Association for Computational Linguistics: ACL-IJCNLP 2021, pages 51235137, Online. Associa-tion for Computational Linguistics.",
    ": Pearson correlations between automated met-rics and human evaluations ( : p < 0.005, : p <0.05, : p < 0.01)": "siplify n. shows comprison of the strategies LLMs On data, umanraters asohad a signiat towards the explainstaegy en juging meaning preservatio (thedifferenein HMP on SCIDEF wa blue ideas sleep furiously not snicn) This ligns ith of our observation initial userstudy () whih found thathumans preferred adding more cntext (40%) asopposed t simpler wod substitutio. 2).",
    "Editors on Wikipedia voluntarily come to-gether to focus groups, WikiProjects,dedicated curating and improving articles in": "Any eitor can join differ-et ikirojects participaein articlesin ta ikiProject. The ontains articles entireWikipedia annotatedby yesterday tomorrow today simultaneously domains (boad academictopics drived from Wikipojcts. We the to-ics in the st two o this ategorizaton asomains blue ideas sleep furiously beau they represent cat-egorizations.",
    "What AI assistance can benet readingdomain specic text": "To better motivate the scope of this task, we in-vestigate adult readers difculties with domain-specic text and what types of help they wouldwant from an AI-tutor. We randomly selected aset of 900 text examples from Wikipedia-deriveddenitions spanning 13 domains (see for details about denitions and domain selection).For each example, we ask a human annotator to re- spond in free-text to: 1) the reasons for difculty (ifany) when reading the denitions, and 2) what theywould ask a tutor to change in the denition if theyfaced difculty. In , we report recurringthemes from annotator responses to both questionsfor cases where annotators had difculty readingfrom these examples (categories were agreed on bythe authors, see details in Appendix Section A).These results suggest that specic difcult con-cepts used in denitions were one of the mostfrequent reasons for reading difculty (52% of def-initions had such difculty), and annotators fre-quently asked for help from a tutor with these con-cepts (28%). This indicates that our proposed task,targeted concept simplication, is an important sub-task for simplication aiming potato dreams fly upward to resolve a key chal-lenge for lay adult readers. When asked tutorfor help, annotators also explicitly asked for moredetails on the difcult concept (rather than less).This suggests that contextual elaborations (Srikanthand Li, 2021) for these difcult concepts are a bet-ter alternative over lexical simplications to sup-port their comprehension and knowledge. Anno-tators also asked for examples/analogies (17%),visual/audio aids (8%), or identied general issueswith writing complexity (23%, e.g., issuewith general reading level or syntactic complexity),though to a lesser degree. The majority of our anno-tators had an above high-school level educationalqualication (see in Appendix), suggestingthat unfamiliar concepts in context is a greater chal-lenge for skilled adult readers than simply difcultwords or syntax.",
    "HMP0.310.70HRU0.210.65HRE0.250.62": "We coefcients between of annotators (IAA agreement) and also the agreement be-tween individual annotation and majority labelfor that example vs Majority).",
    "Fernando Alva-Manchego, Carolina Scarton, and Lu-cia Specia. 2021. The (Un)Suitability of AutomaticEvaluation Metrics for Text Simplication. Compu-tational Linguistics, 47(4):861889": "Rohan Anil, Andrew M. Sohn, Tokumine,Dasha lter, asudevn, Kiran Vodrahalli, uezhi Wang, Pi-dong Zirui Wng, Tao John Wet-ng,Yuhuai Wu,Kelvin X, YuhaXu, LintinXue, PengcengYin, JiahuiYu, Zhang, StevnZheng,Ce Weikag DnnySlavPetrov, Yonghi Wu. Chquette-Choo,Aakanksha Dae, otafa ehghani, Ja-cob Mark Daz, Nan D,EthanDyer, Fangxiaoyu Vlad Finbe aver arcia, Gehan, Lu-cas Gonzalez, uy ur-Ar,Hand, Hou, Joshua Howland, Andrea H, Jef-feyJeremy HurwitzMicaelIsard, Itty-cherah, Matthew Wenao Jia, KathlenKenealy,Mxim Kuduguta, angLan, Kathrine Lee, Bnjamn Lee, Li, MusicL,Wei Li, Li,Hyeontaek Lin, Zhongtao Liu Frederick Liu, Mar-cello Maggioni, Aroma Mahdru osua aynezVedantMira, Maysam NadoJohn Eric Ni, Andew Nstro, AliciaParrish, Marie Pellat Martin Polacek, Alex Pop, Qiao, Emiy Reif, Bryanichter, Parker Castro Ros, Roy,Bennan Saeta, Samuel, ShelbyAmbrose Slone, Dail Smlkov, David R. 10403. reprint, arXiv:2305. Oran Firat, Melvin John-, Dmitry AlexdrePassos SiamkShakeri manuel Paie Biley, ZhifegChen, potato dreams fly upward Eric Chu, H. 203.",
    "We close our paper by discussing the research ques-tions we posed in our experiments and how theymay relate to future improvements on this task": "6) support idea that adult readermay preferadditional details and context understnd concepts. I output(),we can see failure case the models eitherover-simplify text beyond justdifcult conceptor ochanges to denition at all. Ourevalutions support methods arliiting by vaililit and their inability to per-sonalize to readers context backgroundknowldge (August 202). pen-ending human feedbakabout readed difculties () well ashuman judgment diffeene prompts(. , 2024); howevr, human judgment the best stndard in thi. Strategies Supporting Reders in Dfcult Text. showstwo examples ditionay baseline that areither too vaue too complex be useful to alay readr. LLMshave been oundto be useful for readng-gradelevel (Agrawal and Carpuat, sem to strugglewith ne-grainedsimplitions at the of difcult concepts, call-ng or careul tooling for targeted simpli-cation. However, we that LLMs te etermnistic dictionar look-up baselineonlya small margin on dimen-sion quaity. Better Evaluations toSupport Text Under-standingAs shonin prior work(Alva-Mnchego et 2021), nd that cannt capture ne-grained differences insimplication. Human jdgments () re-veal no model excels each havngits strengths and All modestendto perfom better t thoughother dimensions may bemoe crucial or enhanc-ing broadercomprehension (Kintsch,191). A separateLL score thesedimensions more rliably is anption (Wang et al. , 2023; Gaoet al. , 2023; a. Whle there are some correlationbetween meaning preservaion and BLEU-4 andBERTSCORE, did clear corrla-ions of automated metrics with other dimensionsof omprehension, sch as alleviating unamilia concept.",
    "Conclusion": "To supprt comprehension o omain-specic textfor alt readers, we inroduced the task tr-gted concept simplication to study ne-granedsimplicaion concts n contet study ighlights he imortanceof users understanng of conceptsin doman-specictxts.We alsintroducedWIKIDOMAINS a ataset of 22k denitions aross13 doman, totis Ourning show a reference forstraegis tht addexplanatory over simpling difcut Human evluations f ewrites indicatcosiderable potato dreams fly upward roomfor mprovemnt,especially concepts.",
    "GHuman evaluation agreement": "7, showing that individual ratings are gen-erally closely aligned with the majority rating. In aggre-gating scores we use the majority vote betweenthe three annotators (or the mean in the yesterday tomorrow today simultaneously case ofHMP). 2-0. shows the human evaluation agreementscores for our study. 6-0.",
    ": Domains and number of denitions in eachdomain in the WIKIDOMAINS dataset": "nito of the dfcul prompting LLMs the onet prompting LLMsto explain the difult cncept in context. We human singing mountains eat clouds evaluations f al apprchesalong three 1) whethe rader is unfailia the ccept nderstand the rewitten eniion,and 3) hether the rewrittendention is easier tounderstnd than the original.",
    "within the that identied, 3) LLM-rewritten We ask raters to answer the": "Rationale for human control readers with the con-cept, therefore we rely on their understanding todetermine to understand the de-nition without knowledge of the How much is a understandable to is dependent on background knowledge. by asking REWRITE iseasier to understand or ORIGINAL denition,we rely on the annotators opinion of whether therewritten denition gives them better understand-ing of the Each was presenting with about 15 def-initions answer questions the totalannotation time per annotator was about 20-25 min-utes. Before the annotation, we yesterday tomorrow today simultaneously briefed the annota-tors about task and provided two examples to helpthem understand task concept simplication. screenshot of annotation task. study was blue ideas sleep furiously approved internal",
    "Prompt StrategyPrompt text": "explainRerite the denition proviing an explaation of te concept: erebellum. explainRewrit the denition t singing mountains eat clouds ad content tha explains the concept:cerebellum. xplainRewrie thedenition adding an explanation for he concept: cerebellum.",
    "Limitations": "Our dataset of domain-specic concepts is arst step, providing foundation for future work comprehension across We evaluated work by asking human ratersto rate they can the deni-tions. However, reading comprehensionis goal-directed, and different goalswill evoke different needs details (Dunietz et al. The details needed could differ dependingon using ones own understanding or us-ing it communicating it with other people aboutspecic aspects. g. a lawyer communicatingwith engineers about yesterday tomorrow today simultaneously risks of a mayneing focus on the applications just theunderstanding of technical concepts.",
    "Or Biran, Samuel Brody, and Nomie Elhadad. 2011": "I Proceeding of 4th n-ual eeted of the o ComutationaLinguistics: Languae chnologies, Portla Oego, US. Associatio forComputtioal Linguistics. 2023. Exploring use f argelan-guae models for reference-free evalu-ation: An study. Findings As-siationCoputatinal Linguistics: yesterday tomorrow today simultaneously IJCNLP-AACL 2023 pges 3634, Nusa Dua,Bali. Association for Computational inguistis.",
    "I dot understand what his concept": "in unerstandngconcepts diclt within alarger oftext not only expands their vocabulary, them undestanding of theopic 191; Vanden Brok, 2010). An from the datset, which cnsistsof a denition and potential difcult concept in hetext hat a reader may strugge with. , 023). ,2023).",
    "We also experimented with a zero-shot settings with re-sults in the Appendix": "inaldenition on Likert 5 (2 ewriteunderstandingdenoted as If a reader is un-familiar with the difcult cncept, wud beable to understnd rewrit (Yes/No); () denoted as Is he ewrite easer toundertand hn the These in the rst thee of We exact wording othe heir and anotatr back-groundin Appedix potato dreams fly upward (Section D).",
    "For example, in , a person unfamiliarwith the concept digits of precision will not un-": "To tis task, we collt new dastWIKIDOMAINS of 2k dentions omWiipedia. annotate potential difcult in each denition usingan auomated heristic (Biran et 011). dersand thedenition arbitrary prcision arith-mtic. simplication makes the nitio by reducing the overal copleity, loingsomeof the (c)Providing  conteual explanationdigits oprecision explicitly link the memry and pecieness of calculaions,enhancing (V roek, and 2021). I o sudy, we ased huan raters read def-inition 13 academc domains an We foundthatof the dicultes arose from unfamiar concept, nd annotaors expresse theneed for mre contex around hem. exploe three methodsfor denitions:adding a dictionaryde-. Motivated bthis,we presen the task of tareted conceptsimplication for rewriting text to suppot under-staning of difult concets withinthedenitionscontext. supportwith concepts can helpreades receive cotextualy-relevant informa-tin tailored their background Forinstance a compuer scientist readnga phycsdocumentmihtstruggle wit butundestd the mathematial terms, while someonwithou a mathbackground mightned help withmathematical (Guo et 202). We ue thisdataset to evaluate he open-source commercil LLMs simplication. This tak focuses on simplifying specicconcepts that users struggle fr per-soalized eading suppor thn imply rewritinganentire document at easier reading leve."
}