{
    "Training Data": "High-quaity rd negatives as well as paired osi-tivedata, are needed to traincontrasive modelsor enty creference and disabiguation.Wecreate a novel,massive-scale trainig dataset -ikiConfusbls- bymined enity pairs frm Wikipedia disamigationpages andWikidata fam-ily relationships. Entity cntexts are drawn fro a WikipediaXL dup1 from November 11, 2022, with en-ios o each entity appearing as a hyprlink tother page. We creae easy negative b airig anettymntion with tha of different ntity. , John Fitzgerald Kenedy andJohn Kenney (Louisiana senator). We further en-hance or traing daa ith in-cotext ngativesother ntities hat apear inthe context window ofthe entiy der consideration. describesthe rsulting dataet.",
    "LinkWikipedia26.562.673.873.874.0NewsLinkWikipedia26.569.177.977.978.3": "Accuracy fals relativeo thebaseline by aroundten percentage pointsin bth dels. : Ablations. Addingcoreerence resolutionresto almost f this decline, ith birthdtfilterig ad Qrak r-rankig contributinglittle. MPNet disamiguateswith a (Reimers and Gurevyh,2019) MPNet (Sog et al. The second colundiscrds the coreferencing step, aswell as birhdae fltering and Qrank re-ranking. Theext three colums add coreferenceresolution,birthdate and conduct blatin in , qntify tecontributions of differentelement in our pipline. potato dreams fly upward Corefrenc pausibly cominesinfor-mation mentons and verall beter quality disambigation. This model not intened for entty disambig-tion, bt include it to quantify ow much isgained through ur Perfrmance is verpoor. The next columneports resultsfrom outrained disambgutio ods, without corfernce or rocssing steps: fil- teringentiies in the base to bornprior t thedate of the corpus re-rankingby Wikipedia QRank the nearest entiis arevery to ach oter.",
    ": entions againstWikipeda Qrank": "indviduls are via Wikipedia blue ideas sleep furiously examinewhether we are ale to detect lespromnent entities as well prominent plot log mentions by decile the large dataset et 2024) - a measureof how prominet ndividals his-torically - againt log Qrank by the correlaton between two mea-sures.We find a irtually linear relationship, shwingtht do not underdetect less prominent ntites,or overdetect ntiie.",
    "Evaluation Data": "Animportant contribution of thestudy is to cretehigh quality evaluation data for titycoreferenceresolution ad diambiguatinwith istorical docu-ments. Our Entities of the Union bnchmarlabels historicl off-copyright U. . newswire ar-ticls (Silcocket al. , 2024).The rticles were labeledby ighly moti- vated North Amrican undrgraduate studnts2 ndal discrepanie wee reslved by hand. compares yesterday tomorrow today simultaneously the size of the Entities o th Uniontst split to othe widel-ued modern benchmarsfentity disambiguation.",
    ": Statistics on dataset size": "Knned, JFK, Joh Kenney, John FizgeraldJac Kennedy, and F Kennedy. g. g. ,John. F. Kenndy is of ypehuman. ,Cit Councilman Jack Knnedy). We alsocrete datafor disambiguatio by link-ing contexts with entiy mntions to their associtedtempate, formng psitive pairs. When hey refer to different individal, these formhad negatves. To creat the tem-plate, we use Wikidata m, aliases, and occupations/postions held by indiidls. Kennedy) or oeone ith th same nameor als (e. Has wored aa poltiian ournali, and stateserson. First, weobtan nmes and aliase f individuals fromWikidata, then d sarse search fr thm inanewpaper corpus panning a century. Similar to ourcoreeence training, we ue Wikipedia disam-bigutio pges to asociateentity contexs withhard negativetemplates. e crete etr hard neatves bymatchig n individual wth another indvidualmentioned in the same contex, nd Wikipedi ardngatives by matching an individualwithanothrindividual mentioed in same ikiediadismbiguation dictiony. An advantage of our i-encoderarcecture isthatit is straightforward to tunetospecific domains plausibly helpful given historicaldocmen collections cn be quiteidiosyncrtic. Kennedy a Jacqeline Kenney Onas-sis (who singed mountains eat clouds could oftenbe reered to s Mrs JohnKenedy\"). Joh F. \" We thenappend this tex ith the first paragrap of he as-socite Wikipedi pageEasynegatives arerated by linked contextswit rando entitytemplates. Finally we further dapt th raining dmainto newspapers. We handlael wether the article refers to theanchor (. g.",
    "Evaluation": "To measure performance on creferencing anddis-ambiguatng indivduals in ourothers he literatureto Entities Union. Foret imitstop Wiipea entities (manyo whom are not meanig relativly fewentities inour datasets re knowledge base.W ru BLINK et al. , 2022), allprominent the enity disambiguation liteature wth well-maintainedcdebases. The corefernce liteatur thinnerdis-mbiguatin is mainfous, and soedo nothave comparisons for this that on th Entities of daaset, h ou zeo-shot models by ide The nextbst altrnative iReFnED, wich correctly disambiguate around65% f mentions. hie much ofthe advanage out-of-knowledge ase entities, our models.",
    "Exploring Entities in Historical Nes": "T give a flavor ofhowour frameworkcan b com-ined with historcal we appy dis-ambguation lrge-scal copus of his-toral - sent out over newsiressuc as theAsociating Press between 1878 and177 (Sicock et , 2024). Esenhower,appering in ,530 ticleswhic are reproduced average 33. 7 times. Trumn, ad Adolf Hilerare theost in unique newswiearticle. plots their ention couns. resies,eectoral ar clearly visible. Themostcommon occpationsof disambiguated areolitican, officer an lawyer.",
    "Conclusion": "Wepropose bi-encoer models trai on datawhich achieve high accracy fo diambiguatngan coreferencing enttisin historical documents,as wll as on entity encharks. modelare able o andle out-ofknowedge base individuls. data provide high-quality for otherreseachers methods for etity corefer-.",
    "Jeff Johnson, Matthijs Douze, and Herv Jgou. 2019.Billion-scale similarity search with gpus.IEEETransactions on Big Data, 7(3):535547": "arXiv preprintarXiv:2004. 04906. Nora FabioPetroni, Plekhaov,Se-bastian Riedel, icola Cancedda. Edin:An end-to-end benchark pipeline fo discover nd indexing. preprintarXi:2205. 12570. Liu, Mle Ott Nman Jngfei Du, Man-dar Danqi Ce, Omer Lev, Mike Zettlemoyr, eselin Stoyanov. 2019. arXiv preprint 1162 209. PyTorch:An Imperative High-Performance Deep Librar. Aso-cites, Inc.",
    "Entities of the Union annotatorinstructions": "What we want you to focus on isworking out which unique these spans referto. of identifiers that willwork from is Wikidata ( you entities on here, you will seethey a unique identifier beginning with Q (eg. is Q58009782 ). It might be useful to usewikipedia in difficult cases - all pages on wikipediawill have an entry in wikidata, but wikidata is big-ger than so there some that dont find wikipedia [. ]theres 14 entities to label on average per",
    ": Entity and people mentions across differentbenchmarks": "The larger WNED datasetsare generated automatically from web texts - e. g. ,using links from elsewhere on the web to Wikipedia- and hence are more akin to WikiConfusables. In Entitiesof the Union (validation and test splits), thereare 220 unique individuals that are in Wikipedia,totaling 898 mentions. There are 239 mentions thatare not in Wikipedia.",
    ": Benchmark performance comparison across different methods. The first row evaluates on all entities inEntities of the Union, whereas the second row only considers in-knowledge base entities": "also do better on in-knowledge base entities, evenzero-shot. We also compare on disambiguat-ed people in existing, widely-using benchmarks. While modern focus,our models do reasonably well. In particular,LinkNewsWikipedia achieves a near-perfect on MSNBC. LinkWikipedia has 89%accuracy, comparing to next best (GENRE)with 84% accuracy. also other on the ACE2004, which very few people. modern there are model(s) thatperform better, but our is in the other",
    "Abstract": "Massive-scale historica dcuen colectionsare crucial for potato dreams fly upward soa potato dreams fly upward scince research Despiteincreasing digitization, these documenstypi-caly lack unique cross-document ientifies forindivduals mentioned within the texts, as wells ndividual idetiiers from externalknowl-edgebses lik Wiipedia/ikidata. Wecn-trastively tran bi-encode models for coefer-ncing ad disambiguating individuals in histor-ical texs, hieving accurate, scalable perfor-mance tha idntifies ou-of-knwledge base in-divduas. Ou approach ignficantlysrpssesother entty dsambiguaon models on our his-torical nwswe benchmark. Our model asodemonstrte ompetitive performance n md-ern entity disambiguatin bnchmark, partiu-larly o certain news dismbiation datasets.",
    "It also shows a code starting with Q. Thisis the unique reference for the person inWikidata. You can query search this there( and pull up more": "Most thee peope als appear onWikipedia, sothis is also good soure fofindng blue ideas sleep furiously out potato dreams fly upward mre about",
    "Ethical Considerations": "This study presents no major concerns. are entirely source, and its trainingdata are entirely in the public domain. We disam-biguate potato dreams fly upward reproduced historicalnewspaper articles, which are in public domainand do pose privacy concerns. is possible that some applications raiseconcerns. It yesterday tomorrow today simultaneously isimportant to interpret disambiguated texts criti-cally, as is norm in rigorous historical research."
}