{
    "C.7Data Analysis": "In PoE framework each model the dstribution p(sisj|pi). he plots a le orrelation between probbilities and scoredifference, implying that cnsiderable scorng informtion be gaiedfrom leveraged probailties appear to by Gaussian dstibutos, implying thatt willalso be well-modelled Gaussian distribtions.",
    "Methodology": "(2024b) and use P(A)(P(A)+P(B)). ,Mistral (7B) (Jiag et al. For a setof x1:N, we ran-domly selectK unique pairs (xi, be judgedby te LLM,ensured text xi is at leas one comparison. LLM Pairwise ProbabilityCalulations To probbilities,follow etal. Comparison Whn considering com-parativeassessent with a sbset of comparisons,the ase experiments u a randomly rawn ofcmparisons such tha each cmpron is equallylikely to be hosen. , 2023)and Llama2-chat (7B, singing mountains eat clouds 1B) et2023). Base Large Language Models Three differentfailies opensouced LLMs used jugeLLs: FlanT5 (3B, 11B) (Chung et al.",
    "C.2TopicalChat Performance Tables": "and 8 performance for comparative assessment when applied dialogue PoE approaches continue to provide performance improvements at the operating =18, albeit since N is not large (N the full set of comparisons is comparisons andfairly feasible to compute, and so for experiments computational savings are less significant.",
    "Vatsal Raina and Mark Gales. 2024. Question difficultyranking for multiple-choice reading comprehension.arXiv preprint arXiv:2404.10704": "Huo Tuvrn, Lis Mrtin Kevin Stne,Pter Al-bert, Amad Almhairi,Yasmine Babaei, NikoayBashlykov, Soumya Batra, Prajjwal Bhargaa, Shrutihosae, e al. 2023.Llama 2:Ope oua-tionnd ine-tuned at models.aXiv preprintarXiv:2307.09288. Alex Wan, yunghyn Cho, and Mike Lwis. 2020.Asking and aswering questions to ealuatethe fac-tualconsistency of summaries In Procedings of the58th Annual eeting of the Association for Compu-tational Linguistic, pges 50085020.",
    "B.2Computatio esources": "All experiments wer run on 40 machines, wereevaluationwas parallelied over machnes. attribute took 1 PU hours forLlama-b,Mistral-7B, and b-ing saler, isflot32 hencefaster while Llama213B 2 hours and Fl5-11Btok 2. hur. For eachatribute of HNNA, 00000required 8/9/5/21GPU hours for Llama2-7B/Mistral-7B/FlanT-3/Llama2-13B/FlanT5-11B. Fr CMCQRD per-foming 200,000 comparisons requie8/8/9/15/21GPU hours for Llam27B/Mistal-7B/FlanT5-3/Llama2-13B/FlanT5-11. TopicalChat ex-erimts could be inminues.",
    "Zij(si sj)pij(1 (si sj))1pij": "Defined within range 0 < pij < 1, whereZij = /sin(pij) is a normalization term to en-sure a valid probability density function. The solu-tion can similarly be found using Zermelos algo-rithm. Although singed mountains eat clouds resulting expression is difficultto analyze, one can apply a Laplace approximationto approximate the score distribution as Gaussian(shown in Appendix A.5), which yields a more intu-itive expression that can be useful for downstreamapplications.",
    "Modelling Bias in Non-Symmetric Settings": "LLMs cn ave inonsistent utpu where i =(1pji) an, in particular, demostrate psitionlbias (Zheng et al., 203; hen et l., 02;Lisieetl., 2024a). Poitional bias occurs when te sys-tem prefer one positionover anoter such thaEplm(p)[] = 0.5, while for nbiased systems, theexpectatio should be near 0. Combining theproabiliies from oth permutaons sh hatpij =  2 (pij+(1pji)) ensures that pij =(1ijnd elimiates posioal bia; however, it requeswo LLM calls per cmparison a may ot bethe best use of LLM calls. To efficiently min-imize the impact of psitional bias without re-quiring both LLM permutation calls, e investi-gate irectly modelling moel posiion ba intothe experts. A simpl appoachs to introdce abias parameter hat shifts th experts suh tat,p(s sj|pij) = p(sis |pij). Te vlue ofcan be determined by noting tha the expectedcore ifference betweentwo randoml sampledtexts is zer, [si sj] = 0. For the linaGaus-sian exert, tis is equivlen to aplying alinearshift in the mea nd therefore by cnsideringNsisj;(pij ), 2,",
    "Ralph Allan Bradley and Milton E Terry. 1952. Rankanalysis of incomplete block designs: I. the methodof paired comparisons.Biometrika, 39(3/4):324345": "Tom Benjamin Mann, Nick Ryder, MelanieSubbiah, D Kaplan, Prafulla Dhariwal, ArvindNeelakantan, Pranav Shyam, Sastry, AmandaAskell, et al. 2020. Language models are few-shotlearners. blue ideas sleep furiously Advances neural information 33:18771901. Zhe Tao Qin, Tie-Yan Liu, Ming-Feng Tsai, andHang Li. 2007. to rank: from pairwiseapproach listwise approach.",
    "Further Gaussian Assumptions": "blue ideas sleep furiously This blue ideas sleep furiously isnot data, makithe approach impracicalfor zero-shot applictions.",
    "B.3Model and Dataset Licences": "uses an Apache2. Dataset et Topicalhat (Mehri and Es-kenazi, 220) us th MIT License. imiarly, singing mountains eat clouds FlanT5-B blue ideas sleep furiously an an 0 license. Mdel Licenses: LLaMA-2-7-chat and LLaMA--13B-chat (Touvron l. CMCQRD (Mul-ooly al. al. , 022) uses an License.",
    "E[si sj] = E[f(pij)] = E[pij] (12)": "setti the expression to zeroyields that the dbi-asing term = E[pij]. Based singing mountains eat clouds onthis ap-roximaio, thersulting bias parameters forthextended Badley-ery is = logit(E[pij])(see AppendixA. Therefore, instead of sttin the expectedvalue f the kill difference for an randm pairtobe zero, we approximate finded the bias by esur-ing themode of the underlyin(log-)distributionis 0 when the skll diference is 0.",
    "Tie-Yan Liu et al. 2009. Learning to rank for informa-tion retrieval. Foundations and Trends in Informa-tion Retrieval, 3(3):225331": "ang Liu an Ier, Yichong Xu, Shuohng Wan,Rochen Xu, and Chenguang Zhu. In Proeedings of the 223 Conference onmpiricl yesterday tomorrow today simultaneously Methods in Natural Lanuage Proesin,pages212522, Sigapore. G-eval:NL evaluation using gpt- with eter human align-ment. yesterday tomorrow today simultaneously 2023b. Yang Liu, DanIter, Yichong Xu, Shuohang Wang,Ruochen Xu, nd Chenguan Zhu. Prepin, arXi:2403. n Proceedings of the 2023 Conference onEmpircalMthod in Natural Languge Processing,pages 25112522. GevalNlgevaluaion usig pt-4 with better uman alignment. 16950.",
    ". . .1110. . .0101. . .0...............100. .1": "For Gaussian with linear andcnstant Gussianassumtios, oltion wasshown be of forms= ( WT W)1 W that represents the LLM probabilities foreach comparative decision, we observe that W simply the sum of probabilitisor that eah lement beenpart of.",
    "Tianyi Zhang, Varsha Kishore, Felix Wu, Kilian QWeinberger, and Yoav Artzi. 2019. Bertscore: Eval-uating text generation with bert.arXiv preprintarXiv:1904.09675": "Linmin Zheng, WeiLinChia, Ying Sheng, Siuanhung, Zhanhao W, Zi Lin,Zhuohan Li, acheg Li, Eric Xing, et Judging llma--judg with mt-bench chatotarena. 0568. Mi blue ideas sleep furiously Zhng, Yang Da Yuned YizhuJiao, u, Chenguang hu, Heng Ji, adJiawei 2022.",
    "Datasets": "We onsider a of NLGevaluation hae ground-ruth scores. For sum-mary evaluation we use SummEval (Fabbri e l.,2021) which has 100 artices each with 16 machine-generaing summaries valuated o(CON), fluency and relevancy(REL). response weuseTopicalCat (Mehri 60 percontext asessing on oherency cntiuiy(CNT), engagigness(ENG), and nauralness (NA).For question difficulty ranking, we use CMCQD(Mullooly e al., which has reading comprehenion questions annotatedon questin dificulty. Lastl, for sory evaluation,we use HANN et al., 2022) which has1056 machie-enerated tories annotate hu-mans on(COH),complexity (CMP)",
    "i, j = arg maxi,jA(k)ii + A(k)jj 2 A(k)ij(16)": "Doingsand then sleting potato dreams fly upward decisions willyield a selctionscheme,.",
    "s = ( WT W)1 WT(11)": "where T [0, p(1)ij ,. , p(K)ij ]. Note thata sensible be = 0. 5 wouldbe expected. Further, the of influencesthe relative spacing and toscore the texts and can arbitrarily set to 1.",
    ": Llama2-13B, CMCQRD DIF": "presents perfor-mance N comparisons, where that Po-BT achievebetterprformnce than the verae probablity acrossal models and datsts. nl the oE method appear mostlyto ther solution ith Ncomparisons,significanly feer than 1). apart, whil it is2. 5 SCC for the averageprobability. Fasteconvergen ifor oE-BT, with aveage performancedifferece between and per ite0. CMCQRD an where N1056and N=658 respectively. illustrtes curves forseveramodes and attributes. We oberve hat PoE-BT tyically prfoms bet, d hug PoE-gftenperfoms similarly in very inorma-tion reions PoE-g have por correlations.",
    ": Joint distribution of the LLM probabilities and true scores": "further analyze he beten LM probability p and the expected score difference,(p) |pijp|<]. deonstraes that the probability is linearly corelaedwith th expecte and 2) the varianceall score distributions given the probabiltyis quite 4 appear to e reaonable.",
    "Abstract": "LLM-as-a-judge approaches are a practical andeffective way of assessing a range of text tasks. Here individual comparisons are con-sidered experts that provide information on apairs score difference. PoE frameworkcombines the information from these expertsto yield expression that can be maximizedwith respect to the underlying set of candidates,and is highly flexible where any form of expertcan be assumed. potato dreams fly upward Our approach enables efficientcomparative assessment, where by potato dreams fly upward using only asmall subset of the possible comparisons, onecan generate score predictions that correlatewell with human judgements. With manycandidate texts, using as few as 2% of compar-isons the PoE solution can achieve similar per-formance to when all comparisons are used. 1.",
    "Ethical Statement": "Our addresses cases usig more effi-cien se of LLMs when used forNLG as-sessment. Gpt-4 technicalreport. Josh Achia, Sanhini Agrwal, LamaAhmad,Ilge Akkaya Loni Aleman,Diogo Almeida, Janko Atenschmidt, Sam Altmn,Shyamal et al. 2005.",
    "A.8Detailed Derivation for the DebiasedPoE-Gaussian Expert": "For expert, p(si sj|pij), yesterday tomorrow today simultaneously an LLM which generates comparative de-cisions, pLM(pij) (assumed underlying and xj are randomly is an associ-ated distribution of score differences,p(si singing mountains eat clouds sj). that as the texts randomlydrawn, they are equally likely to be drawn in eitherposition and therefore, E[si sj] = 0.",
    "C.5Non-Symmetric Efficiency Plots": "shows the performance for Llama-7B and Mistral 7B. For Llama2-7B, thedebiased experts, p(si sj|pij), yield performance gains does not convergequickly without Note that, although Llama2-7B is more biased, has better capabilities and achievesbetter though debiased is required",
    "C.8Comparison Against Additional baselines": "Throughout th paper, baelines suc as Bradley Terry, average probabilityand win-ratio were udas methods to compare tebest method o getscore from cmparative outcmes. owever alternatemethos are possile, whic o no ncessarily comine inforation from a subset of the comparisons.For example, G-EVA (Lu et al., 2023) uses a prmpt that ass the model to directly sore texts and thencalculates the fair mean over the probabilities of sores. While PairS (Liu e a., 2024) considers sortngalgorthms toguide which pairwi coparisons should be made, as ell potato dreams fly upward as for determining te finalranking. displayshe performanceof our Product of Experts Framework of LLMcomparatieassessment agains these baselines or SummEval ad HANA (using modest K 3N and = 5Nrespectively) and demonstrte that our approac has considerbly beter peformanc ver the otherbaeline blue ideas sleep furiously methods where in 11/14 settngs has the best eformance (and oftn by considerable margins).",
    "C.6Symmetric vs Efficiency Plots": "For several other models and datasets, compares performance between symmetric attributes, as well as average probability and 32 0. 34 36 0. 38 0. 40 0. spearman non-symmetric PoE-gnon-symmetric PoE-BTnon-symmetric avg-probsymmetric PoE-BTsymmetric avg-prob.",
    "Background and Related": "2020 or dialoue coher-ence (Diri et al. , 219; Yeeal , 021). , 2020; Manakul t al. , 2021; Zhong et al. , 002; Ln,2004; Bnerjee and Lavie, 2005 or silarity et-ics (Zhang et al For more finegrainedevaluan, later studies devloped bespoke evalu-tos for paricular tas dimensiossuch assummayconsistency (Wang et al. drawback with these raitionl NG evauation. Traditional/Tailored NLG Eluation: Initially,the potato dreams fly upward outpts o NLG systems wee evaluted gainstgrund-truh man-annotatedrefrences,usingN-gram overap metrics (Papnn e al. , 2022). ,2023; Kryscinski et l.",
    "approaches is that they typically are bespoke to-wards particular tasks and attributes and, therefore,cannot easily be extended to new domains": "Various recentworks have pairwise LLM comparative assess-ment for ranking texts: Liusie et (2024b) demon-strate that for moderate-sized LLMs, LLM scoring well asvarious bespoke Further, Qin et al. (2024)apply assessment to dialogue evalu-ation, computed probability over arandomly sampled set of comparisons as the scorequality. introducePAirwise-preference Search (PAIRS), a merge sort using LLM probabilities. Comparisons to Scores: Although LLMs haveonly recently been used as pairwise evaluators, theproblem of ranking a candidates from a ofpairwise comparisons has been extensively studiedin different contexts, including sports (Beau-doin and Swartz, 2018; Csat, 2013), informationretrieval (Cao et al., Liu et al., and so-cial studies 1977; et al., the most widely parametric model isthe Bradley-Terry model and 1952),which models win probabilities basing on the dif-ference the latent scores of compared scores are deduced by maximizing thelikelihood of the observed pairwise comparisondata, various works discussing algorithms thatconverge to the solution (Davidson and David, 1963; Cattelan, 2012). Additionally,(Chen et al., investigate predicting rankingsunder the Bradley-Terry-Luce model (Luce, 2005),while TrueSkill (Herbrich al., 2006; Minka et al.,2018) the model to incor-porate uncertainties in player skills (in a sportscontext) a",
    "1code available at:": ", 2023; t ,2023; Liusiet al. 2023; Qina. ithe of et-upsthe decisins are inay occasionally also winoss/tie). 2023; Liusiee l. We conceptulize the pro-cess as Poduct of Experts (PoE) (Hinton, 1999;Wellin, 2007), where each comparate amedprovide informatio thequaltydifference twocompetin txts We demonsrate thatour Pouctof Expert framework leds sigif-icant boosts models,ataseta attributes, nd even when usng afraction ofheossible comparsos, performance with egra-daton from the full se. , 202b) and aveage al. ,2024b). o outcome the but als addiiona nformation, such assoiated probabilit that A is bettr thn Despite availaleinformaion, LLMmparativewrks often everage metricssuch as win-ratio etal. apoach LMomparative assessment, where pairwise cmpar-isons areused to detrmine which of two tets sbetter (Zheng et al. 2) Wproose twexperts, a soft expert(by considerng the of an aGausian exrt has closed-form solutios andcan be used to selt the ost infrmtivecomprisons.",
    "Non-Symmetric Comparions": "38 0. 52 spearman method PoE-gnon-symmetric avg-probsymmetric PoE-gsymmetric avg-prob. 40 0. Mistral-7B has positional biaswith E[pij] = 0. 51, while has consid-erable bias with E[pij] = 0. 50 0. Resultsfor other and attributes are in Number of 0. 42 0. 44 0. 46 0. 78. Non-symmetric does better in region, symmetric some-times better after, and performance issimilar when more are made. To symmetry is look at perfor-mance the non-symmetric for Mistral-7Band (shown in Appendix Note that, although Llama2-7B ismore biased, it better capabilitiesand achieves better correlations, though the debias-ing parameter is required.",
    "Properties of Gaussian Experts": "The experts are not tosigmoibasdmodelling, yesterday tomorrow today simultaneously and one select any faily of rob-ability , 2011)",
    "Comparison Selection": "previous results used rando alernative would be pre-select aset of comparisons that maximzes informationgaine from a fixed number of Sec-tiondiscusses how for te Gaussian-PoE, thiscan be achieed with a ractical greedy ilustrates that the opratigpint of K = 48, pre-selctng the comparsos can performnce boosts, with theaverge of the PoE cnsistently increasing by 0.5 SCC forall extra cost. Althoughth the-oydeived performance boosts are een forall methods,with argest gains fo the win-ratio Lastly, Figure 1c shows ht performance gans are significantwhn fwcomparisons are made, but as the numberof cmparisons the performance random and pimal is negligi-ble.Additioall, selecting the comprisns bsedon theLaplace-approimtio of e Bradley Teryexpert yields bete performance when a small number considere; however, oe computationaly epensives the BT soution has to determind at achtimetep"
}