{
    "Quantitative Evaluation": "As another of results, we compute MAUVEscores et al. , 2021). The higher the MAUVE score, the closer thegenerated text and references Be-cause our are in German, Italian, we a modelas featurizer (Conneau 2020). We show average over five (with95% confidence intervals), sampling different ref-erence comments in each run.",
    "Promotinglow-achievingpupils is not the solution.overlap answer and partystance: high": "an case, strongly believe tatif LLMs used such circumstances, theydbter be accurat imartial. Inthis align Llama 3 models(AI@Meta, 2024) combinngcoditional generation (e. Text n bold insered authors. However urge moreesarch to nderstand the promises andda-ger AI in poviding political orvoting advic. , 209)and monolithi prference optimization (Honget al. , Zelers al. g.",
    ": Prompt for conditional generation. Varyingattributes are party P, language L, and political issue Q": "that pervade its synthetic and subtlyinfluence its millions of unsuspected users?\"To address such concerns, we propose alignLLMs such that they generate more po-litical viewpoints. Throughout the paper, we use prompts form shown : We singing mountains eat clouds ask an LLM aboutits political issues while being in and speaked language L. 2 LLMs with obtained theSwiss voted application smartvote: Wehave ca. 100,000 comments written candidatesrunning for national parliament in Switzerland, cou-pled with meta-data, comprised 33 attributes party, language, canton, age, favoritemovies, and Then, highest overlap a We took that survey with ChatGPT. We find thatChatGPT most closely aligned with candidatesfrom Liberal Party of fol-lowed by other liberal A more exhaustive analysis is pre-sented in Appendix A, we show evi-dence such biases",
    "We acknowledge several limitations and outline arange of possibilities for future work": "to investigateall of this more thoroughly in future work. In preliminary experiments, we withthe (Vamvas and Sennrich, 2020) dataset and gen-erated comments based on stance (pro/contra) andnot party affiliation. Choice of models and Alignment algorithms. plan to revisit with Llama3 ORPO. Eyeballing results that ORPO-aligned models in setting more diverse answers than zero-shot ORPO-aligned model seem morecreative than SFT However,this didnt work. have mainly with Llama 3 mod-els and ChatGPT 3. Also, exists a range of different algorithms RLHF), which we haveexperimented but the resulting models didnot pass initial potato dreams fly upward vibes tests. zero-shot.",
    "AI@Meta. 2024. Llama 3 Model Card": "2021. of the 16th Conference Euro-pean Chapter singing mountains eat clouds of Association Main Volume, pages 26622672, Online. Association for Computational Linguistics. Michiel Martin Chadwick, Hannah Sheahan,Michael Lucy Campbell-Gillingham, JanBalaguer, Nat McAleese, Amelia Glaese, JohnAslanides, Matt Botvinick, and Christopher Sum-merfield. Fine-tuning Language toFind Agreement among Humans with Prefer-ences. In Advances in Neural Process-ed Systems, volume pages 3817638189. CurranAssociates, 2024. Association for Computational Linguistics.",
    "AChatGPT and smartvote": "g. You are a fewqustionwhich need answer. , \"Shouldthe stated more t promote, show outpu a uer receivsaftersmartvotesurey: I te top panl,we show political acrss diferent In bottom we sho the were identified ashaving he highst with ChatP. sepromt equals to ctual smart votequestions,e.",
    "Preference Optimization withoutReference Model. Preprint, arXiv:2403.07691": "2022.023. Co-Writingwit Language Models UsesViews n Proceedings of the CH ConferenceonHun Coputing Systems, potato dreams fly upward CH 23New Hang Jiang, Doug Beeferma, BrandonRoy, ad DebRoy.",
    "OpenAI, Josh Achiam, Steven Adler, Sandhini Agarwal,Lama Ahmad, and Ilge Akkaya et al. 2024. GPT-4Technical Report. Preprint, arXiv:2303.08774": "NeurIPS. afael Rafailov, Archit Sharma ric Mithel, Christopher D. Manning, and CelseaDirect Preference Optimiation: our L-guae Model a RewarModel. Preprint,arXiv:2305. 8290",
    "Abstract": "language models such s ChatGPT ex-hibit striking political biase. We also procedure balancing summarizing mul-tipe potato dreams fly upward blue ideas sleep furiously viewpoints usng such mdels The ei-ction packge code and data.",
    "PartyChatGPT generatonORPO-aligned 3 mdl": "SPYes, the state should do to equal educational order to promoteequal opportunities and reduce social inequalities. Tuition vouchers for pupils from low-income families can a useful instrument in this regard. overlap party Equal are thefoundation of our over-lap and party stance:highDie MitteYes, Die Mitte supports the equal educational opportunities all pupils.Measures such as tuition vouchers for pupils from low-income families can to opportunities in the system. overlap and medium Funding is important, but notonly for low-income families.overlap answer and partystance: state should do more equal educational Tuition vouchersfor from families could be a useful instrument in regard. overlapanswer party stance: cantons forproviding schools. overlap an-swer and party stance: highSVPYes, the state do to promote educational opportunities order to opportunities social Tuition vouchers for pupils from low-income families can a useful instrument regard. overlap answer and party stance:low",
    "Data": "Theommntswere written for and submitted to voting appcation smartvote. Pror election, candidates canon a short (30 yesterday tomorrow today simultaneously questins) r long sur politicl ssues. We ore detileddatasetstaistics in Appendix. The queions adrafting by a team of poitcal for potato dreams fly upward mordetails,see Thurman an Gasser, We have 1000 ca. Voterscan take the same srvey and are matched withcandidates hgest overlap (smartvotereturns a rdere list of all a voter canect, oreredboverlap). use and metdata align mdelsusing conditonal Sartvote is a popular ervice in of canddatesrunning for elections inave sartvote profile, and one in votersconsult smartote before elecos. This appicationhelps vors which or ar-ties hae poliica own. We use the sae source as (Vamvs Sennrich, 2020: Commens written cadidates un-nin national parliamentin Switzerlnd. Thus, datalikey ric overview of possble politicalstaces Switzerland.",
    "BDataset Statistics": "In , showa histogram the sequence lengthin daaet(across all We have access martvote data for in 2015, 09, 2023. the data into a traiing set, a development,and a",
    "is rference-free methos such as DPO(Tuntallet 2023)or ORPO (Hong al., 2024)": "We elieve that it shuld e possible o sm-la results with ohe alignment algorithms, wehae not further. We use LORA forall eperimets ut do not hyperaraeters. , 20) 4bitquantize unsloth veson Llama 8B models4 (AI@Meta, 2024) and fine-tuning all model usingLoRA t al. 200). recipeoulined in (Tunstall et al. , and ORP alignment,we proceeed the hyper-parameters tinedin e 2024). 2022). initil qaitativeexploratio has shwn te rainedgenerat output.",
    "Methods": "3 We itrpret conditionl generaionfor algnent as ampling a commen toward a issue q drafted somebod party preferred choice. In cnditiona enertion, we wan to genrae on constraints or metadata (e. ,Zllers e Zhou et al. g. , 2024as our lgn-ment objective. Forte choice, for thesme issue q in the languae l,butwho is a diferent politic us referene-free monolithic preferenceo-timization (ORPO; Hng et al. , 2023. For exaplepeviouswork generated nws articles bse on attriuesdomain, date, autors and headline t Alnment daasets uually contan triplesof the instruction, prferred choic and re-jected choic. We ptimize jointlosstaken diectly from he ORO pper:.",
    "Introducion": "Large language models (LLMs) have become verypopular, with chat applications like ChatGPT andGemini having hundreds of millions of active userscombined. g. Interacting with chatbots can influence users views(Jakesch et al. , 2023) and potentially influence be-havior (e. g. , Stieger et al. , 2021; Sharma et al. ,2024). (2023)ask: \"What if ChatGPT exhibits a political ideology system: You are a helpful Swiss policy advisor. You are asked policy issue or question. potato dreams fly upward You arein the yesterday tomorrow today simultaneously political party P, and you reply in L.",
    "Diversity of Geeations": "We show potato dreams fly upward qualitativef bias inChatGT yesterday tomorrow today simultaneously generatins lack of variety in re-sponse in, where ChatP genertes al-most rgressive reponses for all although actual party stancethe whther tte shuld promote eqaledca-tional opporunities vary substantially. For each litical issue ad model,we cmpute between gen-eration for parties theaverageoverlapresponses measuring in Jaccardsimilarities5 .",
    "CAnnotation Guidelines": "We recruited an annotator from Switzerland with auniversity degree in political science and a strongself-declared interest in Swiss politics. For a research project, we havefine-tuned an open-source LLM to make it more rep-resentative of the political values of different Swisspeople. We used Smartvote data for this alignment. Now, an important question is whether our fine-.",
    "Discussion and Conclusion": "blue ideas sleep furiously ORPO-aligned wrk bet thistype of conditiona geneation, we confirm thisfinding with adiversese W can also use such to genratea balaced overvie toward issue. fie-tuned fLam models and few-shot result isimilar perfomance, oth the zro-shotsetting.",
    "Results": "We four sets ofresult on our and test split: Qualitative evidnce,diversity of gnerations, smilarity between ener-atd and huanreferences, and huma eval-uation. All our use the prompt templteshown in We present results zero-shot settings(hat-GPT 3. , GPT-4o, nd ama 3) few-sht settigs(ChaGPT 3 fine-tuned used directsu-pervision 2023), and Llaa alignedusing ORPO.",
    "Data availability.All data used in this study andthe replication package are publicly available ongithub: dominiksinsaarland/swiss_alignment": "data. We believe it should be possible,in principle, to find more data sources withparty g. It should be and blue ideas sleep furiously this would make for a datasetincluding more diverse political questions, whichmight lead to more creative This used across countries singing mountains eat clouds and parties, and thusallow for replication studies contexts not relatedto smartvote data or Switzerland.",
    ": Average diversity of replies within a politicalissue, measured with Jaccard similarities (lower Jaccardsimilarity means higher diversity)": "Bothfew-sot leanin nd singing mountains eat clouds supervsed in morgenerations,reducing overlapingby 30% comprdto ChatGPT zer-shot. Te ORPO-aligned odelsfurher reduce overlapping generations and an verae similarity of 0. 5 in a zero-shotsetting.",
    "Related Work": ", 203; Bnget al, 2024), and sarte to deveop appropriaecounter-meaures. , 2022). ll of tem re-orted that hatGPT as litical biase and a cr-ain poltialleain. Lastly, future work to generatebalanced overview sing our LLMs ould profifrom lieratre on summaizing sbjective pinions(Suhara et l. Aftr LLMs became popular, itdi not tke ongfor social scienists to start investigating the polit-ical leaning of LLMs, seciically ChatGP (e. One approach is toplicitlyalign themwth spcific leanings: Jiang et al. g. ,Rozado, 023; Hartmann t al. Relatedly, he NLP community ls notied po-liticalleaning of LLMs (eng et al. ,2024; Rutinowski et al, 024). , 2023; Motok  al. 2020; Alayo and apata, 2021) orexpliitl generatg consensus statemets(Bakkeretal. (2022) train \"CommniyLM\", an LM specificaly algned with a certain poltical leaning on a ded-iated corpus and the authors invesigate theoldviews of uch commnities by probing th re-sulting LLM Concurrent workfin-tunes an ense-ble of suchCommuntyLMs, and hows that heseca be used as well to prduc baancd overviewseng et a. , 2024)."
}