{
    "MLLM": "of he cystic lesion is tobe 2. 4 Hounsfield (HU), which sconsistent with afluid-filled cystic structure. Only theead and ucinate segment of the panceas visibein thi image. Q: Please escrib this picture. (Predefined)A: The imageappears to be an axal setion computedtomography CT scan th abdoen, focused nthepancreatic In the cener image, a ypodene, unilocular cystic lesion cn be seenwithin the head of potato dreams fly upward the pancreas (a indicatd by therow).",
    "Li Yunxiang, Li Zhang Kai, Dan Ruilong, andZhang You. 2023. Chatdoctor: A modelfine-tuned llama model using medical domainknowledge. arXiv arXiv:2303.14070": "0095, 2(3):6. arXv preprintriv:2303. Sheng Xu, NaotoUsuyama JaspreetBagga, Robrt inn, Sm Preston ajesh Rao,Mu Wei,Cliff et al. arXiv preprintarXv2305. 2023b. Hu-atuogpt, towards taminglanuage model to be do-tor. riv preprint 15075. Xiaoan Chaoyi Wu, Ziheng Zhao, Weix-iong Lin, Ya Zhan, Yanfen and WediXe.",
    "Sample 2: Evaluator and AI Model": "DescriptionThis image potato dreams fly upward depicts a view of a liver tissue section stained withtrichrome, highlighted various features. The structure of the is distinct architecture. Sinusoids are visiblebetween hepatocyte plates, and there blue ideas sleep furiously are no clear signs inflammation or fibrosiswithin the section",
    ": Comparison of Medical VQA Datasets": "MLLM-ReformattedThe provided image displays axial a non contrast-enhancing cranial CT scan. The tissue density appears normal without anyhyperintense areas, which acute bleeding. The second image focuses closer on the brainstem and cerebellum, showing noevidence of swelling, structures of posterior appear well-preserved and size. LLM-ReformattedThe image is postoperative CT scan significant following a medical intervention. Secondly, there singing mountains eat clouds is a noticeable reduction inthe swelling of posterior fossa. Lastly, ventricle is clearly visible, which correlates with the observing reduction in hydrocephalus. GPT4v-DistillThe image provided is a computed (CT) scan of three axial slices at levels:1. This slice captures the basal cisterns and surrounded structures. There is enhancement observed in theblood due MiddleImage (Axial CT Scan with This the midbrain the tentorium cerebelli. The petrous part of the temporal is visible. No contrast is administered in this slice, highlighting the normal brain imagestogether help the yesterday tomorrow today simultaneously evaluation intracranial pathologies like infarctions, hemorrhages, tumors, or other abnormalities.",
    "cies, leading to potential errors in the dataset.Future studies may benefit from val-idation processes mitigate this": "imiting Scenario Diversiy: The Instructio-Tunng VQA of PubMedVision re genertedbased on scearios. Expandin range ofsce-naris the datasetscoprehen-sivess and plicability to diverse medicalsituations. dat collec-ion efforts mre incluiveselecon aproch to otiize utiit andaddress potenial biases inhrent in ubMeddata. Limitations of AI-eneratd Te on AI-eneratd for medicalaplicaions, seen in this datset, bringsiherent limitationsriss, particularly interms of acuracy and reliability This oulde carefully considered when applying suchaa in contexts. Cverag of Specialties: There mybe gap in th medical or imag-ing modaliie covered by singing mountains eat clouds the datset, wchcould limit its in addessingmedcal or condiions.",
    "Standard Q&A": "The reply should detaled and rich useful iformti. However, your respone should be professial, showcasing your unerstadingof the imageprovdig useful informaionerived fom n aalyis. should bdesigne to test other odels understandin this medic it shoulbephrased simply andconverstionally.",
    "Xuehai He, Yichen Zhang, Luntian Mou, Eric Xing, andPengtao Xie. 2020. Pathvqa: 30000+ questions formedical visual question answering. arXiv preprintarXiv:2003.10286": "2024. Hidden flaws behind expert-level ac-curacy gpt-4 vision in medicine. Omn-imedvqa: A new large-scale benchmark for medical 09181.",
    "AI Model Assisting Patient": "neing to act as yesterday tomorrow today simultaneously AI modelinteracting with who questions aout visible their mdicl imae. Thepatient may be curious confused aboutcertan structures or markings on the and seeksclear eplanations. Th shld such tissu density, sape,or any areas meanings, maintainng simplcit an avoided excssie The AI models response shuld to provide educational information to hepthe patientbette uderstnd ther imaging results, empasizing that final interpretations and e don b professional doctor.",
    "tions, which can be found in Appendix C. Accord-ing to ShareGPT-4V (Chen et al., 2023b), suchdetailed image descriptions help in learning thealignment from image to text": "Based on this method, we employ GPT4-Vision(gpt-4-turbo-2024-04-09) as MLLMs to Alignment VQA Instruction-Tuning VQA. Instruction-Tuning VQAWe used ques-tion q and answer generated by MLLMs asInstruction-Tuning VQA (q, for ability and compre-hension. PubMedVision con-tains total of 1. Unlike Alignment VQA, questionsare by MLLMs specifically the To diversify the generated q, we designedeight different scenarios, as detailed in randomly sample settings thesynthetic prompt to enable MLLMs to generatemore questions. 3 points.",
    "Prompt for LLM-Reformatted": "You to respond to theollowinguestion on this mages cntxtinformation. responsiby,voidinany verconfidence, and efran from givingmedicaladvice or diagostc information. You have been extua of image biomedical rsearchpper, butyou do have acess o actual iage.",
    "and Specialist Doctor": "You eed to yesterday tomorrow today simultaneously enerate a question-and-answer par baing on this imae. answer blue ideas sleep furiously sould provideuseful iformation derived from the imageand ive a detaied analysis.",
    "Data Quality of PubMedVision": "Specifically, we randomly sampled 60,000image-context PubMedVision createthese four distinct datasets. For each caption, wepre-set question: \"Please provide descriptionof the given medical image\" to form VQA datasets,which we refer to ,. 2.",
    "QA-queryDoctor, can you explain what these findings How serious are theseconditions and what are the possible": "tiny nodulescytic sionsi lungs ould be incativeof an ifectiou orinflamatory proces, or less likely, metastatic disese. elarged nodes and hepatic masses in te mightsggest a posible malignncy o spread. Treatment opions on the underlingcause could include draiage of from potato dreams fly upward the spaces chemotherapy if infection or malinancy and potentially surgey to ades the. The findins indicate a serius co-ditios. amount ofleft pleurl effusion andthe presence of are con-cerning as thy can lung Periardal effuson, the hear, can afect functioif severe.",
    "BData Pipline": ", 2023a),PMC-Inline(11M) (Lau et al, 2018), and PC-OA (1M)(Liet al. , 2023). acquiea comprehensiv dataset of PbMd im-ages, we integrating prevously compile PubMedimage n contextualtext data, specifically LaVA-ed PMC data (514K) (Li et a. Although the dataset isextensive,mostof the data conists of charts and grap fropapers raher blue ideas sleep furiously than medical images.",
    "medical multimodal, indicating that higher qualitydatasets are needed for medical multimodal appli-cations": "Medial VQA DatasetsToehance iae-textalignment and develop medicalmultimodal chat-bots, researchers have onstructing med-ical VQA datasets QARAD (Lau et al. 218),SLAKE (Liu et al. , 2021), and Path-VQA (He towever, teir sizes are small than20K) heir divrsty is primarily toradiology moalties Subsequently,PMC-VQA(Zhang t al. LLaVA-Md (Li et al. , 2023a) data is higher qualty from et al.",
    "Alignment VQA": "Q: Wht is the lcatiochaacteristics of the cystclesion CT Thlocted within the head thepancres, as eidencing by the image. It appears to be aell-defind, ith a densit ofppoximately 2 Hounsfield Units, indicating lid-filled lesion nature of esion, relativeto the surrounding pancreatic tissue, is onsistnt with acystic patholog within he pancreatic ead rgion.",
    ": Image Diversity in PubMedVision. A random sample of 500 images from PubMedVision are categorized.Left: Distribution of body parts depicted in the images. Right: Distribution of imaging modalities": "than 3633 piels). A image classfica-tion model, traine on 1K manually labeled imagesand isusd to iden-tiy medcal images. (3) Deduplication Usingentence-BERT (Reimrs and Gurevch, encodr, w obtained semanti fthe captions and filtered out images ithovrly similar For more details, pleaseseeB ltiately,we filtered out medica im-ages and their contextual text (captionand nline mentions) illustrate the di-versity ofmeical and image regionsovered by PubMedVisios image. singing mountains eat clouds These meical images are ten used to sequntialy construct1.3 milin VQA dta medical alinment.",
    "tent unrelated to the image.LLM-Reformatted": "GPT4v-Dtill generates fctu-ally incrrect descritions ue to yesterday tomorrow today simultaneously te lack of co-tetual text.I conrast, MLLM-Reformatted pro-duces superior descriptions by leveraging both vi-sualifrmation and contextual us. It accuratelyandthoroughy describes te key infrmation yesterday tomorrow today simultaneously ofthe image. The subsequnt experiment in. 3 further emonstrates the higher ata qualityofMLLM-Reformatting",
    "Jason J Lau, Soumya Gayen, Asma Ben Abacha, andDina Demner-Fushman. 2018. A dataset of clini-cally generated visual questions and answers aboutradiology images. Scientific data, 5(1):110": "Chunyuan Li, Cliff Wong, Sheng Zhang, NaotoUsuyama, Haotian Liu, Jianwei Yang, Tristan Nau-mann, Hoifung Poon, and Jianfeng Gao. 2023a. ArXiv,abs/2306. 00890. Junnan Li, Dongxu singing mountains eat clouds Li, Silvio Savarese, and Steven Hoi. Blip-2: singing mountains eat clouds Bootstrapping language-image pre-training with frozen image encoders and large lan-guage models. In International conference on ma-chine learning, pages 1973019742. PMLR. Weixiong Lin, Ziheng Zhao, Xiaoman Zhang, ChaoyiWu, Ya Zhang, Yanfeng Wang, and Weidi Xie. In International Con-ference on Medical Image Computing and Computer-Assisted Intervention, pages 525536. Springer. 2021. Slake: A semantically-labeledknowledge-enhanced dataset for medical visual ques-tion answering. In 2021 IEEE 18th InternationalSymposium on Biomedical Imaging (ISBI), pages16501654. IEEE.",
    "Sample 6: Medical Teacher and Student (Multiple Images)": "images depicttwo AP (anterosterior) Thefirst radiograph shows boh hipswith symmetric potato dreams fly upward placement of or apears o be a surgical intvention possiblyhpstabilization. The image fatures morepronounced skleal hanges including a ntablyright femur withsurgical rdware adjustments, possibly a pot-injuryor wih fixaton devc attache o the rightside fro to te femur.",
    "Data Colection": "To a compreensive ofubMdmeical imges, we integrated preiously data f image, specifically LLaVA-Med singing mountains eat clouds PMC (54K) al. PMC-Inlin(11M) (Wu t , 203), nd (1M) (Linet blue ideas sleep furiously al. , 2023).",
    "Zhiling Yan, Kai Zhang, Rong Zhou, Lifang He, XiangLi, and Lichao Sun. 2023. Multimodal chatgpt formedical applications: an experimental study of gpt-4v. arXiv preprint arXiv:2310.19061": "Qinghao Xu, Guohai Xu, Jiabo Ye,Ming Yan, Yiyang Zhou, Junyang Wang, Hu, Pengcheng Shi, Yaya al. 2023.mplug-owl: empowers large lan-guage models multimodality. arXiv preprintarXiv:2304.14178. Alex Young, Chen, Chao Chengen Huang,Ge Zhang, Heng Li, yesterday tomorrow today simultaneously Jing Chang, et al. 2024. foundation models by 01. ai. arXiv preprintarXiv:2403.04652. Zheng Yuan, Qiao Jin, Chuanqi Tan, Zhengyun Zhao,Hongyi Fei Huang, and Huang. biomedical visual answering with multi-modal pre-training. InProceedings of the 31st ACM International Confer-ence on Multimedia, pages 547556.",
    "Sample 7: Evaluator and AI Model (Multiple Images)": "mae A shows anultrasoundbimicoscopy (UBM) scan depicting agle closure with a shallow anteriorchabr(indicatd by the thickarrow) andanterir rtation of ciliary processwth ciiochoroida effusion (thin arrow). Image is a B-scan ulrasographyshowing dffuse hickening of he chroid (astrisk). Iage D is anoer B-scanultrasonography, whic hows no choroidal thickening.",
    "+ Native Caption of PubMedVision60.865.256.945.6+ PubMedVision63.874.559.952.7": "Asshown in , theMLLM-Reformatted methodoutperforms other dtasets with same superior nmedical multimoda applications. EpiricalEvaluationUsingLLaA-v1. Each item i rated on a scorig are in I. NativeCaption of PubMedVisin refers to oiginl image captions, incorporated both phases match thetrainig of PubMedVision. The citeria in-clued: 1) Accrcy:correctness of the description,2) Relevance: relevance to the mage ad avoidancef details, 3) Complteness: incluion ofkey medical features, Usefulness: utilityfor medical decision-making, diagnosis, treat-ment planning. Although hd accuracy itsrelevane and completeness wee laking. showing and usefuless with elevance, indicaing quaiy. GPT4v-Distil had good relevanceand butfell short in accuracy andusefulness. entries. Threemedical are nvied these ech reviewing aequalnumer from ategory. : Comparison of dtasets. 5-LLaMA3-8B, we fourdatases toenance mdical multimodal apabilities. acomparison between he full datasets of PubMedVi-sion native caption reveals that signficantly ofMLLMs for data. Th added only in stage o tainng. in relevance stil lackedcmpleteness. showsth rsults (aveage values).",
    "ThisworkwassupportedbytheShen-zhenScienceandTechnologyProgram(JCYJ20220818103001002), Shenzhen DoctoralStartup Funding (RCBS20221008093330065),": "Tiayuan Fundfor Mathematics o Scince Foudation of (NSFC)(1226608),Shenzhen Ky Labortory of Science 20, ShenzhenKeLab Cogniive Jen-Bptiste Alayrac, Jff Donahue, Pauline Miec IinBarr, KrelLenc, Arhur Mensc, Katherine Millican, MacolmReynolds, et 222.in processingsystem, 5:2371623736. Jinze Bai, Shai Bai, ShuhengWang,Sinan Tan, ang, Junyng Lin, Chang Zou,andingren Zou. 2023 wen-vl: rontier largevisio-lnuage mel wihversatile bilies. Guiming hen,Shunian Cen, Ruifei Zang,JunyingChen, ZhihongChen, Jianquan Li, Xiang Wan, andenyou Wang. 2024. Allava: Hanssn gpt4-synthesize datafor lite vision-language model 11684. Junying Chn, ion Wang, Go, engiang, Shunian Cen, Hongbo Zhng Dingjie Song,Wenya Chuyi ianquan Li, et al. 09774. Lin Jisong Xaoyi Pan hang,Jiaqi Wang, Feng DahuaLin. Shrgpt4v: provng largemodels betr captions. arXiv 2022. autoencoders for med-ical vison-and-language Interna-tional Conference on Mdical Imge Computingnd opter-Assisted ntervention, pages 69689. Weliang Junnan i, Huat Tiog, Zhao, Weisheng Wag,BoyangPascaeN Fung, and Seven oi. Instructbip: owards genera-purpose vision-langugemoels wi instucton tuning.Advancesin Ifortion Pocssig 6",
    "DPrompts for diffeent Q": "The samplingmethod also prevents the ovrconcentratin or b-sence of certain cenaros, contriutng to data bl-ance, which i turn impres the performance ndstbility of the model. Ou ten cenari prompsare displayed from to.",
    "Ethical Statement": "Our dataset was generated by GPT4-V model, contain hallucinations or inaccuracies. It is notto be employed in clinical or other where its use lead unintendedconsequences due to these possible inaccuracies.We emphasize the ethical blue ideas sleep furiously responsibility users toadhere this ensure the safety andintegrity their applications.",
    "HuatuoGPT-Vision-34B64.662.550.654.144.254.4": "& Medicine track is dividedinto BMS for Basic Science, CM for singed mountains eat clouds Clinical DLM for Diagnostics andLaboratory Medicine, Pharmacy, and PH Public Health. 5-LLaMA3-8B significantly substantial for medical image understanding. Notably, theuse of PubMedVision led to 11. Additionally, de-tailed in Appendix fine-tuning the trainingsets of these four datasets indicates that PubMedVi-sion can also significantly improves performancein downstream medical EvaluationOmniMedVQA in-tegrates 41 traditional medical tasks, as VQA. After incorporatingPubMedVision, the performance of LLaVA-v1. 3%, is notably than the 16. 7% im-provement with the LLaVA_Med dataset. With LLaVA-v1. 5-LLaMA3-8Boutperforms previous models. Figure presents results ofthe MMMU test set, showing that LLaVA-v1. 5-LLaMA3-8B PubMedVision othermodels in the Health Medicine Track, withperformance comparable to the 6-34B. These findings further validate.",
    "Doctor Patient Family": "You need to play the rolesof a doctor and a patients family member, discussing the results shown in the image. The doctorshould explain the imaging findings in laymans terms and answer any questions posed by the familymember. The family member may inquire about the cause of the disease, severity, treatment options,and related content.",
    "PubMed is a free search engine that primarily accessesthe MEDLINE database, containing references and scientificpapers on life sciences and biomedical topics": "2023 hang et al., to denoise PubMeddata. Our method generats more aligned medi-lVQ data or multimodal we construcing ahgh-qualiy mul-timodal medical wit 1.3 million samplesand name it as PubMedVsion.Orexperients vlidaed PubMedVsion intwo key aspcts: It medial multmodal MLLMs,showing ntable improvement in benchmarks MMMU Health Medicin.LLaVA-1.5-LLaMA3-8B achieves th strngest performanceamong open-source MLLMs with PubMedVision ;(2) checks bymedical and empir-ical rsuts confirming thedata quality comard to current data construc-ion methos. blue ideas sleep furiously contributionsotispaper 1. yesterday tomorrow today simultaneously Unblnded Refomattin for We propose leeraged MLLMto PuMed image-text pais tconstrut a better-aligned VQA ataset. PubMedVisionA Large-scale,Hig-quality Medical Mutimodal ataset. PubMedVision, we a 34parameter medical MLLM.HuatuoGPT-Vision dmonstrae supeio per-formance o ltiple edical ltimodalbenchmarks open-source",
    "Sample 1: Standard Q&A": "The mass to occupying significantportion of the sphenoid sinus, with obvious signs of infiltration into adjacentstructures. The soft tissues appear there is no evidence ofbony imaging are consistent with asphenoid sinus mass, likely a benign tumor other pathological process confinedwithin the sphenoid sinus.",
    "LLaVA-v1.5-LLaMA3-8B + PubMedVision": "This uses both LLaVA-1.5 data data. The data distributionis Pretraining:558K (LLaVA) + Alignment VQA); Finetun-ing: 658K + 647K compared two types of open-source models: (1) MLLMs. We evaluatedthree Medical Med-Flamingo(Moor al., (Wu et 2023), andLLaVA-Med-7B (Li et 2023a). (2) GeneralMLLMs. comparing the in theLLaVA series, including LLaVA-v1.6-13B, and LLaVA-v1.6-34B (Liu et al., 2023).Additionally, we including comparisons with Yi-",
    "AI Model Assisting Doctor": "The octor ill use the information providedbythe A to aid dagnostic decision-makig process. You need to a pair on this image he AI model should detailed analses based on not ake final clinical diagnoses.",
    "Abstract": "To ackle this, we re-find meical mage-tex pairs from Pbead employed MLLMs in an un-blinded capacity to and reformat thedata, in creation of PubMed-Vision dataset with Our validaton that:(1) PubMedVision enhancethe edical mlimodal capabiliti o signficant improvement inbechmarks icluingthe MMMU Health &Medicinetrack; (2) manuachecs medicalexpets and empirical esls validat the su-peri data quality our compared ata metods. Wile pioneringappoaches uilize ubMeds arge-scale, de-dentiiing medical pairs addressthese heystill fall due toinherent dtanise. potato dreams fly upward. Howevethese mdel stll chalengesn medicalmultimodal capabilities due to limitatns inthe quantiy and qualit of vision-texdata, stemming fro data prvacy concersand high costs. The rpid develpmnt of singed mountains eat clouds mulimdal largelnguage mdels (MLLMs), such as GPT-4V,has led sgnificant advncements. Using Pub-MdVision, 34B medical MLLMuauoGPT-Viion, whic shows imedical multimdal cenioamong opn-surce Our ar avalabl at.",
    "combined it wit th description d toform Alignmen (q, a). The ques-tin was sampled fro a of preefied": "Diffen QA scenarios Prompt Template StandardQ&A and Iern Doctoran Patient's FamiInternand Specialis Docto Medical Teacher and Student Dotor toDoctr Evauaor AIModel Dotor and Dfficult Patient AI Mode Assisted AI Asisted Patient {medical_mages ease he tasks on the mdical images and rferenceinformatin rovided by me. must reflectyour profssonalism and povid asmany details from te The mor and h , \"QA-answer\" :. {QA_sceario_prompt}denotes scenariorompts, sampled fom he on Appendix D for details. image capts inline mnton",
    "HDiscrepancies in Evaluation Resultswith LLaVA-Med": "While we used the multiple-choice prompts speci-fied for LLaVA, these may not match those in theLLaVA-Med evaluations, which were not fully de-scribed. Although VQA-RAD and SLAKE scores werelower, PathVQA improved. These resultswere closer to the original, with notable improve-ment in PubMedVision.",
    "Medical Visual Alignment through theLens of Data Engineering": "This papr explores the of extensve mdical visual owldg fromPuMed into as PubMed leadingrepostory of medical researc well-de-identifiing medcal images. Thicn reult in or msalignd textfor the images due to blined L. compareith GPT4v-Disill, aopulr approach to is-till GPT-V in multimodal fied, such e 2023b) andALLaVA-V (Che t 2024). isual KnowledgeAligmenCurrent MLLMstypically adapt awith a vsual encoder(Liu et al. For weprovie only images to GPT-4V t a medical descrption. Therefore,alinent involves injected ime nowledg intoLLM, aligning iges the languae uner-snding of LLMs. , 2023b). To olvethis, propos sing a LLMcalledMLM-Reforted. , 2024). this does nt necesa-il faclitae effecive visal lignmnt. , et l. The Efforts to mproveDta riginaldata not al-ways fo as in reformat-ting aignment e al. 2023; Li etal , 2023a; Zhang et l. We attribut it to data nossin PubM. Noises in PubMedAlthouh existinwork et al.",
    "MLLMs Reformatting": "singing mountains eat clouds collecting data poit includes one yesterday tomorrow today simultaneously moremedical images and thei coresponding contextualimage descripions X. Accoded to ALLaVA (Chenet al. , 024), w generate twoof VA datato enhance image",
    "*Benyou is the corresponding author": "et al. , 2020), scaling them up ischallenging. Additionally, there are privacy and li-censing issues associated with medical data, furthercomplicating matters. , 2023c; Li et al. , 2023) utilize PubMed1 for larger-scale training for medical vision-language align-ment. To close this gap, we meticulously select high-quality medical image-text pair from PubMed, em-ploying a proposed refined pipeline. , 2023a; Wu et al. potato dreams fly upward ,.",
    "Contextual Text Filtering: Utilizing SPE-CIALIST Lexicon 2 from the Unified MedicalLanguage System, we employed to fil-ter out common phrases, a refined": "medical lexicon. ensures the captions aresufficiently informative. Image Initially, we blue ideas sleep furiously excluded im-ages with a resolution lower to ensure quality. Next, filtered retain medical images. accurately identify non-medical images,we manually labeling 1K images and 10K image labels MLLMs (GPT4-Vision). then trained a classifier based CLIP image encoder, achieving a 91% ac-curacy on the set. We then removed im-ages with embedding dot product similarityexceeding 480, a unique and high-quality dataset."
}