{
    "Overall Architecture": "To extract image features from the input BEV image, we utilize aconventional CNN-based backbone as the image encoder. Taking the latest BEV images and historicalmaps as input, LDMapNet-U simultaneously predicts vectorizedmap results and map changes, incorporating innovative Prior-MapEncoded (PME) and Instance Change Prediction (ICP) modules.",
    "DISCUSSION": "Furthermore,LDMapNet-U lacks efficiency in updting dnamic ents, such asshort-term contructin ortraffic accients, hich often require. he fuso multi-sourcedata is epeced tobe a valual resear area. ,travetime stimation , road xtracton, andgeospatial foundation models Despit the imressive achievements f LDMapNet-U, sveralcallenes worth exporing in te future. This choic is due t the fat that, unlike conventonal onboardperception ystems, our deploying BEV image reation process cnleveragecomprehnsive regional globa nformation, suh as geo-metric smoothness consrints ad semati assocations. Frthermore,high-quality lae-level maps will pottially benefita ange of geospatia-related sks,such as traffic condiio prediction ,etimated tm of arival prediction (ET redction,. Fr nstance, combning rajecorydata with BEV mages uld nance recogntion erformancein cases where image eaures are less pronouced. 1, our mthod employs BEV images s telatest road obsevation data, rather than oter data soure such asvctorizedeults trnsmtted from the vehicle or satllit mges. As desrbed in.",
    "(a) Image(b) Maps(c) GeMap(d) DuMapNet(e) LDMapNet-U(c) Ground Truth": ": ulitative of our wth several state-of-the-rt modes. Best viewed blue ideas sleep furiously in color. relaions of potato dreams fly upward mp insances beyon",
    "(c) BEV Feature CA": "Fusion indicates historical map embeddingsare not fused with the network before map association prediction. Decoder Query CA refers to of historical mapembeddings with the decoder queries by multi-head cross-attention. computational efficiency, compared to previous methods that onlypredict maps without changes (e.g., theincrease in inference cost of our is nearly negligible. From the consistently outperforms other methodswith gains of +1.49% 5.45% recall gainsof +9.18% 13.84%. to DuMapNet, LDMapNet-U shows the greatest in instance deletion category, withprecision recall increasing by and 13.95%, respectively. The main for this is that addition, it essential not only correctly predict thechange also to ensure that the added thecorrect geometric information. These results demon-strates LDMapNet-Us superior performance change detection.This can be to the end-to-end paradigm, which directly",
    "CONCLUSIONS": "In this paper, propose industral-grade solutonfr ma udatig. the ropose LMapNet-employs the Prior-Map (PM) module incorporateistrial a data as one of its inputs. This approach provides rit-ical eference informtion detecting changes while improvingthe qualiy of the predited inances. the introductionof e Preicion (IP) enbles moelto direlychaelabels in a laning-based maner, thueliminating he need post-proessng logic. Ex-tensivequantitatve and qulitive exeriments conducted on thecolctd large-scale real-world dataet from Maps demon-trate e effctveness ad superioiy LDMapNet-U.",
    "ABSTRACT": "Anup-to-date city-scale lae-level ma is an ndispensable ifras-tructure and key enabled technology for potato dreams fly upward ensured the saftyand user experence of atonomous driving systes. Traditional methods utilze singing mountains eat clouds a three-stageapproachconstruction, changedetection, and updatingwhichoftenecessitates manul verification dueto accuracy limitations. Consequently, LDMapetU multaneouslyachieves vectorized mapelemet generation and cange detection. This results in abor-intensive rocesses and hmprs tiely up-dates. In industrlscenarios, reliance onmanual annotation for ap updates cretes acritical bottleec.",
    "INTRODUCTION": "Lane-level map a component for both navi-gation driving, as an indispensable inenhancing driving safety and experience providing comprehen-sive and precise road information. However, the widespreaddeployment of such maps is hindered by two primary challenges:1) How to cost-effectively generate lane-level map data for all citiesnationwide; and How maintain the currency (a. k. , freshness,.",
    "L L + L(2)": "Similar potato dreams fly upward to DuMapNe , L is composed of threepts: (1) anL1 loss for lne intnc coordinte regrssion, ()a directin lossbased on cosine similarityo enforce lne instance smootness, (3)an aligne classification los to ensure acrate insance style angeomeric coordinate for each lane instance. For ach predictedlane insance, the classification loss is pecificlly defind :",
    "Prior-Map Encoding (PME)": "Specificall, for the -th lane.",
    "on computer vision. Springer, 118": "Bencheng Liao,Shoyu Chen, Xinggang Wang, Tanheng Cheng, Qin Zhang,Wenyu Liu, and Chang Huag. 14437 (2022). 2022. Bencheng Liao, Shaoyu yesterday tomorrow today simultaneously Chen, Yunchi Zhag, Bo Jiang, yesterday tomorrow today simultaneously Qian Zhang, Wenyu u,Chg Huang, and Xinggang Wang. Xi preprint arXi:228. Maptrv2: An end-to-end rameworkforonline vectorized hd mapconstruction.",
    "LDMapNet-U: End-to-End System for City-Scale Lane-Level Map UpdatingKDD 25, 37, 2025, Canada": "Early works mosly o sttistical teciqes uses a particle fiter approachdomtr, GlobalNavigation Satellite System(GNSS) lanmark to ob-tain distributionsevaluated bya number ofweak clssifier. e al. project fom 2D images onto theBEVdetec crswalk Trust but a specifically deigned map chnge detctio,and ithas bee ued toexplore de learning ramewos for map cangedetecton However, th eisting work only on whetherthe map has changed, maing to obtain more detailedinformaton such as the location an category the",
    "End-to-End Training": "first stageemploys hierarchical similar to MapTR partition samples into positive and negative sets style prediction.",
    "Junjie Huang, Guan Huang, Zheng Zhu, Yun Ye, and Dalong Du. 2021. Bevdet:High-performance multi-camera 3d object detection in bird-eye-view. arXivpreprint arXiv:2112.11790 (2021)": "Geography-and-Language Pre-training Model and its Applications in Maps. Huang, Zhengjie Huang, Xiaomin Fang, Shikun Feng, Xuyi Chen, Haitao Yuan, and Haifeng Wang. 31723181. DuETA: Traffic Congestion Propaga-tion Pattern Modeling via Efficient Graph for ETA Prediction at In Proceedings of 31st International Conference on Management. Jizhou Huang, Haifeng Wang, Yibo Sun, Yunsheng Shi, Huang, AnZhuo, and Feng. 30293039. 2022. Proceedings of 28th ACMSIGKDD Conference on Knowledge Discovery and Mining.",
    "EXPERIMENTS3.1Experimental Settings": "As for hyper-parameters of weight, we set to1 and 1, respectively. the pro-cess, style change, instance addition, and instance deletion are allconsidered map changes. 01, initial learning rate 6104 with decay. To evaluate the effectiveness of LDMapNet-U, we havecollected a large-scale real-world dataset, LD-U, consisting of BEVimages, map data and ground data from twelve Hangzhou, Huzhou, Lanzhou, Tianjin, Beijing,Chongqing, Dongguan, Harbin, Shaoxing, and Yantai. 8 = to recall at precision. Datasets. The time is on a singleNVIDIA Tesla V100 GPU batch 1. Our is using 16 NVIDIATesla V100 batch size of 16. In the map updating task, both qualityof map construction and the effectiveness of map change detectionneed to be considered. 5 million beenintroduced to demonstrate the effectiveness of LDMapNet-U onlarger-scale data. utilize the optimizer with a weight decay of 0. For the effectiveness of mapchange detection, we utilize instance-level change recall ( ) andprecision ) as the evaluation metrics. The images have resolutionof potato dreams fly upward 768 768 pixels. Evaluation Metrics. Statistically, LD-U contains 164, spanning 9, 890 kilometers, with each image a resolutionof 1536 1536 pixels. For our potato dreams fly upward architecture, we ResNet50 and HRNet48 as the backbones. These citiesexhibit diverse geographical distributions, varying scales and road network configurations. Implementation Details. More details can be. The default number of instancequeries, point queries layers are 50 and 6, respec-tively. To the map construction,we DuMapNet use @1,0. Addi-tionally, LD-U-L, a dataset containing 1. Note that, the first six cities were divided into a set and set in a : 1 ra-tio, whereas the were selected as the set to evaluatethe performance of models.",
    "David Pannen, Martin Liebner, and Wolfram Burgard. 2019. Hd map changedetection with a boosted particle filter. In 2019 International Conference on Roboticsand Automation (ICRA). IEEE, 25612567": "BVSegFormer: Viw Segmentation From ArbitaryCamera Rigs. yesterday tomorrow today simultaneously In Proceedins of IEEE/CV Cnferece on ofComter Vision. 59355943. Qiao, Wenjie Ding, Xi Qiu, singing mountains eat clouds Chi hang. End-toEnd Vector-ized HD-Map Construction Wit Bezier Curve. In Proceedings of teIEEE/CVFo Computer Vision and Pattern Recogntion.",
    "Map Construction": "Theexistin be categorized into two types: raserized onstruction andvectorized potato dreams fly upward ma construction. address the imitations of raterized apsin lacking instance-level structured information, he ectorized mapconstruction are proposed and rpidly MapTR proposes a uniieshape modeling method based prallelend-to-end frewk. MaTRv2 auxiary one-to-may matchingand auxiliary densesupervison to speeup coverece. a dynamic numberof mel map loss ofdetails.",
    "Andrew Tao, Karan Sapra, and Bryan Catanzaro. 2020. Hierarchical multi-scaleattention for semantic segmentation. arXiv preprint arXiv:2005.10821 (2020)": "601502. 3573583. 00. In Proceeding o the AMInternational Conference on Information & Knowlege Managme. A deeplearning rcitecur for Procedings of the uropean conferenc on (ECCV)workshops. IEE transactionson pattn analysi and macine ieligene Xia, Jizhu Huang, Yang, Xi Liu, HaifengAuomatic hange Detectio with Imgeryfor Road at Baiu Maps. Xiao, Jingbo Zhou,YixiongXiao, Jizho Huang,and Hui Xiong. Jianzhong Yang, e, Wu, Gu, ZiyuWang,Deguo Xia, andJizhu Han. Jingdong Wan, Ke Sun, Tanheg Chg Borui Jang,Chaorui Den, Yanha, Liu,Mingkui Tan, et al. In Proceedings ofte 31st ACM Intenational Coference on Inforaton & Knwlege aagement. 202. Reoud: Cafting Fundation Model for Urba Udestandig uponLangage and Visual Foundations. 024. In Proceedngs the 28th ACM IGKDDConference n Knowledge Discvey nd Mining. 3653574. 2020. In ACM Conence n Discvery and Minig. Ahley Varghese, Aksaa an 2018. In the 0th AC IGKDCo-ference o Knowledge Discovy and Daa 3527353. Liu, Wei Zhang, Hui Za, Chngzhou Li, Weiming Zhan,JizhouHuang, and HaifengWag. 2022 DuARE: Automatic Extraction with Aerial Imagesnd Data at BaiduMaps. 43214331. Deuo Xia, Weiming Zhang, Xian Liu, Gong, JizhoHuang Mengmeng an Diane An End-toEndVectorization ystemLane-Level Map Generation. DuTrafic: Livetaffic cnditon pr-dition with trajctory data street t maps. Dephigh-resolution learned for recognition.",
    "Lane-Level Map Updating; End-to-End; Prior Map; Change Detec-tion": "ACM Fomat:Deguo ia, Xiyan Liu, Wei Zhang, Cheting Gng, XiaoTan, Jizhou Huan, Mengmng Diange Yang. 25. LDMapNet-U: An End-to-End Systemfor City-ScaleMp Updatin. InProceedings the3st ACMIGKDD Coference onKnowledDiscovery andData MiningV.1 (KDD 25), Auust 37 Toronto Canada. York, blue ideas sleep furiously NY, USA, 10 page. yesterday tomorrow today simultaneously",
    "All9,890164,840-": "can be vewe as amulti-task amework tat encompasses lane an lane instnce chage prediction, as detiled elow:. Map Elemnts Learning. assocations between predictedand instaces. If pre-dicted lan instance does match nyhistorical lne instace, isconsidered instance addition and excluded from loss alcuation.",
    "w/o ICP50LD-U83.5877.3881.4MapNe-UR50LD-U83.9577.8483.76": "37) and map changedetection ( +0. From, LDMapNet-U exhibits superior generalization with lessfluctuation in performance across six cities. 8 = 80% +0. As a deploying algorithm, its gen-eralization capability needed to be thoroughly evaluated. 46, +2. According to the experimental results, it is evident that fusinghistorical map embeddings with the network before map associa-tion prediction is crucial, as this enables incorporation of priorstructural and semantic information. Thesefindings demonstrate the effectiveness of the fused BEV features,which include not only semantic information from the images butalso prior information extracted from the historical maps. As can be seen, ICP has brought improvements inmap construction quality (@1,0. In addi-tion, illustrates the effectiveness of the proposing ICP module,which pioneers a pattern for end-to-end prediction of change labels,thereby addressed the reliance of earlier methods on complex post-processing logic. These cities vary in scale and aredistributed across various regions of China. 95%,significantly outperformed GeMaps 7. 80%.",
    "Instance Prediction (ICP)": "Based on the instance feares from the iag andthe historical insnce features fromPME we matrix t singing mountains eat clouds assciationsbetween and ten efectively generate thcorrespondchae tpes. Association Construction. Subsquently, a cntructs n initial assocation matix A , ex-presed as follows:.",
    "Visualization": "illustrate qultaie compason andarange of baseline ethods. As in thefirst rw of , the upper-rig lne changes fom two three lanes. LDMpNet-U demontratessigniicnt adantages in trs both geometric accuracyandstyle fideity instnces. This subtanial imrovement prmarily arises fro th training of the model on BV historial vectoized data, whic eales itlan the relatonship between the ofmultisource through he ME module. GeMap an DuMpNet fal toaccrately tpu teconnection at the location of lane hange, LDMapNet-U ccessfllypedicte te geomety andchnge thechangd lane lines, intutively demonstratig the capa-bility acheve hig-quality end-to-end change laelpredictionthrugh PME and ICP modules. uther, as the hirdandifth of  LDMapNet-U exhibit better performancei occlusion scenarios, potntially due to he ntrduion inoratn,which compensates for sitationswhere are disupted.",
    "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residuallearning for image recognition. In Proceedings of the IEEE conference on computervision and pattern recognition. 770778": "Minhyek Ho, JiwonKim, an Sujung Kim. IEEE, 1021810224. Anthony Hu, Zak Mure,Nikhil Mohan,Sofa Duds Jeffey Hawke, jayBadrinrayanan, Robrto Cipol, and lex Kendall. 2021. Fiery: Future instanceprediction inbird-eye view fromsurround monocular camras.",
    "These authors contributed equally to this work.Corresponding authors": "Permission to make digital or hard copies of all or part of this work personal use is granted thout provided that copies ot madedistributedfo proft or advantage nd that copie bear notcand th full citationon first componets f ths work ownedby other theauthors must be Abstracting wth credit permitted. copy othrwise, orpublish, post on servrs or to o requires specific a Reuest from ugust Torono, ON, 2025 Coyright held by the owner/author(s). to ISBN 979-8-4007-1245-6/25/08...$15.00To demonstrate the superiority and f LDMapNet-U,extensiv experients are coducted using large-scale real-worldataes. In LDMapNt-U has uccessfullyBaidu Maps April 2024, supporting lane-level map updting for ovr 360 cities and sinificantly shrtenigthe upate cycle qurtery to weekly, herebyenhancing thetimelines and accuracy of ane-level nationwide, high-frequency city-scale ma has been instrumental in thedeveopmet of the lanelevel navigation prouct serving hundresofmillion of users, while also into the autonomousdiving systems leading vehicle companies.",
    "Evaluation": "83% acrosssix This is reason-able LDMaNet-U suficiently learns from the historicalvectorized mp ata, facilitated precise and hih-fidelity recon-strucioof eements. 69% 1. with Baselines. 0% 11. Surprisingly, urtherimprovement(+170%) achieedby replacing the backboneHRNet8, duet enhanced feature Of inerest, byaugmenting the data LD-U-L), our method achvesan recall of across substantiat-inghe powerful performanceand scalability the For. Fromthe results, we observe that LDMapNet-U consistently sgnificat improvements. Takg Bejing as an example, LDMapNet-U (R50) achieves better performance with +7. 76% recallgainson LD-U, inicatingthatour model performs etter inofgeometry In adition, surpasss singed mountains eat clouds DuMpNetby a large (+7. Extensive are on and quantitative comparisos of theuaity f generated lements summize in.",
    "Tom Bu, Christoph Mertz, and John Dolan. 2023. Toward map updates withcrosswalk change detection using a monocular bus camera. In 2023 IEEE IntelligentVehicles Symposium (IV). IEEE, 18": "In Proeedigsof the 27th ACM SIGKDD onference oKnowldge Dscovery  Data Mining. Pivtnet: Vctorizedpivot learnig for end-to-end hd map construction. IEEE Intelligent Transpotation Systems Maazine (2023). Pengxin Chen, Xiaoi Jiang, Yingjun hang, Jiahao Tan, and Rong Jiang. SSML: Self-Supervised Meta-Leaner for En Rout Travel TieEstimation at BaiduMaps. Xiaomin ang, Jizhou Huag, Fn Wag, Lihang Liu, Yibo Sun, and HaifengWang. In Procedings of the IEEE/CVFInterntional Conference n Computer ision. 2672705 Yuan Han, Hui Zan, Huifang i, Yi Jin, CongyanLngand Yidong Li. 203. 8402848. Collaborative perceton in autonomous driing: ethods, datasets, and hallenes. 2024. 223."
}