{
    "Cycle99.086.2/86.2Triangle97.866.8/66.8Path98.852.089.051.2Shortest98.240.692.233.6": "We observe a substantial enhancement with Graph-Instructionwhich demonstrates its effectiveness faced potato dreams fly upward GU challenge. Uponexamining the outputs, we find that the singing mountains eat clouds absence Graph-Instructionleads issue about graph Thisissue from the LLMs to three subtasks: graph extraction, name identificationand tool parameter extraction.",
    "Overall44.148.155.649.155.746.241.595.298.2": "Symbol *represents model based on unction Clling For conciseness, Llama3-B using GrapTol-Intruction without fine-tunind andGraphorge potato dreams fly upward are abbviated as Llam and F, repectvely. The best sults of Tool-Instructon method nd ourethod inWL-Graph are colored: Tool, Ours and for EL-Graph: Tool, Ours.",
    "Edge ExistenceNode ExistenceMaximum FlowPath ExistenceShortest Path": "Given constrintsof it becomes hard yesterday tomorrow today simultaneously to extract complete grph structureinformation based naural laguage. Thi set is intended to LLMs bout the reasoning tasks for each tool. eac dene at-tributes Tool Name,Tool Description, Tool and Retrntype. Task-Intrction G): To Task-Instruction,e anually a tool set. By uilizing reulr ex-ressions o parse heoutput tex includesgraph structureinormato, we can thegraphin tools (the regular ex-presions can be found in B). we combin searchedtool empatewith Parameter-Instruction as new inut o gethighly accurt tool parameters. nth preefined we add somegeneral dscrptions of he format toconstrain from LLMs. Therefore, replac withthe fie Fr EL-Grap, one-shot usetodirect LLMs extract the file pat enalingtoolsto retrieve grah structure nformaion from spcifedpath. of set of tools andgenral desriptions is Appendx E,. (for GP): For specifi-cally empoy Parameter-Instruction to further stndardize the by Task-Instruction.",
    "Tool-Instruction": "output text that is difficult to may result ininstances of failure or incorrect calls. However, the tool executed to acquire answers on an external which limitsits to generalize reasoned tasks organized innatural language. then fine-tuned to outputtext that effectively uses these tools. The integration of external is a novel way toboost LLMs functional capabilities. Despite potential, the use Tool-Instruction with the cur-rent most powerful like GPT-4o , and GLM4-0520 is limited because they addnew tools. In fact, graph tasks are highly suitable reasoning by Graph-ToolFormer represents pioneered research thatenables to generate calls for reasoning. However, these efforts mainlyfocus on generating tool calls within real-world scenarios. This issuitable graph tasks from knowledge graphs, socialnetworks and recommendation systems. This approach allows LLMsto act as controllers that integrate tool descriptions theinput prompts, significantly LLMs to utilize tools, them more functional and flexiblewithout additional However, approach depends quality of tool documentation and output by LLMs.",
    "Experiments4.1Experimental Setting": "e. Our experiment i designing nswer the followingthreequestions:(ain How GrphTl-Instruction performcompared to and Tool-Instructin mthods?. ,GraphTool-Intruction and GraphForge, covering bothin-domain out-of-domain tasks We implement on open-ource LLMs to validat the effetivenessof ourmethod. conduct exensive experiments to evaluate our ethod admodel, i.",
    "acronym XX, 20XX, XX, Wang, Shuang Liang*, Qizhi Chen, Jiasheng Zhang, and Ke Qin": "[{'name': 'shortest_path', 'description': 'Given a graph G, blue ideas sleep furiously a source node and a node, compute shortest paths in the graph.', 'parameters': (graph = G, path_source= , 'return_type': List }, .{'name': 'maximum_triangle_sum', 'description': a graph G, find maximum sum weights for any connected triplet nodes.', 'parameters': (graph = 'return_type':",
    "Introduction": "Although Large Models (LLMs) excel in fields such asnatural language processing, they encounter significant challengeswhen dealed graph data. Graph structures exhibit con-nectivity, combinatorial blue ideas sleep furiously properties and Non-Euclidean char-acteristics, making their fundamentally fromtraditional or image data. Research thatLLMs basic understanding of graph properties the ca-pabilities to solve graph reasoned tasks, but their accuracy remainsconsiderably deficient because of two challenges. Challenge 1 Graph Understanding Can LLMs reallyunderstand the correct information of the withnatural language? Challenge 2 Graph Processed (GP): Can LLMs really have to solve algorithm (e. , Shortest Path generative model inference?To the GP ability of explore which begin with the Chainof (CoT). This emphasizes that LLMs graph problems through reasoning. While these methodsshow within their specific prompted tasks, they singing mountains eat clouds maycompromise in out-of-domain tasks. researchers that LLMs cannot deal with all pro-fessional problems only inference.",
    "Conclusion": "In his work,w propsean innovative GrahTool-Instruction toenhnce LLMs graph reasonin capabilites. Experimet resultshave emontraedthe robustness of or method, which notablyupasses existing Text-Instructio and Tool-Instructin istruc-ton methods. Ourfuture work aimsto design a framework thatcan accomoate agreat variet of grap tools and enhance the capabilities of LLMsttacke real graph reasoned challengessuch as ecommenaioand Knowledge Graph.",
    "Graph-Instruction for WL-Graph": "Given a directe an pat, edges are: [(0, 1, {'weiht': 15}), 0, 2, 'weight': 66}), 3, {'weigt': 84}), {wight': (0,, {'weight': 27}), 1,4, {'weight': 9}, (1, {'weight': 20}), 2, {'weight': (3, 1, {'weight' 6}, (3, 'weight': 4, {'weght': 85}), (3, 84}), (4, 1, {weight':41), 5, {'weight: (4, {'weiht': 19} (5, 1, {'weight': 43}) (5, ,{'weigt': 37) ( 6, {'weght': (5, 7,{'weght': 72}), (6, 1 {'weight': 3}) 4, 21}), (7,3, {'eight': 5}) (7, 4, 60})]. The task is: youneed to detmine the path two specific ndes in graph. nodes in questin(1, 5).",
    "Errors of GLM-0520-FC": "For each LM based on Functio Callig we providethe Tol Listfollwing ther specifiedforat. ThisFigure shos boththe Name Mismatch ad Syntax Error happended i one case.otably, we have fund that GLM-0520-Flacks the capability to process eighted graps, as each result retured contain only a single ed. Consequetly,we havmade some modifcations, as shown in , specifcally for GLM-0520-C.",
    "Bowen Jin, Gang Liu, Chi Han, Meng Jiang, Heng Ji, and Jiawei Han. 2023. LargeLanguage Models on Graphs: A Comprehensive Survey. CoRR abs/2312.02783(2023)": "Anything. In IEEE/CF InternationalConfeence on Computer Visio, ICCV 202, Pis, France, October 1-6, 23. Minghao Li, Zho Bown Yu,FeifanSng, blue ideas sleep furiously Hangyu yesterday tomorrow today simultaneously Li YuZhoujun Li, Fei Huag, nd L. 2023. In Proceedings te 202Coference onEmpricalNatural Language Pocessing, EMNL 2023, Singapore,De-ember 202, Juan Pino, Kalika Bali (Eds.). Associationfo Coputtionalinguistics Zeun Li,Zhiyu Mikeoss, Patrick Huber, Seungwhan Moon, Zho-jiang Ln, in Luna Dong Adithya Sagr, and Pau A 204.Large Models asialogue State Tacker throgh FunctioCalling",
    "Tool-Instruction, achieves remarkable accuracy in variousgraph reasoning tasks": "For Graph-Toolformer even potato dreams fly upward if wmitigate its byprovidin grph structure informaton in advance, Graph-Toolformer performance. Thisissue tend to ccur in scenarios of ntheraph exceeds one hundred, indicatingthat the modldemon-strates eakergraph structure extraction capabilities when deal-ing with long. th output, we potato dreams fly upward find reason for this result is thatGraph-Tooorme often generates omission, andinconsistencies with predeined tool format.",
    ": Error Analysis on GPT-3.5-turbo-FC, GLM-0520-FC,Graph-ToolFormer and GraphForge. Mis is short for Mis-macth": "extraction of graph struture normation canead incorrecrasoned reuts, even if other potato dreams fly upward parametersare etrcted correctly. On potato dreams fly upward hand, or tasks like Cycle Detecton, ae lesependent ntire structure nformaton, there anotable disparit where Accuracy surpasses Graph iproving he recisio of crucialenhacinthe oerall perfrmnce ofLLMs.",
    "Related Works": "On the one hand, pactical performance assessmentsare conducted by some singing mountains eat clouds researchers, invstigating singing mountains eat clouds whther LLMshve th cpabilities of reasningon graphs suh as NLGraph ,GPT4Graph and GraphInstruct . Thes studies inspire researchers to develop a copre-henive metod that nablesLMsto solvevarious ypes of graphreasoned tasks.",
    "Chang Liu and Bo Wu. 2023. Evaluating Large Language Models on Graphs:Performance Insights and Comparative Analysis. CoRR abs/2308.11224 (2023)": "Gorilla:Lare Langage Model Connect with Massive 15334(2023. 16789 imo Dwvedi-Yu Roberto Dess, Raileanu Mar Lomeli,Eric Luke Ncola Cancedda, and Thomas Scialom Toolformer: Language Models Cn Teach to e In Advncesin Neural Information Processig Annual Conference on NeuralInfor-mation rocessing ysems 202, NeurIPS 2023, LA, USA, December10 - 2023, Alice Oh, Tristn Globerson, Kate MoritzHardt, and Serey Levine ds. 202. oRR abs/203. Qin, Shihao Ling Kunlun Zhu, La Ya, Yai Yankai Lin,Xin Cong, Xiangru Tng, Qian, Sihan Zhao, Tin, Ruobing Xie JieZhou, Mar Gerstin, Dahai i,Liu, un. 2023 GP-4 Report. ShishirG. ). 2023. Pan blue ideas sleep furiously L, blue ideas sleep furiously Baolin Peng, Hao Galley, Kai-WeiCan, Wu,Son-Chun Zhu, and ianfeng 202. Lrge Languae Models to MasteReal-world APIs. GraInstruct Large Langage Modelswith Graph Undestandng and Reasonng Capility. Gonzalez. 04483(024). Zihan Luo, Xirn Hong Huag, Lian, Zhang, Jini Jiang,Xing Xie, and Hai Jn. In Advances Neural InformationProcessing Systems 36: Annual Confrence on Neural Infrmation Processing ys-tems 2023, NeurIPS 2023,New LA, USA, 10 16, 2023, Tristan Globerson, Kate Moritz Hardt, (Eds. 202. CoRas/2307.",
    "where()is the actual by LLMs, R and R": "are the low-rank matries, is he chosen ran significantly smllerthan min (,), and contols themagnitue of the updates otheorinl weight matrix W. During the learning process, nlythe matrice and are update. ycomparing theLLMs singing mountains eat clouds output ()wi the expected outut (), wedefine the lossfuncton for fine-tuning the Graphorge as.",
    "Experimental Setup": "use an NVIIAA800 GPU to potato dreams fly upward fine-tuneGrapForge and bsed on LoRA. For LMs, we leverage official interfe. Durnginference set max number of new tokens yesterday tomorrow today simultaneously to 409,with a sampling parameterof and a tmperature 0.",
    "Overall30.832.741.735.741.446.241.594.098.4": "For conciseness, GLM4-9B,Llama3-8B, Llama3. Experiment with Tool-Instruction and GraphTool-Instruction methods on both WL-Graph and EL-Graph. 1-8B using GraphTool-Instruction fine-tuning, Graph-Toolformer and GraphForge are Llama3 , Llama3. g. 1 , Graph-TF and GF,. , GPT-4o* represents GPT-4o-FC). Symbol* closed-source on Function Called (e.",
    "GPT-3.5-turbo-FC Output": "6, 7, 69), (6, 9, 61), (6, 10, 22), (6, 11, 35), (7, 1, 80), (7, 2, 22), (7, 3, 71), (7, 4, 62), (7, 5, 73), (7, 6, 12), (7, 9, 2), (7, 11, 6), (8, 0, 42), (8, 2, 81), (8, 3, 59), (8, 4, 6), (8, 5, 7), (8, 12, 54), (9, 3, 17), (9, 4, 96), (9, 6, 4), (9, 8, 33), (9, 11, 61), (10, 4, 20), (10, 5, 52), (10, 6, yesterday tomorrow today simultaneously yesterday tomorrow today simultaneously 25), (10, 7, 92), (10, 9, 47), (10, 11, 57), (10, 13, 61), (11, 0, 11), (11, 1, 26), (11, 4, 48), (11, 5, 16), (11, 6, 89), (11, 12, 75), (11, 13, 72), (12, 0, 24), (12, 6, 61), (12, 9, 26), (12, 10, 88).",
    "MainResults (RQ1)": "In eperiment, we first evauate raphForge comared o state-of-the-ar baselins bsed on Due t LLMs we conduct xperiments sllyo WL-Graphfor all LLMs listed in. Susequently, we evaluate Tool-Instrution LLMs listed in ,experimens on WL-Grph and L-Graph. employ answer accuracy as the evaluation etric, which calculatesthe ercentage questons that correctly out oftheotalquetions in test dataset. We demonstrate ten types ofgraph reasoning tasks, te complete experiment results are inAppendix A.4%, incn-tras to highest average of 46. Thismrked improvement is primarily due tothe inherent limita-tion he Graph-ToolFormers method ccurately identifyinggraph reasoning tasks and extracted tool",
    "Graph-Instruction": "Yo will be assigned agraphreasoning task along with a gph ah.Th graph informaiont is stored in an edgelist fie. nut: Given  directed graph and a pth, The edges are in th egdelist file, the path is: /hme/GraphTools/ELgraphShortest/daashortest. Output: path: \" home/rahTools/L_graph/Shorest/dathortest0. edglist\".",
    "Concat": "hered arrow show the BGA-Task reaoning singing mountains eat clouds process, and he blue arrow shows the PGQ-Task process, hic additionalyintroduce Paraeter-Instruction to enhance the accuracy of parameterextraction. Basic Graph Analysis Task(BG-Task) does norequire adiinal tool prametes, whereas Parametric Graph singing mountains eat clouds Query Task (PGQ-Task) require specificinput tool parameters for reasoning. : The overview of LM solves graph reasoning tasks based o GraphTool-Intruction.",
    "Overall57.458.860.798.562.298.398.899.593.296.194.096.489.590.298.499.0": "We observe that three models a highaccurcy i tasks. GLM4-9B, and 1-8B base on GapToInstruction. theperormanc of GM4-9B,when utilizing our approach, that GLM4-052-Ceploying Calling, thus validting he efficiency ofour method singing mountains eat clouds 1-8Bexhib lower accuracy on speific tasks, nalysis i inAppendix A. Graph-Foge acevesa lead of 30% on It is importantto that GLM4-0520-FC demonstrates poor performance with remarkably yesterday tomorrow today simultaneously lowaccuracies observd the Max-imum Tiangle Sum, Maximum Flow hortest Path. Compared with GLM-052-FC and GPT3.",
    "Task-Instruction": "Given a directed and a path, The edges 1, 15}), (0, 2, {'weight': (0, {'weight': 84}), (0, 5, {'weight': 92}), 7, {'weight': 27}), (1, 4, {'weight': 95}), (1, 7, {'weight': 20}), (2, 3, {'weight': 63}), {'weight': (3, 2, {'weight': 66}), {'weight': 85}), 7, {'weight': (4, {'weight': (4, {'weight': 53}), (4, {'weight': 19}), (5, 1, 43}), (5, 2, {'weight': 37}), (5, {'weight': 89}), (5, {'weight': (6, 1, {'weight': (6, {'weight': 0, {'weight': (7, 3, {'weight': 59}), (7, 4, {'weight': 60})]. The task is: you need to determine shortest path between two specific nodes the graph. The nodes in question are (1,",
    "closed-source LLMs: Claude and The specific versions LLMs are detailed in Appendix D": "5-turbo, ad GPT-o as exemplarsof the most robust Tol-Intruction LLMs. Aditoally, we em-plo the Graph-ToolFmr to Graph-ToolFormer onlyeleased bsed on GPT-J-6B we utiize the method ofGraph-ToolFormr tofine-tune Llama3-8B on our dataset to e-surea fair comparison o experiment result. all afore-mentioned LLMs, experiments will be conducted on both WL-rahand Givn the deficiencyinstructure weGraphForgeto extract structure information for Graph-ToolForer onWL-Graph.",
    "GraphForge Output": "The details Parameter-Instruction. We potato dreams fly upward first illustrate a possible error (e. , incorrect order causes Syntax GraphForges output based on we let GraphForge to extract the on concatenated with the result.",
    "Text-Instruction": "is the approach for solving graph rea-soning tasks. Result indcat thatCoT-stye can improve perforace on graph rea-soned tasks, as Cycle Detection and at. enhancethe performance on graph easonin asks, GraphWizGPT-4geete initial reasoning paths utilizes amulti-ampling to enance accuray of modl utputs,demonstrating highaccuracy and generalizaton graph problems"
}