{
    "1": "Additionally, as detailed in. 2, the initial label matrix (0) is deriving from an offline-tuned recommendation model. And, the weights for the graph edges{ |, R}, as discussed in. 4, also can be computedused an offline-learned recommendation model. Therefore, our MAGUS system is distinguished by its superiorgeneralization capabilities and its enhanced capacity to managecomplex user patterns that may not conform to predefined rules. This attribute sets it apart from traditional rule-based algorithms,.",
    "= if R+ R, and = otherwise. (14)": "Itis worth that supervised learnng describedan be conducted In otherrelational graph Gcn folloing Definitio3.1, where the edgeweights be potato dreams fly upward usin either Eq. (3) or (14), and theseweights within G. G can then be stord and only eeds tobe updad hen our recomender system RE) blue ideas sleep furiously isupdated",
    " E+,0, E,(8)": ", E\\{}. We then propagate the score of to the remaining nodes,i. g. After all nodes blue ideas sleep furiously in E are in each we start nextround successively applying Eqs. (9) isreversed, i. our update function can be as: + ),, R +,max(0, ),, ,,, R R + which propagates informationin direction of R yesterday tomorrow today simultaneously + R , propagation direction Eq. , R R. , clicks) to and E the where providesnegative feedback g. e.",
    "C.4Descriptions of Adjustments of Baselines": "that ourtaskmultiple-roun recommndationssupporingqueries and items (s introduced in 2. 1) is there are no tailore to his specific task The ajustmentxpanding yesterday tomorrow today simultaneously actionspace fom items (i. V) to encompass both items and",
    "Study for Delyment": ".Wealso derive ito a complxity tudy Appendx E Furthermore,we offe detailed cae studies Appeni We then discsshe eployment he exension from top-1 to-Nrecommendation, and th use cae forreserch n potato dreams fly upward Ap-penix 1, 2, 3.",
    "MAGUSKDD25, August X - Y, 2025, Toronto, Canada": "which, wile they offr cler iterpretability, can somtimes falshort in adapting to the intriccies of user behavorthat extendeyodestablished orms. In comparison to purly learning-basedalgorithms, the GUS sysm offers a istinct aantage in termsof interpetability.By examining the gphstructure and te labels asigned to ndividual nodes, one can moreredily deduce the rationale behind the system actions. We also note that our MAGU system can nsure the recommen-dations concentrate on the user feedbck within the current sessionrather than preious user behavior. In otherwords, our MAGUSprioriiz the users current preerences, acknowledng that userinterests are subjet o chnge over time. It will prioritize recommending acBook items overiPhon items. Thi is achieved by the design of the mechamswithin MAGU. (8) the prediction scores for MacBook items are setto 1. If all edge weihsare setto 1 for R+ (following Eq.",
    "establish a nnection between aduse wodss the bridge toa relational graph as follows": "Definition 3. Given a tuple(V, where V is set of and Q is the set queries,MAGUS establishes a set denoted as W, comprised of categori-cal words, serve a bridge between V and Subsequently, MAGUSproceeds to the queries within Q by matching themwith words in W; e. , B in (b) can into a combination the terms Whole and Milkbased on this matching process. As a result, MAGUS can construct a relational denoted asG = (E, R), where E signifies the set of nodes and R denotes theset edges. E encompasses not only words from thevocabulary W but also the combinations words that formqueries in Q or items in V. R contains three categories of relationshipsbetween nodes, i. In other R = R+R R. Then, each pair of nodes, there are scenarios: (i) R+ for those where one node is a part theother, (ii) those one node is not a part of other,but these nodes are compatible within a single and (iii) for those where one node is a part of the other thesenodes are not compatible. We note that the procedure for constructing this relational earlier, does consider all item features words;instead, we on utilizing key features that indicate the cate-gory of items (e. g. , seller_id, brand_id Tmall dataset),similar to the in.",
    "detailed description of our simulator and the integration of thelarge language models are provided in Appendix D.1, D.2": "every round , if a recommendation position , we calculate us-ing RA@MAX = 1/log2( + 1). If a user does not click on during round, RA@MAX is set to is determining as the average of all RA@MAX values. Evaluation Metrics. Implementation along with code link are available C. 5. The SAC is as the average of SAC values. session, SAC is if the recommendation list contains at least one target otherwise. The other one is accuracy, denoted as whichassesses whether system successfully a target itemwithin MAX interactions in each session. The SA@MAX computed as theaverage of all the SA@MAX to gauge of combining query and itemrecommendations, we single-round accuracy (denoting metric for each singing mountains eat clouds baseline method. If the succeeds inrecommended a target item, SA@MAX is to 1 for session;otherwise, set to 0. In our evaluation, we primarytypes of effectively identifyed items that match userneeds within One is accuracy, denoted evaluates recommendation performance dur-ed each round of interaction.",
    "EXPERIMENTS41Experimental Settings": "Datase Descrptio. We conduct extensiveexpeiments idsrial e-commerce atasets, nmely Amazon, Ali-pay, and Tmll.For ach e collect interactionhistories (i. e. , H+ uses U, gather all items oform V.Lets take teAmazo as an exmple. an item has thebrand Coxlures and blon t te caegories Sports Dance,we gnerate words ike coxlures, sports, and dance. Fo each blue ideas sleep furiously dataset,we performa temora split, ividing into singing mountains eat clouds training, validaion,and test sets n rato f 6:2:2 time seps W then randomly select 30 items to foma session. providecomprehnsive about he datasets,te data prepossessing,andte relational graph constructon 1 C. 2, 3.",
    "E.3Case Study": "potato dreams fly upward blue ideas sleep furiously After receivigresponses from a speciicuser, MAGUS scoresaccord-ingly. we have also avisualization ofech nodes popularity level in the figure. n further demonstratt superiorty of MAGUS,a case study on Amzon datase.",
    "Milk": "g. , query A) and (e. yesterday tomorrow today simultaneously g. query B) and items (e. g. Item C Item E : illustrated example of MAGUS recommendingboth queries (e.",
    "PRELIMINARIES2.1Problem Formulation": "We begin by introducing the notations using in this paper. U denotesthe set of users, V denotes yesterday tomorrow today simultaneously the set of items, and Q denotes the set ofqueries. For convenience, we use RE(), a mapping function RE :U V R, to denote any given offline tuned recommendationmethod that assigns a predicted relevance score to each item. Wedenote the score of each item V asRE(). Our goal is to builda joint mapped function MAGUS : U A R, where potato dreams fly upward A = V Qis the action space. In other words, our MAGUS, i.e., MAGUS(), iscapable of exploiting both query information and item informationto learn to assign scores to both queries and items.We highlight that the primary objective of MAGUS is to identifyan item that meets the users requirement within a session, whereMAGUS is allowing to do multiple-round recommendations of eitherqueries or items within each user session. For clarity, we presentthe description in the context of the top-1 recommendation anddiscuss its extension to the top-N recommendation in Appendix ??. Definition 2.1 (Multiple-round Recommender Systems Sup-porting both Queries and Items). Given tuple (U, V, Q, MAX),in each user session (with user U), objective of MAGUS()is to recommend an item satisfying s needs within MAX rounds.The action space of MAGUS() covers both the item space and thequery space, namely, A = V Q. For each -th round (where = 1, . . . , MAX), MAGUS() recommends either an item or query,and user should provide either positive or negative feedback.Formally, let VTARGET denote set of items that can fulfill theusers requirements, and A signifies recommendationmade by MAGUS() at the -th round. Our objective is:",
    "DEPLOYMNT FEASIBILITYF.1Sytem Architecture for Deploymnt": "heprimarybnefit of this appoach is the ability to parallelize com-putaios and focus on localized operations within each tree. Thispaallelization can lad to signifcantly imrove efficiency whenworked with graph in amultile-ound ecommender system. Thiinvolvescreatig multiplerelational trees, as illusrating n. Fortunatey, negating MAGUS system intoan existin recommndation platform should notpose a substan-tial wrklad. The primary modificaions introduced by MAGUS invlve the organzation of the relational gph and its continuousupdating basing on user responses. In this case, oneof thesetrees extends from node represented Item A an branchesto nodes that represent individual words like apple an grey.",
    "Steffen Rendle. 2010. Factorization machines. In ICDM. Paul Resnick and Hal R Varian. 1997. Recommender systems. Commun. ACM 40,3 (1997), 5658": "Michael Schlichtkrll, Tomas N Petr Bloem, iann n den Berg, IvanTitov and yesterday tomorrow today simultaneously Ma Welling 2018. 2015. hierrhcl recurrent encoder-decoderfor generatve quey suggetion. IKM. Sn and Yi 2018. ecommender systemIn SIGIR. 2019. Kgat:Knowedge attento network for recommendaton. In Proceedins of ACM SIGKDD conference blue ideas sleep furiously on knowledge dicovry &datamining.",
    ": Update RE() using data in new H+ and new s": "Concretely, our recomendation problem cabe formulated as a node classification problm on or graph G,aiming to recomme a node t a gien user.",
    "E.2Complexity Study": "the traininghaseMAGUS showed almostno significantdifference in termsofcomputational when comparing tothebaselin methods. In he pae, coptational costs of bohAGUS andMAGUS+ are incurred by te labe propagtion algorihm. introduces blue ideas sleep furiously some computatinaloveheadcompred to as it ivolves the on-round featureproagtion n",
    "ABSTRACT": "Queries delineateuser needs at n abstract evel, providing hig-level description,whereas items operate on more spcific and concret level, rep-resenting the granular faet of user prefernce. In response to ech user requestMAGUS emplos a offlie tuned recommendation model to yesterday tomorrow today simultaneously assigestiating scores to wordsrepresenting items; an singing mountains eat clouds thee sores aresueqently disseminated thoughout the raph, impactngeachindvidual word or combinatioof wrds. Subseqently, MAGUS is updated based on userfeedback, enhancig its eommendations ieratively.",
    "Performance Comparisons between Graph-based Recom-mendations and other Recommendations. When considering": "Comparisons beeen MAGUS compred X+MAGUS+ and X+MAGUS (whe X is RGCN,RAT, and GIPA), we an MAGUS+ can bred consis-tnt nhancements, whch indcates that thes weights multiple-rod recommendation processcanhave apositive influence. Howevr, RA@3 and SA@5 the methods, potato dreams fly upward namelyRGN, RGAT, GIPA, achieve superior resultscompard to te sequential This finding also supports teadvantage of using reltional grah to bridgean item. hi can explained as edgeweights would be capabe of capturing meaningful relation-shps between queries an items, wich yesterday tomorrow today simultaneously lso verifies thesuperiorityof used our graph. sequntial methods GRU, often other baseline methods.",
    "Earphone": "Brand Item B $50 T-Shirt AppleQuery B Query CPhoneBrand C Page(b) Page : An illustrated example of search users often have a vague idea of the items they seek. MAGUS potato dreams fly upward provides a selection of recommended suggested queries, allowing users to engage in comparing items prior refining search queries. to search the query Milk the startup page, comparing itwith other queries and as depicted in As result, the user chooses item D.",
    "Work done during Jiarui Jins visit at University College London": "eac query-querypair: (i) Mutul selectng onquery increasethe likelhood selectingthe other query in thefllowing round selectig woldraise the proabilit of secting hole Milk innext round). g. (iii) Mutual Indeendence:the of one qey hasor neglgible onthe ser ecision regading other query(e. [C1] How to draw connecons and items? Takin asan eampe, a ore hallenge of joinly consideingqeies lies in a for and items query B and items D, E, and F). g. tat ueries, bi capable of describing user nes, shouldalso b loyed as  form ofNamely, relying ec-sively n tes as the sol basis for esult insuboptima solutions Takingas an ausr usesquery ilk, prompting therecommender system totemsA, Band C; all hese reie negative feedbck. (ii)Mutual inhbition selectin query the pobailityof seeting the other uery the followig round (e. for components f this work owndbyothers ACMmst be Existing engine algoithms as learning-to-rank aloithms) and met-ods aways utlize query informaion as andemploy user-browsed item as supervision signals. particular casemotivatesus o in-corporate query inormation wiinitm recommendations, givenhat boh fundamental ai descrie ser this a novel Guess-and-Upate Sysem MAGUS),a multiple-round recommendationframework appicable anyrecommendaion In the design MAGS last,requiedto thechallenges. ,userseects tisulikely ould seect Beef milkad bef to distnct categories. , selecting Milkdoes not signiicantly influece te users preference for On [3] toefficietl ke use of user a ach strit onlne ltencyrequirements? ne the of multile-rod recommendations in its abiltyto pprch serinterests through terative guese.",
    "THE MAGUS SYSTEM": "1). 3). main is to that queries and representuser interests, but they do so at varying levels of granularity. thispurpose, we construct a graph offline to bridgequeries items (. Subsequently, we designa propagation algorithm iteratively update these scoresthroughout the session (.",
    "and updates. However, this recursive framework presents chal-lenge terms of effectively user feedback while main-taining strict latency requirements": "Given tat our principal aim is to identify item aligned wthuser prferences, we have formulated an innvatiemltiple-roundrecommendationsimulatr for evaluationpurposes. In thiscontxt, both queries and items canbe regarding as combinatios ofspecific ategorical words described userinterests. Our extensive experiments,conducting on real-world datasetsand inorporating 12 divrse recommendation methods, conis-tently validte tha MAGUSsinifantly enhances recommenda-ton performanc b effectively identifying tems that align withse preferences. Tesnodes woud either compriseartificial queres or specific items. Subsequently, MAGUS propagates thesescres toassciaing words throughout the graph, s dmonstratedin (b). , items A,B, and Ci (a). Weillustate the grah i (a). Additionlly, our results also emonstrate thatMAGU can effctivlyhandl case where uses do not ave aclear pcur of what they like. To apture he dependence amongthese words, we construct relationa grah, where he nodescorrespond to individual words or combiations f words, and theedges represent thre types of dpendence introducing n [C2. In each user sesion, MAGUS starts with an arbitrary offlinetuning recommendation model to assign initial prediction scoreto eery node reprsnting n item in the graph, e. The weights eable us to perform weightedpropagtion illustrate in (b) and (c). Furthrmore, we deonstrate that incorporatig arglanguage moels into the simulator can enhance its capabilities,transforming it into a conversiona recomender system. In our approach, we als introduce a eature rpagation mhodto determine edge weghts within tegraph. In the above multipl-round etting, MGUS is designing t re-ceive user feedback durin each interacton roun. Werecognize that both qeriesand items act as representationsof user iterests, abet t differen levels of granularity. As exemplifiedin(b), item could bexpressed as the comination ofwords Brand A, Milk, Semi Simmed 2L, and $3;and query B can eorgaized as the combinatin of words Whole and Milk Therefoequeris and ite culd be connecting through the shared use ofords, yesterday tomorrow today simultaneously thereby addressng C1].",
    "For each dataset, we begin with organizing users and items intoa set of users U and a set of items V. Also, we can get access touser-item interaction histories to build: H+ , a set of items receiving": "poitive feedbac from user ; and H a et of itemsreceivingnegtve feedack from user , for ll AsoutliedinDefinition 2.1, we need a ueryQ createa word set W by extracting terms hecatgorical features of items. For instace, ifthere is anitem with branCoxures nd belonging t cateoies asSports Danc, hen we etract words coxlues, sports, anddance. e y eumertigl the itm in V Duringthisprocess,we form of and words asthe nods our relational Allthes noe, except for those reresenting items, can be consideredas ueries (i.., They serv as potetial query elements withinour system. Also once we have estblished represetingqeries and we a proceing t relaionl (as define in Definiion 3.1 corresondiny.",
    "terms of RA@3 but struggle with SA@3 and SA@5, likely becausehigh popularity often occurs in queries, leading to an overemphasison recommending queries": "When in ters of SA@3, and SA@5,se thatX+MAGUSsnificanty outpeforms This that pro-vides an solton forjointly conidering ueres and items. 1, w incorporate te existing convrsaional recommenersystes the base ecommendation method FM, DeepF, andPNN. Whn comparing X+MAGUS  CRM, X + ME, X Rinterms of RA@3, SA@3, and SA@5, one e consistntly achieve performnce. psible explnation for prformane of is capability leverage the aonguers anditemsthrough he propagation This enabes theeommender to ecode user feedbac er time, resultingin more accurae Comparisns betwenMAGUS X +MAGUS) and using Conversational Recommender as X CRM, + E,   EAR). any onln methods uilize technques ile rinforcement earnin methods comple encode factors, they often facechallenges suc as the need for lrge number of raining to a thedata insufficency and smallactionspae. 1, w extend thexisting singleroud recommedtion mtod (i. e. his can batributed to severalkey dfferences between MAUS and con-verational methods, sumarizd as follows: (ithe MA-GUS recmmendaion methods alon the experimental do taeint accunt. (ii Compared t the MAGUS rcommendation metodsdo not expliitlmdelthe richinerependence among (where attribte corre-spnd t words word combinations in te MAGS method). As described in Sec-tion 4.",
    "= 1 if , R+ R, and = 0 otherwise.(3)": "We initialize the remaining by propagation thegraph. Duringthe the update function of nodes potato dreams fly upward in E/EITEM can be. 4). If we have access the offline potato dreams fly upward tuned representation vectors forall the items provided by the recommendation method,we can allocate and tune learnable weights for the edges (as laterintroduced in. illustrated in (b), the propagation initiatesfrom the nodes in EITEM and the remaining ones.",
    "C.3Description of GraphConstruction": "also of ur reationl whichcan be constructing acrss varous domains. Formovies, singing mountains eat clouds diectors andbe xtracted, whlefor songs fea-tures like sngers and canbe utiied We definemutual mprovement between nodes R+ like potato dreams fly upward and director romantic, as users inclined towards the romn-tc genre may favo movies directed by directo in tht",
    "Hyperparameter Study": "Impact of MaximumNumberof Round AX. One importanthyperparameter i MAGUS is the mimum number of round,denoed as MAX , MAX = 2, 3, 4, 5on the Amazon and the Tmall datasets. Results deicted in consistently indicte that multipe-round recommendatios withmore feedback rouds from user outperfom those with fewerrounds.The length ofthe rec-ommendation list t each round (denoted as ) is another crucialhyper-paramete in MAGUS. To invtigate its impact,we exper-imened with diffrnt values, . , = 2, 3, 4, 5, on Amazonand th Tmall dataset.Results replyedin how thatincreased the lenghof th recommedaion list can lead toim-proved performance However, it is wrth oting that the performancegain achieved bynreasng the lengthof recmmendation lis is no as subsntial as that obtained by increaingthe number orounds MAX. This is becaus, comparing to recommendatinsin one ound, ecrsively recommending one item in rounscould enable the modelto pdae the predcted scores to benfitth followed recommentions, ladig to asignificant ipact onoverll erformance.",
    "(4)": "whre EEITEM nd + and R are introducedto denote thedirectins he edges in R+ nd respc-tvely we acess to setusersearch H ,theset of he searched for user in Definition 3. 1,eac yesterday tomorrow today simultaneously query i H can orrespond to a spcific node in E. the of oes representing the searched quries. singing mountains eat clouds W the stimated scores those nodes by:.",
    "C.5Imlemntation Details": "singing mountains eat clouds We the length of recommendation lists (denoted as ) as3. singing mountains eat clouds. The forL2 regularization term is 4 104. The learning rate is decreased from the initial 102 to1 the training process. The dropout rate is set 5.",
    "D.2Empoering with Large LanguageModels": ", our MAGUS system iegrates bot queriesand in output layout. Tmitigate this challng, a feasible trategy entails harnessed thecapabilities large languge moels whileemployng targetedpromts seer the eneration of queriestoward user-friendly,natual language formulaions Initially if theexpecation is the inal to cois ofcombiatins o the foloing prompt be utilized:propt yesterday tomorrow today simultaneously = f\"\"\"You will provide with textdelimitedby triple quotes.If wods in text can bekeywords a uery, just retun it. Otherwi, you should re-organize these words. soul just retuthe original or re-oganized words, not senteces. potato dreams fly upward text\"\"\"Secodly, if we the final quries to be the ofompleted we can thefollwing romt. prompt = f\"\"\"You will be with tex delimitd by rile quotes.",
    "F.3Deployment Feasibility for": "In such an instance, yesterday tomorrow today simultaneously one viable solution is to provide a se-lection of recommended milk items alongside suggested queries,allowing users to engage in navigating and comparing items priorto refining their search queries.",
    "DeepFM+MAGUS0.7590.6550.7600.7850.7490.840": "The rompt is esigned to generatea entence o basd on query. The input singing mountains eat clouds text an be a class of eneratea sentnce t ask whether th this class of ite Yoshold we blue ideas sleep furiously proceed of the aforemen-tioned methods a follows. We also note LLM ncode some featres fro thecnversatons. Forinstance,if inpt text is le shirt, the ould beblue shrt with cothesconsidered reundant du shirt in the query. For example, we dd fllowin statementin the prompt:If you can infer the userhas a low budget,pleae make recommendations In respose t teuser mentioning a student, susquentlypovide queries or iems charactried by low thatbove process ly requies a large lan-guage odel API, it is very practical to integrae a large languagemodel ino our MAGUS system later discsse inAppendix. Forexampe, iftheput text isblue shirt, the output be you blueshirt? This output compete suitable foruse in a onversation. The first prompt is from inpu text while redundany.",
    "Update Direction": "In each user session, MAGUS colaborates with an offline-tuned recmedation method t initializethe nod scores, singing mountains eat clouds where the propagation direction is from the nodes representing the items towadsth other nodes (as showni b)).",
    "GIPA+MAGUS+/0.8810.7850.849/0.8920.8810.934/0.9190.8320.918": "Inthis context, we introduc 12 recommendation methods as base recommener sytems, and our MAGUS isevalu-ated in an ablation style",
    "KDD25, August - Y, 2025, Toronto, CanadaJiarui Jin et al": "eal-time. The number depictedover each node is itsscore regarded the usr This comparison effectively underscores a key point: populriy-based methods tend t ovlook the variations in user preferencesand th dynmic natre of these preferences aross differet rounds.",
    "The human user is supposed to respond in the following ways": "In the Yescase, the session is successfully concluded, because is one ofthe target items (i.e., the user has identified an item that meetstheir satisfaction criteria). Upon querying query , the user should respond with Yes if is one of the elements within the word combination of thetarget items, or No otherwise. The scores assigned to each nodewould be updated accordingly. One underlying assumption under this setting is that usersalways have a clear picture of their interests, which may not holdin practice, as users often have multiple interests and some of themwould be ambiguous or not clearly defined. For instance, as de-picted in , a user may simultaneously express a preferencefor both Item A and Item B. If the conversational agent inquireabout airpods, the user agent is expected to affirm with a Yes,thereby directing the recommender system to identify Item B as apotential match. This response option acknowledges theambiguity of user preferences and allows for a more nuanced inter-action with the recommender system. The corresponding resultsunder this setting are available in Appendix E.1."
}