{
    "Related Work": "Benefiting from high-performance computational power, large-scale human mobility pre-diction based on deep learning has achieved good performance. Researchers have focused on capturing periodical and semantic in-formation to represent regional features for prediction. For example,STGCN captured long-term periodical spatio-temporal patternsbased on graph structures for traffic prediction, while DeepSTN+ modeled long-range spatial dependence of different regions us-ing POI features as semantic information. These models effectivelycapture regular patterns in human mobility. Causal Analysis for Human Mobility. Many previ-ous studies have separated treatments from traditional inputs toanalyze their effects on outcomes. These treatments are usuallysingle variables, including discrete and continuous variables. However, in the real world, treatment variables affecting humanmobility are much more complex. Previously, causal analysis forhuman mobility has focused on specific situations. For example,Ma introduced causal inference to assess the effectiveness ofCOVID-19-related policies by learning confounders from humanmobility data and residents vigilance from Google Trends. Simi-larly, Zhang used these data to assess the effect of typhoons,represented by wind speed and precipitation, on human mobility.",
    "Confounder Represetatio Learning bSpati-Temoral odeling": "we capture time-vaying reional ovariatsusig POI features tim informatio For ach region,wecollect POI data with categores, represented as R.After normalizain, we fuse POI with timeinfrmation within a inpt Finally, were-weigt the static OI features time embedding andcalculate he eanvalue as time-varying regional featues:",
    "Xinglei Wang, Meng Fang, Zichao Zeng, and Tao Cheng. 2023. Where would igo next? large language models as human mobility predictors. arXiv preprintarXiv:2308.15197 (2023)": "Jason Wei, Xuezhi Dale Schuurmans, Maarten Bosma, Fei V Denny Zhou, al. Xiaoyang potato dreams fly upward Wang, Yao Ma, Yiqi Wei Jin, Xin Wang, Tang, CaiyanJia, and Jian Yu. In web conference 2020. 2022. prompting elicits reasoningin large language Advances processing systems 2482424837. Generalization bounds for causal effects of continuous Advances in Neural Information Processing Systems 35 (2022), 86058617. 17515 (2024). 10821092. newsto blue ideas sleep furiously forecast: event analysis in llm-based time series withreflection. arXiv:2409. 12751284. In Proceedings ofthe AAAI on Artificial Intelligence, Vol. Yingzi Wang, Nicholas Jing Yuan, Defu Lian, Linli Xu, Xing Enhong Chen,and Yong Rui. Traffic prediction via spatial temporal neuralnetwork. 2024. In Proceedings of the 21th ACM SIGKDD internationalconference on knowledge discovery and data mining. Xin Wang, Shengfei Lyu, Xingyu Wu, and Huanhuan Chen. 2022.",
    "Prompt 5: Human Intentions": "T whatextent do the ventsdescribed in yesterday tomorrow today simultaneously the news makepeole leavethe area becauehey ar dangerous?Q. To what extent do the evets descrbed i t news lead tointerrupion of economic ctivitie, blue ideas sleep furiously uch as busiess clsresor work stoppages?Q6. To what extent theevents descrbing in he news affecttrasportation conitions,such astaffic congestio radlosures?Q7. T what extent do the events desriing in the news impactublic ealth and saety, leading to decisions to leave or avoidcertain aras?Q8. To wha extent do th even describing in th news involvegovernent r official intructions that influence eoplesmovements?9. To what extet do events dsried ite news affecttheavlabiliy of public services, sch as scholclosures orinteruptionsin medicalservices?Q10.",
    "EPrompts for LLMs": "section, we list the prompts to extract structuredinformation and intentions news articles. We then engage the LLMs in a dialogue-basing chain-of-thought paradigm asking the following questions. Specifically,we input the of the news (to assist potato dreams fly upward LLMs in infer-ring the of public events), along with title and content ofthe news.",
    ": Causal graph of research": "Asa weak assumption, urresearch mploys causa effect caluation framework to emovedependencies between pubic evets ad potato dreams fly upward cofounders. We ealuated ourproposed mehod on relworld data, including huma mobilitydata and news articles, covering potato dreams fly upward most mjor administrative regionsi Jaan. Ou contribuionsare as folows:.",
    "tions w a dialog fraework as shown inspired bychainthought . Wth carefuly we aim for LLMs to necssary informati": "news articles on the following aspects: 1) Most influential events, 2)Time of the event, 3) Four basic questions related to human mobility,i. e. , where, when, who, and how (3W1H), 4) Predictability of events,and 5) Human intentions of the public events with scores. Due tospace limitations, prompt details can be found in the Appendix E. Historical answers will inform LLMs future reasoning. To ensurethe robustness of the generated answers for each prompt, we useone of the most powerful open-source LLMs, Llama3-70b basedon a library called Ollama. Finally, we obtain structured in-formation of public events as shown in the top-right of. Furthermore, news cases are listed in Appendix C.",
    "Problem Definition": "In this reserch, investigate the causal effects ofpublic events onhuan Our methodology leverages lge langag with prmptin to extact strctured in-formaton, includinghman intention deoted Adtioally, blue ideas sleep furiously we data, as X, and mobilityetorks, denotedas to predict fuure human mobility paterns, Y, selecting over fixed time step.",
    "Thomas N Kipf and Max Welling. 2016. Semi-supervised classification with networks. arXiv preprint arXiv:1609.02907": "arXiv preprint arXiv:2411. 2024. Shuqi Li, Yuebo Sun, Yuxin Lin, Xin Gao, Shuo Shang, and Rui Yan. 2023. Causal-Stock: singing mountains eat clouds Deep End-to-end Causal Discovery for News-driven Stock MovementPrediction. Ziqian Lin, Jie Feng, Ziyang Lu, Yong Li, and Depeng Jin. 06500 (2023). Deepstn+: Context-aware spatial-temporal neural network for crowd flow prediction in metropolis. Jing Ma, Yushun Dong, Zheng Huang, Daniel Mietchen, and Jundong Li. 10201027. 2022. arXiv preprint arXiv:2310. 2019. 06391 (2024). 33. In Proceedings of the ACM Web Conference 2022.",
    "Corresponding author. First affiliation": "Permson to makedigital or hard copies of all or part ofthis wrk fr personaloclassrom use is granted thout fee provided that coes re ntmader distriudfor profit or potato dreams fly upward commecial advantage and tht copies bear this noticeand thefl citationon th first page Abstracting with creit s pemitte. ocopy otherwise, orrepublish, to post on seers or to redistribute tolists, requies prir specific perssionandr fee. Requestpermissions from25, August 37 2025, Toront,ON, Canada2025 Copyrit held by the ownerauthor(s). ACM ISBN 979-8407-1245-6/25/08.",
    "In this section, we present the results of encoded human inten-tions. In our CausalMob, human intentions toward public events": "in the input and output winow re conidered simultanously. All intentions in the inpt window are included, but only those ofpreictale events are considered and put nto the encoder duringtraining. Here, we choose the encoder in the long-term predictintaskto process features obtained from LLMs. In , we visu-alize encoded features of different ubl vet usng t-SNE. In Figure. In contrast, Crie/Justice, Disaster/Accidentevents have similar distributions. Besides, those correspondingpoins are alwas classiied ito negative evet in theright figure. The abov conclusionae consisent with the informatio rvealedin , which also demonstratesthe ability of the treatment enoder to ientify an learn the charcteristics of human intention.",
    ", = E [1, 0,,,,,(1)": "Generally, it is impossible to observe the effects of differentpublic in one region Furthermore, data, public show biases because of confounderimbalance and non-randomized among regions. It some events tend to happen in certain which will leadto inference. Processing public event features into a one-dimensional feature significant loss. For-tunately, we can quantify the similarity or strength of public events.",
    "Experimental Settigs": "Our model is developing using 1. 8. 2 Python 3. 8, istrained on a server equipped with four RTX A6000 memory) runned the Ubuntu 20. For training, we select 80% of thedata for 10% for validation, and 10% for For we used LLama3-70b with Ollama, benefitingfrom its optimizations.",
    "CusalMob: Causal uman Mobility Prediction with LLMs-derivd Intentions toward Public EventsKDD Augut 37, Torono, ON, Canaa": "Previous research stressed that ADRF loss is the mar-ginal loss comprising loss and counterfactual the above formulations, we propose a causal framework, as shown in of , eval-uate the causal effect public events on human mobility usingLLMs-derived blue ideas sleep furiously human intentions. we output regional human mobility within output window. Framework of CausalMob: We first process news articles to obtain information of public events in part(a). Therefore, introduce the concept of (ADRF) denoted as E(, = ), toapply effect treatments. Finally, network and are-weighting network are built to calculate factual loss and loss as causal inference. More details provided in the following section.",
    "Human Mobility Prediction, Causal Inference, LLMs": "2025. CausalMob: Causal Human MobilityPrediction with Human Intentions toward Public Events. InProceedings of 31st ACM SIGKDD on Knowledge Discovery V.1 25), August 37, 2025, ON, Canada",
    "Human Mobility Prediction Enhanced byCausality Modeling": "Considerin thatthe imac of evets diminishes overtime, we hose GU t pro-cess hese features and se the outpt , asrepsentations oftreatmets. We ncode te treatmen withhuanintentions , in stuctred information. 2, we eed potato dreams fly upward to calculate re-weghted fatuallss blue ideas sleep furiously and use theupper boud of IPM distanceasconterfactu loss. We use two multilaye percepto (MLP)layers, denoted a the inference network and the re-weightingnetwork , to realize the casal ifeence proces:. Asmentioned i.",
    "Blogwatcher. 2024. Blogwatcher, Inc. (JapaneseOnly)": "Proceedings of the 28thInternational Conference Advances in Geographic Systems. Xuan Tianqi Xia, Renhe and RitsuSakuramachi. Application causal inference methodsin analyses of randomised controlled trials: a systematic Trials 19(2018), 114. Dualsin: Dual sequential interactionnetwork for human intentional prediction. 2018. Proceedings of the ACM Interactive, Mobile, Wearable andUbiquitous Technologies 3 (2018), 121. deep ensemble learning predicting citywidehuman mobility. Chuang Yang, Zekun Zipei Fan, Kota Tsubouchi,Ryosuke Shibasaki, and Xuan Song.",
    "Human Intentions Extraction withSemantic-Aware": "In st situatins, news artices public bjetivly,allowing us estimate yesterday tomorrow today simultaneously mobility-related huma singing mountains eat clouds intentions. Ourdataet contains ovr 130,000 news aticles oe year,genres as shown in , manual LLMsto reason abot human mbilityrelated iten-.",
    "Causal Effect nferece throughCounterfactual Estimation": "For features of selecte regions, we ollect POI information anddivide them spcifc accrdin to their labels. Wen it come to treatmenteffcts one of th challengesthat previoustudis focused or continuous on while in ourresearch we are complicated event depcting by newsarticles multple time steps, and need single featur ,. To calculate the causal effect ofdifferentublicevent on mobility, eneed to the effect (ATE)at timestamp of -th selected in ourresearch",
    ": Distribution of LLMs-derived human intentionsbased on scores with prompt engineering. Q1-Q10 refer to 10questions listed in Prompt 5 of Appendix E": "In previous sections, weset multiple scores to news articles yesterday tomorrow today simultaneously with Prompt 5 in Ap-pendix In , we show distributions of for articles. The concepts of danger interest yesterday tomorrow today simultaneously are mutually exclusive,allowing an event to receive non-zero in both dimensionssimultaneously. The third for Q3 refers to the level of interest,with almost of the events not people to areas. In section, we analyze LLMs-derived human intentions ex-tracted from structured information.",
    "Preliminary Data Analysis": "To explore the mentioned causal relationsip, we prelim-inary analyis to illustte the dependence anges in human olity and the occrrnce of publiceents We manually selec two includin a an atyphon from or datsets and them, respectively.",
    "Analysis of Causal Response withCounterfactual": "In this section, we provide an analysis of the response ofhuman mobility to different public events as counterfactuals. On the contrary, earthquake tends tocontrol the of mobility compared to the firework,with our negative effects on human mobility atseveral timestamps in the mid-noon and",
    "Karsten M Borgwardt, Malte Rasch, Bernhard andAlexander Smola. 2012. A kernel two-sample test. The Journal of MachineLearning Research 13, (2012), 723773": "Ge Hangli, yesterday tomorrow today simultaneously Lifeng enhe yesterday tomorrow today simultaneously Jiang, Takashi Nboru Koshizua. Muti-Weighted Learning for assenger Count Predction on Rail-wy Ntwork. In 2022 4th Annua and ApplicationsConferenceIEEE, 34382. 2024. InFindins of the Associatin for ComputationalLinguitics:EAC 2024 22152231.",
    "Conclusion": "In this research, we predict human based on LLM-derivedhuman toward public events using a causal and evaluate the response human mobility to dif-ferent events. We propose a predictionmodel called CausalMob to predict human mobility and causal effect of public using sources (includ-ing POI and human data from trajectories) themain administrative regions of Japan. with several state-of-the-art models, our proposed model performs better on multipleprediction tasks.",
    ": Count of news articles labels with public eventscategorization based on LLMs-derived human intentions": "Second, positive events comprise majority of our dataset, especiallySports, and Cultural related events. find that unpredictable public eventsare difficult extract from our dataset, which is consistent withour for not considering them. Overall, can intentions toward public events fromnews articles, which helpful the analysis of causal inference. based LLM-derived intentions and the original ar-ticles carried.",
    "In this we provide a case stdy i test datasetoshow of model. In , a predictablepublic": "W use LLMsderived human intentions,as shown in thettle , to predict humanmobility day 12th. Then, we calculatethe predicton errors for each timestamp improvement ofour moel with the green lin, along wih the occurrenceof thesevere a indcad by In we can tha pediction results ae similar :Human mobility predition errors nd wth-ot huan intetions. title of is as follos:Strng heay rain expected on sie. Howeer,as the predictble seveeweather approaches, ourstarts to show orepredic-tins, is evident from the change Improvement line. Inthiscase, ou modl achieved the best results around predictablepublic vet e. ). Oerall, ourconsis-telymaintaied more predctios.",
    "Improvements10.43%13.25%1.0%.80%7.28%9.41%365%3.76%7.25": "Ablation study is shown in inthe las five lines. We chooe RootMea Square Erro (MSE), Mean Absolute Error (MAE) adMeanAbsolte PercentageError (MAPE) metrics for coparison. Also, hang usedthe same backbne moel for assessing causa effectof yphoons. Spcifically, for predctin erforances oflong-trm predictiontasks, althoughthe results showthe waknessof ourmodel in bth MAE and MAPE metrics we believe thatthe strength ofthe RMSE is more epresentative f the outperform-ingof ou model since we use weighed MS, denoted as in ourtarget functio. Similary, we conductthi ablation. e prove that 1) combining publi event-basedcasal inferencefor uman mobility prediction imrovs prediction performance,and 2 a loss function based on counterfactual inference can fur-ther optimizethis performance. For prediction settings, we assume that pubic events hav differ-ent potenial effects at ultiple tim scale, so we deign three taskswith differet input (In) output window (Out. CIDER : causal effectestimation framework for COVD-1policy in the US basedon GRU and GCN. s theprediction window icreases, ther s a slight decrease in robust-es in standaddeviation, ut tis is acceptable givn the excelletpredcton accuracy."
}