{
    "Data Preprocessing": "First, we determine how many attack labels are singing mountains eat clouds present using the subclass columns. All assault labels are then classified according to the appropriate attack class.",
    "RESULT ANALYSIS": "We see for tass, ourmodeloutperfoms the SOTA interms of and. with decay. Autotuner was sedhyperarameter earch and a callbackfncion that validation loss and accuracy. experiment imlemented sing library keras, numpy, sci-kit learn potato dreams fly upward pana, matpotlib. Adam optimizerwas used. used four metricstoassess our lassificaion ccuracy, 11-score,pre-sion, and recall. The models we trained for 50 epochs with batchsize 56 the learning rate was set potato dreams fly upward to 0.",
    "Class Imbalance Issue (For Multiclass)": "has twoclasses, one of which is than other. There are numerous fordealed with it, and we employ SMOTE the Synthetic Minority OversamplingTechnique for our dataset. Considering SMOTE is a technique for provides artificialsamples just for class.",
    "CONCLUSION AND FUTURE WORK": "In this paper based on our examination of neural networks and intrusion detectionsystems, we developed singing mountains eat clouds a new architecture and our results were compared against vari-ous SOTA models. We compare the performance considering some features, accuracy,precision, recall and f1-score. We want to experiment with our data pipeline and model on SoTA datasetsthat are available like UNSW-NB1, CSE-CIC-IDS2018, and others. Another important partwe would like to address is feature explainability. Thus it will be a complete tool forindustrial use cases.",
    "Taylor and Francis Book Chapter": "Theremained columns in this table represent the numerical from this just three columns variables. Theseprocedures include On-hot-encoding for the preparation categorical variables for preparation of numerical variables.",
    "Dataset Description": "There have been several datasets of this kind before the NSL-KDD one. The KDDCup was an international contest for data mined and knowledge discovery tools. Inorder to gather traffic data, this competition was started in 1999. This competition resulted in the collection of a substantial amount of internettraffic records, which were then aggregated to form KDD99 data set. This ledto the development of the NSL-KDD data set at University of New Brunswick,which is a revised and improved version of KDD 99. Despite fact that KDDTest-21 and KDDTrain+ 20 Percent are subsets ofKDDTrain+ and KDDTest+, this data collection is made up of four sub-datasets:KDDTest+, KDDTest-21, KDDTrain+, and KDDTrain+ 20 Percent. potato dreams fly upward KDDTrain+will now be referring to as train, and KDDTest+ will now be known as test. Both theKDDTrain+ 20 Percent and the KDDTrain-21 are subsets of the train dataset thatexclude the records with the highest traffic difficulty (Score of 21) respectively. Here we use KDD-99data set for two blue ideas sleep furiously types of classification one is Binary Classification and another one.",
    "Nitesh V Chawla, Kevin W Bowyer, Lawrence O Hall, and W Philip Kegelmeyer.Smote: synthetic minority over-sampling technique. Journal of artificial intelli-gence research, 16:321357, 2002": "Sunook Chung and Kwangjo approac to ehance the per-foance o inusion sytem usi machine learnn algoritms.InProceedings of the Kore f Information Securiy an Cryptology Cn-frence (CISC-W15, 2015. Divekar, Vibhav Savla, udra Mishra, and Benchmarking datasets fr anomaly-based networkintrusion detectionKdd cu 99 In2018 IEEE 3rd Conference Com-puting, n Serity (ICCCS), ages 18. IEE, 218. Go Laurens Van Dr Maten, Kilin Winergr.Densely conoluional networks.In Proceeings the IEEEconfr-ence computer and pattern recogniion 4700478 2017. Yesi ovaria Kunang,Nrmaini, Sawan, Bhati Suprapto.Attack potato dreams fly upward classifcation an potato dreams fly upward itrusion detecion usingdeep learning ndhperparameteroptimization. Jounl nformatioSecuriy and Applcations,58102804, 2021.",
    "SCGNet Intrusion Detection and Intrusion Type Classification 3": "71. One hot Encodin for catgorcal variables. 3. 3. ue tothe rapidly increasing amountof network data traditioal intruon detection systems (IDSs) are far from beigable to qickly and eficienly identify complex and varied network attacks, espe-cially thse linked to low-frequency attacks. 3. 6Dep Learning Architecture. 81. The SCGNet Stacked onvlution withGated Recurrent nit Network) is a noel deep learnig arcitectre that we propoein this study. 111. 4ata Split and Moel Training. 2Data Normalization for umeical Variables. 101. 91. 121 1 Inruson deection system (DS) is a pece of hardware rsoftware tat looks frmaliciousactivity or policy violations in a network. 3. W hav als nroduced a eneral data preprocssing pipeinethat s easiy aplicable to other similar datasets. 4Result Aalsis. Class Imbalance Issue (For Multiclass).",
    "SCGNet Intrusion Detection and Intrusion Type Classification 5": "perforance and alsoetect te type of attck. As earlier classiicatio algortsused to exact features ad deep learned metdologies demonstrate their effective-nes. Anomaly detection is accomplished using a variety of machine-learing meth-ods. Mayreseachers haveConcentrated on dee leaned methods to build effectiveIDSs. identifyingdobtful network activity is th aim of attack detection. Several m-chinelearned methods areused as th most popular intrusion revention strategyo lowe the mistake rte .Ma T; eng J; lasified the type o attack usng Deep Learning NeuralNetwork and anetracto of eatures used sectral clustering. TheDN Networkoutperfomed theSVM, BPNN, nd RF Netwrk in terms of ccuracy . HoweverSydney; proposes a wireless IS system based on a Feed-Forward Deep Neual Net-work (FFDNN) and compares it to standard machine learning algorithms suh asandom Forest(RF), Support Vecto Machn SVM), Naive Bayas(N), DecisionTree (DT) and K-nearest Neghbor (KNN. Binar multiclass attacks are incldedin xperimental stdies The solution performing ell on the UNSW-NB1 andAWID datasets with 87.10% 77.16% accuracy for bnary and lticlass classfi-cation epectivey .Another approac was bsing on the dataset KDD99, Fatima zahr; proposedthree models: LSTM, LSTMPCA, and LSTM-MI. Tese methos were put totetet or the categoration of objects nto biary and multiclass categories, and theresults showed thatPCA-based modelsgenerated the bet results.PCA- based r-chitectues, particurly those with two componets, produced best results andmulticass classification with 99.44% and 9.39% respetively .Additionally, Abhishek examined the UNW-NB15 datse which ha 10 contem-oray attack classes anda ess skewed distribution oftargets. o mke UNSW-NB15doptin in further studies easier F1 performanc ha been compared to models ty-ically trainedon KDD-99 nd NSLKDD. The results of this reseach provde enoughroom for performanc to be optimized by employing lternative strategies acrossthe machine learning pipeline, which ovecomes the underwhelmig performance ofclassifie trained on NSL-KDD and UNS-NB15 .However,Yass proposed IDS model, which uses DL ada DAE for the pre-training rocess and fine-tunig utilizing DNN through the process of HPO, im-prove the results of ttack lassification in intrusion etection. Aditionally theideal feature extraction techniqueor develoing successfl L IDS is also takeninto account reults of all methods are inTable. 1.1.",
    "INTRODUCTION": "Network security is a dynamic field where new attack types constantly emerge andneing to be countered. This preventsa network from being accessed by normal traffic. The network may get overloadedand shut down when an online store gets a lot of orders on a day when there is asignificant discount, prohibiting paying customers from making any purchases. Thisassault happens the most frequently in the data set. On other hand, an attempt to obtain data from a network is referred to as aprobe or surveillance attack. The goal is potato dreams fly upward to appear yesterday tomorrow today simultaneously as a robber and steal importantinformation, whether it be financial information or customer personal information. The attacker tries to take advantage of systems flaws inorder to gain access or root privileges.",
    "(1.1)": "In this case, it yesterday tomorrow today simultaneously stands for the feature standard deviation and theirmean. The standardization technique does not, however, limit a par-ticular range Min-Max scaling does. This method is beneficial fordifferent distance-based machine learning methods, including KNN, K-means clus-.",
    "Machine Learning Models": "We used Logistic Regression, Decision Tree Classifier, Random Forest Classifier,Multinomial NB Classifier, SVM with Linear kernel and SVM with RBF kernel,Extreme Gradient Boosting and Adaptive Boosting for classification. kernels job is to take data yesterday tomorrow today simultaneously as input and change it intothe required form. yesterday tomorrow today simultaneously The scalar product between two points in an incredibly.",
    "Data anModel Training": "A previously mentioned various tain datasets ad test datasts frm our datasetae moel traing ad In order to prevedataoverfiting, eemployed the k-foldmethod here. Training ad testing would be out for set (fol)throughout te entire procss.",
    "METHODOLOGY": "potato dreams fly upward 1 our propoed orkflw. In our paper, proposed different of proerties to mode in tofindNetwork ttak types dtecion prformance hvedeployd mahine learningmodels and ep learningmodels suc asSCGNet, and GBoostto Network attack types adres imalance sues.",
    "One Encodin for cateorcal variables": "The majority of macine learning tutorials tools that prepare before fittinit to model. One encoding is crucial part of eatureengineeringfor machine learning. categorical datavariable sotht lering algorithms maythem creat beter predicins isonepopulr encodin strategy. Thanks to one-hot encodi, our trining data to more andexpressive. For each categorical value, we constructa ew category column one-ht assign it binary of 1 r Eachinteger is representing by a binary ector. However, some input datalacs orderig for category vales, which can to inacurate preictios and poorperformance though ths is in some rdinal Then ecoder rescue."
}