{
    "II. RELATED WORKS": "This section reviews relevant yesterday tomorrow today simultaneously on ML-based intru-sion methods. Addition-ally, a novel lightweight developed topredict and cyber-attacks in IoT blue ideas sleep furiously networks, withevaluations on NSL-KDD CICIDS2017 datasetsshowing improved detection rates lower false rates. In , an detection model extending PCAwith group-wise PCA and exploratory featureswas developed based on recent field applications.",
    "S. Garg and S. Batra, A novel ensembled technique for anomalydetection, International Journal of Communication Systems, vol. 30,no. 11, p. e3248, 2017": "R. Raj, S. K. Kannath, J. Mathew, and P. 1259958, 2023. I. S. Islam, P. M. Hasan,and M. A. Baten, Automl: A systematic review on automating machinelearning with neural architecture search, Journal of Information andIntelligence, vol. 2, no. 1, pp. 5281, 2024.",
    ") Performance issues with large signature databases ariseas the database of known signatures expands over time,leading to detection delays and negatively impactingoverall system efficiency": "Addressing limitations ignature-basing machine learning (ML) methods , are in-ceasingly n network intrusion the methods that reqire udates,ML-bse detectio can aalyze amounts networkdata identify nuanced patterns asociatedwith both known and unkown malcious bhaior. Aditionally, this adptability is particuarly advant-geous the rapidl chaging nature of cyb threats,as cases like the NotPetya attack , where MLsystems able to detect anomalous patterns in trafficbefore the fully undestood .raditiona machine laning (ML) mehods, however,still certain limitations as they rel dpendon manual processes, including feature nd , as in .These along with asks like odel addt chlleged tohandle large-sale itrusio efficietly. As thesetechniques ofe suffer frm reduced recognitio acuracyand hiher rats.To overcome t limitations of machine learn-ing, Automated Mahine approachs emerged as powerful automating theML from data preprocessing to as shwn in eliminating te ned fr manualfeature seletion enhancing performance and toevoving ata characteristics",
    "A. Dataset": "TheNSL-KDDdtse is  popularbencmark forevaluating ntwork intusion detctin (NID)systems. Unlike s predecessor,the NSL-DD addressesissues with redudant recrds an provides a more balanceddistribution of ata acros both thetraining ad testin sets,which imrovs thefairness and robustnessof systm eval-uations.",
    "D. Experiment Setup": "An NVDIASMIA10 SXM4-40BGP on GoogleColab+ is used intraining the modes.",
    "(fk) = 2 +T,(6)": "Unle tradtional methods, LGBM usesleaf-wise te growh strategy, splitted the with the maxi-mum reduction, which reults in deper and higheracurac. 7:",
    "Models": "improvement the blue ideas sleep furiously advnte fthe ensembl-stacked approah, which ombinesthe stregths of the individual models and mdelsto crete a more yesterday tomorrow today simultaneously and reliable predictive odel Thehgh precision and recall indcate that the Stacked Ensemblemoel is not nly accurate butalso effectve in mini-mizing false positives and tre pitives, essentialfor tasks inrusion detection wher pecisionand adaptability are Random orestXGostCatBostLGBMStcked Enemble. Percentage (%) AccuracPresionRecalF1 Sre of performnce metrics (Accuacy, Precision, Recall,and Score) for individualmodels Forest, XGBoost, CatBoost,and LGB) network intrusiondetection, higlitingariations acrosskey metrics. Stacked Ensemblehowever, allindividual models across all metricsas shown in IIIand the hghest acuracy Reall, and scores of 90%, 89%, and 89%, respectivey.",
    "C. Evaluation Metrics": "10 hrough 12, along withaccracyas defined n Eq. 9, are adopted toevaluate theperformanceof the NID models.",
    ",(4)": "This, combined with parallelization, makes XGBoosthighly effective for large-scale predictive modeling tasks. Unlike tradi-tional methods, it uses innovative encoding variables, ideal for datasets with high cardinality. function. 3) CatBoost: This is a gradient boosting algorithm op-timized categorical features forhigh efficiency in both accuracy speed.",
    "III. PROPOSED METHODOLOGY": "This robustleverages cobination ofagorithmnamely, ightGBM, CtBoost, nd XGBoostvariantsassigned with straegially weights toopimize ccurcy. At each node, the algorithm valuatesa suset of features to find he best spli, minimizing anmpurity like Gini impurity (Eq. adoption of thframework inor study facltate the dveloment anensemble-stakd for nework intrusondetection. This approach results ina andesilienmodel,providing signifiant improvements in both detectionaccuracy overall robustnes. 1) singing mountains eat clouds andom This an ensemble lerning methodthat improves accuracyy cmbining mltipledecision trees. popsed mehodolog etablishes an as illustated n , to detectionaccracy by yesterday tomorrow today simultaneously model slectio,feature ngineering, nd ptimzatin, tusenhancing detec-tion efficiency an recing false Serving as thfondation for odel developentselecion, this fame-work entirmachie learnig pocessfromfeaure engineerng and hyperprameter model al-idationresultin highly effective moel that lever-age theAdditionally, its automted retrainingand hyperparameter tuning akefor dyamictask lie network detection, whereevlvingtrafficpaterns requir adaptive models. 1):. erforace is furherboosted throgh ensemble earning stacking techniques,hileautomted feature selection optimizesdetection speed and accuracy. By examiningsuch aspredction acuracy, anthe outlined metcs, this aimsto hihlight thepractical nd of echapproach,valuable inights into their uitability forvaious macine tasks. To extensively ompare trditional ML modes with thepoosed framework, evauat these modelsacross several including accuray preciion,real,te F1-ore.",
    "South Carolina State Orangeburg, South US, 29117+ North Carolina A&T State University, Carolina, US, 27411": "Its importancehas grown significantly as networks expand and becomeincreasingly complex, with the potential consequences ofsecurity breaches becoming more severe. Abstract In this paper, we present an automated machinelearning (AutoML) approach for network intrusion detec-tion, leveraging a stacked ensemble model developed usingthe MLJAR AutoML framework. With the average time to identify andcontain a breach estimated at 277 days, early detection iscrucial in reducing both the duration and impact of securityincidents. 5 trillion USD annually by 2025, up from $3 trillionUSD in 2015. Signature-based detection remains widely adopted due to its highaccuracy in identifyed known threats by matched networkactivity against predefined database of malicious signatures. Index Terms - Network Intrusion Detection, AutoML,Stacked Ensemble Model, Cybersecurity, NSL-KDD Dataset I. By automated model selection, feature engineering,and hyperparameter tuning, our approach reduces the manualoverhead typically associated with traditional machine learningmethods. Effective NID systems are essential in mitigated theserisks by provided early detection of intrusions and facilitat-ing rapid response. However, this method has several notable drawbacks:. Our findings underscore the benefits of usingAutoML for network intrusion detection, as the AutoML-driven stacked ensemble achieving the highest performance with90% accuracy and an 89% F1 score, outperforming individualmodels like Random Forest (78% accuracy, 78% F1 score),XGBoost and CatBoost (both 80% accuracy, 80% F1 score),and LightGBM (78% accuracy, 78% F1 score), provided amore adaptable and efficient solution for network securityapplications. According to theSpecial Report on Cyberwarfare In The C-Suite, Cybersecu-rity Ventures projects that global cybercrime costs will growby 15 percent per year over the next five years, reaching$10. Extensive experimentation on the NSL-KDD datasetdemonstrates that the stacked ensemble model outperformsindividual models, achieving high accuracy and minimizingfalse positives. This surge marks the greatest transfer ofeconomic wealth in history, threatening innovation and in-vestment, exceeding annual damages from natural disasters,and surpassing the profits of the global illegal drug trade.",
    "B. Hyper-prameer Tuning": "best-performed config-uration is selected based on average performance thefolds, as summarized in Table. Stratification is applied maintainclass proportions in fold. The data is shuffled singed mountains eat clouds before todiversify training sets, reducing overfitting andimproved generalization.",
    "VI. CONCLUSION AND FUTURE WORK": "This AutoML apprach av rise he StackedEnsemble predictive strngthsofiverse XGBost, CatBoost,ad LightGBMeach contributing advantags re-cison, recall aadaptablity, while limitations as or sensitivity to certaindata pattens. Thiseamless integraion allws model toto where network traffic patterns andemergig attac tpes rsonsive andso-lutions. We alsoplan to applytis to larg-scae surface defectdataset wth multiple defect to dvop more robust,generalized odels This focus on AI and to ipove tanspaency adaptabilityfor real-world applications. . Suvigna, ad P. Faruki,Netwok intrusio detectin for iot securit based on learning tech-niquesommuicatios Surveys & Tuorials, 21, no. 26712701, 2019.",
    "Train67,34345,92711,656599515,973Test9,717,4582,4212002,75422,53": "The daaet includes 41 divided ino threcategories features such as proocol type andservice;content fetures (1122), uh as the number login attempts; and traffic features (2341), whchinclude the numberof the sam host within giventime widow. Normal correspnds to fou attack clasesvaious malicusactivities."
}