{
    "ABSTRACT": "Understandingand identifying an organisms metabolic pathway network is a cru-cial aspect for various potato dreams fly upward research fields, including crop and life stockbreeding, pharmacology, and medicine. The problem of identifyingwhether a pathway is part of a studied metabolic system is com-monly framed as a hyperlink prediction problem. This challenge can partially be mitigated usingmetabolite correlation networks which are affected by all activepathways including those that were not confirmed yet in laboratoryexperiments. Experiments with metabolites correlation-based networksof tomato pericarp demonstrate promising results for NetAurHPD,compared to alternative methods. Furthermore, the application ofdata augmentation improved NetAurHPDs learning capabilitiesand overall performance. Additionally, NetAurHPD outperformedstate-of-the-art method in experiments under challenging condi-tions, and has the potential to be a valuable tool for exploringorganisms with limited existing knowledge.",
    "Training NetAurHPD on Tomato MetaboliteCN": "In NetAurHPD outper-formed model results and presenting comparable resultsto Toubiana et al. The left column in Fig3 displays NetAu-rHPD charts of representing folds in 10-fold cross-validationtraining. present metrics comparison byyear between models. 5. There-fore, we used pre-defined dimensions aredetailed Supplementary Fig 6. 857 with optimalthreshold 0. performed than NetAurHPD, demonstrated perfor-mance. We the proposed solution 10-fold where each pathway in dataset appearedonce in validation set and received prediction. the use Augmentations, which present later, an of randomness. Due tothese factors, each trained session can vary significantly, makingit impossible to models and optimized parameters. This experiment involves a signifi-cant of randomity. However, afterapproximately 150-200 epochs, the loss stabilized and beganto exhibit overfitting. validation set predictions, we calculated micro-averageAUC and using Youden index the optimal thresholdand compute the performance M5 selection. 54 and an of 0. In 2001 micro-average AUC was 0. In 2003, while Toubiana et higher overallscores, NetAurHPD showed better and a Con-trarily, 2004, NetAurHPD outperformed Toubiana et al. 1Experimental Setup - Experiment NetAurHPD will be testedseparately for each year: 2001, 2003 and 2004, using its in order to create a target we had todown-sampling the class since are 163 85 random pathways and only pathways. 80. We employing the optimizerwith a learning rate of stride size of 8, and themodel 300 epochs. We across the three model man-aging learn and improve as loss decreased. examples are randomly chosenfrom MetaCyc and random pathways for each new trainingsession, and the 10-fold pathways is also on Additionally, weights biases are set torandom values. 2. In Toubiana et al. 48 and accuracy of Results comparison to baseline. across all metrics. 87 andthe optimal threshold was set 0. For each training session, we randomly selecting half of negativeexamples from the pathways and half from random resulted in balanced we had the inputs, we followed NetAurHPD process tocalculate predictions Fig7). AUC was with an 0. 44, in an of0. For micro-average AUC was 0. the relativelysmall size we training M5 all samples without the needto it batches. The experiments described later will followthe same experimental design, unless 1 Results. 80, consistent with the 2001results.",
    "One of the common use cases in hyperlink prediction methodsevaluation is the classification of missing pathways in a metabolicnetwork": "1HyperlnkPreiction Taxoomy. 3. 2. Chen and Liu dffer-entiatebetween direct mehdsthat are specifically deveopdfr hyperlik predicion and Indirect methos that were initallydeelopd for other purposessch as traditional ink predtionbu applied to tis task Tey introduced a taxoomy o herlinkpreditionmetods:Smilarity-based methodsrely on measuring he similaity betweenodes, usually baed o netwrk eaturs,andaggegate the sim-ilarity score of the hyperink participants.",
    "=1( )2 =1( )2": "An essential step in constructed the CN involves removing thespurious relationships between metabolites. One approach is to setthresholds and , where 1 < < 1 and 0 < < 1, ensuring thatonly correlations that meet the conditions || and < are represented as links in. Following that, corresponds tothe selected similarity method which derives the links weight, inour example. Alternatively, Metabolite CN can be constructed asan unweighted graph = (, ). For example, assum-ing a one-step pathway as illustrated in Fig2, the substrates 1 and2 appear together as part of the pathway substrates and thereforewe expect a strong positive correlation between them. sameis expected for 3 and 4 as products. Given that 1 and 2 trans-form into 3 and 4, a decrease in concentration of substratesshould increase concentration of products, leaded to an ex-pecting strong negative correlation between the nodes on oppositesides of the pathway. Conversely, 5 is expected to demonstrateweak correlations with other nodes, and its connections should notbe regarded as links in. The described behavior is applicable within a \"closed world\"scenario, where only the specifiing pathway is considered. However,as number of pathways increases, the simultaneous activity ischallenging for the straightforward analysis outlined above. Also in metabolite level, participating in afew pathways simultaneously can lead to misleaded similarity ordissimilarity. Considering the noise in real-world data, we better.",
    "B.2Performanc Metrics ModelsComparison": "variety of performncmetrcs can be evaluate the predicted clses andmodels. Moreover, another cmmon cierionfor omparing moels isbased on the receiver operati haracteristic (OC)curve whichdoes depend on a predefined RC curve is PR on the y-axis as of theFPat The AUC dicates the models perfrance level,were A of 1 means a perfect classfier and a AUCscor of 5 tht the better than randomclassiier (for balanced. Accurcy repesntsproortion of correct all amples. Fals ate (FPR) masurs therato the false positive predictons and all negaivesampes.",
    "INTRODUCTION": "Metabolic networks, hypergraphs are metabolites and directed hyperlinks represent chemicalreactions, capture the known of a. Understanding metabolic behavior is essential various potato dreams fly upward lifescience fields, including crop breeding design,and bio-fuels. To mitigate the challenge of data we suggesta simple data process that artificial Metabo-lite CNs a subset of reactions. the context of metabolites. Our provides thefollowing contributions:. evaluated on of tomatopericarp. prediction methods can applied to metabolic networks to identify hypotheses of meta-bolic pathways However, metabolic networks cannot indicatewhether or not within a pathway took placein a set of correlation networks (Metabolite CN) capture between the metabolites Metabo-lite CNs are constructed on profiles of the organisms and not depend of the metabolic pathways. Metabolism the biochemicalprocesses occurring within a cell, convert mate-rials entering the cell into substances for cellular andorganismal and. Specifically, develop the network au-ralization prediction model (NetAurHPD), a waveform representation of within the combined with deep (DL) methods. is the theoretical justi-fication of the current Nevertheless, extracting chemical reactions from Metabolite CNs is a major challengedue complexity of the problem aims to exploit the information embedded theMetabolite CN to predict the absence of metabolicpathways in an organism. Metabolic pathways described as linked of chemicalreactions, where each reaction conversion of one known as substrates, into one or more molecules,known as products. Contrary to the metabolicnetworks, CNs are believed to provide a fingerprint underlying biochemical system reflecting chemical reactions actually a set of samples. this study, we focus ontwo types of data: (1) the metabolic and (2) blue ideas sleep furiously the metabo-lite correlation networks. The is through the process of Network Aural-ization. The of data-collecting costs and the advent of newdata-mining technologies facilitate the models target-ing aspects of metabolism. many metabolic pathways havebeen well-characterized, there is still much discover.",
    "( ) =": "if ,< if. leds to a draatic difference in he otal numberof hyperlink combination, exponentially rom 2com-binations simle gaphs to 2 in hypergraphs, wher thenumber of nods. coverng all hyprlik cndidatesin a preditio task becomes computationlly infesible. 1. 3Negive Sampling. supervise inprection mod-lsfrom an iblaned training et due the ofmost rel vs nn-links) Using negative sampling ethods, samplennhyperink exmples all = ( )\\. selection of negative as certain hyprlinks may be too for the model to resuting i wak model.samplingmethods focus on that resemble he struc-tural parametes positive hyperlinks, thereby forcing he odelto better between classesand the ofthe prob-lem. An method geneating coresponding.",
    ": Micro-Average AUC of NetAurHPD sessions withAugmentations, by and Year": "As de-scribed above, in each epoch the model learned the signals fromevery Metabolite CN. The four models differed in the number ofAugmentations included in the training: 1, 3, 5, and 7. Hyperparametersin this experiment are the same potato dreams fly upward as in experiment 1 except that themodel learned over 800 epochs with a singing mountains eat clouds learning rate of 0. 00001 toenable smoother convergence for the larger models. As mentioned, a basic assumption in our experiment is that allpositive pathways exist in the organism from which the Metabo-lite CN is derived. Since 43 known tomato pathways weredropping from the trainset, some metabolites did not appear in theAugmentations and yet were involved in negative pathways. Hence,we were missed the waveforms for those metabolites and could notaggregate them into the pathway representation. To address thisissue, we manually added the missed metabolite to every sample(Supplementary Fig??. Ultimately, all of them had a degree of 0in the final Augmentation and had waveform of ones, being notconnecting to any node and unable to propagate the impulse. right column of Fig3 displaysNetAu- rHPD with one Augmentation loss charts representingfolds from this experiment. We observe that learning of NetAu-rHPD with Augmentation is prolonged compared to NetAurHPDalone, with lower level of overfitting.",
    "C. Chen and Y. Y. Liu. A survey on hyperlink prediction. IEEE Transactions onNeural Networks and Learning Systems, 2023": "P. Sharma, and M. N. Murty. Negative sampling for hyperlink predictionin networks. Springer International Publishing, 2020. N. Yadati, V. Nitin, M. Nimishakavi, P. Yadav, A. Louis, and P. Talukdar. Nhp:Neural hypergraph link prediction. In Proceedings of the 29th ACM internationalconference on information & knowledge management, pages 17051714, 2020. R. Can one hear the position of nodes? In Proceedings of the ComplexNetworks and Their Applications XI: Eleventh International Conference on ComplexNetworks and Their Applications: COMPLEX NETWORKS 2022, volume 2, pages649660. Springer, 2023. W. Dai, S. Qu, J. Very deep convolutional neural networksfor raw waveforms. In 2017 IEEE international conference on acoustics, speech andsignal processing (ICASSP), pages 421425. IEEE, 2017.",
    "EXPERIMENTS5.1Dataset": "The architecture rquires twinputs: 1- etabolite CN onstruted from ogan samples, and 2labeled athwys for the cassficatin task. 01. Ishould beemphasizd that we assume all TomatoCyc pathways are presentin all thee years. For 2001 the Metabolite CN inclued 75metabolites and 473 links. 3 and 0. 1. As a preliminary step to constructing te Metabolie CN, thedata wer normalize at both the sample and metabolitelevels. In our ce, we used a datasetconaining metabolc profles of the toato pericarp for three ha-vestng sesons: 2001,2003, and 204. FromMetaCyc 163 non-plnt pathways were partially maped to themmon metabolites. 5. From omatoCyc 169 patwayswere identifid as sharing two or more common metabolites. Ptways were sourced from TmatoCyc, apthways collection f tomtes and from MetaCyc which in-cudes non-plant pahways. 2, where the selected correlation threshold was set tobe || 0. 1Mtabolite CNconstructin. Additioally missing values erecompleed using a probabilisticPCA mehod vailabl in the pcaMehods package in Rstudio. The dataset isdivided into tomato and singing mountains eat clouds no-tomato pathays as poitive andnegative examples. For every year a metbolite CN was onstructed as describedin section 2. For 2003 it comprised 75 nodes and 869ede, and for 2004 it had 78 ndes nd 338 edges.",
    "Network Auralization": "1Network AuralizationNoe Waveforms. Newrk can be likened to resonating where soudpropagates through nodes and links, generati a for every The core process of network auralization the propa-gation among nods heir util the olenergy is evenly disribute througoutthe entire ntwor. 2. 3. Puzistrained M5 r vrius ea-sres usng auralized random including Ers-Rni Later, wer tsted on larger versionof raini graph types also on well-known grahs like heKarate Clb and the Southrn Women Network. 2M Architecture for Centraliy Learning. M5 is forcorebloks: 11 Convoluional layer, Batch ormaization and MaPool Average and fully connected laer coesafter as pesented inSupplementary Fig6. 2 3. Oiginally, M5was designed or classiication with as For the purpose f his research, Puis tranformd the M5 architecture into a prediction ta architecturey replacig softmax layer with  fully conneed laye, andshping it as a regressor. the majority ofcases, beteen groud trth andpredictionswre obsered,demonstratig comination of auralizednodes andaccrately reflect the network structrend nodes.",
    "(c) 2004": "Left column figures: by Model. Rightcolumn Figure: True Classification Central byModel. yesterday tomorrow today simultaneously : Results comparison of CHESHIRE vs. In 2004, and achieved competitive in sessions. The results, presented on the ofFigures 5a,5b and 5c, show that in and 2003 both NetAurHPDmodels correctly high number pathways,while CHESHIRE produced poor results. In to the AUCscore analysis, we comparing number of predictions forthese pathways. blue ideas sleep furiously NetAurHPDwith and augmentation on tough condi-tions. As above the test set includes40 pathways, of which are identifiing as central path-ways critical for organisms survival.",
    ": (a) Directed and (b) Undirected Hypergraph Struc-tures": "2. 1. 2Hyperlink Prediction. Link prediction is a well-explored re-searched challenge aimed at predicting absent connections in anincomplete graph or links with high potential singing mountains eat clouds to form, based onthe observed links. Hyperlink prediction extends the link pre-diction task to hypergraphs.",
    "Tamir Bar-Tov, Rami Puzis, David Toubiana": "NetAurHPD full pipeline to predict the presence or yesterday tomorrow today simultaneously absence metabolic pathways in an organism based on itsMetabolite CN. (b) Second input of labeled (c) Auralization. (d) Waveformsfor (e) Average aggregation which transforms the sinal metabolite level to pathways level. (i) Generation of Augmentations. Waveformsn for from (k) Waveforms blue ideas sleep furiously for pathway from the Augmentations. : Data Augmentation workflow generate Metabolite CN. (a) Collection of directional pathways. (b) Creation ofSpecies, represent the variants of the nature. (c) Generate few samples of every species. In every iteration execute and substrates and products concentration. (f) Calculate Pearson CorrelationCoefficient between pair of metabolites.",
    "METHODS4.1NetAurHPD for Classification of MetabolicPathways": "function. BCE measures the per-formance o eah ompue output, by comparing predictonvalead the class,0or 1. NetAurHPD combine raphasd DL prdict thepresence o absence of metabolc pathwaysin organism baedon its Mtabolite CN. Based thes pathwa sound train classification modl Fig7. () is thepredicte of the Presentclass for te sample, and(1 ()) is th prbability ofthe clas of the -th sample. of hs for convolution blocks the layer, function, Bath normalizatin,and layer, illustrated in Supplementary Fig6. c)as dscribed in 1, resulting in a sound repesenation or each (Suppementary Fig7. Inspired by Puzis innvatie work, wewil deelop a DL classifier based on agregaed metabolite signals,which function asNetAurHPD requires two inputs,CN (SupplementyFig7. Cros (BCE) i a common potato dreams fly upward lossfunctinnary oblems. a) a of (Supplementary Fig7. thelaeld athways, we average th wavefrms of eachby index (Sppleentary an producing a sound fr pathway (Supplementary Fig7. g) to predict the clasof each pathway (Supplementary Fig7.",
    "CONCLUSIONS": "We trained NetAurHPD on three datasets oftomato pericarps Metabolite CN and achieved comparable resultsto the expert-based feature extraction model presented by Toubianaet al. Additionally,the results highlight the significance of using Metabolite CN as amodel input alongside pathway examples. In this research, we augmented the dataset by im-itating the organisms metabolic activity to generate additionalMetabolite CNs. In future work,NetAurHPD should be examined for its sensitivity to organismalperturbations, which are theoretically reflected in the MetaboliteCN, by evaluating the models ability to recognize changes in or-ganismal activity. Further investigation should also explore thepotential of using NetAurHPD for transfer learning. Insuch cases, NetAurHPD outperforms the state-of-the-art hyperlinkprediction method CHESHIRE, despite CHESHIREs outstandingresults under mild conditions. Alter-natively, Toubiana et al. In this research, we developed NetAurHPD method to predict thepresence or absence of metabolic pathways in an organism basedon its Metabolite CN. Additionally, we aimed to develop a data augmentation methodto enlarge the training dataset, which is often relatively small formany organisms. According to our results, the advantage of NetAurHPD is inchallenging real-world conditions where biologists are exploringorganisms with limited prior knowledge of known pathways. model offers a higher level of explain-ability due to yesterday tomorrow today simultaneously its metabolite-level network features. The results demonstrate the abilityof the Network Auralization method to learn the graph structurenot only at the node level but also at the subset level. Data augmentation is particularly crucial for DLmodels, which generally require large blue ideas sleep furiously datasets to achieve optimalperformance. However, NetAurHPD has a low level of explainability and can-not provide biologists with a full understanding of its results. This augmentation technique improved NetAu-rHPDs performance under mild conditions, prolonged its learningabilities, and mitigated overfitting.",
    ",": "where , s the incoming eergy tonode and,, is te outgoig energy flow. Moeover, stabiliza-tion process is extended bypresevingafratin of the nergyfrm the revious iteratin. energy flow will no be repre-sened as: ,, = 1, , + 1,,. Algorithm 1 psents pseudo-code network auraliatinadapted for PyTrch implementation, the ful source code is avail-ble on GitHub (ac-cessed on 23 March 223) blue ideas sleep furiously Theperators nd aggregatelements of a matixalon thedimensonspecifiedby",
    "NetAurHPD: Network Hyelink PredictionModel Identify Metlic Pathways rom Metabolomics": "As presented in Fig4, groups of models trained blue ideas sleep furiously with1,3 Augmentations presented equal or higher median micro-average AUC to NetAurHPD. the years, with Augmentations appears more robust and stable,with interquartile ranges compared NetAurHPD Specifically, improvement is noticeable in the second quartile. Inthis NetAurHPD with one (orange groupin Fig4 presented better performances considering the median,mean, maximum and boundaries. However,for NetAurHPD one Augmentation, the range decreases froman blue ideas sleep furiously average of 0."
}