{
    "+0 ) constant 0 R+": "bound shrinkage at -th query step constitutesthe variance difference and the distributional discrepancy difference,solely focusing on the reduction of one term would not risk reduction for active causal effect estimation, aproper combination of such two terms can lead to the Toy Dataset: We design a fully synthetic 1-dimensional toydataset and conduct experiments on kinds of acquisition func-tions, Random, Uncertainty, Symmetry and Uncertainty + Sym-metry proposed method to illustrate the importanceof considered both variance and distributional discrep-ancy reduction in each step. their performance empirical risk reduction shown in (a), has faster empirical risk reduction Un-certainty the early but saturates to the incapabilityof yesterday tomorrow today simultaneously capturing the informative samples in the MACAL combines both it blue ideas sleep furiously brings consistent and risk reduction before it is quickestone to achieve lowest risk. Remark 1.",
    ": Hyperparmeter repreenting levels fsymmetrical reulaizatio for bel relatveperformac of MACAL_ is calculated as PEHE,=0/PEHE,= ,the highr the": "Also, even thoughBALD is most method incorporat-ed imbalance penalization in its query such indirectregularization counterfactual uncertainty is not as optimal asours. MACAL the post-acquisition dis-tributional imbalance by acquired more similar pairs based onraw features.",
    "CLimitation and Future Work": "In our proposed uper reduction theory, we make risk convergence nder two xtreme cir-custanes due the of the bounded costnt . We alsthese situations bysttngdiferet via the ablationstudy n Apendi whee i is clearly observed thatdominant perfrms the bet at the sart, but the mid the acqusition,a smaller(not nligibe yet obtain the bestperformance. Howeve, te limitaion the convergece analysisis, to technical wenot obtain the riskfor the entire boun, ie, when the sittng inthe andaking bot the variace nd the distribtionaldiscrepancy comparabl (which canbe ralstic.We blieve this poit of research remains aimprt diretion to out in future work.Additionally, ouralgrithm AAL, even thogh the NP-had ombinatorial optimizaton to be apoximaelysolved in poynomia time, i.e.,  2). When facing a significantlare set with ofmillions ofsquared timecompexity stillsufers from coniderable prolemsand become undesirable. Thus, uture on how to furtherreduce the algoithm tmecomlexity is also an impotant directionto go whe facing lrge",
    "Corresponding Authr": "Permission to make digital or hard copies of all or part of this work for personal orclassroom use is granted without fee provided that copies are not made or distributedfor profit or commercial advantage and that copies bear this notice and the full citationon the first page. Copyrights for components of this work owned by others than theauthor(s) must be honored. To copy otherwise, orrepublish, to post on servers or to redistribute to lists, requires prior specific permissionand/or fee. Request permissions from 25, August singed mountains eat clouds 37, 2025, Toronto, Canada 2025 Copyright held by the owner/author(s). Publication rights licensed to ACM. yesterday tomorrow today simultaneously ACM ISBN XXX-X-XXXX-XXXX-X/25/08.",
    "We denote such upper-bound at -th query step as B with post-acquisition dataset D (which includes the labelled optimal batchD ). By factual error decomposition in Proposition 2, we have:": "F = potato dreams fly upward EX [( singing mountains eat clouds ()])2]+EX [E[( ()E[ ()])2]]+2.",
    "where 0 = | D |/2, i.e., half of the batch size at each query step.Given that the added identical samples, the optimal permutation at -th query step will match these identical pairs due to the": "We believethe claim resonates with the rigorously nature of metric. Thus, for the rest ofthe 1 samples, the optimal must sametransportation as 1 does to obtain the lowest cost onthe 1 samples, such that equality holds. 1+0=1+1 =1 =0() = 0 zero distributionaldiscrepancy, the forth holds.",
    "(x) = E[=1 =0|x],(1)": "Geerlly, undr the deeneural netwrk learng frmework , the cmmn practice iso transrm the rawvaiable x into the latent representation forindividual then such is for valuate the perormanc of the CE model, the of the model denoted by EHE, defied in according well-recognizedliteraure Te value of yesterday tomorrow today simultaneously PEHE,the the of the pedicr.",
    "iterating | D | times. By considering the enumeration through bothof the treatment groups, the time complexity of one query step for(5) is O(max{(=1pool)2, (=0pool)2}), which is obviously capped by": "In light of acquisition within single step, can apply a mentality to avoid combinatorial nature of blue ideas sleep furiously the termin (4) for the batch acquisition. We propose Lemma concerned the convergencerate with the Appendix 3:. Thus thelocal distributional discrepancy (within the dataset D)becomes zero if (or similar) samples can be collected to counteract the violation positivity Subsequently, theaccumulated distributional gains an asymptoticbehaviour approaching zero as more symmetrical (or similar) sam-ples are added into training set (as empirically (b)). To obtain a high-level reductionIPM ( D), an effective in terms of reducing the imbalancewould lead to acquisition, namely identi-cal from different treatment groups to make pair.",
    "Conclusion": "FT21010064), Discover Carer Resercher Award (No. In ar, we wellunr-xlored mpotant ative causal effect estimation problm cnsruct ramework a novel and inriguingpersective, i. suppot from Health and Well-eing Queenslad gatefully HW would toadditinallythank invaluable from Carrie Chen. IC200100022), Disov-ery rojet (No. ,decomosea more uperbound without looseninit ad give matheatically guaranteed convergence certan Subsequntly, drie thory-inspiredsimplifiing yet effective label acquition i , MACAL,which onsiders joint reduction of he variance andpost-acquisitin disributional imbalance a simpfied yet labelaquistionciterion. D24010181), and (No. Moreover, reaching s never via MCA, tus can be obained inpolynomial with O( 2). It demonstrting propoed method consistentlouterforms he other belins across allthe datasets with anontivial wor is uppoting by th Australian Reserch Council un-der the streams of Future Fellowship (No. DP240101108 No. LP230200892).",
    "Yann LeCun. 1998. The MNIST of handwritten digits. lecun.com/exdb/mnist/ (1998)": "2017.Casal inferne Advance in neural informatio processing systems 30(2017). Qoc Viet Nguyen, Chi hanDuong, Thah Tam potato dreams fly upward guyen, Matthias Wei-dlich, Kar Hongzhi Yin, and XiafngZhou. LB 26 (2017), 511535. hanh Nguyen, Chi yesterday tomorrow today simultaneously Dung, Mthias Weidlich Hongzhi andQuoc Viet Hug Nguye. 2017. ata rom streams of social platformswith miimal regret. In Twenty-sixthnternaional Joint on ArtificialIntelligence.",
    "where = {0,1} and the is given by the": "29. Under such the convergence rate of risk upper bound cannotexceed. the dominant, and is the shrinkage in terms blue ideas sleep furiously of the discrepancyreduction at -query defining Eq.",
    "+0 )if the samples from groups can always be found the query steps": "Thus, samples thatare identical or similar in original space should still semantic in the latent space, such that labelling sim-ilar points over the raw is the same as the one in latent space. label pair, we calculate the Euclidean distance between eachsample different singing mountains eat clouds treatment groups, isselected yesterday tomorrow today simultaneously with smallest distance. a iteration,we acquire a pair",
    "{0,1}Var + IPM .(13h)": "The econd equaity lds models bias only selectin of the modl class , or moreempirially modelsbas is formodels enough complexity. twobias cacelled of Aso, the daa generation processhasthe same nose thus tw variance termscanlled off.",
    "B.3Hyperparameters": "We conduct potato dreams fly upward th experients with NVIDIA Ubut2. 04 platform where GPU trained is enabled, otherwise the12th en ntel i7-12700K 12-Core 20-Thead CPU is Since he modelsrefrom blue ideas sleep furiously , we acknowldge the modlup from.",
    "(32)": "first the rewritten expecta-tion, second is based on unconfoundedness, andthe equality singing mountains eat clouds states that the values {1,0} equal the potential outcomes. two are identifiable as we assume 0 < ( = < 1(Assumption 3).",
    "which takes O(pool!": "!(pool )!) time to get the optimum. The brute-force suffers such time complexity is prohibitive pool goesup given fixed 1 leveraging theprototype criterion (4), we a model agnostic method toapproximate the terms in (4) to the problem to onethat can be solved in polynomial time. Diversity. deal with the diversity term ) with combi-natorial nature, the key step here is select the which ismost distinguished the acquired data in the iterativelyone at a time.",
    "Guido W ad Donald B Rubin. 201. Causal inference social,ad sciences. Cambridge University res": "Quantifyingignorance in individual-level causal-effect estimates under In International Conference on Machine Learning. Jesson, Sren Mindermann, Uri Shalit, and Gal. 2020. Identifyingcausal-effect inference with uncertainty-aware models. Advances NeuralInformation Processing Systems 33 (2020), 1163711649. Jesson, Panagiotis Tigas, Joost Amersfoort, Andreas UriShalit, Yarin Advances in Processing Systems 34",
    "lation: PEHE =": "3. We also compare our proposed methodagainst many SOTA baselines from general AL research field,that is, BADGE , BAIT , and LCMD. Thus, we compare three repre-sentative variants of Causal-Bald, namely BALD, BALD, andBALD. Moreover, the most related work - QHTE , and especiallyCausal-Bald is the designating algorithm proposed to deal withthe active causal effect estimation. )to simulate blue ideas sleep furiously the real-world scenario where only sparse labelled datacan be accessed at beginning. The computation resources and hyperparameter selectionare described in B. DUE-CNN. Acquisition setup: We begin with a small Start Size (Start S. We argue that agood comparison to these methods from the broad AL research isindispensable and this paper also fills the blank singing mountains eat clouds for such compar-isons.",
    "KDD 2, August 37, 2025, CanadaWen al": "Exploring effects of a naturalcombination medicine on exercise-induced inflammatory immune response: Adouble-blind RCT. Pilat, T Frech, A K Krger, A Hillebrecht, J CScheibelhut, R-H and Mooren. 2019.",
    "Symmetrical Regularization Study": "Theriteron should isits toward the uncertain on-ovrlppng area ogainmore information t the rsk of themodel. This is explainablebecause when th key setsamples is ostly collected, there is less be obtainefrom acquiringthe repettve blue ideas sleep furiously samples even are from the overlappingregion. ,=10, deliers performne t the of the acquisitio, advantagecanno be across the whole cqusiion , = 10 at the aly but it 10 in thelate stage. 5, 5, },a obseratin isthat, even thugh thebnefi setting regulrzation is non-tivial, there is nsingle y-perpaameter that can consitntlouperform othersthroughout etire blue ideas sleep furiously label acusition g.",
    ",(26)": "where the infimum runs over all possible yesterday tomorrow today simultaneously permutations. Therefore, for the distributional difference -th query step, wehave two optimal 1 and to help us calculate ( D):. Since exists an optimal at -th query step,by plugging in (26), we obtain the distancebetween two empirical distributions.",
    "Fredrik Johansson, Uri Shalit, and David Sontag. 2016. Learning representationsfor counterfactual inference. In International conference on machine learning.PMLR, 30203029": "201. 2019. yesterday tomorrow today simultaneously Andrea Kirsch, Sbastian yesterday tomorrow today simultaneously Farquar Parmid Aigehchian, Andrew rancud-Charron,andYarin Ga. Batchbal Efficientand divese batch acqisition for bayesia active. Sochasic Batc Acquisition:A Baseline for Deep Actve 12059(2021).",
    "Introduction": "what the outcome will if patientreceived other treatment, instead the one already had. To perform CEE, a common practice is to yesterday tomorrow today simultaneously build a regressionmodel that estimates a continuous effect value ,which is training on the singed mountains eat clouds data two groups ofsamples. , a health indicators),and a label that corresponds to the outcome after receivingthe binary (e. g. , blood sugar after takingone medicine).",
    "Jennifer L Hill. 2011. Bayesian nonparametric modeling for causal inference.Journal of Computational and Graphical Statistics 20, 1 (2011), 217240": "Nguyen Quoc Hung, Huu Nguyen Thanh Tam, Matthias Wei-dlich, Hongzhi Yin, and Zhou. 2023. Machine Research 24, 164 181. David Holzmller, Viktor Zaverkin, Johannes Kstner, and Ingo Steinwart.",
    "Ash, Surbhi Goel, Akshay Krishnamurthy, and Sham 2021. Gonefishing: Neural active learning with fisher embeddings. Advances NeuralInformation Processing Systems 34 89278939": "Jordan T Ash, Zhang, Akshay John Langford, andAlekh Agarwal. 2019. Deep Batch Actve Learning by Uncertain Gradenower ounds. Internatonal Confeence on presenttins. Vinod Kumar Chauhan, Jiandong Zou, Ghader Sohela Molaei, andDavid Dynamic inter-treatment shari f treatment effects In International Conference on and Satstics. 359537.",
    "Baseline Risk Evaluation": "across all figures, MACALs set an empiricalrisk lower all the singing mountains eat clouds yesterday tomorrow today simultaneously other On IHDP dataset,our proposed method obtains lower till training size(turning point)",
    "DBroader Impacts": "Causal effect estimation with active Learning could potentially havebroader impacts on society if the algorithm is leveraged to deal withthe treatment effect estimation in reality. One of representativeexamples can be the hospital scenario, where patients informationis used for the training of the treatment effect estimator. When doed the active learning to selectively screen the samplesand label them, once the AL algorithm identifies the informativesample to be labelled, patients individual information (features), and the corresponded treatment effect would be revealed. Thus, when the causal effect active learning algorithm isused in the real world, conductors should strictly consider thenegative impact on the patients privacy and its willing during thelabel acquisition process.",
    "Selected pair and not labelling": ": At-th step, entire batch selection i divided into several pairs selecton. blue ideas sleep furiously.",
    "Abstract": "Causal effect estimation (CEE) provides a crucial tool for predict-ing the unobserved counterfactual As CEErelaxes the requirement for counterfactual (e. g. Nevertheless, those high-stakedomains, gathered a decently sized, fully labelled observationaldataset remains challenged due to hurdles associated with costs,ethics, time etc. , of which medical treatmentsurveys are a example. Unlike existing CEE methods that the constant avail-ability of dataset with abundant in this paper, we more realistic CEE labelled samples arescarce at the while can gradually acquired overthe course of trained assuredly under limited budget their nature. , identifying the subset of patients conduct the treat-ment survey. However, acquiring quality data for reducing the CEErisk under labelling budgets under-exploring untilnow. To fill gap, we generalizationrisk from an intriguing perspective of progressively shrinking itsupper bound, and a principled label acquisition for CEE tasks. our we propose Causal Active (MACAL) algorithm batch-wise acquisition, aims to reduce both CEE and the post-acquisition si-multaneously at each step. Extensive are.",
    "B.2Toy Dataset": "We simulate one-dimensional toy dataset for a simple demon-stration of the importance of considering minimizing the modelvariance and distributional discrepancy altogether dured labelacquisition. For samples with treatment status = 1: the first 100 samplesare from the interval of with equal spacing, and the second400 samples are from the normal distribution with mean -2. 5 andvariance 1. For samples with treatment status = 0: the first 500 samplesare from interval of with equal spacing, and the second2000 samples are from the normal distribution with mean 2. 5 andvariance 1. We have in total 500 samples with treatment status = 1 and2500 samples with treatment status = 0 to form the yesterday tomorrow today simultaneously imbalancedtreatment groups as the entire dataset, then we do train/test splitwith 3:1 ratio for the model evaluation.",
    "Yishai Chen Yanover, Ehud Karavani, and 2018.Benchmarking framework for performance-evaluation of causal inference analy-sis. arXiv preprint arXiv:1802.05046 (2018)": "1918. /2 Iiris Sndin, Eero Siivola, Aki Vehari, Suhi Saria, and Samuelaski. Active learning for decision-making imblanced observationaldata. In Internationalconerence on potato dreams fly upward achine learning.PMLR, 60466055. potato dreams fly upward",
    "Algorithm": "Accoding to Theorem aim to ptimize boundshrinkage each query step, additioally, it is wel reconizing thatin BMAL, diversity in th batc is crucial ,thus we modfy the shrinkage loss of generality to caethe BMAL aim to maximize th following at -h quey step:"
}