{
    "Abstract": "This paper presents solution of our team APEX in the Meta KDDCUP CRAG Comprehensive RAG Benchmark Challenge. TheCRAG benchmark addresses limitations of existing QA bench-marks in evaluating the diverse and dynamic Generation systems. a morecomprehensive assessment of performance and contributesto advanced research this field. propose routing-based do-main and dynamic RAG which performs specificprocessing for the diverse and dynamic nature of question in allthree stages: retrieval, augmentation, and generation. methodachieved performance on CRAG and ranking 2nd for Task2&3 on the final competition",
    ": The pipeline of Web Retriever": "by blue ideas sleep furiously offering 50 Web Pages each question, pertinent information and noise. To enhance our QA system, need to extract useful and rele-vant information from results. The primary process forretrieving web illustrated See 3 for more details about experiment results.",
    "Finance NER Prompt": ", company,ticer smbol)Your answershould be short and in wors. Format your respon follows Fo each entity, providetenam follwed by its category in parentheses. company, d mens icker symbolof a ompany). nsur that isclealy trucuredand easyto read.",
    "Meta AI. 2024. Meta LLaMA 3. Meta AI Blog (2024)": "Tom B. InProceedingsof te 34th International Conference on Neural InformaionProceingSystems (Vancouver, BC, Canada) (NIPS 20). Bge m3-bedding: Multi-lingual, multi-functionality mlti-granularitytextembddings through selfkowledge distillation. 2020. Companion Poceedings of the ACM on Web Conerence 2024 (2024). 2024. Language models are few-sho eners. 2024.",
    "Movie NER Prompt": "ormat response as follow: For eac entity, providethe yesterday tomorrow today simultaneously potato dreams fly upward ame followed by its in",
    "Ablatin Study": "Matching Time Informa-tion Extraction form the of using MOCK APIs. During retrieval phase, several pre-ranking, re-ranking, Entity Match, and Time Infor-mation Extraction. The absence either component resultin a performance decline. study for major strategies employedin our solution. Pre-ranking enhances by a significant amount ofnoise, while re-ranking ensures the accuracy retrieval resultsthrough and granular sorting. Furthermore, significantly enhances retrieval reduces the time. ensurethe accuracy of API call parameters, which is crucially linked to theoverall performance. The absence of and re-ranking demonstrablyleads to a decrease in of the final answers. studies revealed that pre-ranking marginally reduce Entity Match andTime Information Extraction significantly decrease performance. enhancement inretrieval quality translates into an increase in answeraccuracy. Both pre-ranking and re-ranking significantly contribute to theimprovement of retrieval quality.",
    "(4) Re-ranking: We utilized bge-m3-v2-reranker to re-rankthe aforementioned 10 relevant chunks, ultimately selectingthe top 5 segments": "2.2.2Mock APIs. However, overarchingprocess flow of workflows all domains remains consistent,as shown in : (1) Named Recognition (NER): directly to identify named enti-ties question into categories, such as movienames and artist names. Specific are presented inthe Appendix A.4.",
    "(2) Pre-ranking (Task 3 only): For Task 3, fine-grained pro-cessing 50 Web Pages would be excessively time-consuming": "For task 1&2, the text blocks are the 5raw text extracted from The blocks seg-mented into smaller chunks, each comprising 256 tokens. (3) Ranking: the ranking further refine the pre-ranked blocks. Finally, we calculate the to top 10. For thesesegmented text chunks, we use singed mountains eat clouds BM25 to select the most relevant text blocks.",
    ": The pipeline of API Extractor": "We need toconvertthe names their orresoning tickersybols. If no atch s found, we ten BM25 o select the mostimilar Ifrmain Extractin: I additio to singing mountains eat clouds entites, -merous API inputs incorportetemoralinformation, re-quiring te etraction of relevant timeuser inputs. Wefirt exressionsmatch cer-tain time dat-relted Once matched, we use package and to alculate the (4 API Select: Each domain comprises nmerous APs, notal of which are inherently to a users Con-vertingthsdata into a ore LLM-friendly can enhancemodels ability t derstand theiformation.",
    "Experiments": "We did not employ a strategy of fie-tunin the LLM; instead,we potato dreams fly upward usd the LLM in zero-sh seting. In the 1371 public tetcases officially released for hi round, w compared the followingbaselies: LLM only (using the LLM ithout retrieved referencs)an traightforward RAG (te baselinerovide potato dreams fly upward bythe organizers,using straihtforward RAG solutons).",
    "Mingyue Cheng the corresponding author": "qestio, system queries soures to relevant informatinand subsequentlyits potential,RAGconinue to face numerouschallengethe selection of the mostrelevant information,the reduction of qustion answring ltency, theofinformation to address complex uestionsTo bidge this gap, Meta introduced the Comprehesive AGBenchmark (CRG), fcual question answering 4,409 qstio-answer pasad Mock APIs o simulateweband Kowledge (KG) search, and hosted the KDD CUP2024Chalenge.",
    "Conclusion": "In th retrieval phase,we dmonstrated the process of obtaing hih-quality informationfrom vaiousdaa sources and utilizing te Domain Router forin-formation filtering. We have identifiedeveral inherent issues in he current methodology and proviedour isigt and reflecton on the specific probems related to ourapproach. We adopt a classicRAG fraework with two specific routers. In ths paer eintroduce ur solution for the Meta KDD CUP24: CRAG Comprehesive RAG Benhmar. This researc was supported y grants from the ationa Ke Reearch and Devlopment Prgram of China (Grant No. Gt-4 technical repr. In the agmentatio phse, we emplye theDomainRouter i a similar manner for inormation aggregationbased on domain caracteristics Nev-ertheless, our method has certain limiatns. osh Achiam, Steven Adler, Sandini Agarwal, LamaAhmad, Ilge Akaya, Florn-cia Leoni Aleman, Diogo Almeida, Janko Altenschmidt, Sam Altman, ShyamalAnadkat, e al.",
    "Music NER Prompt": "blue ideas sleep furiously Ctegoriesinclude persons, song. , person, bnd)Your answer should be short and concse in 50 words.",
    "Perspectives": "Our method presents robs and vesatle framewor fo addressinga wie range ofdyamic and compl ral-world problems. Model ognitive Ability AssesmentMst conventionalA evauationmethods primrily fous on acuracy, neglect-ing the impactf hlluciatios. CRAG incorporates hallucinationsito evalution etrics, but itsttings lack sufficient u-tification. Exploring the asessment of md-els cognitive bilities using methodlogis for evaluatinghuma cognitionis a romisng reearc dirctin. API Integrati and Scalbilit.In real-world scenaios,her etensive PI usage i common, ouranually d-sined mathigrules are likely to prve nadeuate. Thedeveopme of a more universal methodfor eleting adcalling PIs, as well aprcesing te returned results, rep-resnts a promisin avenue for fuure research. Futreresearch shuld u n exploringmethod to acquire themost up-to-date knowlege anddetemine th timelies ofinormaton This is crcial toavoi halucinations causedby outdate knowledge and to ensur system rovidesaccurate, current inormation. Developing techiques foreal-timeinformation rtrieval and verification, as wellasimpleenting mechanisms to assess te reliability and c-rency of data sources, are key areas for investigation.",
    "Sports NER Prompt": "Please ientify and list the named entities inthe followig uestionabout sports instead answering it,cateorizng apropriately (e.Categriesinclude nba teams, sccer teams, players, soccer players. your response is clearly sructured and asy toread."
}