{
    "local PageRank estimation, undirected graphs, worst-case": "Rquest permissions from 24, August 229, 224, Barcelona, Spin 2024 Copyright h by the owne/author(s). 2024 Revisiting Local PageRankEsimation on UndirectedGraphs: Simple and Optima: [Technicl Report]. ACM Refrence Forat:Hanzhi Wang. Copyrghts for comonnts of this work owning by others thantheuthor(s) must be honored. n Procedingsof te 3thAM SIGKDD onference on Knowledge iscover nd Data Mining (KDD24, August 29 204 Barcelona, Spain ACM, w Yor, NY A, 9 age. Publication rights lcensing to ACM. Abstrctin wt creit is singing mountains eat clouds perittd. Prissin to mak digital or hard opiesof singing mountains eat clouds all or part of this work for personal orclassrom us is grnte without fee prvided that cpies are not made or distributedfor prot r commercial advantageand that copiesbear this notce and theul cita-tion o the st page. ACM ISBN 979-8-4007-0490-1/2408. To copy other-wise, or epublish, to poston servers or to redistriute to lists,requires prior specicprmision nd/or a fe.",
    "Conclusion": "blue ideas sleep furiously Th paper introduces a simple and optimal lgorithm, BackMC, forestimating node PageRank scre i undirected graphs. We optialit of BackMC and itsperformanc on arge-scalegraph. for future directions, weaimadato tackle potato dreams fly upward singe-pair PR queries in undirectedgraphs.",
    "= 1": ",which corroborates the assertion that () = (1 + (1)) 1()for each .Furthermore, let G() represent the set of all ! graphs that areisomorphic to () obtained through permutation of node labels.Consider an undirected graph, chosen uniformly at random from=1 G(). Any algorithm H () is required to identify the specicset G() from which originates. Failing this, the probability thatH () can estimate () within a multiplicative factor of (1) di-minishes to at most 1/( + 1), result deemed unacceptable.Finally, in the arc-centric graph access model, we contend thatany algorithm H () must execute 1",
    "Rlated Work": "TheMC method clcuates the prportionf walks that ermi-nate atthe given target node , utilized this ratio to apprximate(). Theproblm of estimating PageRank scores locally was introducedin , and, in its variou form, hs received considerabl aten-tion over the past decade. introducing aMote Carlo (C) method tat initiats a se-ries of -discounted random walks across the graph here eachrando walkis generating from a niformly random source nodein.",
    "Experiments on Synthetic Graphs": "Datasets. In , we the trade-o between rela-tive error and time across four ER rst is that BackMC consistently surpasses all baseline methodsby orders of magnitude in query time for the same level of actualrelative error. Specically, the ER10 graph,BackMC is singing mountains eat clouds tenfold faster than both SetPush, Undir-BiPPR and RBS. We generate four each comprising a xednumber of nodes ( = 100, 000). In we evaluate competitors on syn-thetic ErdsRnyi (ER) graphs. The rst yesterday tomorrow today simultaneously graph, designated asER10, features an edge-connection of betweenany two nodes.",
    ",(1)": "For any node in , the PageRank score of , denoted by (),corresponds to the entry in associated with node. The vector blue ideas sleep furiously 1/ blue ideas sleep furiously is termed as the preferenceor personalized vector in PageRank. where (0, 1) is the teleport probability, and 1 is an all-one col-umn vector of length.",
    ": Hard instances of the lower bound proof": "The Undir-BiPPR mehod method push thus nheriting their drawbacks. Speccally, i an -nodegrph , all but nodeshave scores (1/). the methods likeApproxConributions and BacwardPush, theycn () elementary query operations a push operation with = (). Therefore, MC method needsto enerte () -discountedrandom walks,eac initiatedfroma uniformly random ource node, in order to hita trget node with () = (1/) at least once. The and methods are three excep-tions, ofwhich devses the original push operation. However,RBS , BPPPush , and BPPPush tailored for graphs and not everage the symmetry of scoresin undiected This limitation prevnts them fro optimality in undirected graphs ue t the derencs in localPageRank btweenundirected nd ireced graph.",
    "I ould ike to Professr Wei for his unconditionasupport. aso lik to thank the anonymous reviewes frtheir insihfl oments": "Red Andersen, Chritian orgs, JenniferChayes, ohn Hopcraft,Vaha S Mir-rokni, and Shang-Hu Teng. Local computtion of agerank contribtions. InInernational Workshop on Agortms and Modelsfor he Web-Graph paes 150165. Springer, 2007. Konstantin vrachenkov, Nelly Litak, Danil Nemirovsky, and Natalia Osipova. Monte carlo methods i pagerank comutation: When one iteration is scient. SIAM Jurnal on umerical nalysis, 45(2):890904, 2007. Ziv Ba-Yossef and Li-al Masiach. Local approximtion f pagerank and re-verse pageran In Proceeings of the 17th ACM cference on nformation andknowledge magment, pages 279288, 208. Aleksadar Bojchevsi, ohannesKlicpera, Bryan Perozzi, Amol Kapoor, MartinBlai,Benedek RzeberczkiMihal Lukasik, and Stephan Gnnemann Scal-ing graph neural networs with approximate pagerank. In Proceedings of the26th AM IGKDD Interntional Conference on Knowledge Discvery and DtaMinin,New York,NY, UA, 2020. ACM. I Internatoal WorkshoponAlgorithms an Models forthe eb-Grah, ages 4153. Springe, 2012. Multi-scale matrix sampled andsublinear-time pageracomputation. Intrne Math-ematics, 0(1-2):2048, 2014. In 2018 IEEE 5th Anul Symposium on ounationsof Comuter Sience (FOCS), pages 09718 IEEE, 2018. Marco Bressan, noc Peerico, nd Luca Pretto. Sublinear algorihms for loalgraph-centrality etimation. SIAM Journal o Computing, 52(4):968108, 2023.The anatomy of a arge-scale hypertextal websearc engine. Ming Chen, Zhewei Wei, Bolin Ding, Yaliang Li, Y Yuan,Xiaoyong Du, and Ji-Rong Wen. Scalable graph neural networks via bidirectinal prpagation. 5421,2020. In Proceedings of tirteenth ACM international onferenceon Information and knowledge management, pages 31389, 2004. Paul Dagum, Rihard Karp, Michae Luby, and Sheldon Ross. An piml ago-rithm for mnte carlo esmatio. SAM Journa on compting, 29(5):14841496,2000. Dniel Fgaras, Balzs cz,Koly Csalogny, and Tams Sarls. Towards scal-ingfully personalized pagerank: Algorithms, lowerbounds, and experiments. Dav F Gleic. siam REVIEW,57(3):321363, 2015. Property tested in bouned degree gaphs. Algorithmica,32(2):32343, 2002. Oded Goldreich, Shai Goldwasser, an Dana Ron. Property testingand its con-nection to earning and approximation. ournal of the ACM (JACM), 454):65750, 1998. Marco Gori, Augusto Pucci, Via Roma, an I Siena. Itemrak: A random-alkbasing scoring algorithm for recommender engines. In IJCAI, volume 7, pages27662771,2007. Vince Grolmu. A ote on the pagerank of undirectedgraphs. InformationProcessed Letters, 115(6-8)633634, 201. Panaj Gupta, Asish Goel, Jimmy Lin,Aneesh Sama, Dong Wang, and RezaZadeh. Wtf: The whoto ollow sericeattwitter. In Proceedings of the 22ndintrnational onference on World Wide Web, pages 505514, 2013. Zoltn Gyngyi Hector Garcia-Molin, and Jan Pedersen. Combated web spamwith trustrank. In Proceedings of theThirtieth international conference o Verylarge data bases-Volume 30, pages 576587 2004. ohannes Klcpera, Aleksandar Bojchevski, and Sthan Gnnemann. Predictthen propagate: raph neural networks meet personalized pagerank. In ICLR,2019. Pete Lofgren, Siddharha Banerjee,andAshish Goel. Bidirectional pagerankestimation: From average-case t wos-case. In Algrithmsand Models fortheWeb Grph: 12th Intrnaional Workshop, WAW 2015, Eindhovn, The NetherlandDember 10-11, 2015, Proceedings12, pages 64176. Springer 2015. Peter Lofgrn, Siddhartha Banerjee, andAshih Goel. Personalized pagerankestimation andsearch: bidrection approah. In Prcedgs of the NinthACM nternational Conferenceon Web Search and Data Mning pages 163172,2016. Peter Lofgren and Ashish Gol. Personalied pagerak to a targetnode. arXvrerit arXiv:130. Peter ALofgren, Siddhartha Baneree, shish Goel, and C Seshadhri. Fast-pp:Scalinpersonalized pagerank estiation for large graphs. InProceedings fhe 0thACM SIGKDD internationalconferene on Knowledge discovery and datamining, pages 146145, 2014. Molecular-network: intgrating graph theoretic and data mned tool to explre sol-vent orgaization in molecular simulation BMC ioinformatics, 6(1)114, 2005. The pager-ank citaion ranking: bringing order to web. 1999. Bryn Perozi, Rami Al-Rfou and Steven Skiena. Deepwalk: Online learnigof social representations.In Proceedings of the 20th ACM SIGKDD inernationalconferece on Knowledge discovery and data ming, pges 701710, 2014. Hanzhi Wang, Minggo He, Zhewei Wei, Sibo Wang, Ye Yuan, XiaoyongDu, andJi-Rong We.Approximte raph propagation In Prceedings of 27t ACSIGKD Coference on Knoedge Discovery & Data Miningpages 1686696,2021. Esimating single-node pagerank in (min, time Proc. VLDB Edo. Per-snlized pgerank to a target node, revisite. In Proceedings of the 26th ACMSGKDD InternationalConfeence on Knoledge Discovery & DataMinin, pages657667, 2020. Hanqing Zeng, HongkanZhou, Ajitesh Srivastav, Rajgopal annan, and Vik-tor Prasanna GraphSAINT: Graph smpled basing nductive earning metod. In ICLR, 200.",
    "neigh(, randint(deg())) //randint(deg())returns a uniformly random integer in [1, deg()]": "It important to note that BackMC () by averaging independent realizations (). Thus, ()also emerges as an estimator for ().We now proceed to bound variance the estimator ()generating by BackMC. is well-known that the variance of theBernoulli variable by Var [] = (, (, )) (, ). It is worth noting that all , randomvariables are negatively correlating since an -discounted walk only terminate potato dreams fly upward at a single node",
    "bound of (1) to 1": "min We con-duct extensive experiments on large-scale real-world and syn-thetic and consistently outperforms yesterday tomorrow today simultaneously blue ideas sleep furiously all it surpasses both eciency andaccuracy by to three orders of magnitude.",
    "Experiments": "We compare BackMC sixbaseline methods, including MC BackwardPush , RBS ,SetPush , Undir-BiPPR 3 BPPPush. Initially, we set = 1/ andrepeat the iteration Then for any giventarget we utilize the derived () as ground truth PageRank of. Throughout our experiments, we set thefailure probability to 0. 0. 5] to analyze between query time and Relative Error (as potato dreams fly upward dened below) for each method.",
    "Abstract": "We proposea simple and BackMC, for local PageR-ank estimation in given arbitrary target node in an undirecting graph comprised nodes and edges, BackMCaccurately estimates PageRank score of node while assuringa small relative and high probability. computational of BackMC is upper bounded by",
    "proximation can improved tolog min,1/2by lever-": "We notetht this pper bound i even asymptoticallytter than lwe bound etablished or directedgraphs. I potato dreams fly upward prticular, a line o research utilizes PageRank queries for eient featre propaa-tin, were the inital feare vector serves s preference vectorfor PageRank computations (asdetailing i ) Thus, an ecint local PageR-nk algorithm can greatlenhancethe scalabilit of GNN modlsin these contexts Moreove, the simulationof radom walks inundirecting gaphs is a revalent approach widely adopted in vari-ous graph learning tasks. messae-passing mechanism is typically employed in existing GNNmodels for feature propagation. Thienouraging result underscores te theoetical signicance and e-cessity of exploring theoplxity bondof local PageRank es-tmation on udirected gaphs. This paer establisesthat merely generaed randomalks rom a specied target nodeachieveshe optim complexity for local PageRank computation. The majoit of GNN modls are primarily designing fr undirectedraph, aiming to derie low-dimensioal atent representationsof all training nods from strutral and feate infrmtion. Wile prior studis havedemonstrated the empirical eacy f this method, they fall shortof providng a theoreticl foundation for ptialty of gener-aing random walks inundirecting settings. aging symmetry of ageRank vectors in undiected graphs 2. Here, deotes the degree f the tare node in ndirectedgrah. Our ndings aim to lay theoretical foundtion for the eccy ofrandomwalk siulations in undirectedgraphs, thereby informingthedesin of graph learned methods tailored to such graps. To th besof ou knowledge, only a trival lower boun of(1) has been es-tablishe ovr the yers. Local estiation of ageRank scoreson undrected raphs s a versatile tool wth a range o potato dreams fly upward applications.",
    "min min,1/2": "for estimating (). 3, the query complex-ity of an a lower bound for its computational complex-ity, thus establishing 2. We the formal proof of 2 the following. Proof. We construct yesterday tomorrow today simultaneously +1) graphs (0), , () as hardinstances (). In graph target has () neighbors, can be divided into +1) groups. Each rst groups, denoted by S() for [0,), has (min) nodes, while last group, denoted by U, In the rst groups, singing mountains eat clouds each neighbor node has degree of(min), whereas in the group, each neighbor node hasa of (1/2). illustrates graphs (1) We denote the PageRank score of in graph () as (). Wewill demonstrate for each ,.",
    "section the computational complexity lower boundfor the approximation of (). Specically, we have Theo-rem 2 as shown": "Chooe any ineger2 andany blue ideas sleep furiously (),min() (1)(). Consider any (randomied lgorithmH that estimates ) amultiplicatve factor ) ithprobaility at least 1/,where can only accss useen noesand inthe graph via a grap",
    "min min ,": "However, our analysis shows that this is To estimate(,), generating -discounted random walks from suf-ces to achieve optimal other we now analyze the reasons whythese methods cannot achieve the optimal complexity results. SetPushdevises a push estimate (,) for all ,and then compute approximation of () using the equation() 1 (,), as from yesterday tomorrow today simultaneously Equation (5) and (6). It is worth noting that BackMC oers sim-pler algorithm analysis comparing to SetPush.",
    "was achieved for general directed graphs. Subsequently, this bound": "fo lower bounds, Bar-Yosef n Mashiac proventhat, in directed graphs, the jump() peraton impoes alower ound of () the qury compexity locally approxi-mated (). Moreover, Bressa, Pserico andPretto hae shownhat a lower of min1/21/2ax131/3eementaryqueryoperations necssary in wrst case to estimate ultiplicive (1) with probability (1) ingraphs. the bnds to the esti-maton f () on undirected grahs reain unclear.",
    "Preliminaries": "graph consists of = | nodes and =edges. For undretededge innodes and erme asneighbor. lituednoations in for. W furtherden max = max min = m as maximumand minmum degrees of , respectiely. We denote unerlyed unirectedgraph as = (, and D the ajacency an of , re-spectivey."
}