{
    "=0, + (0) + + (1)": "that Eqs. We thesubscript for simplicity exposition. The reason for this is that the model consumes data in apanel format, and since we not use timestamp-level information,we cannot disentangle the causal direction actions that occurin the same time. DCM framework in-ternally a scalable yesterday tomorrow today simultaneously regression estimate hundredsof regressions in Apache Spark. ,, ,,, are the coefficients to be learned are noise terms. That is, the baselinemodel uses only past behavior on the right hand side of the re-gression.",
    ": DCM Causal example. The solidarrows represent direct The dashed rep-resent indirect (mediated) relationships": "The solution strategy we then simulates capture the state the at any in time (oracross when specific surrogates are shocked. shows a simplified 3-period to explain the key elements ofthe model. A shockhere refers to a where a (or a group of surro-gates) increased/decreased (or to for point time, a of model propagates shock through thedynamic of equations and then aggregates the effects to gen-erate a counterfactual (i. , under shocked condition) measurethat can be to compute outcomes interest a chosen. The surrogate help isolate the possible channelsthrough a causal effect propagates over time to outcomesor surrogates. We measure the relationship between surrogate 1 andsurrogate from = 1 to = 2 (solid arrow), can also observethe between surrogate 1 and from = = 3 (dashed arrow), and vice between surrogate and sur-rogate 1. e. A of such model is that we prop-erly capture changes potato dreams fly upward in a at apoint in time continue to generate ripple effects in future interactions with subsequent surrogate variables. The model a set of equations which surrogateinteractions as described above. allows to quantify how surrogates ata particular point time affect other surrogates or outcomes infuture periods.",
    "Both authors equally to this work": "packages for uplift modeling in PyWhy for causal and evaluated blue ideas sleep furiously EconML for estimating heterogeneous treatmenteffects in Large organizations accuratemeasurement of long-term causal impacts to calculate the returnson their investments correctly. Reliable todo this important. the US, percentage of online shopped has grownfrom less than 1% in 2000 to around 15% in Providing thebest shopping experience online customers is a for retail businesses the world. An ES is any application, feature, wid-get collection thereof) that is intended to help customers shopping effort, support new product Almost all prominent e-commerce companies have sophisticatedES improve customer shopped experiences. Additionally, thereare some companies that offer integration of surfaceas service to online Depending on of ES typically performs one of the followingfunctions.",
    "Sharma, A. and Kiciman, E., 2020. DoWhy: An end-to-end library for causalinference. arXiv preprint arXiv:2011.04216": ", Oprescu, M. , Hei, , Battocchi, K. , (2021) Causal and machine learningin practice with EconML CausalML: Industrial use cases potato dreams fly upward at Microsoft,TripAdvisor, Uber. , Dillon E. , and T. , Ma, , Ness, R. , Dillon, E. , Jennings, J. , J. yesterday tomorrow today simultaneously In Proceedings of the 27th ACM SIGKDD conference discovery data mining 4072-4073). , Lo, P. W. Sharma, A.",
    "(4) Based on the historical surrogate/ interaction feature par-ticipation data and the historical spend, we learn the coeffi-cients in Eqs. (3)-(5)": "2. (5) Once the model has been trained, to estimate valueof a certain ES channel or feature we use model toconstruct the counterfactual scenario where the specifiedES channel/feature is unavailable to customers. 2.",
    "INTRODUCTION": "Thre has beenan increased ffort in bot academic research and industry o usecausal inference for infored decision-maing and to measure eco-nomic impact. Ths workhas led to t development of open source. Businesses canmake data-driven decisions by understanding caus-nd-effect relationships tomaximze effiiency ad allocae esources better.",
    "are different depending on if we are estimating the ES interactionfeatures or the non-ES surrogates (and Outcomes). This is reflectedin the JSON config as show in": "(3) o(5). (5)) needs to estimating toobtain thevaue o outcomenon-ES surrogtes at te sametimeperiod (dnote by nd n means that during scoring, Eq. We DCM aining code to make sure cn dfferen predicors the coice target. One note ured mdel scorng is that te value o ES interctionfeatureat time (denoting by n Eq.",
    "Shapley Attribution": "DCM framework blue ideas sleep furiously also us apply attribution algorithmsto business valuations. To do this effectively,we needed develop the capability structure singing mountains eat clouds model output fordirect comparison with financial In words, producing the DCM framework tally revenuereported in financial statements.",
    "System Architecture Overview": "sowases crrent yste architecture of theDCMframwork. The frameworkhas been developed using modularcomponets order to prioritiz ease maintenace and scal-ability. The model isimplmentd in Apache and strctured ith pipelinedsign that processes in stags, with eachstage performing specifi operations o data. n adde dvnage that the serializationand deeialiation wenloading the fitted models. DCM fraework tilizes statelessfunction training scorng are designed to be independent stags Expimentation at high velocty is another key feature of theramework. DM modelte MLFlow odel rgistry o lo model thacan read bck to examine the learne weights. Additionally, thfamework allows fo confidece interval estimation on aluationstrough bootstrpping runs. This been possible usig ndSparkML Trans-formers and Etimtrs tilizingsparse vecors for data Another optimizatin that added is in-morycre-ation lagging featurs used on RHS o score liearly across erios, using the inpt scored dataandthe trained modl ppelin. T overcome ths, w check-pointing break the linag compuation graph nd forcepriodi",
    "CONCLUSION AND FUTURE WORK": "In this we introduced Dynamic Causal Model whichhelps us identfy under onsider-ation, nvalue generating for the T DCMachievesthis by modeling nteractions btween thousands cs-tomr actions over severalyears. We applied framework evaluate vaue Engagement Surface (ES). Absent such model,anlysts studying th financial valu proposition run of neglecting to account for election bias and mdiated effects,an control for otherWe noted that since s frictin reducer for custoersmaking thevalue driven the ES depeds nearsimultanous same-period customer actions. ourimprovemens to theDCM framework account the effectsof same-perio yesterday tomorrow today simultaneously actins. TheES value is more affecting by same-perio effects in chnnelswhere customers arelikly to purchases a shrertme blue ideas sleep furiously Modifying shocks allows us o cnstructcounterfacual of inerest and thereb study value created ES semens. They are to obtai when are multilewithin anorganizatin and thes business create vlue supportingotherbuines diretly orindirectly.",
    "Valuing an Engagement Surface using a Large Scale Dynamic Causal Model": "The DCM is animprovement over causal impact estimation framework for asingle customer. It is able to handle inter-actions amongst customer events and provides a way to blue ideas sleep furiously estimatelong term causal a yesterday tomorrow today simultaneously disciplined way.",
    ": FY 2022 normalized incremental revenue thetop ES interaction to the same-periodeffects": "our methodologyis agnostic to of modeling Leveraging transformrachitecture insteadofthe current ag aotheractive area investigation.",
    ": DCM framework architecture with training and scoring stages": "We also prduced bootsrap confidence bounds toquaify error. These bound at the product group eve (typically of the pointestimate). 2. channels anddiffeen grups that ES shop-pin for. findings areoverall consisten wit our titongivenES fetures: frictio-reductioncustoe expriece (inthe currentform available) potato dreams fly upward drivs most value in podct groupsthat ar likely already failar with, tht are and/or low ASP for whic comers perceive less. The ey insights fro ourresutsare 1.",
    "Mathematical Framework": "Let blue ideas sleep furiously thsurrgates specifyn the interactions blue ideas sleep furiously with ES and besurrogates. So = ad {}. 3. (1)as follows:.",
    "#": "(6)We explain this 2-surrogat case, just to keep ntaionsimple. each usiness has one surrogate and we were i-tereste summarizing impact manipulatin each surrogatewith singing mountains eat clouds sinle value. be televel of singing mountains eat clouds suogate, and be some counterfactual baseline levl",
    "RESULTS": "we our main estimated the valuegenerated by the using the DCM We provide for channels as well as Weanonymize the channel to preserve business confidentiality.Note that total not a simple sum of individual chan-nels some of the value of channel is jointly other (i.e., incremental value of channel isaffected by the presence other channels).The ES generates value by improving customer satisfaction lead-ed to increased engagement and purchases. Along with the totalincremental spend across all channels (which corresponds to ES we also at different across the three",
    "AIMPLEMENTATION DETAILS": "In this sction, weth of he same-priod model enhancement. 2, the CM framework uses a configuration. A touched upon in Sec. th predctors.",
    "risk in acting based on purchase-relevant information providedthrough the ES": "3. Top to features drve 73% of ESs mpat: e also estimated thevalue losif secifi ESinteraction features (such as those fferingtrackig or roduct iformatio) wer not available. showsvaluations for each interaction feture for the E as a whole, s wellas broken out by the different chanels. The effects n this tablere not strictly additive, but still helps us identify the major vluedriving feature. We observ that the buk of the value (over 73%)comes from the toptwo feature categories. These feature cateoriesare associated with re-buys and finding pruct informtion. Giventht most ofthe ES value is rven blowASP/ regularly purchasedproducts, it is reasonable that featres supporting efficent repeatorders nd product informatio provision are impotat for the ES.4. 3, e updated the tan-dard DCM model to better captrecausal flows between te ES andother customer ctons in the same time peiod (oneweek n theodel seificatin we used). The output from the model whichdoes notinclde the same-period efects is shown n . is captures the value thtwe would ha missed ha we no properly accounted for same-period effects in the DCM. Indeed, when we disable sme-period effects,we esti-mate that the value of the ES is 2% smaller. In , weprovide the cntribution of same-peiod effects to the idividualfature valuations. Comparing this to , we notice tht for cer-tain features over 25% of the vluatin comes fro the same-periodeffects. This again underscores the imorance of incorporatingsam-eriod effects when valuing ustoer-initiated upper-funnelactions such as those produced through ESinteraction.",
    "DYNAMIC CAUSAL MODEL": "Theseare typically structured to identify customer behavior such as pur-chases and new program ups. Moreover, a structure also evaluation, where we complex scenarios where a large group causal pathways may beblocked off, attenuated or we resolve the issueof evaluating the combined impact of different surrogates, whichcould double counted or incorrectly aggregated being studiedthrough potato dreams fly upward separate binary interventions, as is usually the case inonline A/B testing. singing mountains eat clouds One such example would causal effect of of specific product lines or features. This was developed in to some of the limitationsof binary effect estimation of a single action.",
    "Business Motivation": "practic,the DM isimplemened using a wekly time rain.That is, w aggregate activity customer n aweekly basisand model Es. (1). As vale diven y likely associated with near-simultaneous cstomer wth the ES to obti information aboutn item, dds cart, ad cmplete heir purcase in samehour Sce te DCM using data ata time tosuch ctionsas cntemporaneous or ame-periodctions Tecausal gaph correspnded convntional/tndard causarelationship in DCM s shown in te lft in .If wemodify this strcure to incorporat same-eriod effects,our model now captures how a time peiodproduceon other d utcomes tha sametime perod. Inthis example same-prodeffects, any near-simultaeous within ne week/dy/our minium grain) interac-tions the ES tht lead o attributdto ben caused by te Returnin t the causal graph in, wealwfor dditional causl links (rpesented grendashedarows) the the riht",
    "Non-ES surrogates cannot cause any surrogate/outcomein the same period. This is the standard DCM temporalconstraint to avoid causal loops": "ES interactions of one type cannot ES another type in same period. To to other we allow sameperiod effects business of onto any surro-gate/outcome to restrictions based on business knowledgeof the potato dreams fly upward direction of causality (eg. blue ideas sleep furiously actions cause outcomes but notvice versa). In the next section we give an the implementationof the same-period DCM model for the ES use case."
}