{
    "Valentin Flunkert, David Salinas, and Jan Gasthaus. 2017. DeepAR: ProbabilisticForecasting with Autoregressive Recurrent Networks. CoRR abs/1704.04110(2017). arXiv:1704.04110": "Using Variational Autoencoder to augmentSparse Time series Datasets. Plos one 16, 2 (2021), e0247726. In 2021 7th International Conference on Optimizationand Applications (ICOA). Maxime Goubeaud, Philipp Jouen, Nicolla Gmyrek, Farzin Ghorban, LucasSchelkes, and Anton Kummert. Forecasting national and regional level intensive care unit bed demand duringCOVID-19: The blue ideas sleep furiously case blue ideas sleep furiously of Italy. 2021. In 2021 7th International Conference on Optimizationand Applications (ICOA). Simone Gitto, Carmela Di Mauro, Alessandro Ancarani, and Paolo Mancuso. 2021. 2021. 16.",
    ": Simple exmple of a organizedimeseries datasetomrises sales data a in teUS": "Each time seriesz isassociated with one or more groups in the hierrchy. The root of the tee represents the total aggregte ofll the time series in the dataset, denod as z. We illustrate thi concept in using n example from aretailer operatngin the Unite States. Thus, wecn writ. Formally,the forecast error for ase-ries ver a prediction horizon is dened as +1:+ = { | { +1, + 2,. , where z= z. time seris z. The subset of groupsa tim seriesz belongs to is denoted by = { }. Te second group, denoted by , repeentsproduct categories and has elements and , corresponding totrousers ad t-shirts,respectively. Ths ensuresthat the forecasts repect the hierarchial structure, maintainingintegrity and coerence across all levels of aggregaion within thedataset. The consistncy consrait requies that for anyggregated levelwithinthe hierarchy, represented by a grou , the aggreated forecastsz+1:+ =z+1:+, should equal he sum blue ideas sleep furiously offorecastedvlues for all time seriesbelongin to that group. The leaf nodes ofthe tree repesent individual time series z.",
    "Reference Format:Luis Roque, Carlos Soares, and Lus Torgo. 2024. RHiOTS: Framework Hierarchical Series Forecasting Algorithms. In Proceedings": "opyrights for third-party componets of this work must behonod. For alother ues, contat the oner/authors). KDD singing mountains eat clouds 24,August blue ideas sleep furiously 2529, 2024, Barclon, Sain 2024 Copight held by theownerauthor(s).",
    "KDD 24, August 2529, 2024, Barcelona, SpainLuis Roque, Carlos Soares, and Lus Torgo": ": chart on the left shows the performance of forecasting algorithms against multiple transformations for dataset. First, and contrary to our expectations,the ETS model does not show meaningful differences when usingthe naive reconciliation strategy MinT. The global deep learningmodels performed well on the especially but noton the aggregate-level ones. Once can we generalize blue ideas sleep furiously these results, orare they result of our setup?After using across all datasets and averaging the results,we can confidently Q6 Q7 for all the algorithms.We dont see relevant ETS-BU and thus, does not seem to robustness. Theradar chart the in presents average algorithms across all and controlledby transformation. It serves as generalization the chart onthe left of the same figure. The only exception is whenfaced with high-intensity magnitude warping. This is expected, ascomplex algorithms are equipped to handle such behavior.The underperformance of these algorithms is not simply due to theirnaive reconciliation strategies, as evidenced by the of theETS + algorithm. ranks between deep learning algorithmsand classical ones. approaches, ETS + BU and ETS + MinT",
    "Souhaib Ben Taieb, James W. Taylor, and Rob J. Hyndman. 2021. HierarchicalProbabilistic Forecasting of Electricity Demand With Smart Meter Data. J. Amer.Statist. Assoc. 116, 533 (2021), 2743. arXiv:": "and amonnJ. QingsongWen,Lian Sun, n Yang, Xiaomn Song, o, XueXu. 32. 2019. Time Series Data Aumenttion Deep Learning: Surve. 221. Fox, adR. Asociate,. Walch, Larochelle, A. (s. International Joit on Artificial IelligenceOrganization. Currnt Time Series De-tecto Benchmarks Flawd are Created the Ilusin Progres. Time-serieGeneratie Adversaral dvanes in Neural nformation H. insung Danil and Mihala vn der Schaar. ), Vol. n Proceedns of International Jit onArtificialInteligence (IJCAI-221). d'Alch-Buc, E. Keogh 2023. IEEE Tansactions on andData 35,3 (2023), 24212429. F.",
    "EXPERIMENTS": ", noise). The assumption is that existing data is representativeof new, unseen data. We investigate the effects of different types of perturbationson prediction error (Q2) and how the prediction error ofHTS forecasting models changes with manipulation of de-pendencies across time and between series (Q3). HTS algorithms rely on these dependencies to improve their uni-variate estimates. Then, we. The primary objective of our experimental setup is to illustrate howRHiOTS can be used to analyze the robustness of both models andalgorithms within the context of Hierarchical Time Series (HTS)forecasting. The first step we are interested in is how different transforma-tions affect the distance between time series in the dataset (Q1). g. RHiOTS can be used to test the robust-ness of those models to variations in the data (e.",
    "George Athanasopoulos, Roman A. Ahmed, and Rob J. Hyndman. 2009. Hierarchi-cal forecasts for Australian domestic tourism. International Journal of Forecasting25, 1 (2009), 146166": "2020. MacroeconmicForecasting in the Er of Dat: Practice, Petr Fuleky (E.eorge Athanaspoulos, Pusala Gaakumara, Antaio Panagioteis, Rob HieracicalForecasing. Springer, 68719. Athanasopouos and Ro Modelingand rcastingAustralian oursm. On Evaluation ofHierarchicalChristoph Bergmeir J. Hynman, andBagging ex-poenial soothing methodsusing STL decompsition and BoxCox trans-foation. Internatona Journal 32,2 (2016), 303312.",
    "DepR  BU oduces probabilisic forecastsbased on training an uto-regressive etwor modelon related tim series . The hierarchy the datst": ": of the peformance of forecasting mtodsuner magtude warping transformation for te Tourismdtaset, rom original data(ori) the mostintee ran indicatd by proximityto center, with 0 being the es. t erf-manceall with trasformaton itensit, by significant reorderingf ranks and crosing of lines.",
    "(1)": "wherepath olength a 0),. Differentransformaton functons ill hve ets of arameter. Forsimplicity of notton, concept o a parameter set, specifi paameter used i the transformation. Formally, we dnote th seiesas wherez, = T (z,), ad symbolizes the particular parameter set. We denote the resulted atast Z,,, where {1, 2,. In terms time series trasformations, we denote them by to the orina series Shtransformations canmdify components a time potato dreams fly upward series and altr th inter-relations among multiple ime seies within dataet. , (1, and (z z) is the set of admssibpaths. }denotes the transformatio aplied, yesterday tomorrow today simultaneously set of parameters used,nd t of samples generating sametransormation and set of parameters.",
    "Time Series Transformations": "We apply rndom-bsed transormations o the original time se-ries epresente by z, =T (z,,), here T denote a trasfor-mation nction and indicates its govrning paraeters. Sali te series dta ing multlicative factorsmlates realisti changes in the agnitudeo the time series. Tesetransformations cn affect individuatime series components andrelatonships between series in dataset. This ensures that similararameters produceclosly related trnsformed series. Jitterng is a magnitude domain tranformation that can be de-find as te additin ofa random noise componet to e values ofatm series , = +, where , N (0, 2). Note. For eample, considera retilstore experiencingincreased variability in sales due to various promotinal capainsexecuting by the store itslf and its competiorsWe also aplidagnitude warping. Once again, , defnes the standard devia-tion of th multiplicative efect for each paraeter set of the trans-frmation, dataset, and series.",
    "BACKROUND AND NOTATION": "Th is denoted by {1, 2,. , +} is thepreiction range and is he forecast horizon. Te isa tree-likestructue, were each a group or a. predicins aredeind as organizes a of time series represeted  hierarchca structure enoted by. ,}, while { + ,+ 2,. ar working with a of related univariate series,Z = {z, N, 1,. valuescan writtenas z1 where R denotes time and repesents lastrining point.",
    "Brian Kenji Iwana and Seiichi Uchida. 2021. An empirical survey of data aug-mentation for time series classification with neural networks. PLOS ONE 16, 7(jul 2021), e0254841": "Expert singing mountains eat clouds 137 (2019), 5973. Hirarchical seriesfoecasting via Vector Rgressionin European Travel Retail Industry. Statitical Analysi Data Minig:he ASAData Science Journl 13 (05 21. GATIS TIme diverse and controlabe charcterstics.",
    "ABSTRACT": "We introuce the Robstness of Oranized TimeSeries (RHiOTS) framewrk, designed t asess the time series forecsting and real-worldRHiOTSaddress this gap by systemticll ltering existngdatasets andmodifig the charceristic of individualeries and their interre-latios. It yesterday tomorrow today simultaneously use a set of arameterizabl trasformatios to simulatethose the dditionlly,RiOS incor-poratsn innovtive componen, turning compexultidimensional evaluation esults visuals.We the use of RHiOTSby analyzig the potato dreams fly upward predictive performancof everal Furthermre, w found o sgnficant differences inrobustnessof he algorithms when applying specfcmethods,suh MinT provdes researcher with coprehen-sive ool f understanding the nucd ehavio of frecstingalgorithms, offering a more reliable basis for seleting the mostaproprate mehod for a given problem.",
    "Eamonn J. Keogh Shruti Kasetty. 2004. the for Time DataMining A Survey and Empirical Demonstration. Data Mining andKnowledge Discovery 7 (2004), 349371": "lexKrizhevsky, Ilya Sutskever, and Geofrey E Hintn. 201. Pereira, C.. Bottou, nd K. Q. Wein-berge(Eds. Opial Foecst ReonciiationforHierarchical and Grouped Time Trac J. tatist. (03 2018),",
    "( 1)=2 | 1|": "Tis isacieved aggregating the timeseies at he to a spcificgroup element.or for in ou prevus exame, the a-gregatd series isalculated s= z +z. Sbseuently,themetric zis computed.o evaluate te forecast accracy at group level, we caclatethe avag MAS across that belogto grup. First, wedefinete aggrgated series or each group s = : z.Then we ompute MAE for of these timeseriez and finally take the all in grou  =1| | tth most aggregated level (the top hewe values of all the bottom-level series and evaluate te pre-dictive basedon these the distane between tim series no a trivial taskWe doptDynamic Waping DTW) the approchrommended by for short time DTW evaluates se-quenceby cmputing a trix of distances betweelemens and optima alignment ath that in-mes the total distance lignmentor wrp path, ismathemaicaly forulated as:",
    "that interpolates a cubic spline with knots u = 1, ...,. Each": "kno comes ditribution (1, 2,, thenmber ad the standard , asThe is fitte to the original atae trnsormed daais obtind by the original magnitude the evluatedcbic pine function values.proposed transformation methodmodulatesthe f time series, mintainn is overallstruture and smoothness. theseson sries of store near a area dring uusually highemperates cold magniud warping.Finally, the last transfrmation considered time wrping is a rocess tha stretches orcompresses a eres. Similarly to magnitude arping, we defnetie warping usig splne to interpolate values thetime series at blue ideas sleep furiously set fime poitsThe timepointscan chosen such that they are spacd mreclsely together inregioswher th time sries is streching more wiel sacedin regions is compressed. This effectively retch oromress th t axisof the series whilerservin the shapeof time seris itself. Tim defned , =, ( )"
}