{
    "CONCLUSIONS": "This paper itroduces a label-aware coortaugmetedlearnng framework desining enhance deectionmodlscapability in revealing camouflage frauds. To refinethe information, Vecug label-awareneigbor mechansm, effectivelythe nega-tive neighbr representatins i th augmented pace. n summay, VecAug a obust to ehancethe distinuishing ability of detection pro-ided a promising strategy detecting fradsters.",
    "Cohort Identification Phase": "Here, Ethe augmentato neghbor vecors and egatveneighbr vectors, respetiely. We cosructa tailored ctrastve loss to achieve this oal, whiis in andexlained in. mitigate callenge,we adoptstategy that involves retrievingbot augmentationneighbors neighbors or eac taret dringtrining. cohorts specico activities,the target sapleis fed ito (), a vector quey tosearch augmentationneighors in However, cohort augetaton for frudkey challenge:th potential of predicion This ca when incorporating nformatio fromwell-camoflaged fauders that ofnormal wen ex-cessivly integrating noral user beavor informationto rpresentation learing of fraudsters. This enables the mdel t discrn dispariies eten well-camouflaged fraudsers and sers.",
    ") + =1 exp(d(y,y, )": "In thismanner, the personalized cohort from the burn-in blue ideas sleep furiously phase remainsuseful in the augmentation phase. This method enables supervised con-trastive learning and prevents the cohort augmented representationfrom diverging too much from the original burn-in vector. Since cohort identificationdepends on vector distances between the target sample and can-didates, it may deviate slightly from distances in the augmentedrepresentation space, potentially reducing the relevance of neighborinformation to the current prediction task. Task #3: Latent Space Alignment.",
    "and Kuldip K. Paliwal. 1997.Bidirectional recurrent neuralnetworks.IEEE Transactions on Signal Processing 45, 11 (1997), 26732681": "2022. H2-FDetector: A Fraud Detector with Homophilic andHeterophilic Connections. - of ACM Web Petar Casanova, Pietro Li, Guillem Cucurull, AdrianaRomero, and Yoshua Bengio. 2018. InternationalConference on Learning Representations, ICLR 2018 - Conference Track Proceedings(2018), 112. arXiv:1710. 2019. A graphattentive for financial Proceedings - InternationalConference on Data Mining, ICDM (2019), arXiv:2003. Live-Streaming Fraud Detection: A HeterogeneousGraph Neural Network Approach. for 36703678 pages. Wang, Xiaomeng Yi, Rentong Hai Jin, Peng Xu, Li, Xi-angyu Wang, Chengming Li, Xiaohai Xu, Kun Yu, YuxingYuan, Yinghao Jiquan Long, Yudong Cai, Zhenxiang Li, Zhifeng Zhang,Yihua Jun Gu, Ruiyi Jiang, Yi Wei, and Charles Xie. Milvus: APurpose-Built Vector Data Management System. Proceedings the ACMSIGMOD International on Data (2021), 26142627. Meirui Wang, Pengjie Jun Ma, Lei and Maarten De Rijke. 2019. 2017. Session-Basing Fraud Detection in Online E-Commerce Transactions Using RecurrentNeural Networks. Ziming Wang, Wu, Baolin Junjie Wang, Kaiyu Huang, and Proceedings of the ACM SIGKDDInternational Conference on Knowledge Discovery and Data Mining 51945203. Xiao, Yuncheng Wu, Zhang, Gang Chen, Chin 2023. MINT: Detected Fraudulent Behaviors from Pro-ceedings of the VLDB Endowment 16, 12 (2023), 36103623. 2022. Knowledge Injected Prompt Based Fine-tuning Multi-label Few-shotICD Coding. of the for Computational Linguistics: 17671781. Jianke Yu, Hanchen Wang, Xiaoyang Wang, Zhao Li, Qin, Wenjie Zhang,Jian Liao, and Zhang. 2023. Group-basing Fraud Detection Network one-Commerce Platforms. Chaohe Liantao Ma, Yasha Wang, Jiangtao and Wen Tang. 2021. GRASP: Generic Framework for Health Status Representation on Incorporating Knowledge Patients. 35th AAAI Conferenceon Artificial Intelligence, AAAI 2021 1 (2021), 715723. Dongyu Zhang, Liang Wang, Xin Dai, Shubham Jain, Junpeng Wang, Yujie Fan,Chin Michael Yeh, Yan Zheng, Wei Zhang. 2023. FATA-Trans: Field And Time-Aware Transformer for Sequential Data. International Conference on Information Knowledge Management, Proceedings(2023), 32473256. Zhang, Hongzhi Yin, Tong Chen, Quoc Viet Nguyen Hung, Zi Cui. User Representation Learning UnifyingRobust and Fraudster Detection. Dl (2020), 689698. arXiv:2005. 10150 Panpan Shuhan Yuan, and Wu. SAFE: A neural analy-sis model for fraud detection. Zhu, Dongbo Xi, Bowen Fuzhen Zhuang, Shuai Chen, Xi Gu,and Qed He. Modeling Users Behavior with for Cross-domain Fraud Detection. Web Conference2020 - Proceedings of the World Wide Web Conference, WWW 2020 (2020), 928938.",
    "Efficiency of VecAug with Integrating": "Our exprimen-ta results ighlight VecAugs integration with exitinfrad detectio methods its combintion with providing amore fficient approachto fraud detecion. W performed experientsove 20epochs for bot cases and the throughput number tuples processedsecond) both CPU anGPU. Specifically, th solutionof VecAugwith Milvus acieves hger training ad inferenceefficieny, speedups of up to 21 3x 26. 6x ofCU and GUrespetively, incurs no extrainfra invstmet. r w mploye HNSW as the index forvector searc, for ih accuracy and efficient The throughput compariso results, as deicted in Fig-ure demonstrate VecAug exhibits when integrted wth a databs compared toVcAug operatingwithoutone. o ensure fair comprisons, we mainaed consistet batchsiz of 512 across all tomximize the GPapacity.",
    "Influence of Cohort Size (RQ4)": "50% 1. 00% 1. In section, we investigate the impact of cohort variationon the effectiveness of VecAug. is evident that the performance of the learning framework remains highlyrobust varying sizes the cohort Cohort K 0. 50% 2. 00% 0. 50% 2. 00% 1. 00% HEN w/ VecAug Cohort Size K 0. 50% 1. obtained from potato dreams fly upward detection models on Shopee-small are illustratedin. 00% 0. 00% MINT w/ VecAug.",
    "DHYPER-PARAMETERS SETTINGS ONVECAUG": "hyperparameters and a crucial role VecAugs ob-jective function. Specifically, they to the weights ofthe supervised contrastive loss and auxiliary reconstruction loss,respectively. further increase of to leads to more pronounced due to an on distinguishing trained from negative neighbors,which could cause overfitting. On the other decrease in below 0.001 reduces the models ability counteract noise",
    ": Performance improvements of HEN and MINT onShopee-small after integration with VecAug, depicted in AUCacross various cohort sizes": "certain threshold. asmaller cohort,meaningful informaion is agregated from trainingsmples to enrich epresentatin of target sample. Howver,as the cohorsizeicreases, both vluable nosy informationis thetarget users, esltig erformace saturate at =4.Iitially, mostlearned aug-menationneighors closely align with taget sers, therbyenhancing their representation. with an increased size,the encountering neighborsith op-posie labes the targe uses rises, potentily compromisingthe o However, the i-plemetatin of a label-awar neighbo separation schemehelsmitigte adrs effects nois infrmationbythe When te mpacts ofnegative nighorsand thelabel-aware scheme are performacef ecAug relative acoss vary-ed cohort izes. summary, our VecAug effectivelyenhans learning capaciy o baseodels xhibits rbustperformance, irrespecte ofsize variations.",
    "% and 6.83%, respectively. These new results further validatethe of cohort augmentation for fraud detection.CVISUALIZATION VECAUG": "Weuse t-SNE vsualze user emeddinsof bse modeland itversion VecAug, as sownin. most xisting eth-ods thatuse contrastiveloss on encoderoutputs, applieslos the predcted This shows blue ideas sleep furiously th varietyand of anduserbehaviors.",
    "KDD 24, August 2529, 2024, Barcelona, SpainFei Xiao, Shaofeng Cai, Gang Chen, H. V. Jagadish, Beng Chin Ooi, and Meihui Zhang": "AUC-orienting Graph Neural Network for Fraud Detec-tion. International Conference on Information and Knowledge Man-agement, Proceedings (2020), 315324. Xurui Li, Wei Yu, Tianyu Luwang, Jianbin Zheng, Xuetao Qiu, Jintao Zhao, LeiXia, and Yujiao Li. 2018. William L. GeniePath: Graph Neural Networks with Adaptive Receptive Paths. In Advances in Neural Information Processing Systems,Vol. 2017-Decem. International Joint Conferences on ArtificialIntelligence Organization, 36703676. Yang Liu, Xiang Ao, Zidi Qin, Jianfeng Chi, Jinghua Feng, Hao Yang, and QingHe. The Web Conference 2019 - Proceedings ofthe World Wide Web Conference, WWW 2019 2 (2019), 8393. Yu, and Sihong Xie. 2019. CopyCatch: Stopped group attacks by spotting lockstepbehavior in social networks. arXiv:2002. Meng Jiang, Alex Beutel, Peng Cui, Bryan Hooi, Shiqiang Yang, and ChristosFaloutsos. 2017. arXiv:2006. 2020. Transaction Fraud Detection Using GRU-centeredSandwich-structured Model. Hamilton, Rex Ying, and Jure Leskovec. Proceedings of ACM SIGKDD International Conferenceon Knowledge Discovery and Data Mining (2020), 31013109. Proceedings of AAAI Conference on Artificial Intelligence34, 01 (2020), 362369. 2018. No place to hide:Catched fraudulent entities in tensors. Robust SpammerDetection by Nash Reinforcement Learning. arXiv:1711. 2020. Can Liu, Qiwei Zhong, Xiang Ao, Li Sun, Wangli Lin, Jinghua Feng, Qing He, andJiayu Tang. 2021. Ziqi Liu, Chaochao Chen, Longfei Li, Jun Zhou, Xiaolong Li, Le Song, and YuanQi. Enhancing Graph Neural Network-based Fraud Detectors against Camou-flaging Fraudsters. Yingtong Dou, Zhiwei Liu, Li Sun, Yutong Deng, Hao Peng, and Philip S. 2016. 2020. Can Liu, Li Sun, Xiang Ao, Jinghua Feng, Qed He, and Hao Yang. Yikun Ban, Xin Liu, Yitao Duan, Xue Liu, and Wei Xu. 05988 Dawei Cheng, Sheng Xiang, Chencheng Shang, Yiyi Zhang, Fangzhou Yang, andLiqing Zhang. Almeida,Joo Tiago Ascenso, and Pedro Bizarro. Yu. Online Credit Payment Fraud Detection via Structure-Aware HierarchicalRecurrent Neural Network. 00910 Ziqi Liu, Jun Zhou, Chaochao Chen, Xiaolong Li, Xinxing Yang, and Le Song. Spotting Suspicious Behaviors in Multimodal Data: A GeneralMetric and Algorithms. 2013. The Web Conference (WWW) (2021), 31683177. Interleaved Sequence RNNsfor Fraud Detection. Proceedings of ACM SIGKDDInternational Conference on Knowledge Discovery and Data Mining (2020), 924933. The Web Con-ference 2019 - Proceedings of the World Wide Web Conference, WWW 2019 (2019),616626. Bernardo Branco, Pedro Abreu, Ana Sofia Gomes, Mariana S. 12307. Heterogeneous graph neural networks for malicious account detection. In Proceedings of Thirtieth International JointConference on Artificial Intelligence. Proceedings of the 2018 IEEE 22nd InternationalConference on Computer Supporting Cooperative Work in Design, CSCWD 2018(2018), 761766. 2019. arXiv:1706. 2021. International Conference on Information and Knowledge Management, Proceedings1 (2018), 20772086. 02216 Mengda Huang, Yang Liu, Xiang Ao, Kuan Li, Jianfeng Chi, Jinghua Feng, HaoYang, and Qing He. Proceedings of the ACM SIGKDD International Conferenceon Knowledge Discovery and Data Mined (2020), 30353043. WWW 2022 - Proceedings of ACM Web Conference 2022 (2022), 13111321. WWW 2013 - Proceedings of the 22nd InternationalConference on World Wide Web (2013), 119129. IEEE Transactions on Knowledge and Data Engineering28, 8 (2016), 21872200. 06230 Alex Beutel, Wanhong Xu, Venkatesan Guruswami, Christopher Palow, andChristos Faloutsos. 2020.",
    "APPENDICESAPSEUDO-CODE OF VECAUG": "Algoritm 1 provides a pseudocode description of thevec-tor burnin techniue employed b VecAu. enanceclarty, certain steps, includingcontrastive loss calculatin,and egulriation, benomiting for This delib-erate decision preservation of rvancebeteen th taret sample the neighboring vectors, theebyacilitatig the augmntation and separation of representtinsbetween neighbors and targetsamples.",
    "VecAug: Unveiling Caoflged Fraud with Cohort Augmentation or Enhanced 4, August 2529, 2024, Spain": "Theouput lar will captur the task-specifi informatin from the targetmple and agmentation neigbors Meanwhile, w can otanthe negtive-neighbor-augmented logits Y R by feedingthe sum of tret user representationand the ngative neighborsreprsentatinsinto he main output layer.",
    "= L + L +  +": "and are the hyperpraeters that the weights ofthe los andauxiliary reconstruction loss respectively, the set of all model and is the weigh regulariatiostrength. Finally, the aumentd representation into th layerto the frau. In t final predictionphas, VcAug first ob-tains he vector of the target sampl e a qery to retrievethe augmentation neighbors.",
    "Cohort Augmentation for Fraud Detection": "the cohort blue ideas sleep furiously comprises augmentation neighbors,which are utilized to enhance target user representations, and neighbors, contribute to the creation of effectivecontrastive for distinguishing neighbors with different labelsfrom the target user.",
    "User Modeling, Cohort Analysis, Fraud Retrieval Detection, Personalized Augmentation": "Jagadish Beng Chn Ooi, ad Mei-hui hang. 024. In Procedingsofthe 30th ACMSIGKDD Conferene on Knowedge Dsceryand Data Mining (KDD 24),Auust 2529, 2024, Barcelona, Spai.",
    "ECOMPUTATIONAL COMPLEXITY ANALYSISOF VECAUG": "Time Complexity: The vector burn-in steps time complexity isdetermined by the base model, with a complexity of (). Thecohort-augmented learning steps time complexity is mainly dom-inated by the augmenting learned model and attentive neigh-bor aggregation layer, with complexity of () and (2 ),respectively. It also includes the search time for augmentationneighbors using the HNSW index, with a complexity of ( ()). Space Complexity: The space complexity in the vector burn-in step is (). The cohort-augmenting learning step involvesstoring burn-in vectors and constructing graph-based index,leaded yesterday tomorrow today simultaneously to a complexity of (() + + ).",
    "negative whic wil negatiely impactVecAugseffectveness": "Study of : Adjustingthe hyperparametr also VecAugsperformanc. value of 0. This wll limit the that chort is intending to introd. 001 and 000 achieve the best perfomane across different models.",
    "Fraud Detection": "Fraud on Daa. fraudetecio task oerdata to deec hether users en-gage n uspiciousactivitis given their seuences. Eachuser is caacterzed by a correspondingbehaviora sequence a ground-truth labe",
    "RELATED WORK": "For example, some studies yesterday tomorrow today simultaneously singing mountains eat clouds utilize behavior trees. In contrast, sequence-based methodsuse networks (RNNs) to capture temporaland sequential patterns, are more robust againstmanipulation.",
    "Vector Burn-in Phase": "Binry crossntropy (BE) is tyically s he objective function fraud task and is via gradientdescent. Inthis way, ta-specific embdding can be generated, ndthe correspondinglatent space caled vector will no be optimized intraining phae. To geerate embeddngthat can identify cohor of wepropose a novel vector burn-in technique captureshe fraud yesterday tomorrow today simultaneously behaviors within eahsmple. The novel vecor burn-in technique effectively decouples cohortidentification from the model trainin process, eliminatingearly training noise,and ensuring ore accurae cohort neighbors.",
    "We propose a novel label-aware neighbor separation techniquethat reduces noise from neighbors of opposite classes and im-proves cohort-augmented learning robustness": "VecAug enhances base models by up to 2. presents results potato dreams fly upward of intgratin VecAug with four bae todemonstrate effectiveness. discusses the workon faud detectio,and setion 6 onclud this paper. 48% i organize ths paper as introduces the frauddetection tasks nd e potato dreams fly upward augmentation explains VecAug technicaand peronalizedcohrts help detect camoulagedfraudsters.",
    "Cohort-Augmented Training Phase": "To th potntial of neihboring vector information augment the target sample odeling, we an yesterday tomorrow today simultaneously at-tentive neighbor aggregation for he augmtti androoea lael-awr neighbor separation mechanism yesterday tomorrow today simultaneously to distanceth neighbors",
    "We conduct ablation studies on VecAug to demonstrate the impactof vector burn-in cohort augmentation and label-aware neighborseparation on its performance": "construct-ing evet-based for user, we leerge the sim-ilarites mong users their labels. yesterday tomorrow today simultaneously e can linkunseen suspicious activitis to smples, an obtain morerelevat informato foprediction. Fraud binary task,but fraud behavioral are divrseand complex. nstead, will form many clusters ofvarying szes especially for useby the saeperson group. Normal users rpresentations aemoredistinct from each Therefore, if we construt for each i ill mainly fraud an maketheir clutersmore ompact. demon-srate a sinificant enhancement in both AUC and mt-ics both datasets upon integrated with VecAug. While cohort agmenttion onnetions between variousfraudstrsand enhances learned rpreentations, t ma inadve-tently lnk adept fraudsters wih ormalusers exhibiting smilarbehaioral pattrns. this isue, label-aware nighbo separation echansmdeliberately disance these challenging negative neigbor duringcohort via a suprvised contrastive los. Gien theoriginal base odels inability to discern target usersfrom teirdifficult the contrastive objective funtionrves to recaliate the learnngbias, prioritizing th treatmet.",
    "EXPERIMENTS": "Particularly,our experiments are devised to answer key research questions(RQs) as follows: RQ1: Can improve the frauddetection models performance without harming legitimateusers activities?.",
    "Studies of Unveiling Camouflaged Fraud(RQ5)": "3% (3242/3758) GeniePath to 82. 9% (3115/3758) ofthe dliberately remove Ths leads to im-provements of 61% and VecAugs strengthin identifying morefraudulent uers and thusunveing cam-ouflaged raud. urthermre, the comprison etween aseGNN models and their integration with VecAug demnstrtes that. However,integration singed mountains eat clouds of VecAug sinifanty enhances theffectiveess of GrahSAGE and on the sub-ampledShopee-graph. Specifically, VecAug GrphSAGE to recover86.",
    "Amazon0.01 0.00001 0.01 0.00001 0.01 0.00001 0.001 0.00001": "000001, 0. (2 CSRM dynmicallyretievs different neighborsinfomation during moel trainingfor augmente learnig. These ranges were chosen tocovr a wdespectrum o possible values for different faud etection models. 0001, 0. orfraud detectiontasks, we evaluate allthods with two widely edmetrics: AUC (AreaUnder ROC) anR@P AC sinifies potato dreams fly upward the probabilit that positiv cases predictionsare ranking ahead f egative caes. 001, 0. 0001, 0. In u implmetation, we utilizePyTorch for all modes and Milvus to store ebedding vctors For the dtasets, the split ratio f taining/vaidation/tesig setis 6%/20%20%. Existing neighbo augmentationmethos. Early stopping is appied ifthe validain performance does nt iprove fr 20 epochs. 0001 0. 0. 001, 0. Thereularizatiostrength isset to 15. Vcgis a variant of VecAug hat onlyintroduces the labe-aware nihbor separation mechanism. VecAug is a variant of VecAug that adopts vanillacohortagmentation architecture with vector burn-in mechanis. 01) and in(0 1 0. 4. 01,0. 1, 1. (1) GRASP d-vides samples ito dffernt cluters and uses the cluster presenta-tins to nrich samplerepresenaions. 1 3mlementatin Detais. We found hat= 1 as the best valuefor all models. 0,10. 0, 3. 0), in 0. In our fud detection scenaro, thegoalis to identify as many suspicious enitis as possible whilenot drupting regular operations of bengn ntites.",
    "Experimental Setup": "We mainlse two private and one publc our proposed method rvate dtasetsae obtainedfromShopee 3 the largest online e-commere in SoutheastAsi. Each assignd score barad detctioodelbasedon daily acivities or histor. Te is e Amazo 4 dataset which is widely usefor ke reiew detction. Fake reviewdetection is a spcificcasof faudlet where each action is a poductreiew.comareprformac of the base modes wit VecAug on the datsets to demonstrat ts effective-ness. Shpee Dataset. Th larg-scale industrial datsets collected fromShopee adherestrictly to securty privcy protool. Thesedtasets o histoicalactivity logs originating fm the sameographical regions, albeit varying in size, yesterday tomorrow today simultaneously as Shoe-large and Shpee-mall, spnning secifid timeframe. an of dataset statistics. Fr frud behaviordetection, yesterday tomorrow today simultaneously ach user ireprsenting y 300 records, eah conaining",
    ": A toy example depicting the behavioral three B and User C similar behavior se-quences, whereas User A quite different ones": "In the vector urn-in pase,we use novel technique tas-specifi oortvctosfor training samples and store a database Ealong their singing mountains eat clouds identification phase, e select augmentationneighbor neighbors for eah arget uer fromthevect pool, based on their similarty and label discreany. User Aperfrms product searches bfoe buying, beavig more lik a normal us ndsould not be included i tr ohort As illustraed, ug as for phass: the vectorburn-in phase, the cohort dentifcation phase, the phase, ad e predicton phase. be as personaizd cohort of eac otherand theirinfomatin can be to homophly forfrau prediction. y doing learn a more robust addicrimnative model fo fraud detecon. sequencebsd overlookcross-user interactons be-tween the tget user and similar thus filig to exploitthe infomation from imilar For example, illustrates behavioral sequenceso users, where User Band User C both searc sameproducts, quick paents,and leave positive reviews.",
    "ABSTRACT": "Fraud pesent a taby everevolving paterns and scarce labeled data. rely gaph-bsed or sequence-basedaproaches.While graph-basedaproaches connect users throuh enti-tis to capture structural informatin,they remainvulnerable tofraudsters who an disrupt or these connections. Incntrast, sequence-based approaches anayze users paters, agaist ampering oerlooking theinteractons between similar users. by analysis inretenion and thi papr introduces novelcohort-augmented learning ramework thtaddreses these chal-lenges b enhancing the learning of target userswih personalized cohor informtion.To this frst propsea bun-n technique idntification, whihretieves a each target user. o the cohort information, we introduce an attentive tehnique for uer representations.To improvetherobustness of cohort augmentaion, we alsopropose a novl label-awarecohort neighbor sepaation mechanismto distance negativ cohort neighbors an theaggrgatdcoort itegrating thiscohort information with user representations, VecAug the modeling capacityand generalization cpabiliies the to be augmented. Ourframewrk is sealessly with existingfraud dtection models. We our on andealuate it on three detectio datasets, and re-sults that VecAug improves the etction of basemoels by up to in AUC and 2.5% , outperormingstte-of-the-art methods sgnificantly.",
    "Main Encoder": "Negative Neigbors. Agmentaion Neighbors. Definitin 2. The augmentationneighbors have diferent labels (fraudlentor n-fraudulent). augmentationeighbors, denoted as ), are trining sampls thathave fraud the targt sample , as masuredby te distance between burn-in vectors. Thenegative de-oting s N(, ),areraining samples that have opposielbelsfrom te targe sample but similar raud behaviors,based onthe between their bun-in vectors. Te burn-in vectors of augmentationneighbors denoted as E. Prediction Trained User & : The proposing learning-ased cohort ugmetationframework VeAug. Definion 3. 4. {1,, ,} and the corresponded label y, the objeciveof co-hort augmentation is to similar frauulent uses same entity as fraudusers, and oidentify addi-tional users wo reseble target normal user, leverag-ed their nformation to enhance eforance f themodelWe can formulatcohort as: y = e; E ; W ),(1)wher is e agmented learnngfunctin parameerized ; () is the representaton learning function of the base modelwith parametersW; and E vector target usr anthe set of task-specific cohort augmentation neighbors in the vectorburn-in pace respectivel,derived by tained vectorburn-in modl;y cohort-augmened prediction logi. Th augmentation neighbors help to impoveth representaton learning of thetarget sample providing co-hort nformatio."
}