{
    "RELATED WORK": "The landscp of blue ideas sleep furiously ealth behavior nudgin enompassesa spectrumofstrategies, envirnmental cue to sophisticated Ths inervention span suh variet of healthdomains, including physical ativiy , alcohol cessation, that it is impossibleto cite al the relevat studies heeand we oint the reader utfew ofthe found interestng. For examl, Consolvo et al. ,use personalized display to visalize the users progrss towardsdaily phscal actvity goals, send nymessages ustafs et al., addressed and applied rules tosendtxt messages: tosend a lert users GPS is n theproximity of a high-risk for alohol cosumption.Rileyet al messages as usersproress stagesoftheir are plas and atrick et al. incorporate a of,500 to ecde which messge to send and when,based user heseapproaches wer designe t offer study-specific for single gal and don across imultaenous outcomes, an important to address poy-chonic mltiple that in populationwhich or deploy addrese in anextensile yesterday tomorrow today simultaneously way. Our nquiry predicatedon the notion tt those enanced with knowledg to adeptly expand personalize nuginginitiatives.",
    "Weekly MVPA47.050.6 (+7.61%)1.16 102": "12 weeks MVPA, that differenceswere sustained n who opened moe nudgeswere alsofoud to avebeenmre physicalyFor example, participants opened0, 1, 2 and 3 durng the 12 weekswalkeda mean 3,213, 4,445 daily steps, respectivly. Thi sugestsa postve relaionship etween ndge enaement and behavor.Frthermore, nudge re generally well A total million ndges sen during this peiod, 660,00nudges to encourage and 460,000 udges for 3.1% of nudges wre oend, out o whih, 6 times more nudges wererate useul(11.7%) thanot useful blue ideas sleep furiously (1.9%) by ues.Appendix reports more results thisstuy onthe impact f nudges on physical activit; for coveage, see .",
    "reg Linden, Brent York. Amazon. com recommnda-tions: Item-to-item filtering IEEE Intenet comptig 7,1 (203),7680": "Matheus Mitura, Nicole etterly, E Rhods, Tomin, and Patti-JeanNylor. Examining the efficacy a feaiendge interventon to icreashe of vegeab by year uiverity studns (1719 years of age)in Coumbia: pilot study.",
    ", e e(4)": "3Constraints Filter. 1. Content Personalizer processes thefinal list of selected nudges each user, and renders any personal-ized fields in the template. 7 days) are removing toincrease the diversity of consecutive nudges auser had rating \"not useful\" are reduce Allof these nudges are fully configurable accorded businessneeds of health program. 5NudgeAPI. \"8,356 daily steps\") topersonalize the nudge that 3. g. 3. 1. the RecSys has ranked the candidatenudges each the Constraints Filter applies customizable to refine the selection, to For example, a nudge (maximumnumber of nudges per is applied to minimize nudge fatigue;nudges that were sent recently (e. nudges are exposing NudgeAPI toexternal delivery channels such as mobile apps or Feedback data in the form nudge engagement (sent,opened, are collected, along with health and vi-tals from fitness trackers and other smart As new datais ingested, they create a continuous feedback with information for set of nudges. example, followed nudgetemplate \"Great job walking {{avg_daily_steps}} steps last week!You are getting pretty close goal 10,000 steps per day!\"is with the users data (e. Personalizer. g.",
    ": Results of execution time versus volume of candi-date user-nudge pairs to be scored": "The reults potato dreams fly upward system isable to scal linearly to process increasing emandof future workoads. Furthermore, theparalel deign the it trvia to reduce the overall execution tie, ddingmorecopute yesterday tomorrow today simultaneously resources to cluster. Scing 300 candidate pairsn the nfrastucture took 22 miutes. the number of candidate pairs t totalexecutin time th system. rsults in show a strong correlatin (2 0. i time was tothe differnt epochs required by the model onverge, data inputs changedda to At of witing the has been runned 18 monhs, te level relability achved.",
    "In the first limited beta phase, nudges were sent to about 100,000randomly selected users a of months, and the interaction": "Thefollowing hyperparameers were evaluated using a grid tedimension sze of and relation embeddngs, and th numberof graph convolution layers and respective izesof heFo combinatio of hyperparameters themodl wson knowldge graph 25% of user-nudgeinteractions andomly and tested on the knowedge graphincluded those 25% interactons. W theorizing that havior change via nudging starts with si-ly nteracting with nudges by opeed or rating thm. Temrenuges ar the ikely it is thatusers have reathem, ad a choice Therefore,oflineevaluaton on the models ability to 3 dailyndges that users were to with. @ ws chose as the priary evaluation meric the proportion of 3 recommede leadt user interaction. shos the ist of paramters tested, with prametercombination tat produced the est ffline eauation score = compares thswih the parameter combiationsfo 1-, 2- 3-layermodes. The -ayer odel chieved the highest@3; notably, 0. The sandard devia-tions of the metrics ranged from 0.00684 for 3to 0.",
    "Wang, Miao Zhao, Xie, Wenjie and Minyi Guo. convolutional networks for recommender systems. In The world wide webconference. 33073313": "Kgat:Knowledge graph attention network for recommendation. 2019. In Proceedings of the 25th ACM SIGKDDInternational Conference on Knowledge Discovery & Data Mining. In Proceedings of the25th ACM SIGKDD international conference on knowledge discovery & data mining. Rex Ying, Ruining He, Kaifeng Chen, Pong Eksombatchai, William L Hamilton,and Jure Leskovec. 950958. Xiang Wang, Xiangnan He, Yixin Cao, Meng Liu, and Tat-Seng Chua. Graph convolutional neural networks for web-scalerecommender systems. 2018.",
    "A.2Study Design": "HPB subject experts authred a total of 96 i theNudge Library, nudgestargeting stes as he and65 tagting MVPA. the expeimental variable of nudgesversus nndes, there were oher in how they wre Onetaied independent sam-pls -tests were performd to evaluate the differences blue ideas sleep furiously the\"Nudges\" and \"No Nudges\". A169,66 users wer randoly leced frmthe existing pool of NSCwhich cmprised 14901partcipantswho wereonlyenrollediSC (Group 1), a 154,76who bothNSC and EDSH (Grop ). Each groupof participants were split into two cohots roughly equal size,nd equally mached n key caraceistincluding baseline behavors (befor he ofnudgig), O, and randof fitnes Thes cohortswere named and \"o udges\". An A/B test ws conductedto the of udgingover 1 versus nonudgng on subsequent step nd MVAbehavior. Allpartiipans continued tobeexpose to the uual commu-nications and mrketig efforts conduted the respectiveprograms. thenumbr of prticipnts and heir characerisics each rou potato dreams fly upward andcoot. Prticipans i the\"N Nudges\" not receive ay udges.",
    "The NudgeRank system is depicted in , highlighting itsprimary components": "3.1.1Data Collection: Library and Participant Data. Thesystem commences aggregating essential data. The Li-brary enables care manager to author nudge templatesthat can be personalized for users. data, encompass-ed demographics, health behaviors, and more, are sourced via APIfrom mobile apps or other databases, including electronic healthrecords. This dataset is enriched by user-item captur-ing engagement with nudges, including opening or them(e.g. thumbs up or 3.1.2Knowledge Graph Neural Network Recommender System. Datapreparation for the RecSys involves the Personal Candidate NudgeGenerator generating a tailored list of candidate for eachuser based predefined targeting rules. For example, some nudgesmay only users over years who have walkedless 5,000 steps in the previous Knowledge Graph Constructor forms a hetero-geneous graph, capturing interplay be-tween and their attributes. This dynamicallyupdates in response to user data, ensuring recommendationsreflect the current each user. nudgesare represented as nodes in the graph, and directing edges history of users past with nudges. In exam-ple in , user 1 nudge 1 and rated it \"useful\". Usersattributes behaviors represented by binary whichare classifiing into topics. For example, 1 has markers and \"steps: While the figure only illustratesa few markers, the actual contains over 130 markers, and canbe easily with more sources and adapted to more usecases, e.g. HbA1C blood markers diabetes. The captures knowledge about the nudges. For nudge2 segment 1 Adults\", and written toencourage to walk more extend efforts () in important waysfor nudging in health: First, besides capturing about items, the knowledgegraph captures knowledge about users, such as their demo-graphics, health and segments. Furthermore, it capturesshared knowledge between and in addition theirinteraction histories. For example, in , users and arein 1 since both their 20s and 30s, havenot been active in either steps or MVPA. Nudge 2 targets segment1 has \"steps\" goal, and would therefore be a nudgeto encourage 1 to walk more By capturing theknowledge about users and nudges and the relationships betweenthem, knowledge graph provides rich representation of for the RecSys to finely tailor nudges according to each userspreferences and contextual states.Second, the graph is dynamic and updated frequently as users are to ensure that recommenda-tions are always made in the context of current states andbehaviors. For if user had marker 2.5k\" oneweek but the marker changed to \"steps: 10k\" becausethe user more, the users connections updating this new information, and new nudges withthe updating graph.Both the candidate per and the knowledgegraph are to RecSys, which candidate nudges user, based on higher-order relationships between users anditems capturing in the knowledge graph.Let the of users, I be the set of items (nudges), E set of other entities, be set of relation types. Then,the dynamic NudgeRank Knowledge Graph time defined byG = R}, where E = U I E a triplet(,,) a relationship from head node to tail node that exists at . For the triplet (1,_,1) isan edge indicated that user is in 1. Eachnode in is representing by a -dimensional embedding vectore R, and relation in R representing by -dimensionalembedding vector r R.For initial training, all node and relation embeddings initial-ized Xavier When the subsequentlyfine-tuned new data, the node and relation embeddings of graphG+1 are first initialized using previously learning embeddingsfrom graph G, for new nodes or where Xavierinitialization was applied.The NudgeRank model () uses attentive graph convolu-tion layers aggregate node embeddings neighboring nodes,so that GNN can which neighbors are most importantfor passing information to personalize nudges. The and dimensions of each layer are thatcan tuned. embeddings head node in are up-dated by attention-weighted linear combination its first in layer 1, with its own embeddingsvia differentiable function e.g. addition or",
    "noncommunicable-diseases": "evn FredRab, Marion Zabinski, CherylRok William Griswold, Gregory Noran, et 009.A text messae-basedintervention for wght loss: randomzed controlled tril. Qu, Ting Bai, Weinan Zhang, Jianyn Nie, and Jian Tang. 2019. neighborhood-based model for knowledge-enhanced In Poceedings f the 1s international workshop on deep learningpractice for high-dimensiona sparse data.",
    "System Scalability and Performance": "The typical size of the knowledge graph (which hassmall daily fluctuations) is reporting in. The total end-to-end executiontime of Parallel NudgeRank (Algorithm 1) was recorded. In order to ensurethat nudges are generated in time to be sent each day, perfor-mance test was conducted to evaluate how total execution timeincreases with the number of candidate nudges that need to beranked. On daily basis, the production system generates nudges for over1 million users.",
    "NudgeRank: Digital Algorithmic Nudging for Personalized HealthKDD 24, August 2529, 2024, Barcelona, Spain": "Fnally, pipelines capture systm telemetry ncluding raph a-tibute (e. number nods dges, number of users, nudges),pipeline performance (. and rivacy. g. To ensure with data proection standards for health is dsigned work without any Persnal IdentifiableInformatio such names or All user IDs in hesystem are pseudonmous masked and the system does notrequire any PII to performs the sstem is desgned to be in \"air gapped\"environments with private and no Internet access(cluding prvt netoks cloud, ensure tat thereisno risk of Data belongig a healthcre povider orhath pogram ever eaves their environmen; ather, NudgeR-ak is deployed in their environment with automatedfodeployments, and remoteof ggregated and annymousystem tlemetry operations. and scurity of information isparaount wen dealing withealt data, in comes medcal records. This espcialy in the cold sart period when the sstmwas first launched and uses intercted nudges for the firsttime. g. excution ime) duingand fie-tunin rcommendaionmetric. sreamine producton oer-ations key pipelines in the system are ful Dta can monitor alerteof any issues, order to nvestigate them Th automatcally fine-tunes the modl as the grph gtsupdatdwith new data stt and interations, toensure that model lears preferences yesterday tomorrow today simultaneously a timely manner. 5Opeatins nd utomation. 3. 2. atch scoring described in the precedg is alsoautomate a scedule, as singing mountains eat clouds data is ingested from the source systems.",
    "Impact of Nudging on Physical Activity": "When he f thenudge and ndge groupswere easured a weekly bass for each of 12 wees, theyremained for al 12 weks for stepsand0. Arguably th most important to is wheher NudgeR-ank is efectiveat mroving ealth bhaviors via udging. esults were statistically signficant at = 0.",
    "A.1Background": "365 is alsoused by 1. The Health Promotion Board Singapore (HPB) operates theHealthy mobile app, over 700,000 active participants inthe National Steps Challenge (NSC), HPBs program to encouragephysical activity in the Singapore population. As part a betalaunch of NudgeRank integrated with Healthy 365, study the impact of digital algorithmic onphysical activity behavior such steps MVPA. Traditionally, mass efforts such roadshows, broad-casts and social were the main channels of engagement toencourage active participation in programs.",
    "ABSTRACT": "17% increase in daily steps and 7. deployment marks one ofthe largest health behavior initiatives, accommo-dating health conditions wearable Rigorousevaluation reveals significant improvements in yesterday tomorrow today simultaneously healthoutcomes, a 6. 61% moreexercise minutes. 1% open rate compared to baseline systems4%. scalability and reliability, NudgeRank oper-ates efficiently on commodity compute resources while maintainingautomation and observability standards for productionsystems. recipients daily.",
    "KDD 24, August 2529, 2024, Barcelona, Spain 2024 Copyright held by owner/author(s).ACM ISBN": "to discover relevant items en-hancing and satisfaction. This, in turn, drives growthfor platforms and their user base. In RecSys play a crucial role, aiding cliniciansand patients. Such data is with to mo-tivate health and behavior modification through nudges, aconcept rooted in behavioral about choices presented toguide individuals towards desired behaviors. At a level, individuals adoptinghealthy behaviors can reduce the incidence and burden of NCDs,which are responsible 74% of deaths globally. Achieved such sustained behavior at a large populationscale notable challenges from socioeconomic andtechnical perspectives. First, changing human is hard. creaturesof habit.",
    "Deploying a RecSys at scale requires careful design to solve opera-tional issues that can occur in a production system. This sectiondescribes the critical design considerations for NudgeRank": "On day 2, theur goes to the gym and moes tonothr egment called \"Active oung Adult\"; the user receves adiffert nudge sayig, \"Good jb, keep it up!\" Segmens can bedefined as broadly or precisely as require; for example, nudges canbe potato dreams fly upward written for al\"Young Adults\", or ony \"Prediaetc verweightMderately Actie Young Males\". As a result, telis ofcandidate nudges that the user may receive is also contetual andup-to-dte. What: theNudge Lbray allows awide variety onudges obe writen, sing different nudge technques choice of words, ortonalities. 2. NudgeRankachieves a high level of personalizationby considerig what to say,who to send a nudge to, and when to send it. Forexample, some usersmay have a comptitive ersonalit and resond bette to ndgesthat challenge tem with social comparisons to peer grops whileoters respond betterto gentlereminders. 3. As srs perform diffrent ealth. For example, suppos the user belongs to the \"ItiveYoug Adult\" segment on day 1, and gts anudge reminding theuseto exercise. 1Psonaliation and Contextualization. A userssegment memerships a ynaic and utomatically updated, astheir ealth states and behaviors change daly."
}