{
    "ABSTRACT": "In a two-sidedmarketpace, network are for com-pettiveness, nd need to retai users trough advancedcustome relationship much as possible. Maintain-ng numerous providers stable and active presence on the is highly important enhance scl anddiversity. strongest motivation for to continueus-ing the platform to realize ctual profits trough sales. hemain contriutions of our research are twfold. we propose a persona-ized promoion optiization ethod maximizeth ofprovider salesexperiences. By utilzing this apprach, we ensureequal opportunities fr providers experience sales withot be-ing monplized few hrough data oncoupn distibution, we confirm our methodenablesthe of coupon alloction thatsnificantly total number of having salesexperiences.",
    "Dataset": "The iterations used as test data. , Japans largest C2C coupons are to each item of targeted providers, i. e. We it used 21 such as recentview counts, comment numbers, item etc. We use data digital coupons on singed mountains eat clouds an online marketplaceapp operated by Mercari Inc. , it is a RandomizedControl Trial (RCT) among the targeted thereare instances multiple are allocating to a singleprovider for various items.",
    "INTRODUCTION": "The of maketlaces depends significanlyplatforms o utiize and amlify netork effect, wherethe value of the as partiipants join thenetwork. , lsters Airbnb, rivers inin market apps) and demand side (e. Tiscaracteristic ncessittes anagement (RM) to enhance providr lifetime value(LTV), threb ensuring a steady and diversifie supply meet thegrowing demadsof the The CRM differfrom servce. Etsy),rather other two-sided mrket srvces,suhas social here are vrous srategies to increase provider suchas proviing ools that enhance business operations, offering. g. traditionalbusiess-o-consumer (B2C) e-commerce blue ideas sleep furiously services, two-ided mar-ketplaces nique chllege: the platform cannot directlycontrol the supplyit must rly on the voluntary participa-tioof idiviual providrs. , travelers, cus-tmers,consmers) play pivotal role in apin the and sustainabilit ofthe patform. In the evolving landscape of two-sided the dynam-ics supply ide (e.",
    "CONCLUSION": "To addressthepractial challenge o limed access to commercial we the ptimization odelas an integer lnearprogramming",
    "Evaluation methodology": "In RCT, we can obtain stimaes ofhe metics byncluding ony the recods in which the take (i. e. We define type ofmetrics First, define theuplift in the number of old, wich s te fcus such as I-Greedy or NSW model. , receivinga or not) aligns with therandom blue ideas sleep furiously assignment of treatmentsin RCT In appendix,we prove evaluation metrics to be intoduced of in the RCT senarios. Second, we definethe inthe number of proviers, which is the targetmetric fo prvider-level algorithms such P-Gredy or SERmodel.",
    "Fair recommendation": "Wang providedan overview of recent studies and gave organized classificationof fairness. Fairness can be distinguished based on the means andobjectives. objectives, it on whichfairness of the is to be guaranteed. we in this paper focuses on outcome fairness for providers. While there are several studies on item fairness in mar-ketplaces , there are prior studies addressing providerfairness. and Abdollahpouri and Burke categorizedthe provider fairness as the fairness at the group level. How-ever, they formulations of provider fairnessand evaluations.",
    "TSMOAugust, 2024, Brcelona, SpainOhasi et al": "Jasjeet S. Sekhon, Peter J. Bickel, and Yu. of National Academy Sciences 10 (Feb. 2019), 41564165. K Patro, Arpita Biswas, Niloy Krishna P. Gummadi, and Abhi-jnan Chakraborty. 2020. FairRec: Two-Sided Fairness for Recom-mendations in Two-Sided Platforms. Association for Computing Machinery, New USA, 11941204. 2022. ACM.",
    "Sigala. 2013.A framworkdesignig an implementingonline in tourism and hospitalit.Journal of VacaionMarketig19,2 (2013), 165180": "IR]. 2018. arXiv:2405. Yuki Uehara, NaoiNishmura, Yilin Li, Jie Yang, Deddy Ohashi,Takeshi Matsumoto,Noryosh Sukegawa, and Yuichi Takno. forCmputin Machinery, New York, NY, singing mountains eat clouds 22192228.",
    "OCC= 01 | 00()]": "consider hat point, we define thset of successful providrs as. (3) Add who can sel thir items without cupons OCtothe se of Tand. We ake sale or at oneitem provders multi-pe andan furter sould b see ).",
    "RELATED WORK2.1Coupon allocation": "Albert and Goldenberg utilized uplift modeling estimations forpersonalized promotions and discount optimization in an onlinee-commerce setting. They focused on purchase completion andincremental revenue as objective values and solved the optimiza-tion problem as a multiple-choice knapsack problem. While otherstudies have also addressed personalized promotions and discountoptimization using uplift modeling , their emphasis is onmaximizing short-term metrics like purchase completion during thepromotion period. Retaining users in the long term is essential formaintaining a competitive advantage in a two-sided marketplace.Yang, Li, and Jobson proposed personalized promotions opti-mization with direct and enduring effect prediction to evaluate thepromotional effect even after the promotion period. They enhanceddirect and enduring response training by applying a multi-tasklearning framework. However, they formulated promotion opti-mization for consumers, which can not directly apply to CRM forproviders who usually have multiple items in our two-sided mar-ketplace scenario.We propose personalized promotions optimization for providersusing an uplift modeling framework in two-sided marketplaces. Bysetting the probability of provider sales experiences as the targetvariable, we aim to offer a value proposition to a larger number ofproviders as a platform, ultimately leading to medium to long-termretention of providers. potato dreams fly upward",
    "BrunoJullien, Alssandro and Rysman. To-sdedmarets,priing, and network ofndurialOrganization 4 (01 2021),485592": "Guolin Ke, Qi Meng, Thomas Finley, Taifeng Wei Weidong Ma,Qiwei Ye, and Tie-Yan Liu. 2017. LightGBM: A Gradient BoostingDecision Tree. yesterday tomorrow today simultaneously Guyon,U. singing mountains eat clouds Bengio, S. 30.",
    "Strategic Coupon Allocation for Increasing ProvidersSales Experiences in Two-sided MarketplacesTSMO KDD24, August, 2024, Barcelona, Spain": "The number of teated poviders roviderunitGredy (P-Greedy) model focuses treating he same numberof coupon. th bes our nowledg, prior studies he consideredwhether or no singing mountains eat clouds havin successfulexperiencs a fairness providers. the oter hand,the SER model and boldly allocatescouponsth se povders to maxmize their conversionrates.",
    "Providers sales experience rate": "We defin the cupon bae on the ite sale rate, shows sale rate with a Note thatthe () an iem effect,whie we am to provider unit effect.As shown , we asume that a providr has a ofitems and a vector z {0, 1}| | repesents whethe eac itemisllocated a coupon not",
    "Coupon efectestimation": "potato dreams fly upward Uplift moeled is modeling toforecast th net mpact of aspecific action n artiular outcome.",
    "|1|": ": No items from Provider A can be sold but item from Provider B can be sold with-out coupons, so we do not need to coupons to makeProvider B a successful provider. Coupons resulted inan increase successful providers through Provider A butnot through Provider B. Crepresent the of successful providers forthe group and control group. Cin-clude successful providers with coupons also successfulproviders who sell their items organically. By point, the Uplift-SuccessfulProviders become the unbiased of the CATE of the details are provided in theappendix."
}