{
    "Zhang, Kun Cao,Yukuo Cen, Yu, Da Yin, Jie Tang. 2024. PST-Bnch: Tracing and Benchmarkig the Sourc Pblications.arXiv prepinarXiv:202.1009": "2024. singing mountains eat clouds OAG-Bench: Human-CuratedBenchmark potato dreams fly upward for Academic Mining.",
    "NCF-based PST Model with SciBERT": "Two separate SciBERT modules encodethe query paper and reference inputs independently, after whichthe [CLS] token representations from outputs are merged andfed into Multi-Layer Perceptrons (MLPs) to calculate the predictionvalues. The model architecture is depicted as. Denotingthe inputs of query paper and reference as and respectively,the complete process of model is as follows:. The SciBERT module com-prises 12 BERT layers, each implementing attention and feed-forwardnetwork (FFN) mechanisms.",
    "the set of relations that describe the interactions between differenttypes of nodes. Each paper node is associated with various textattributes, such as the paper title, abstract and body": "A conventional approach the task involves modeled it as a matching problem,where between the query paper and potential referencesis Giventhe conceptual overlap between the PST task and recommendationsystems, we frame PST task as a recommendation problem. In this frame-work, \"citation\" represent interactions between \"users\"and \"items\", with \"critical citations\" interpreting positive reformulated the as task, wecan leverage the family of algorithms in recommender systems. Specifically, we focus on predicting the probability a \"criticalcitation\" for each pair (,), , To this end,we employ collaborative filtered algorithms, which, despite theirsimplicity, proven to be effective.",
    "Dataset": "The i iidd rained an valdatin subsetswith a rtio of 8:2. The tex forhe query paper includes the title, abstract,keywords, and irst 500 charactrs f the body. We conduct eperiments on dataset provied th orga-nizer. From tota of 78 we ontct 8905samples. the refer-ences, the iputs compise the til, keywords, and in each referec appearsthe full text Nega-tiveemployed with apitive-to-negatve ratioof110.",
    "Language Model Methods for PST": "Recent advanceents in languag models have significantly en-hanced text processing capabilities. Fin-tuning hse mdels withannotated data hs demonstrated promising reslt for PS task. Preious research a explore th integation of text ebeddingtecniquessuch as Word2Vec and loVe. By framing thePS as a binary classiication prblem for ciation signifiance,the applicatin of modes singing mountains eat clouds such aSciBER, L, and Galactca inconjuncton with aMlti-Layer Percetrons (MLPs) lssifier hasyieled pomising results. Builing on these advancements,the PST-Bench dataset a been intrduced, utilizing pre-trainedmoels like BERT and SciBERT which frther demonstrate theeffectiveness of thes models in identifyng signiicant reference. Nevertheless,the full potentia of these odelsremain largely untapped.",
    ": Paper Source Tracing the Citation KnowledgeGraph": "vector machine, blue ideas sleep furiously potato dreams fly upward random forest, tree, kernel logistic regres-sion, among others",
    "Introduction": "Papesource tracing (P is vital f effective knowledge manage-ment. By linking commo atrbutes between aers a relatinaledges, a comprehenive citation knowledge gaph is cstucted. Utilizing a citation knowedggraph facilitates theidentification ofcritical refereces, elucidatesthe evolution of disciplines and techiques, ad foster academcconections and collaborations. To ti end, we propose a modelbasd n Neural Claborative iltering (NCF) for the PST task. The model processesthe textul aribue of pprs obtained fromDBLP-itaion-networ (bbreviated asDBL), with the as-sistne of SciBET , a pr-trainedlnguae odel. The soure code of our appoach is publcly vailable at ur contrbutionsras follows:.",
    "Machine Learning Based Methods for PST": "These features are then utilized andinference with various machine methods, such support.",
    "Team AoboSamaLeader of Team author": "ermission o makedigital r hard copie ofall or par of this rk for ersonal orclassrom se is granted without fee provided that coies are not made ordsribuedfor profit or cmmerial avantage andth copiesbear thisntice and th full citationon the first page. stactngwth credit is permtted. To coy oherise, orrepublih, to post oserversor to redstibute to lists, requires rior speific perissionand/or a fe. Copyrights fr componets of ths work owned by othrs than theauthor(s) mus be honore.",
    "Scientometrics 118 (2019), 2143": "2023. Neural translation for n-tex Jural o theAssociation for and 74, 10 (2023), 1229124. 2008 In Proceedings ofthe 14th ACM SIGKDD inrnational nference on Knowledge discovery and dataminng.",
    "Experimental Results": "model is trained n a NVIDI A100-PCI-0GB The totalnumber of 2.3 For hyper-parameters, the batch sie is set to 16, and themaxium length ppernd refrence is 51 tokens. Thememoryusage oes not xceed 6 GB.e emloy DAM optimizerwith an initial learning of 1105.We evalae the of our modelusing the testdata provded by the organzr. As baseln comparisons, the roNE, and SciBERT reultsofarious methods theMean Average Precision (MAP)Our proposedmod (CF-SciBERT) aciees 0.37814 represent-inga significan mprovemen over the with  28.23%enhancement relative t best-performing baselne.To emonstrate the significance textual attribts i the task,we design aabltin eperiment by introducing NCF-id excldes attrbutes and only the paper The ablation results text attriut improvethe performance, as show in . Furtherore, the improe-ment of the model over the SciBERT odel aloesuggest that the architecture hasa positive impact the",
    "Abstract": "3781 o theMean Average Precsion(MAP) metric,outperformingbaselinemodels and ranking1thamong all participed teams. To process textual attributes of papers andextact input features for the model, we utilie SciBERT, pretraiedlnguage model. The sorce code is publicly availblat. The aper Sour Traing (ST) ta seeks toautomat the idntification of ivotl references for potato dreams fly upward given scholarlyarticles utilzingadvancing data mining techniques. In theKDD CUPOAG-Callenge PST trck, blue ideas sleep furiously we dsign a recommendaion-bsdframework tailored for the PST task. According to th xperimental results, urethod achieved ascore o 0. Identifyed significant references ithi the complex iterrelationsof a citation knowledge graph ischallenging, which encompassescnnetions through citations, authorship keyword, and otherrelational attributes. This framewokemploysthe NeuralCollborative Filtering (NCF) model to generate finalpredictons."
}