{
    "Anirban 208. Asymptotic Theory of Staitics and Probability. o. 180.Sriner": "Alex Deng, Ya Xu, Ron Kohavi, and Toby Walker. Variance ReductionUsing singed mountains eat clouds In-Experiment Data: Efficient and Targeted Online Measurement for Sparseand Delayed Outcomes. In ACM International Conference on Web Searchand Data Mining (WSDM). 823831. 39373946. 2023.",
    "Ratio Metrics": "s is showny , the emirical coerage of ll the estimatos are loseto the nominal cverage, in wh STATE acievs the bestper-ormance o variance duction. Heer, the effectiveness of RM isaso lmited by the correlation between te ML-based predictorsand the outcome etrics, whichis easily potato dreams fly upward influenced by big outlers. (b) and present the detailed experiental reslts ofvarince reduction or ratio metrics in simulaiondata. As a obust estimator, STATE can significntly decrease the neg-ative effects for varianc caused by outirs,whichcontributes toover 90. Specifically,CUPD only educes6. 7% varance reduc-tion compare with DIM.",
    "ontrolled perints, Vaiance Reduction, Heavy-Tailed, RobustEstimation, Causal": "In Prceeings ofth 30thACM SIGKDD on Knowledge Disovery ata Mining(KDD yesterday tomorrow today simultaneously August 2529,2024,Barcelona, Spain ACM, NY, USA,10 pages. ACM Format:Hao blue ideas sleep furiously Zhou, Kun Sun, SaomingL, Yangfeng Fan, Jiang,Jiaqi Zheng,and Tao202.",
    "Related Work": "For instance, the CUPED estimator, which is widely yesterday tomorrow today simultaneously applied in industry, utilizes relevant from thepre-experiment period to reduce variability yesterday tomorrow today simultaneously the outcome met-ric, and shows that higher covariate andoutcome, the performance of variance Typically, they utilize many covariates in a ma-chine learning(ML) predicting to develop a proxyvariable If outliers are notproperly dealt they may to bias high inparameter estimation. literatures discuss univariate linear adjustmentmethod. Furthermore, the majority of variance methods focuson For adopt the main idea of its assumptions, introduce method forratio metrics decrease the negative influence of outliers.",
    "Experimental Setup": "The generated process is almost same Denote sample by The covariates dis-tributed as N (, 55), is from a uniformdistribution 10). Let () and () be nonlinearfunctions with the forms() sin(12) + 6 23 + 10|4| + 5|5| + 50,. data.",
    "STATE. The robust regression-adjusted estimator for ratiometrics after consistent transformation": "etrics. We compare variousreuction tec-niques on tw primary evaluation metrics: bia and vriance.Consistent previous studies, assess bias by empiril rate of the 95% confidenceinervals (CI).The closer te overagerate to thenomnal coer-age rate(95%), the smaller the bias of the estimatr",
    "Experimental Evaluation": "Firtly, we validtethe perforaceo various methods in reducingthe variance ofcont metrics and ratio mtrics in siulation data. inally, we discuss limiaions of he TATE estimtor. For cmpleteness, wealso investgate thempact ofthe poportionof outliers ithe data set on STATE.",
    "Limitations": "Now lets discuss the applicability of the STATEmethod. Whn metrc folowsa Gaussiandistribuion, the STATmethod is comparabl yesterday tomorrow today simultaneously with estate-of-the-art mehods,bu introduces extr computationalcost",
    "KDD 24, August 2529, 2024, Barcelona, Spain.Hao Zhou et al": "To address this problem, introduce the Students-dtributionto vaiance reduction. the degree of freedo decreases,the -distribution hasheavier tails, non-zeo probability thtouside the bulk the endows with an propertycalling robustness As show in , GMV can bebetter characterizd the rgression residuals are modeled generalizing -distributin. In he typial ettigs of experients, online trafficis randomly partitioned two groups: a treatment group and acontrol group. They keep almost onfiguration xcept treatmet goup an aditonal intervention(e. In te ausia distrbu-tion, probability observations falled beyond ix standrd dviations be extremely small (less than 0. play role n enabling data-driven across a widrange of companies including Facebook Airbnb ,Gogle and exerimensare for busineses, as een small eected keymetrics have implications for the evenue. Although DIM nbiasing estimates, it still suffers fromhigh variance, leading to sesitivity lw staisti-cal tousand of rn eachyear, ny benefitsf incresing sensitivity will b ampifid due toecnomies scalIn mathematics,varance reduction techiquesare to hiher precision the metic o interest and have ben in-troucedto online controlled recenty. The X-axis epresents residuals betweenthe real value the predicted alue, where largevalue are clipping to the upper bound. blue ideas sleep furiously For a trategy that increases one users revene by $0. to develop a proxy that is hihy with outcomemetric, everalmachine (L) based have beenexplore. Thanks o te cenral difference-in-means estimator produces un-biased estimaionof hichis calclated by the differencebetween and ontrol group outcomes. Gaussian distribution itStudents tfitReal distribution 0. We integrate the machine learning adjusentmethod the Stdets -distributon t estimate ATE forcountderive a ariational EM to We introduce linear transfor-matio for etrics reserve estimationand consiset ariance, under which regression-adjustemethods and Sudents -distribution a be intoducto reducevarianeand improve sensitivity. g , a nwproduction or email).",
    "[ (1)] [ (0)]": "[ (0)] ATE of ratio metrics. ince is contt,Propet guarantees that the le is to that of value singing mountains eat clouds of isunkow in ractice, we can helevel of tested for . Base on Proerty 2, peformingegression ajustment for will in consstet estimator of with vriance than . Furthermore, estimationcan e introduced and eliminate th influene atypical andoutlying obserations.Constrcton of",
    "Abstract": "Variance re-duction is an effective technique to improve the sensitivity of ex-periments, achieving higher statistical power while using fewersamples and shorter experimental periods. By adopting a variational EM method to optimize the loglikehoodfunction, we can infer a robust solution that greatly eliminates the. , regression-adjusted estimators) arebuilt upon the intuitional assumption of Gaussian distributions andcannot properly characterize the real business metrics with heavy-tailed distributions. Online controlled experiments play a crucial role in enabling data-driven decisions across a wide range of companies. Furthermore, outliers diminish the correlationbetween pre-experiment covariates and outcome metrics, greatlylimiting the effectiveness of variance reduction.",
    "Peter M Aronow and Joel A Middleton. 2013. A Class of Unbiased Estimatorsof the Average Treatment Effect in Randomized Experiments. Journal of CausalInference 1, 1 (2013), 135154": "201.Uncertaint in Exprient wthependenData: yesterday tomorrow today simultaneously ootstrap Methos. 1303311. Roman Budylin, Druts, Ilya Katsev, Valriya Tsoy. 2018 CnsistentTransformation of Raio for Efficent Online Controlled Eperiments.",
    "Factors Affecting STATE Effectiveness": "From the (b), we can that when dataset does outliers, more precisely, metrics follow a Gaussian distri-bution, STATE, CUPAC, and MLRATE perform similarly variancereduction. The reasonis that degree of variance reduction typical methods asCUPED, CUPAC and MLRATE depends on correlation constructed covariates proxy and business metrics. 2 0. 0. 6 0. 0 0. 4 0.",
    "AvgOrdPrice95.06.495.621.894.991.695.7": "It ndicatethat he STATE performs substantially better than the CUPED,CUPA and MLRATE estimators on both orders metric and GMVmetric. A lower threshold rsutsin more observations beyond thresholdbeed restrained,whch consequentl yilds areuced ariance inparameter estiation. These sample pintsthat fall on the tail (alsoknown a otlirs) are not afected by treatmen, but has geatimpct on te nsiiviy of measuring TE. Furtherore, we compare STAT method with the ypical win-sorizaion metod Huber regression forealing withheavy-tailed metrics. This ibecause Huber rgression trasforms themean square loss functionof extrem observatons ino linear form, theeb partialy reduc-ing impact of outliers. T get a bette snse of th manitudes of variancereuctionthat he STATE mehod miht acievein prctice, weseect twoey cou metrics:orders per user and GMV p user, bth of whichhave heavy-tail distrbutions. and 5 isplay results of wisoriza-tion at diferent treshold(99 and 99. For each metric, we construct A/Atests.",
    "Consistent Transformation of Ratio Metrics": "The ratio metrcs are also common in the indstry, which can beregarded a the ratio of two count metrics. For example, he clic-throug rate is a ratio metr, which is a ratio of te clicknumerand the pgeview number. Addressing the variace reduction ofratio metrics is more complex but much lessinestigated in eistingworks. In this section, we willintoduce consstent tranfomtionso that STATE cn beutilized toeduce variance of rato metrics. Following the notations in Sec. 1, let ,,, be the corre-spoding count metrics, i.,.",
    "[]2,": "The cofficient (1)+ snota constant significance level of s equivaletto hat of. where / an second equality due t. Since nit in etris not atch heran-domzation unit,he comon rgessin-adjusted mehod and estimatio cnnotdirectly peform variance redctin for yesterday tomorrow today simultaneously ratiomeric. Seifically we construct a linear metic nd let =. irstly, i showed that (1 + ). I section, follow the main idea n (tansformingratio erics to linear metrics), but mtigate he aove defectssimultaneously.",
    "Empirical Results": "In this section, we perform two real experiments on the singed mountains eat clouds Meituanfood delivery yesterday tomorrow today simultaneously platform, analyzing the count metrics and met-rics, respectively. Here, we focus A/A tests, not the A/Btests running production. This because true effect of theA/B tests is unknown, which makes it impossible evaluate the rate of confidence interval. the aver-age treatment effect (ATE) online experiments is typically smalland to significantly change the relationship between theoutcomes and the in variance testsshould be very similar to that in -0.10 0.000.050.100.15 ATE 2.5 5.0 7.5 10.0 12.5 15.0 17.5 20.0",
    "Ratio metrics": "As i shownby , mprical cverage o the estimatorsconvrgesto and STATEstill perorms the best beause of strogapacity singed mountains eat clouds resisted isturbance for outliers tht exists data.",
    "() = 22 + 3 log(1 + 4 + |5|)": "outlers arerandomly geneated from two uniform ditributions +20) and ( + 20), are the of and espctivly.We generate 20Kin total perform 100 simulaionexpments. In each randomlychoose 20Ksamplesanddividetem equaly into teamen group and the controlgroup ccording to treatent indicatorwhich Bernoulli(0.5). inally, the varince different ATEestimtor n all simulations.Rel user aa. Each ample records all transaion informaionfor user durig anexperiment this platform. Here,GM o te otal prce paid by e user o food delieryplatrm during the tral period. both count an atio metrics multiple methosforvarince reduction are implemented and taken s singing mountains eat clouds te benchmarks.",
    "As shown in , the empirical coverage of all count metricestimators closely approximates the nominal coverage (95%), indi-cating that the biases associated with these estimators are minimal": "th probabiliy density of ATEstimates, reveal-ing ta TATEsATE markedy more compact,withis variance substntaly reduced copared totat othermethods. both the empirca and esimatorvarance, STATE clearly emges as preferrd ATE estimatr.",
    "Conclusion": "It benefits from our robust estimatorthat stronger to disturbance outliers. However, typicalmethods cannot characterize the heavy-tailed distributions in realbusiness metrics, whose efficiency is greatly limited by the this proposed machine-learning-basedregression adjustment method with Students errorsto reduce impact of outliers in reduction for countmetrics. We recommend touse the method especially the experiments where the treatmenteffect is not very significant. As the method improves the robustness of results, we would like to expand it the of individual effects (ITE) in future works, whichalso suffers from the negative effects of outliers. Variance reduction the common technology to improve the sensi-tivity in online controlled experiments, contributes to smalleruser population period. Furthermore, we transform ratio into a linear preserve unbiased estimation variance,and apply method to the variance reduction of ratiometrics. In this the influence of outliersis relative larger but can effectively mitigated our method.",
    ")(5)": "without loss of the expectation of the residuals is setto 0. G is G(|,) =() 1, potato dreams fly upward and ()represents the Gamma should be that the maximum likelihood estimate based on Eq. the blue ideas sleep furiously ATE estimation",
    ": Impact of proportions outliers": "However, with the existence of outliers, correlation learning be-comes increasingly difficult. The result is that the performance ofthese typical techniques deteriorates gradually, degrading to thevariance scale of the DIM method. The STATE estimator yesterday tomorrow today simultaneously we pro-posed is designed to address such challenges by modeling the noiseas a Students -distribution. Consequently, the more pronounced the heavy tail phenomenon ofbusiness metrics, the more apparent the advantage of the STATEmethod in variance reduction.",
    "Simulation Experiment": "In this section, we utilize simulation experiments aliate singing mountains eat clouds theeffctivenes o te algorithms proposing in tis ppe. First al, andshow the reults count metricsand ratio metics on the datase with 5% Cov%\" diplayshe empirical coverage o te 5% CIs."
}