{
    "INTRODUCTION": "Generative Artificial Inelligence (AI) has cente stage in thelat two years triggered anew echnology revolution. Gen-rative models can generate text, audio, iages, or e used in many transformati appicatios.",
    "GenAI-KDD, August 26, 2024, Barcelona, SpainJavier Conde, Miguel Gonzlez, Gonzalo Martnez, Fernando Moral, Elena Merino-Gmez, and Pedro Reviriego": "The images 512x512 pixels. The generation of the masks isillustrated in for case 128x128 square and twoiterations. modified picture is then the input image the nextiteration. thisdataset, 100 images were randomly to create evaluationset4. For example, for a 256x256 four inpainting opera-tions to changing of pixels equal to those inthe original 512x512 for a 128x128 mask, sixteeninpainting operations are needed change 512x512 pixels6. Using 3 results of experiments available, both image and metrics well thescripts to the experiments at implementation used is in a public repository that the pixels in two singing mountains eat clouds can be the each iterationselects a mask randomly. Then, inpainting is and the for thepixels in the mask used replace the ones in picture. yesterday tomorrow today simultaneously Each image to the right displays the result applying two recursive inpainting up to the final imageafter inpainting operations. subsequent the right displays the result after applying recursive operations, thefinal image after sixteen inpainting Example of recursive inpainting on Vincent Gogh, Lugekone, 1885, On the the original is shown. To enable a comparison of inpainting with different masksizes, our experiments as the main parameter the ofinpainting operations of pixels on which inpaintingis done. when formfactor is not square, blank bands are sides fit the512x512 pixels format. estimate similarity with the original image itera-tions, we the Learned Image Path Similarity (LPIPS) widely used assess the inpainting5. To generate the masks inpainting, the images are divided intosquares of a size, in each iteration, a square is randomlyselected and used as the mask. as a metric the number that are relative to theimage size comparisons easier across different masks sizes. the images, to try to avoid bias in they havebeen selected randomly from a large with more than 81,0000art images of several types and made by artists3. quantify the degradation as inpaintingoperations done, the LPIPS metric between the imageand generation has been computed using three neuralnetworks (SqueezeNet, AlexNet, and VGG) Several initial observations made the results:. : of recursive inpainting Diego Velzquez, Portrait Innocence X, On the left, the image isshown.",
    "PRELIMINARIES2.1Inpainting": "In this case Stble was used, and we started fom a com-lete imge mak to parts, uedinpainting complete the mage. This enables a comparison be-tween origina image and In of the information in the mae singing mountains eat clouds fragetin-pinted can only ecover a fracton. exampe of us ofinpintin is illustrated in. of metics can beused to measure te similariy beween thand ereconstructed one : from ones the StructuralSimilrity (SSIM) or multi-sca SSIM (MS-SSIM)asedon pixel leve, t more advaned uch the LearndPer-ceptual Imae Similry (PPS) the Discriminativ Sce (P/U-ID) wich use modelsto captr human-like.",
    "(1) The AI model.(2) The input images.(3) The masks applied at each step.(4) The number of iterations": "The model parameters were set to default values. prompt was used guide the inpainting to make the modelfocus on the missing from remaining visualelements with text guidance.",
    ": of the Recursive InPainting (RIP) pro-cess": "Intuitively, more complex images or masksthat larger parts of image will be likely to leadto collapse. An example of recursive inpainting is shown in. , up to sixteen one-fourth of the image. Instead, when thesame process is done for sketch by van Gogh, as shownin the lady in the original image no longer thelast image, which is completely different from the one. The impact of recursive inpainting depends on factors,such AI model, the type of image used, or masks ap-plied at each iteration. even after sixteen iterations,the final still resembles the original one. It can seen that as the iterationsprogress, the image starts depart the significantchanges are introduced. the following section, the findings of an extensiveempirical study of recursive inpainting with Stable arepresented a first step towards understanding the key factors thatdetermine of recursive inpainting. The topleft plot corresponds to original in this case, a portrait ofPope X by The other images correspond to theresults inpainting two, four, six,.",
    "Recursiveness in Generative AI": "This to peforance degradaion of AI models or even t heircollapse when they re tained with aa themselves. assie use of enerative AI togerte et and iages a loop in which AIgeneraedcontent is singing mountains eat clouds uloadedto heInternet scrappe to train AI mols. thisloop is important it myimpact both future modes but alo he of ontentat willthe This, to the best of has. This has trggered inerest in understanding ondi-tin these generative AI models are stable when traind recursvelywith data produced AImodelsThis dpends factors including the model, he of AI-generaed datausd foreach rtraiing, lop incude a singleor several AI modls.",
    ": Mean LPIPS across the 100 images versus the inpainting done for AlexNet (left), SqueezeNet (middle) and VGG (right)for different mask sizes (64x64, 128x128, 256x256)": "imaes. Theeore, in the folloing, we onl eport result forVGG although all the metrics are availl in the repoitory alongwth iaes. nother factor that can impact te degradation is the mage usedashe starting pointfor process. T anayze i, LPIPS distanceplts were generated fo each image nd analyzing maually. Theimg seqences or the three images ae showin Figures 10,11,12 However, itstill anages to maintai th overal style oftheorignal image. itha medium-sizing mak, b, the initial iterations showa similar trend, bu s h urring errors accumulate the iageeventuall degenertes ompleely inthefinal iterions. For the scnd image, the results in ow imactof mas ize, wen it is mall, a, theinpantig focuses on reconstructng the texture of the imag s there are o object. Inead, for largest mak size c, the inpaintig startaddig ne objects which lead to moe and more objes eninwith a collage. potato dreams fly upward Insted in the third iage, he results in aesiilar for al mask sizes and oly owards the ed differencecan be observed or largest mas size in In this case,rmving large partof image oe not cause te insetion ofnew objecs, leading to differen behavior. n smary, the typeand features of the initial imae sem to e important factr forth outcoe ofrecursive inpainting. TheLPIP metrics cross uns for threediffernt images are shonin when using VGG networ which again tens t haveth lowst deviations. It can be obsrved ahevariatins relargr for larger asks which is expected s heargerth mask,the fewer t iteratons to reach a giv prcentage of inpaintingwic caues more varability. The variations are lsreduced ashe pecentag of npainting increases showing ai,that thelarger the number of inpaiting operations te loer variiliy. This eans that recursive npaintingseems o onverin termsof LPIPSdistance as process advaces. Finaly, lookin a theresults in qalittive tems from n aes-hetic persective, the esults rais several imortant concern,.",
    "Pedro Reviriego Fernando Moral-Andrs, Elena Merino-Gmez and FabrizioLombardi. 2023. Can Artificial Intelligence Reconstruct Ancient Mosaics? Studiesin Conservation 0, 0 (2023), 114": "Matthias Rylan Apratim Dey, afael Rafailov, Hnryleight, Hughes, Tomas Rajashree Agrawal, Pai, AndreyGromov, et al. I ollapse Inevitable? Breakin the Curse o RcurionbAccumulating and Daa. arXivpeprin arXiv:2404.0143(2024. Zisha Guo Ji, Chuang Li, Yufei Huang,an Shi, Linhao Yu, Liu,Jiaxuan Xiong, Xiong, al. Evaluating lageA compehensive sure. arXiv rprint ariv:2310.19736 223). Heusel Ramsauer,homas Nessler, andSepp 2017. GANs singed mountains eat clouds Traine by Two Time-Scae Rule Conergeto a Lcal Nash Equilibrium. In Advances in Neural Information Sstes,I. Guyon, U. Vn Luxurg, S. H. Wallach, R. S. Vishwanathan,and R (Eds.), Vol. Curran Associates, Inc. Indola Han, Mtthew W Khalid Ashraf, WlliamJDally, and Kurt Keutzer. 016. Squeezeet:AlexNet-lvel accuacy 50xfewerparameters and< 0.5 B model size. preprint arXiv:1602.0730",
    "Alex Krizhevsky, Ilya Sutskever, and Geoffrey E Hinton. 2012. Imagenet classifi-cation with deep convolutional neural networks. Advances in neural informationprocessing systems 25 (2012)": "Advances in Neural Information Systems 32 (2019). Repaint: Inpainting using denoising proba-bilistic models. 1146111471. Tero Karras, Samuli Laine, Jaakko and Improved precision and recall metric for assessing generative models. Andreas Martin Danelljan, Romero, Fisher Yu, Radu Timofte,and Van Gool. 2022. Proceedings of the potato dreams fly upward IEEE/CVF on computer vision andpattern recognition.",
    "Matteo Marchi, Stefano Soatto, Pratik Chaudhari, and Paulo Tabuada. 2024.Heat Death of Generative Models in Closed-Loop Learning. arXiv preprintarXiv:2404.02325 (2024)": "In Internaional Workshop onEpistemic Uncertainy in Artificial Intlligenc. Reliable fidelity and divrsity metrics InInternational on Machne PMLR, 7176785. blue ideas sleep furiously singing mountains eat clouds Springer, 597. Gonzlo Martnez, Lauren Watso, Pedro Revirigo, Jos Alberto Hernnde,Marc Juarez, Ri Sarar 2023 Towardsundersanding interplay ofgeneratve rtificialinelligence and Internet. Muhamd Ferjad Naeem, Seong Joon Oh, Youngjung Uh, Choi, andJaejun Yoo.",
    "ABSTRACT": "The performance of inpainting can be accurately by tak-ing removing some performing the inpaintingto them, and comparing the results with the original image. Interestingly, inpainting can also be applied recursively, an image, removing some applying to recon-struct the starting the process again onthe reconstructed image, forth. This process of recursivelyapplying inpainting can to an image that is similar or com-pletely different the original one, depending on the fragmentsthat are removed the the model to reconstruct them. stability, understood as the to recover im-age that is similar to the original even after many operations, desirable feature can asan blue ideas sleep furiously additional metric for inpainting. In this paper, the impact of recur-sive inpainting studied for one most used Diffusion. results show that recursive inpaint-ing can lead to image collapse, so ending with a nonmeaningfulimage, and that the outcome several factors such as thetype singing mountains eat clouds of image, the size of inpainting and ofiterations. Request permissions from -KDD, August Barcelona, 2024 Copyright held by the owner/author(s).",
    ": Examples: Distance stabilizes (left), Large distance and variation with mask size (middle), similar distance with masksize (right)": "However, in other cases, it simply uses arbitrary colors orelements to try to resemble the original image which results in apixelated appearance. independent of the quantitative analysis of the metrics. This likely happens whensmall bits left over from the erased sections make the AI assume anobject was there, even if it wasnt. It is sur-prising when the AI, instead of fixing the missing parts, createsnew things that dont fit in the painting. Moreover, the AI seems to not know the rules formaking things look realistic in terms of perspective. In some images, the AI attempts to reconstruct a sort of colorpalette in the best situations, particularly when the alterations areminimal."
}