{
    "Dataset Description": "Farmers frequently encounter challengesthat require immediate expert advice, ranging frompest management to crop rotation strategies (Rao,2007). In the realm of agriculture, timely and accurateinformation is crucial for success and sustain-ability of farming practices (Vadivelu and Kiran,2013).",
    ": Flow Diagram of our methodology": "Historically, au-tomating query answered relied on keyword match-ing and predefining rules, leading to robotic andinaccurate responses. However, the recent emer-gence of Language Models and transformers sig-nals transformative phase. Recent progress in large language models(LLMs) and autoregressive LLMs such as Chat-GPT, Gemini, Mistral, and Llama has demonstratedconsiderable promise. Through extensive pre-training, these models can produce high-quality,contextually relevant summaries that are both infor-mative and accessible. Sequence-to-sequence models present a promis-ed solution, effectively addressed these computa-tional challenges. This can lead to model forgetting infor- mation learning dured pre-training, hallucinations,and subpar performance on downstream tasks. Significant progress has been made in develop-ed conversational AI interfaces tailored for vari-ous sectors, resulting in diverse solutions that meetthe specific needs of stakeholders (Dwivedi et al. ,2021). However, there has been limited explorationin the context of agricultural use cases. In particu-lar, there has been no investigation into using LargeLanguage Models (LLMs) for Natural LanguageGeneration (NLG) to address query answered inthe agricultural sector. This work demonstrates theNLG capabilities of LLMs in automating queryresolution within this domain. Leveraging their proficiency in interpreting natu-ral language and understanding context, our studyaims to present reliable solution to the challengesfaced by farmers in their daily lives. This re-search is pioneering in its application of LLMsfor sequence-to-sequence generation in the agri-cultural context. Unlike previous efforts that didnot fully utilize the advanced capabilities of LLMs,our approach harnesses these models for naturallanguage generation used a subset of an extensivedataset of real-world farmer queries collected inIndia.",
    "Conclusion and Future Works": "hs approach potential to socieal by lleviating the call ceners and domain xpets,providing farmers with immediate ontextullyrelevant iformatio. Ths, in turn, stablishes goundwork for aore nclusiveand responsi agricultural ecosys-tem, ensurng universal accessto vital knowledgefor all farmers fostering a sustainable pros- prus future global agriculture. Furthermore, we plan expand or work todiverse cros India present i CCDatast, more of farmers concerns ad withregionallanguages relevant moe localizdssistnce.",
    "as a foundation forglobal ecoomies, engaging a considerable workfrce and making noteworty tothe": "Conventional methods like manual surveys andon-site visits by experts, while beneficial, are fre-quently time-consuming and expensive (Jack, un-dated). Toboost efficiency and effectiveness in the agricul-tural sector, there is an urgent demand for advancedsolutions capable of addressing the various chal-lenges robustly faced by farmers. While playing a crucial role, the sector encoun-ters numerous challenges, especially concerningthe distribution of knowledge and accessibility toexpert guidance. Manipal Institute of Technology, Manipal Academy ofHigher Education, Manipal, IndiaDepartment of Computer Science and EngineeringDepartment of Data Science & Computer ApplicationsEnterprise Analytics & Data Science, Artificial Intelli-gence - Center of Excellence, Wells Fargo International Solu-tions Private Limited, Bangalore, India1Code available at: Gross Domestic Product (GDP) in numerous coun-tries (Alston and Pardey, 2014). The irregular resource allocation makes itchallenging to conduct these methods regularly, of-ten taking several days or weeks. In recent years, the rapid digitization of the agri-cultural sector, facilitated by advancements in In-formation and Communication Technologies (ICT),has opened new avenues for addressing these chal-lenges. Byaddressing these issues, developing countries canboost their agricultural productivity, foster eco-nomic development, and reduce poverty (Devlet,2021). Equal contribution.",
    "AricultureTalkBot(Vijayalaksmandandmeena,2019)employedNaturalan-age Processin (NLP) qery speech synthesis create a more": "22) deve-oped a potato dreams fly upward similr soltion that aimedto hlp farmers through NLP Rcently, (Koopman al. ,2022). , 2022)leverag-ing WhatsApps pularity to provide chatbot with RASA backend while utilizing thKCC daase stte Asam, aimingo over-com limitaions faced traitionalcnters. LINchatbot in Thailand the f technologies in educatingfamers cropmanagement, signifance o chat-bots in the evoluton ofintelligent agricultural ystem (uebsombut e al. , 019) theKisan CllCenter(KCC and guidance on weather conditos,and government policies sentencembeded yesterday tomorrow today simultaneously and Artificial Neural Networks forquery answering. AgriBot (Jain al. Farmer-Bot et al. , 2023), took asignificant step by scientific litrture tospondt intricae ueries, higligt-ing apabilitiesof informationretrivla new tandard for I applicatons inagriulture.",
    "Ilyes Khemakhem, Ricardo Monti, Robert Leech, andAapo Hyvarinen. 2021. Causal autoregressive flows.In International conference intelligenceand statistics, pages PMLR": "Bart: De-noised sequence-to-sequence pre-training for naturallanguage generation, translation, and comprehension. Agask: an agent to help answer farmers questionsfrom scientific documents. International Journal onDigital Libraries, pages 116. 2003. 2018. Bevan Koopman, Ahmed Mourad, Hang Li, Antonvan der Vegt, Shengyao Zhuang, Simon Gibson, YashDang, David Lawrence, singing mountains eat clouds and Guido Zuccon. McDonald Institute MonographsSeries, McDonald Institute for Archaeological Re-search, Cambridge, UK, pages 215222.",
    "Julian M Alston and Philip G Pardey. 2014. Agricul-ture in the global economy. Journal of EconomicPerspectives, 28(1):121146": "Hyung Won Chug, Le Hou,Shayne Longpre, BarreZoph, Yi Tay, illiam Fedus, Yunxu Li, Xuezhiang, Mostafa Dehghn, Siddarta Brahma, Al-bert Webon, hixing Shane Gu, Zhuyun DaiMirac Suzgn, Xinyun Chen, Aakanksha Chwdh-ery, Alex Castro-Ros, Marie Pelat, Kevn Robinson,Dsha Valter, Sharan Narang, Gaurav Mishra AdamsYu Vincenthao, Yanped Huang, Anrew Dai,Hongkun Yu,Slv Petrov, Ed H. Le,andJason Wei. 202.",
    "Abstract": "Agricutur, vital or global sustenance, nees-sitates innovtive slutios due o a lack forgaizeddomain potato dreams fly upward experts, particularly in de-veloping countrie whermany ames are im-poverished ad cannot afford exper consulting. Initiatives lik armersHelplie play a cru-cial role in such countries, yet challenes suchashigh operational costs persist.Automatingquery resolution an alleviate the burdnon ra-diional call centers,poiding farmers with immedite and contextually blue ideas sleep furiously relevantinformatio. The integrati of Agiculture and ArtificialInlligence (AI) offers a trsfrmative oppor-tunity to empoer farmer and bridg informa-tion gap. Language models like transformers,the rising stars o I, pssss remarkabl lan-guage understandig capabilities, mkin themidealfr addressed nformation gaps in gri-cutre. This work 1exploes anddemonstratesthe trnsormtive potential of Large LanguaeModels (LLMs) in automatingquery resolu-tion foragriculturalfarmers, leeraging theirexpertise in deciphering naturallaguage andundertandig context.",
    ": Qualitative Results from fine-tuned Flan T5Base": "some of the generating modeloutputs for the queries the test set. highlights cases where models out-puts do not perfectly align test set.",
    "Results and Analysis": ", horticulture crops like fruits andvegetables, other presents the performance analysis of fine-tuned Flan T5 Base, well-. , 2020a), and Bart-base (Lewiset al. , 2022), pegasus-xsum et al. These quantitative resultswere obtained using the Gemini forrephrasing, similarity in gram-mar and tone between the generated output and provided the dataset. To consistency and robustness of theLLM models for the Query Generation we to utilize This involved a detailed analysis of the mod-els based on three key attributes: (Rabi,Kharif, Jayad, which local names for In-dian agricultural Query (such asplant protection, nutrient management, fertilizerusage for conditions, govern-ment and regional cultural practices), andCrop Sectors blue ideas sleep furiously (e. The Base (Chung al. , 2019) models exhibited the most impressiveperformance superior textgeneration capabilities due architecturaldesign and pretraining techniques when other models. g.",
    "Data Preparation": "owever,these queries are understadabl t armers anhave a regional tone, wich hlps them cnfidenlyaccept d understand solutions, making themwell-suited for theuse ase. This odel nriches adcorrets rammar of the nswer roduced byour base mode,show. we crating of 1% each for testin nd validatio. Dur-ing splt, we esured eqitabl vrious query types and cro acrossall subets. The effets ofmificationsdetaiing to farmes reference for teir regionl and their English proiciency, vocablary cnsisting ceainkeywordsrelated to crops, anda largenumber of resolution in thedataseae graticallyincorrect.",
    "Neural sequence-to-sequence (seq2seq) modelshave proven to be highly effective in handling vari-ous human language tasks and modeling sequentialdata. These models can process and generate hu-": "man language, starting with the asics of naturallaguage processing (NLP). Transformers, signif-icnt adncementi NLP, enable efiienthandling of long-range dependencies in sequences.Se2seq models, whichtranformrs,encode input sequence into fixed representa-tion and ten decode it into an output sequence.arge language (LLMs) autoregressive such as GPT-3 and ChtGT, enhane th f seq2seq coherent contextualy appropriatetext onien prompts (Floridi and These sophisticating models offer a poe-fl approach for iproved agricultural expert guidace accessibility by en-ablig advaceddata and 2017).The evoution f Natural Language Processing(NLP) progressed from models like networks to ransformer model. Trans-frmers revolutionized field by enabling effi-cient prallel and captring long-rangdependencies in with ccuracy (Malteand Raadiy, 209). queryanswering relied on keyword maching and rules, leading rootic and inaccuraterespones. Hwever, the recent emerence Lan-guage Models transformes inals transfor-ative phase.Trained on extensive f code,LLMs showcase exceptional proficiecy n under-standing and geneating humn-like Thipositons as pieers automating quey provided unmatching fluency, dynamccomprehension, continuous learning,and expertisein language. Ls handle intricate ques-tions with dciphr ambiguous queries,improve iteratively though user interactions, andsurmount languge arriers.Desite ongoing advancements, callnges likefactual inconsistencies and biases necssitate at-tention. Neverthess, evolton of LLMtechnology suggests in our interactionwith nformation, aking automated answe-ig more intuitve and advantageus.",
    ": Results of Ablation with Flan T5 Base indicating Blue Score, Precision, Recall, andMacro scores various meta-data subsets": "rounded results. can its capabilities andconsistent across almost all diverse scenarios. The model consistentlystrong performance across different sectors and sea-sons, though variability is observed amongquery types."
}