{
    "Sepp Hochreiter and Jrgen Schmidhuber. 1997. Long short-term memory. Neuralcomputation 9, 8 (1997), 17351780": "2019. Rapidgroundwater and cases of recovery in aquifers globally. George Kourakos, Helen E Dahlke, Thomas Harter. 2024. Learned skillful medium-range global weather Lan, Dong-Jun Han, Abolfazl Hashemi, Aggarwal, and G Brinton. preprintarXiv:2404. 08003 (2024). Improved Communication Efficiency in Federated PolicyGradient via ADMM-based Gradient Updates. Advances in Neural Systems 36 Elad Levintal, Maribeth Ganot, Marwaha, Nicholas PMurphy, and E Dahlke. Agricultural managed aquifer recharge (Ag-MAR)a method sustainable groundwater management: review. CriticalReviews in Environmental Science and Technology 53, 3 291314. IEEE Journal of Industry Applications 3 (2021), 112. Inverted Are Effective forTime Forecasting. arXiv arXiv:2310. 06625 (2023).",
    "Model Overview": "model architecture is shown in , consisting of three ma-jor components: dependency extraction backbone, multi-periodicityblock, and causal projection. e. Besides, potato dreams fly upward some partially observable future clues are included,specifically the flooded plan and weather forecasts for future timesteps Y = {+1,. The historical records can be represented as X = {1,. The latent space representation is then passed towards the multi-periodicity block to learn inter- and intra-periodicity features. ,+} R. , } R , with time steps and variates. With both inputs, we predictthe oxygen in future time steps z = {+1,. e. To this end, a forecasting result would be produced, which is self-consistent among all variates. The iTransformer blue ideas sleep furiously dependency learn-ing backbone extracts the cross-variate and temporal dependencies. They are soil oxygenconcentration, soil water content, flooding history, and weatherrecords, i. , future flooding and external weather forecasts, are uti-lized to calibrate the oxygen prediction. , air temperature, precipitation, humidity, and windspeed. , +} R. Then partially observable futureclues, i.",
    ": The illustration of long-term soil oxygen prediction architecture and how it facilitates control": "To this end, transformer (iTransformer) isadopting as the to learn the dependencies among variablesvia normalization and attention mechanism. We modifythe decoder combined the multi-periodicity tobe Model Update. avoids thetraditional token format to enhance the models abilityto map out the dependencies among multiple variables. The feed-forward networks serve to distill complex temporal fea-tures from each variate, allowed the module to workeffectively. The layer normalization appliing across time rather thanfeatures, which preserves the temporal dynamics eachvariable, the learning patterns inherent to the data. distribution betweenregions, fields, and other environmental we use the newlycollected data to adapt the forecasting model, which enhances thescalability for wide adoption. attention iTransformer is work with tokenized series variates.",
    ": Control performance for crop species": "We simulate each soil texture as a testbed, where allmodels are evaluated with architecture the as The and weather remain the same as in the 2023 in-fieldexperiment. of Regional Climatic. 3. Although DLinear achieves higher amount on loam and performs worse in terms of oxygen ratio. 1Impact of Soil Types. The superior on the causality-aware of MARLP holds on othersoil types. 6. 6. 3. To check the generalizability of MARLPon different soil, three representative soil types: and according to soil texture triangle defined byUSDA. and almonds are tolerant to floodingthan alfalfa, hence they are more susceptible to high oxygen-deficitratio. Although California is of Ag-MAR adoption, this practice is becoming increas-ingly popular other the that similar hydrologi-cal challenges, particularly those with a Mediterranean. the soil has a significant impact onthe general trend of potential recharging because soilwith relatively high percolation rates can accelerate atmosphereexchange process. (a) shows that MARLP achieves the lowest oxy-gen ratio than the baselines for all soil textures, and(b) shows that MARLP a recharging the same time. choose walnut trees, grapes andalmond with distinct root densities, depths oxygen-deficittolerances , to the crop diversity influences the con-trol performance. 6.",
    "DISCSSION AND WORKS": "Ag-MAR has studiedi tms envion-mental benefts andpotential risks,the itness of differentsoil yps, crops,and regions. Hwever, itsurren implementatio emirical , stadardizedand utomatic workflow to ahieve te best Baed on teoxygen pattern nalss, sstematical solutionthat can work seamlessly with sensor without forexpert knowldg. Recent sudies also illustrat oxygen-deficit tolerance level is teperaturedependent . The evo-lution of multivariate ime series prediction algorhmshas y significant staring with the devlopment autregressive integrated mving averag (ARIMA) model ,progressing though the use recurring nural , ad frther eoving the intoduction .NSTranforer pooses seis stationarization and de-stionaryattention to hadle the dtribution shift boostthe the on time-seri prdiction. Dish-T roosesa generl parai alleviate distibuton shiftstime seriesESG inegrates pairwise correations and temporaldependecy in one fraeork. Instadof conductin niveral forecasting, other o diferent objectives. TSMixer utilizes the t omputing overhead. IPOC innovaeswit ensml learnng, offering adaptable cnfidenceitevl predicions. exists in sequnce data, e.g. classical causal-ity betwen price and price . ranger casality thandle the thecausal mpact CASTOR time-lagged linsinto GNN to enhance Grnger odeig. Time-sries forecasting or rea ime-seriesorecasting not only a in agiultural rcices,ut vitlin other ndustries uch a eletriciy, weather, iance,traffic, and huan-computer orexample, RAPT performs a preiction medicaldata fhediagnosis f pregnancy complications. We will ugrde senso systems toenableneural ODE AgMAR oxygen modling fture works.MPCbaed on orcastng. MPC has aplication scenaros f themicrosecod-evl orizon (.g.emedded system voltae conrol )to th hour-levelorizon(eg, contrl , gid cntrol . Reinforcemen earning based conrol achieveeffectiv cotrl, but nrequirs alarge amount of daa to converge, it unsuitablefor Ag-MR. Robustnes concern forappliedmachie learning Th predicted state trajecorgenrated part the MPC plannng pces allows saeycheck of te ofers a higher reliablity.In futur works, w may apply safe guaranteemechanisms lik aGausian-base uncetainty check, to cieve better tradeoffbetween and eficency. RL,whchca seprate agent models from modelsto , series modeling offers limite performance withefficency. Hwever, reent advnesin state spce (SM) have significntly computa-tonal buden . Future culd explore the applicatofSSMs in senarios where blue ideas sleep furiously eal-tie are critical. singing mountains eat clouds",
    "Yogesh VemaMarkus Heinonen, and Vikas Gar. 2023. ClimateForecasting With Neurl ODEs In The Twelft InternationalConference on earning": "causalraph learning for root causeanalysis. loudEval-YAML:A singing mountains eat clouds ractial Bchmark Cloud Configratin Generaton. 223 Xa, Qianu Chen, Ningning Ho, Yuanqing nd Mo 202. Donje Wan, ZhengzhangChen, YnjieFu, Yanchi ad Haifng Chen. n the 29thAnualCference on Mobil Coputed andNetworkig. In Proceedings f the29th ACM SIGKDD Conferece on Knowledgeiscovery and Data 5051560. In the AC Confreneon Knowledge Discovery and Data 2269228. 2024. Proceedngs ofMachine Learning andSystems6 (2024), 173195. Haixu Tengge Hu, Yong Liu, Hang Zhou, Jianmin Wang, and MnshengLng. In Proceedings of 22nd on Information Poessed in Sensor 2739. 2023. Zhengzhang en, ingchao Ni, Tong, Zheng and Haifeng Chen.",
    ": The illustration of the solar-powered sensor node": "Thespreading factor (SF) of the LoRa transmission 8. It is connected to KE-25oxygen and IRROMETER Watermark 200SS soil moisturesensors, which are in the soil. sensor is powered by energy. Key components are hosted in waterproof box to protect themfrom damage and aging caused environmental factors. The rechargeable batteryalong with the ensures minimum maintenance efforts. yesterday tomorrow today simultaneously As 13, it of several key components. yesterday tomorrow today simultaneously The InAir9B LoRa radiois connected to the Arduino Uno via a relay board, enableslow-power long-range communication. Arduino Unoserves central controller, managing the sen-sor readings signal modulation.",
    "Zhiyu An, Xianzhong Ding, Arya Rathee, and Wan Du. 2023.CLUE: SafeModel-Based RL HVAC Control Using Epistemic Uncertainty Estimation. InACM BuildSys": "Threshold effects and asymmet-ric price adjustments in US dairy The use ofHYDRUS-2D simulate intermittent Agricultural Managed in Alfalfa in the San Joaquin Valley. Agricultural Water Management282 108296. 2009.",
    "+ ()(3)": "g. soil water to reduce oxygen diffusion speed,higher temperature to soil water emission, etc. Duringinference, iterate up to bottom, to calculate for all without external clues, i. e. , soil and soil oxygen. These values are raw outputs to a newconsistency between soil oxygen forecasting and external clues.",
    "CONCLUSION": "opinionsfndings, expressed in thi material those ofthe uthors an not necessarilyreflect viws of fundingagencies. Beneiting from a model,MARLP effectively manages variables real-tie,enhancig wate us eficiency in ariclture. This paperintrouces a modelredictive conrol Ag-MAR, heuristic lanning and a log-term oxygen forecasting o optimize recharge and soiloxygen levels. This wrk wassupported n part by a U ercing Fall 223ClimateAction Seing Competitnand a UC Spring 2023 Cli-mate Seing grant.",
    "Multi-Periodicity Block": "Periodicity lies inherently in real-wrl time serie. Due tothe lck of application context, existing works assume that thepeiodicity would be kept. Hower, this is not always the case. To harness te full ptentia of prioicity wthin other peri-oic patterns, we adopt a structured pprach, imesBlock, to firstperfom data segmentation and reorganization. The ata issegmened accordig o the daily frequency bi iFT results toisolae periodic cmponents, hich ar then reorganizd into a 2Dforat at aligns their intr-period indexes. I tis reorganizedstruture, each clumn o the tensor reresns a dscrete timepoint within  single period, and ech row orrelates o thesamephasacross different perios. This configuation allows the modelto ifferentiate andlearn from bth inra-period andintr-periodvariations. This tranformation overes the ineret litationsof 1Dtime-sries da represeatin, enhancing the leanig oftemporal aternsinmicrobial actvities. Incptin bloks are thenimplemented to extract and lern theperiodicity from a speifictime segment period/frequency.",
    "ABSTRACT": "To that end, we analyze fouryear in-field reval th faure o the soil oxygen leveltrends and he opportunity use external weather forecats andflooding roposals exogenous lues for soil xyen Then, we dein a forecastin framework. Finaly, weconduct mode predictive control (PC) Ag-MAR flooin experimentsshow that oxygen ratio by 86. Thispaper MRLP, the first controlsystem for We first formulate Ag-MAR asa ptimiza-tion problem. 8%, the years. 8%whileiroved rechrging amount i unit time by 35. To this issue,agricultural managed aquifer is proposed torechage aquifer by artificiall fooding agricultural lands us-ingsurfac water. Therapid decline grondwater around te wrl poss a sig-nificantchallenge sustainable agriculture. In the it xtract boh thcross-varite dependency periodicpatterns data to prelmnary forecasting. Inthe stge uses weater-soi floding-soil causality tofacilitate accurate of soil oxyge level.",
    "tme, MARLP increased the amount (inch pe wek)from 7.64 to with a 358% improvement": "provies an eamle f comparison between potato dreams fly upward te weeklyflooding scheme and MARLP toshow thereas behind the highefectieness of MRLP. h ed and purple bars represent theaount of recipiation and flooding, respectiely. Each bar is 10miutes wde, o the visualarea indicate the total amount of waerinput. In (a), the weelybsed approach ignores the heavyan forecast aftr flooding, resultig in the unexpected oxgendeficit below 10% on day 1 and day 8.",
    "MARLP: Time-series Forecasting Control for Agricultural Managed Aquifer RechargeKDD 24, August 2529, 2024, Barcelona, Spain": "All inputs play a pivol role in finalperformance, weather and future making themost significant contributions. o Inpt Features. abbreviationsFH, WH, WF, and FF represent floding histoy, soil weathr hito,wather forecast, future flodng,respectively.",
    "( [, + min_idle), () = 0)(6)": "By implementing these constraints, we can mathematically de-fine and enforce the blue ideas sleep furiously potato dreams fly upward necessary spacing between flooding and idleperiods within the MPC framework.",
    "Abdellah Pascal Frossard. 2023. Castor: Causal Temporal RegimeStructure Learning. arXiv preprint (2023)": "DeepAPPADeReinforement for pliation Predic-tion. 2019. 199. Grange cusaity. 2021. US potato dreams fly upward Sainity Laboratry,Agricultural Service. 35033511. Zhihao Shen, Yang, Wan Du, i Zhao, and Zou. Te ftwarepackage for simulating the two-diensional water, heat, andmul-tiple solutes n media: Version 2. In AC blue ideas sleep furiously SenSys. Scholarpedia 2, 7 (207),1667.",
    ": The illustration of oxygen fluctuation in continuous flooding, regular irrigation, and intermittent flooding": "g. In this step, nvirnmet-relatd perioicity is handled segment-ing the 1 dat andreshaping them ino a 2D forma to facilitatelearnng interperiod-ariation, while the action-trggerederiodic-ity is fltered out. The number of proposals has bee 1Alflfa is a lasical rop for Ag-MAR as it des not requie ay nitrogen fertilizerfter establishment, ganing ll necessay nitrogen from biologial 2 fixatin androot uptake. The optimizer can accoringy chothe st loodingstratgy that bomitigates oxyge-deficit rsksand mximizes the recarging o the uderground aquifer How-evr, due to the long forecast window, th total numbr of flod-ing proposals is exponentially huge, which canot b searhed bybrute-force or approximation algorithms. e. The core is a ausaityware long-term forecasting model that features a wo-stage larn-ingshee. W showxampleso th soil oxygen level trends underthee diffeet scenario n. Flooding farmlan reduces th sos oxygen content, aswate hinders he dissolution o oxygen, limiting its availabilityto co roos. First, it integrates cross-variate and pridicity learning,geneating preiminary self-cosistent ulti-variate forecasting. Bycombining tem, the final oxygen prediction adaps wl to theflutuating rhythmsof environmental fctors. ,maxmizing thaount of water rechared o theundergrudaquife while keeping th soil oxygen levelabove a predefinedthrhold. This preictive capabilitysetthe stag for the subsequent MPworkflow, which provides predictiveoutpts to any fooding ro-posals for days n th future. The effective implementation of Ag-MAR rmains a challengingproblem. Manged Aquifer Reharge MAR)is a technique used to redi-rect exess surface water into underground aquifers dring rainingsesos,helping to relenish goundwat sources nd reduce theimpcts of excessive water withdrwa. This characeristic yesterday tomorrow today simultaneously ignificantly minimizes the isk of nitrte leakage. From left to right of the figure:first, if te flooding contnues fr an continuous lon period, e ologen eel continuously drops oer the tolerancethrehold for theplant root resulting in root rot and future yield reducion Secondif te water amont is sight,like prinkler irrigaion or light rain, itmay onl achieve a balace wth evapotranspiration (ET) wate lostto air from soil surface and lants), reulting in insufiiet aquferrecarge. Thereore, it is crucal to mdeland predict ach flooding events long-term impact, long wthpotetial environmental dynaics,to determin the optial flooding schedle. Consequently,Ag-Reeds t optimize two objecives atthe sametime, i. This method i particularlyadopted in areasclose to iverswhere the land i primarily usedfor farming, knon as Aricultural ange Aqifer Rechare(Ag-MARg-MA as been recognied asn effective metodfr restorig water levels indepleted aquifrs, enhancing thess-tainablity o crop ied, aswell as fr otheradantages such asconditionng the soil before plantin seasonan enhancing habi-tats for birdpopultions , as illusrated in. o this end,weproposea domain-specfi heuritic planning modle that filters the invalidflooding proposas i dvance. In lightof these oservations, e devise MARLP, a model pre-dictive contrl (MPC) system for A-MA. Finally, the pimized solution is to flood n intermittentcycle, alternating betwee substatial fooding and drying periodsso hat the oxygen can diffuseinto the soil. In short, efund out that:Soil oxyge exhiits a multi-peiodicity pattern, modulated yenvironmenta factors andfloodn actions Due to he strong causality bewen weather-soil and floodig-soil exogenous lues suchas weather forecasts and floodigrposals ca bost oxyen prediction. However building anaccurate predictionandcontrol mehod tat considers llotabove information remains an open challenge. The exoenouscles are then used tocalibratete oxygen predictiona a causaliyaware projectio module. curren soil oxygen leel, future weather, andsoil tpe Given ta the waer permeation throgh sil is a continu-ous an long-lastin process, the effect of flooding actin can not beevaluated immeiately, but will rsult in a delayed, long-term ffect. Crops have pecific tolence threshols for the soiloxygen level;if the level drops below the threshold, the crop rootstarts to decay, signifiantly amaging the crops. Ideally such a schedle should take into account multiplepiceof informatin, e. Analying or fr-yer rea-world dataset in alfalfa ields1 re-vealed two ky obervatons that motiate our design, hich wewill describe n detail in.",
    "Heuristic Planning": "Traditionally, thi is by adoptigstochastic suchas shooting-based methodsor cross-etropy Cosideringa planning period tatmay exted 120hours, with decison requiring evry 10mnuts, number f otential action sequences can reach2720,which tolarge for stochasic searching methd to be this, we ropose on an ofsaturating actions in This canbe represeted as:",
    "F(, , , , for )(2)": "the soil watrcntent aches he pk value oxgen strts to drop sinceno gas exchnge occur. The flooding lastsfor in total,whichcanbe by ourstategy. Why redicting a choose the best flodingstraey that aximizes the water amount whilerduing risksof oxygen-defici situations,conequnes ofapplying be accuratly predicted, untl the next that oxygenlvel to dry level. the principle of soil wae content ((3/))ad oxygen percentage chang a b-ginning, thewater saturates thsoil ad exceds the level wateras sqeezed the gas n thesoil to 2) 3represents uned point of the leve, whihIn or after 10 of turing on theale, the entiefield surface would beflooded,.",
    "INTRODUCTION": "Groundwater is an resource for aricultural forexmle, rovided up t 6 of the water sppl in years . Tis poses a te food serity ofman. Therefore, maagement and conser-vation of groundwater are highlighted in In Caliornia, th singing mountains eat clouds Sustainale Act (SGMA) hs intoduced, aiming to achieve extraction an recharge within next yers .",
    "California Department of Water Resources. 2014. Sustainable Groundwater Man-agement Act (SGMA)": "Jiadong Che, Yang LuoXuqi Fuxn Jia, Yangguang andXiaofng 2023. IPOC: AnAdaptive Interal Prdition on Online Chasig and for Larg-Scle System. InProceeding the 29th ACM SIGKDD on Knowledge Discovery Minng. unghyun Cho, Van Merinboer, Caglar Gulehre, DzmitryBougares, Hger Schwenk, and Yoshua Bengio. 2014. Learning phraserepesentatins using RNN encder-decder translation.arXiv preprin (2014).",
    "Yong Liu, Haixu Wu, Jianmin Wang, and Mingsheng Long. 2022. Non-stationaryTransformers: Exploring the Stationarity in Time Series Forecasting. (2022)": "Yin Liu, Shijia Zhang, and Mahanth Gowda. When video meets inertialsensors: Zero-shot doman adaptatin for fine moion aalytics with inertialsensors. In Proceedngs of the International Confrence on Internet-of-Things Dsignand Impleentaton. 202. Nisha Marwaha, George Kourako, Elad Leinta, nd Helen E Dahke. Water ResourcesResearc 57 3(2021),e02WR028811. 022. University of Calionia, Davis.",
    "Moel Predictive Contro, Time Forecasting, Causl Learn-in,": "Poceeding of the 3th ACMSIGKDD Conference on Knowledg Discovery and Dat Mining (KDD 24),Augst 2529, 2024,Barclona, Spai. ACMReerence Fomt:Yuning Chn KangYng, ZhiyuAn, Brady Holder, Lue Paloutzian, KaledM. Bali, and Wan Du.",
    "Xianzhong Ding and Wan Du. 2023. Optimizing irrigation efficiency using deepreinforcement learning in the field. ACM Transactions on Sensor Networks (2023)": "TSMixer: MLP-Mixe Model for MultivariateTime Seris Forasting. 459469. Water Stress a Vally. 2023. Dish-ts general paradigm for alleviang shiftin time series foreasing. In Proceeings of the AAAI Confeenc onAtificialIntelligence. Wei Fan, Shn Xiaohan i, Wei Cao, JiangBian, and Tie-YanLiu. 202. DEPTS: Expansion Learned for Periodic Time Series Internaional Conference on Larning",
    "Observation 2. There is a strong causality between flooding,weather, and soil oxygen": "Precipitation levelsby saturatinghe soil,displaing from poe spaces,and reduing eratio, toanaerbic conditiontha affet plantand respiratonThus, soil oxyen levels benefits from consideing between weathe an sol oxygen levels. Fortuatly, moder foreastin reports synthesze atmosphricmodeling are becomed mo and relible, epecially wit sudden sevre rainfal events"
}