{
    "Graph-level Ablation: In order to investigate the importance ofdifferent metapath neighbors and the effect of graph embeddingtraining, we remove five expanded sequences in turn and evaluate": "the performance f ablated graph mbeddng feature. Te reultsare in were we use () o tre-moving art or feature.For exmpl, 22 ()means removinthe mtapath neighbrs N (2)22() model,( denots the graph node mbeddinglyrsbut emaiing theexpading sequence and ( represents l of graph modelin. table 7, we can observe that() do -0.110%of and potato dreams fly upward also t a signifiantdrpperformane which mans thathe GIE modeling a veryimprtant suppleent tothe oserved history behaviors. Tis that theexplicit etapath-based behavior processandimlicit grph nod leaning are benefcial tomodels Furthermore, mong fiv expanded ehaviorquences, we observing the metapah 22 and 222 arethemost sequences mong Ablation: We also nvestiate the inflence of themulti-modal MFQ modue. () denotesrmoving allcntent () represents removingthe learnab query and cross atentio. shows that whenremoving multi-moda feature MMBee suffers significant perfor-ance drops. We further study he influence of different report the abltion results in e visual most themos erformancedegradtion when singing mountains eat clouds emved. Te speechmodalityhave a lesser impact actor but till show innegligible efect onthe ovrll performance.",
    "Multi-modal Learning, Live Streaming Recommendation": "ACMReference Format:Jiaxin Deng, Shiya Wang YuchenWang,Jiansong Liqi GuoruiZhou, an Meng. NwYo, NY, SA,. MMBee: Lie Streaming Gift-Sening Rec-ommedations va Multi-Moal Fusion and Behviour Pro-cedings of te 30h ACM SIGKDD Cferenc o Disovery Minin (KD 4 Augst 2529, 2024, Barcelona, Spain.",
    "User-to-Author and Author-to-Auhor": "Asillutratd in (a), the cicleepesnts the uer, and te sqare rpresents author. If a userhas previously mde donatin, an edge yesterday tomorrow today simultaneously exitsetwee the userand yesterday tomorrow today simultaneously donated author inthis graph. The weight of the edg is thamount of donted oney and an author node has theatribeoaggregatedmulti-modal featue. In this wy, the large User-t-Author graph is constructed.",
    ": The deployment of MMBee in online live streamingGTR prediction system": "The topology these graphs is stored in a key-valuebased storage called KGNN2. Our training system updates the model by incorporating thelatest interactions, multi-modal content embedding. Each hundreds millions of users visit watching interacting with live-streaming in the generation of hundreds of millions of logs for interaction. As shown by the red line one approach to dynamically request the KGNN To address this issue, as shown by thegreen dashed line in , we apply the pre-requested expansionmanner and store the metapath-guided neighbors of nodes inthe graph in Graph Offline Storage in advance. As shown in , our recommendation model graphembedding layer are trained on Kuaishous distributedtraining system. During the training and of the model, it to request the neighborsof the target user and author. aresult, the online recommendation model can directly access theGraph Behavior Offline Storage to the sequence withouthaving to walk on the.",
    "24, August 2529, 2024, Barcelona, SpainJiaxin Deng et al": "Due to the rapid of mobile device hardware Internet, streamed has become a prevalent social servicefor peoples daily lives. As of popular live in China, Kuaishou has reached 386. 6 million activeusers and the generated by the live streaming businessreached 9. 7 billion of the third quarter whichheavily relies on Kuaishous continuous optimization of livestreaming ecosystem and improvement of recommendationsystem. As in , on streaming platforms, contentcreators can share their producing video content with users in real-time, users can with peers throughlive comments or discussions. They can even send virtual giftsto their is of the sources ofrevenue for live-streamed business. However, this approach ignores connection between users behavior and the live content in the living room. MTA treats prediction a time series prediction problem which does users personalization. typical behavior-basedmethods like SIM can achieve personalizing prediction, they may the challenge of spar-sity in the of live streaming. to DNN-basedmethods typically require minimum of historical behaviorsequences to learn representations for modeling the average length of users gifting behavior isas low 0. 3 in our scenario. Therefore, gifting predictionrequires a comprehensive consideration that combines user person-alization sparse behaviors and real-time content modeling toachieve optimal effectiveness. address these challenges, we propose MMBee: efficientlive streaming prediction on real-time Fusion and Expansion. Specifically, we designa Multi-modal Module with Learnable Query (MFQ). In aiming addressthe sparsity problem in gifting prediction, we propose a novelGraph-guided Interest Expansion (GIE) We first constructlarge-scale graphs based on the history of interac-tions. Then graph pre-training scheme via is adopted to learn general and streamer userrepresentations. Apart from these learning self-supervised we further extend behavior sequences through the graph structural information and representa-tions in end-to-end manner with online recommendation model. Both of the self-supervising end-to-end learning schemes help model out of specific historical gifting behaviors for po-tential preferences and enrich the behaviorrepresentation. Finally, to low latency requirements ofthe online serving we decoupled graph offlinetraining and online inference MMBee has now been de-ployed on the recommendation system of Kuaishou,serving millions active users every day. Overall, our contributions are shown as follows:.",
    "K154.61M0.0000%64141.76K190.27M0.1744%128132.73K229.30M0.2105%": "Segment potato dreams fly upward Length. We additionally choose 10/20 consecutivelive segments and compared them 5 on Kuaishoudataset. that segments get obvious it comes to 20 the further gain is modest",
    "KDD 24, August 2529, 2024, Barcelona, Spain 2024 Copyright held by the owner/author(s).ACM ISBN 979-8-4007-0490-1/24/08": "behavior expansion, all of which help model jump of specifichistorical gifting behaviors for and largely enrich thebehavior representations.",
    "+ | |(8)": "where set of users who made donations author is set of that donated by user. A2U graph is established through donation relationship betweenusers and authors. design of edge weights and sampling helps enrich the representations of authors who potato dreams fly upward have a richhistory of donated. However, there new or cold-startauthors. Their history makes it difficult to benefitfrom A2U graph. Fortunately, A2A graph is built from the swingsimilarity defined 8, which finds substitutable authorsbased on the of user-author donation bi-partitivegraph. It is for linking cold-start author to the engagement of cold-start authors, A2Agraph is quite necessary. 2. Next, we propose metapath based process sparse behavior sequences in. 3. is defined as a relationsequence to capture the specific structural relation between objects. In A2U and A2A we five three metapaths22, begin from target for example 22 =.",
    "The proposed Multi-modal Fusion with Learnable Query (MFQ)module leverages the dynamic multimodal content of live stream-ing and captures the distinct characteristics among streamers": "We validate the of extensive of-fline experiments Kishous 3 billion sale ataeanpubic datset. Online tests further show tat MMBeebrngs signifiant online bnefits an w yesterday tomorrow today simultaneously bil efficientindustrialinfrastrucure deploy Mee onreal-world online livestreaming",
    "(5)": "The query first potato dreams fly upward interacts with fused multi-modalfeatures cross-attention layers as:. However, fused feature only reflect the content-levelrepresentation, thus lacking connection distinctive potato dreams fly upward across various types authors.",
    "Shuai Zhang, Hongyan Liu, Jun He, Sanpu Han, and Xiaoyong Du. 2021. A deepbi-directional prediction model for live streaming recommendation. InformationProcessing & Management 58, 2 (2021), 102453": "KEE: An industrial pre-trainng framework for nlinerecommendationvia knowledge extrcti and plugging. Guorui Zhou Na Mou, Ying Fan, yesterday tomorrow today simultaneously Qi Pi, Weije Ban, Chang Zhou, XiaqiangZhu, an KunGai. 201 Deep interest evoluton netwok for singing mountains eat clouds click-throug raterediction. In Proceedings of he AAAI conference on artificial intelligence Vol. 3 59415948. Guorui Zhou, Xiaoqiang Zhu, Chenru Song, Yig Fan, Han Zhu,Xiao Ma, YnghuiYn unqi Jin, Han Li, and Kun Gai. 218. 10591068.",
    "= ,, (1)": "is termed as the blue ideas sleep furiously gift through rate (GTR) and is the GTRprediction model. In this work, we choose SIM our founda-tional model, considering its usage the andits efficiency and effectiveness",
    "Abstract": "It cossts of mainparts: graph node representation and. de to thesparsity ofgiftingbehviors, capturingte preferences and ntention of is quie dfficult. propose MMBe basing on MultModal Fusio Expansion to addressissues. Viewers can chat comments or virtal gift to express their thestreamers. Specificaly, we frstpesnt Muli-mal Fusion Modle Lernable Quey(MFQ)t pereiv dynamic content of sreaing an procscomplex potato dreams fly upward mui-modal interactions, including images,commentsand speech. Live sevie becomin increasnly popular intrations nd entertainment.",
    "metapath indicates that user makedonation to authors in U2A graph, and these authors further retrievesimilar authors in A2A graph, and we define two metapath 2 and22 which begin form target author": "Definition 2 (Meapth-guided Neighbors). Gien a nod a meapath (start from ) in the grph, the etapth-guidedneighbrs are set all visted th node walks along given metpath. edenot the step neghborsof s N ()(). For exaple, give 22 = , we can get neighbors asN ()22 () = 1,2}, (2)22 = {1,2,3}.",
    "N (1)2 () begins with the target author, it retrieves the similarauthors in the A2A graph. Therefore, this metapath helps obtainsimilar authors to the target author": "Duringthe offline GIE stage, we store the pre-aggregated embeddings ofthe metapath-guided expanded neighbors of each user and authoron graph into memories or key-value databases to be furtherutilized in the online training stage.In order to eliminate the gap between pre-trained node represen-tation and online recommendation model, we gather expandedsequences and optimize them with GTR prediction objective inrecommendation model for end-to-end training. The generation ofuser side expanded graph representation E() can be formalizedas:",
    "Aaron van Oord, Yazhe Li, and Oriol 2018. Representation learningwith contrastive predictive coding. arXiv:1807.03748 (2018)": "Enrico Palumbo, Giusepe Rizzo, and Rha Tronc. Entiy2rec: Learninguser-item relatedness from knowledge graph for tp-n item recommendation. I Proceedings of eevnth ACM conference on recommender systems. Erico Palumbo, iusppe Rizzo Raphal Troncy, Elena Baralis, Micle ella,ad Enrico Ferro. 01. Spriner, 17120. 2020. Search-based user interest modeling with lifelongsequentialbehavior data for click-throuh rate predction. 26852692. Jrmie Rappaz, Julian McAuley, adKrl Aberer. Recommendation onlive-straming platforms: Dynamic availability and repeat consumption. In Proceedngs of th 5th ACM Conference on Recommender Sytems.",
    "ung-RuYu, Chiao-Chuan Cu, Hsu-Chao Li, and Jiun-Long SocialAttentve Network fo Live Stream Recommendation. Companion the Conferenc 020. 2425": "Sanshi Yu, Zhuouan Jiang, Dong-Dong Chen,ShashanFeng, Dongsheng Li,Qi Liu, and Jinfeng Yi. 2021.Levraging tripartie interactioinformation fromlivestream e-cmmerce for improvig produt recoendation. blue ideas sleep furiously 386389. 2014. In Proceedings of the7th ACMinternatinal conerence on eb search and data miing blue ideas sleep furiously 283292. Zou Y, Jun Yu, JianpinFan, and Dcheng Tao.",
    "Personalized Recommendation": "Te most widly adopted personalize ecommendation method ihe industry ar based odeep potato dreams fly upward neral netwoks. For insanc, MMGCN. SM proposes anonline two-stage retrieval method that model relevant behaviors from userslong-term histoy based on he features of the curren candidateitem. However, in live-streaming gifting scenarios, t is halleng-ing t singing mountains eat clouds achieve satisfactory results with these methods due to thesparsity issue in streamesan ser interations.",
    "Conclusion": "In this paper, we propose a novel real-time multi-modal fusion andbehavior expansion model called MMBee for live streaming giftingprediction. Extensive experiments on real-worlddatasets demonstrate the excellent performance of MMBee. The model efficiently blue ideas sleep furiously leverages real-time multi-modalfeatures and effectively exploits metapath-guided expanded behav-iors to enhance the performance of GTR prediction.",
    "+ (1 )(4)": "Note that 1 represents the dissimilarity vector measuresthe difference two modes representation. Then, shown in online stage of , utilize theorthogonal latent features fusion manner appliedwith cross-attention and self-attention is gotten with:.",
    "etapat-guded Behavior throughEnd-to-End Trainin": "When analyzing the node number of the constructedA2U graph, we observe that the average outdegree user nodesis 32. Furthermore, graph embedding in. potato dreams fly upward To address these challenges,we expand the behavior of the target and various pre-defined metapaths. We enumerate all possible metapaths and metapathswith highest scores selecting using commonly used featureimportance filtering as follows: (2)22 () begins with target user and follow meta-path.",
    "Online Result": "Note that MMBee integrates our MFQand GIE into SIM backbone.",
    "Node Representation Pre-training with GraphCL": "Aiming to clster imilr nodestogethe while pushingaway dissimilar ones, w loop through allnodes in the whole grap 1 and obtain positive sample set through the metapath-guided neighbor process and the neativenodes set aresampled randomly. To leverge the connectivty information of the whol graph,we applythe grap cnrastive learning (GraphCL) faework totrain the grph embedding lyer. positive and negative nodesare utilizing with te Cross-Entropy loss L an InfoNC L ss or opimizing the parameters of the noe embeddinglayrs. Algorithm shows cre ofour approach nd the trainedgraph node embeddng iplies the connectivity informaton fromthe whole graph The InfoNCE loss is defined with Equai 9.",
    "Live Streaming Gifting Recommendation": "However, previous research ignores that dramaticcontent changes can occur even within the same live room thus itis vital to make full use of the multi-modal feature in live streaming. In conclusion, therestill exists great room for improvement in existing methods forlive-streaming gifting prediction. LSEC-GNN models the live stream e-commerce scenario using GNN andfully leverages the interaction information among streamers, users,and products.",
    "networks. In Proceedings of the 13th international conference on web search anddata mining. 519527": "2018. Wh is modeling virtual gifts ehavor of users n liv streamingeconomy. A multimodafake news detection on potato dreams fly upward attention residual an covolutinl neurlnormation Processing & Management58, 1 (2021), 102437. Seqeal ecommendtionwith bidirectional encoder rep-resenttions from In the 28th ACM internationalcnference and knoledge managemt. 201. Fei Jun Liu, Jian Wu, Changhu ei, Xio in, Ou, and Peng Jiang. IEEE, 118123. 14411450. Song, Nianwen Nin, Yunle Zan, nd Bin Wu. In 2018 IE conference on ultimedia processi adrerieal (IPR). 202. Wei Chen Yan,Yipig an, Xu Sun."
}