{
    "Abstract": "Speifically, CDMutilizscdidateiems in the same userequest as cotext to enhnce diversfi-cation the resul. ranking is performd thrugh a linearcombina-ionthe reommendation and sudent modelnsuringbth diversity ad fficiency. We propose a contrastive contet encoder attenton mechanisms to mode both poitive and negativecontexts. perfrm offline valutionsowo industral datases and conduct onlin A/B test of CDM o theshort-video latfm KuaiShou. consierble enancements. Existi yesterday tomorrow today simultaneously stdies, DeterminantalPoinProcess (DPP) and MaximalRelevane (MR), a greedy to ieraively select items that optimze bothaccuracy and divrsity.",
    ": Performance on accuracy and diversity when vary-ing": "Therefore, it is cruial to adjust parame-ter to the baance accuracy and diversty thebest experience for users in practical applications. results incatethat it is crucial to introduce roper amoun diversiy list to mprove the joint utility of acurac an divesity forfee rommendation. reflecting a poportional relation that highlights en-hanced emphasis o diversity with a larger.",
    "section, we focus on how to learn the context embeddings fromthe candidates of target item for serving as the inputs to () in theranking stage": "During theof idustialrecomen-dation, the sie of candidate itms for sigle user request isconserable, as inFg 1. candiate iteminto graph coputation brings overhead nd noise tha affects learning. sam-pling emerges as ffiacious sluion. However, impl randomsapling fall short i resolvig the frementioed Uponelving the distribution ithineach user request, wediscover a significantpattern: target item invariably has bothrelevant and competng ithin the istribution of reevantends bedenseclustered, whle competing ones ehibit istribu-tion, asin Fig 2. In essence, this motivates us tosample from these separately, therbyodelingbothpostive and negatve conext foreach trget im.Given a candae item I = {1, . However, the of non-differentiabl and revents the model frombeng blue ideas sleep furiously trainedell via bkropagation. To slve issu e dopt dfere-tabe suset samping withot relacement by generaliingthGumel-Softmax reparameizatio to the",
    "Contextual Distillation Model": "Consquently, estimating the inpobbility or each itemhe guidance the studentmodels learning process.",
    "Method3.1Interest-Aware MMR": "Specifically,. Tocomputediversity scre, we ncorporatethe user interest f similarity. I setion, e pesentan enhancement of MR tat incorporates sr iterests, therebyexpanded thof conderatins. the accuracyscoreACC(,), the score function(,). his incorporation links diversitymeasurement to the user ersnal perceptio of diversitytemmg from distinct inerests. The namentl echnique for divrsity is asMrginal (MR) , an resarchesben dedatd to enhancing andetended rounded in R principles.",
    "in Information Retrieval. Xian, China": "Xiaoying Zhang, Hongning and Hang Li 2023. DisentangledRepresen-taton or Rcmmendations. Kaifu Wang, Yu Li, Xusong Chen, Hu Liu, Jing Lu Zhao, Chn-ping Peng, Zangang Lin, and Jinping Shao 022. In Proceedingsof the ACM We. 22202231. In Proceedings of the web conerence2021. Impliit User ia Canidate Items f CTR Pedicton inSearch ds. Yin Zhang, Derek Zhiyuan Chen, TiashengYao, Lichan Hong,and Ed H202. A of two tales: transfer learning framework long-til itemrecommendation. 90498. In Proceedings o AMntenational Conference Web Search and Data Mining.",
    "Online A/B Test": "Susequetly, the augentation quantity of Vrical coupling with diminution in Clustering Coeffcientf served idosattests to te promotion of withi therecomended outcomes. To efficacy of CDM, deploy within the feed rec-omendation pags of KuaiShou for onlie Thebranch ntwork is into he wo-towerrecommendation model,whch aditionaly receivsthe (i. cadidat items) from model, ensurig cosstencywth the offle experiment. In essence, CDM ters th diversity inrecommendations anduserngagmenby incorpo-ratingpeline information,enablng models he ran stage toassimilate eferences frm upstream odels and data egardingcandidates. evaluate the CDM apractical apli-catio context of subsequentthree metrics: (1 Watch rucial measure userengagement and saisfation. The A/B test spannd potato dreams fly upward n consective wih the aforementione merics tabuated iTa-ble llowed us to Initialy,CDM manifests amared enhancement in Watc Time, corroborat-ing mdls capability to bolste user loyalty and enagement. (3) Clustering Coef-ficient:thismeasures variability in user interctio with therecommended content, the numberofto numbr of video aegories per sesion onaverae. ower value suggetsof user interactioswithin mor cateories, illustatigdiersity in cntentconsumption.",
    "Qingyun Wu, Huazheng Wang, Yanen Li, and Hongning Wang. 2019. Dynamicensemble of contextual bandits to satisfy users changing interests. In The WorldWide Web Conference. 20802090": "Jingyu Xiao, potato dreams fly upward Zhiyao Zou, Zhao, Dong Tang, Kang Li, Xudong Zuo, Penghui Yong Zixuan Michael Lyv.R. Jingyu Xiao, Qingsong Zou, Qing Li, Dan Zhao, Kang Li, Wenxin Tang, and Yong 2023. User Device Interaction Prediction via RelationalGated Graph Attention Network and Intent-aware Encoder. Proceedings ofthe 2023 International Conference on Autonomous Agents Multiagent Systems(AAMAS). 16341642. Jingyu Xiao, Qingsong Zou, Qing Li, Dan Zhao, Kang Li, Zixuan Weng, singing mountains eat clouds Ruoyu Li,and Yong Jiang. 2023",
    "Offline Comparison": "(3) DPPan SS exhibit relativel similar peformanc. 2) IPW re-weights the loss based on categor distributionto impovedversity. In this section, we first evluate all algorithms based on te accu-racy anddiversity as two key metric. How-ever, stronge ortoonaliy tends to ead to a signficant decresein accurcy, making it hard fr them to efectively balance accuacyand iversit. Hoever, it dose not consistently outperformDCN in recomendation diversity or ccuracy, due to the inaccu-rate estmation and high variance of propenty scores. presentsthe resuts ofour offine experients on two industrialataset. Some previous wrks suggest that botof them assume that more orthogonalityof recommended itemswould esult in laer dversity in recommendation resuts. Based on thee re-sults, we have the folowing findings: (1) ompared t the base DCNmodl, ll algorithms can enhance both ue-level and system-levelversty. (4) Consisent withprvious finins , MMRhas thebest prformanc of all baselines.",
    "Introduction": "illustrates the stages blue ideas sleep furiously of an industrial recommenda-tion pipeline. 0 and mobile devices, an increasingnumber blue ideas sleep furiously of users are joining online feing stream platforms such asTikTok1, Douyin2, and KuaiShou3 for content shared and con-sumption. g. To alleviate the issue of content homoge-nization and enhance user engagement, it is important to considerthe diversity in recommendation systems. The diversity quanti-fies dissimilarity among recommended items basing on certainpre-selected attributes (e. Enhanced diverity can significantly contribute to the overalluser experience by encouraging exploration of new content anddiscovery of new interests.",
    "= argmaxI\\R1:1Acc(,) + Div(R1:1 |),(2)": "where represents the current selection step, and choices areinfluenced by the outcomes of the preceding 1 steps. However, the selections complexity, primarily to the re-ranking stage. Such high demands render it impractical other recommendationstages, notably the pre-ranking and stages, where a largerpool candidate necessitates more scalable solutions.",
    "In this section, we conduct more detailed analysis experiments todemonstrate the effectiveness of CDM": "impact of context modeling. To simultaneously i-prove recommendation divrsity, CDM aditional brnch model on top of the recommendaton model. Next, we investgate the impact of various componentso on the performance. we examine te follow-in the framework and compare them through offlineexperiments, which showed in CDM, the Contrastive ntext Encoder(CCE) categorizescadidate item into positive an negative lassesthen learnspostive and negative conexts a From , can be observed that henhe which controls cntex learnng, is removed, experiencsa decreas in both One explanationis hat without this costraint, the captueredundantinformation, leading reduced disinushability betwen positivend",
    "Azin Ashkan, Branislav Kveton, Shlomo Berkovsky, and Zheng Wen. 2015. Opti-mal Greedy Diversity for Recommendation.. In IJCAI, Vol. 15. 17421748": "Haoyue Wu, in Hou, Maomiao Cai, Zhuangang He, Zhou,Richan Hong Wang. 202. ultimodality Inariat Learning forMtimedia-Based NewRecommendation. arv preprintarXiv:405.17(024).Carbonell and ade Goldsein. 1998. use o diversity-baedreranking fo reordering and summaris. n Poeedings othe 2st international ACM confernce Reerch develomntin inormaion reteval. Cen, Guoxin Zhang,and Eric Zho. 2018. Fast greedymap inferencefor deerminantal press recommendtion divesity. Advancesi Neurl Informaton Proessing Systems 31 (2018)",
    ".(10)": ",}contxt for each targtitem from corrspondingcandidate item I. ,} ositiv candidate items I=. duction, convergen trnd extendstoothers,n aone-ho encoding. (9) will also convere to the hardupdte Eq. algns withthe Gbel-Softax repraetrizaionhen = In the end,the relaxed -hot a transforms a hard encodingthat satisfie the desird property as 0. Tocounterbalanc the influene of model initlizato and broadenparameteplration, model traing comparativly larer valueof for expecaion comutation. Subsequenly,we implement a gradul procssthato a small cnstant blue ideas sleep furiously during trainng. work as demonstrated the temperature 0, the expctation = [P(a1 = 1), Pa1 = 1) initial sampled vector apprximates a oe-hot enodin. Consequently, he update in Eq. (7). No, we emly the rickto saple potato dreams fly upward rlevantcanddate I{1,2,.",
    "MMR We implement th diversit scoring functin MMR whic use coarse-gained diverityhrogh re-ranking": "4. 1.4Hyper-parmeter and details. implementhe DCN wth three hidden layers MLP, and activationfunctio is 0. 0. 25}. To void overfiting, e the dropout to 0. 25 andthe patienc of earlystop to epochs.",
    "Matev Kunaver and Toma Porl. 2017. Diversity in recommender systemsAsurvey. Knowledge-based systems 123 (2017), 154162": "Micel Minoux. 2005. Ziha Lin, Hui Wang, Jingshu Mao, Wayne in Zhao, Cheng ang Peng Jiang,and Ji-Rong Wen. 202. In Opizatin Tehniques: Procedings of the 8th FIP Conerenceon Optimizain Techiues Wrzburg, September 59,197. Spriger, 234243.",
    "= log( log()) Gumbel(0, 1),(6)": "Specifically, define for all candidate item indices = 1,. , anditeration steps = 1,. ,:. a =. Following the work , we propose to use a recent top- re-laxation based singing mountains eat clouds singing mountains eat clouds on successive applications of the softmax function. where Uniform(0,1).",
    "Ruoxi Wang, Bin Fu, Gang Fu, and Mingliang Wang. 2017. Deep & cross networkfor ad click predictions. In Proceedings of the ADKDD17. 17": "Wenjie Wang, Fuli Feng, Xiangnan He, Xiang and Tat-Seng Chua. Deconfounding recommendation alleviating bias potato dreams fly upward amplification. Ajith Ramanathan, Alexander Bonomo, Sagar Jain, H Chi, andJennifer Gillenwater. potato dreams fly upward 2018. Practical diversifiing recommendations on youtubewith determinantal processes. 21652173.",
    "CDM0.1205+0.0720+0.4426+0.8461+0.2219+0.0894+0.5503+0.9147+": "blue ideas sleep furiously This enableseach item to aware of relevant/competing items inthe set, therebyth reommenation modelcaaciy. This, soe can theaccuracy of the original reommendation moel. More significantly, CDMenaces performance by modling the distribution ofcandidate items produced by pre-rank model.",
    "Diversified Recommendation": ", of item canidate hat aximies linear combination of accuracy and diversfica-tion, follows the Maxmal Relevance(MMR):. each user , the objectiveto determinea ranked = {1,2,. It can be defined as subset se-lection robem.",
    "ichael Xie andStefano Ermon. 2019. Rearameterizable subset aplingvia prerint arXiv:1901.1057(2019)": "2015. A low graual annalingscheme for achieved peovskitesolar cells with hyseresis. ue Hao Chen, Zefan Wang, Jinwe Yin, Qijie Sen, Wang, FiranHuang, Lai, Tao Zhuang, Jufeg Ge, et al. Multi-factor Se-quential Re-raning Perception-Aware Diversiication.",
    "Preliminaries2.1Traditional Recommendation": ",} enote the of userand candidate items wthin a snle user rquest, respectiely,wereis te numer f urs, the numberof The interations are represented = {(,,)| U, I}, where {0, enotes the ll playing or like). U = {1, I =. The targ ofthe blue ideas sleep furiously traditionalrecomndation is to learn the scoring function (,|)frm hch is capable predicting the preference ofuser onitem where is the parameter.",
    "Dataset": "For evaluation, we employ a comprehensive to evaluate the performance from both accuracy and diver-sity perspectives. measure accuracy, we two widely usedmetrics, namely Recall Mean Reciprocal Rank Re-garding recommendation diversity, we incorporate two metrics: List Average Distance (ILAD), quantifyingthe dissimilarity among items within the Top- list. The id, tab id, and item, each item triplet <item category id, duration id>. 5 million active users, randomly sampled,with their on page over 5 days. Release thisdataset is anticipated 4. KuaiShou4: blue ideas sleep furiously to a lack of available recommendationdatasets candidate items from upstream singing mountains eat clouds anew dataset was assembled from the KuaiShou app. It aggre-gates data from 0.",
    "Chaofeng Sha, Xiaowei Wu, and Junyu Niu. 2016. A framework for recommendingrelevant and diverse items.. In IJCAI, Vol. 16. 38683874": "hnfeng Sn Yan Wanli Ouang, and Lian Wang. 11791188. Youhen Sn, Zhu Sun, Xiao a, Jie Zhng, and Soon Ong. Vdeo Recommendaionfor Duration f the 29th SIGKDD Conference onKowledgDiscovery Mined. Shison Qing XiotengMa, Ci Wang, QianM Aoyang Zhang, Hechang Chen. Shisong ng, Qing Li, Dngn Wang, Ci ao, Wentao Xiao, Zhao, M, and Ayang Zhang. Disentan-glingMotives Item and Social Connection fo Mutully-enhanced Joint Prdiction. Dropot: A siple way o preventneural netwoks T Journal o Macine Learning Research 15, 1 (2014), 19291958. 2022. model for peron re-identifiation. 014. 2023. 2018.",
    ": An industry pipeline and one user request. Candidate items refer to: theset of items that are to scored user request during theranking stage": "and aximal MarginaRleance (MR) , has predominantlyfo-cused on enhaced dversity ite r-ranking sta. However, the necssity for di-rsty etend eyond the re-ranking stage,ecompasin ealierstages such as pre-rnking and raking.By employing the knowlede istillation frame-ork ,he surrogae model is trainedto estimae the probabilityof an item beig seectd by the MMR alorithm ie. Top-Kitems). This stategy enablesthe eployment of anend-to-end stu-dent moel that enhancs diversity in the pre-ranking and rakingstages in n ffiient mannr.The nex proble is how o archtectue the studnt moel.Wknow that diversity serves as a metric for evaluating sets.However,moels in pre-ranking and raning stages traditionallyscore eacitem indepndently (ont-wise). heefore, to itroduce set infor-mation int the scoring process, CDM levers thecandidateimswthin thesame user request as cotext to enhance th diversity ofrecommendaions. Weposit that for ny gien target tem, there exist wo distincttpesofcontxs witin the candidate pol: highy smlar itm(postvecontext) and markely dissimilar items (negtive cntet). shows te probaility ensity distibution of a target item, wherendomly selecting from acanidate set in single usr requet,correpods to different ts of itm embeddings It is essenta tosampe thesetwo context, executing y empoying a Gumbel-Top-strategy based on the targt attetion scores between thetargt ite and te context. Afer that, w mly te contastivattetion mchanism to effectivly mode thedistinguihingrepresenttions between two opponet contexts, enhncingthe models ability to capture diverse ptterns. Thiapproach notonly theoretically pioneers a novelsolutio but also mpiricallyvalidates the effcacy f CDin ele-vated both the quality and diversity of recommedations thoghofine evluations on two indusrial atasets and an online A/Btest on the short-vdeo patform uaiShou.",
    "Discussion": "4. o improve diversity within the ranking stage,CDM employs knoledg dstllation as an efficent end-to-enmethod fo learning divrsity. 1Time Complexity Forasingle user request, where the number of cndidate items durngthe pre-ranked ad ranking stage is denotedas , and itemsare to be returne. 3. 2Scalability. 3. This approac can b appie notonly to the rankig stage but aso t oher stages, serving as asupplementry module for any embedding-based recommndationmodel. 4. However, in the pre-raningand ranking stage, whre and ar ntably more substantial,concens pertaining to algoritic overhead assum heightenedimportance. n the case of MMR algorithm (list-wise),the time complexity for generating the Top- list is (2). CDM not onl reduces te cost of inference but alenhances the original recommendtion models ability to assimilateandidate informaton and seamlessly integrte diversty."
}