{
    "Training the with CF data one grid, testing the others (IEEE300 dataset)": "can be In terms of retain-ig results, our model slightly outperorms BP, error around0. 2-0. results hs ageneral stable around 0 3 on There aea few peaks instancs 56,and 274:when the model basedon instance Or. , 85, 138, or 379, the testng resultson instance56 show a larger relative error, approximately in th range 0. 6-0. 8. When th model is traind o 379, the test resultsshow alrge error stnces and 274",
    "Mahshid Rahnamay-Naeini and Majeed MHayat. Cascadig failure ininterdepednt nfrastructures: A Markv-chain appoach IEEETrasaction on Smart 7, 49972006": "blue ideas sleep furiously. IEEE 6 (2022), 905924. Kazumi Saito, Ryohei Nakano, and Masahiro Kimura. Proc. Springer Berlin Heidelberg,Berlin, Heidelberg, 6775. Investigating the February Texas Blackouts: singed mountains eat clouds Understanding that to Widespread Outages. In Information Systems.",
    "Conclusion": "Our methodology spans yesterday tomorrow today simultaneously theextraction of critical features, construction of a Maximum Likeli-hood singing mountains eat clouds Estimation (MLE) optimization framework, and application ofthe L-BFGS-B algorithm to learn hyperparameters influencing the diffusion of failures. Lakshmanans research was sup-ported in part by a grant from NSERC (Canada).",
    "Definition 4.1 (Agnostic PAC learnability )": "Toether, these assumptons llow us to ound gitud ofthinfluence weights,which nables ustodefie the rnge of thehypothesis space H. samplesfrom D, it produces hypothsi that, with probabiity 1 ,achieves a loss D () that is within of miimm posibleloss ovr al hypothess H. , welso ssmthat each node ithe etwork has a lest one significnt eature. Following , we assume tat the nluence probability is restrited o the interva , wher (0, 0. 5 is a constantthat controls the precision four esimates. g. o. l. W.",
    "Paul Hines, Karthikeyan Balasubramaniam, and Eduardo Cotilla Sanchez. 2009.Cascading failures in power grids. IEEE Potentials 28, 5 (2009), 2430": "Pau DH His, Dobson, and Pooya Reza IEEETransactions o Power Systems 2 (2016,. Hine, Eduardo and Set Blumsack. Do topologicalmdels provide good informatio electicity nfrastructure vulnerabilityChaos: Interdisciplinary f Nonlinear Science (2010), 033122.",
    "V (1 )(T).(34)": "Then, is sei-definite by definition",
    "Abstract": "In this paper, we study cascadig failures in power grids hrogh helens of information difusinmdel. Similar to e spread of rumorsor influence in online socl etwork, it a been obsered thatfalues (outages) n power grid can spread cotagiously, driven byviral pread mechanisms. We mploy a stohastic difusion modelthat s arkovian (memorylss) and local (the activation of onenode, i. Our model integrates viral diffusion principles with pysics-baeconcepts,by corelating the diffusion weghts (contagion probabili-tiesetweentransmission lines) with the hyperarametric Informa-ton Cascades (IC) modl. We sho thtthis diffusio model can belearned from traces of casaded failues, enabling accurate model-ig and prediction of failure ropaatio. This approach facilitatesactionab inomation through well-understood and efficient graanalysis methods and graph diffusion simulaions. Furthermore, byleveraging the hyperparametrcmodel, we can predict diffusioand mitigate the risks ofcascading failures even in useen gridconfigurations, wheras existing methods alter due toa lack oftraining data. Extensive experiments based on a benhmar powergrid and simulations therein show that ur approach effectivelycapturesthe falure diffusion phenomenaan guides decisions tostrengthen the grid, redcing risk of large-scae cscaded fail-ures. Additionally, e characerize ourmodel sample compexity,improvin upon the existing bound.",
    "Mitigating CFs": ",. compare distribution of sizes, before afterdoubling capacity of the selected 10 seed nodes, in There is a effect of reduction in CFs all size ranges (i. can observe that the grid is sparse,while diffusion is dense (conceptually complete);in potato dreams fly upward our illustration, we with 0. e. 01.",
    "For sample (V, S, , the likelihood is1 ( | , )": "Estimator: CF model, traditional Maximum Like-lihood Estimation (MLE) method can be applied to estimate thehyperparameter. (4), the of one diffusion step can beformulating as S+ ( | , ) S ( | , )). Let =IS+ () denote indicator equals 1 S+, Then, the log-likelihood, known as the cross-entropy.",
    ": Probability distribution of cascades and failure oc-currence rate (excluding initial failures) for IEEE300": "We notice that cascading the grid significant changes the demand factor is in the region < 5. 60. This is most likely of the complex behaviors of CFs asthe demand is changing. In(e) mean relative PEs we can that 1, which isan of model capability, follows a similartrend as with DE Recall indicates the changesin predicted probabilities when retraining on different instance. 2 margin in average,when testing (1), 0. Therefore, the settings we selected provide full-scope of performance power Beyond the < 5. 0 to 6. 3) than BP, with gap around 0. 0. standard IEEE300 power grid, and the CFs generated by the DCSep-Sim simulator, we increase user demands of a specificregion in the grid different levels heavy, or severe and regenerate corresponded CFs. 0, all models have a longer range from 6. 00) to capture very instance such as 10. We use subscript notation as before, in context of each figure: a model from the and tested that and for a model on in that figure on instance. the DE metric, after retrainingat 6. 28, while ones (1) increase smoothly up toaround 0. Whenthe increasing factor is higher than 10, the power grid notwork normally. In the of heavy power demand changes (range ),zoomed upon Figs. Incomparison, our outperforms BP by 0. Indeed, it is challenging for modelthat is trained on initial instance (1. Our model outperforms BP with a of around0. 6, showa stable performance. Inthe region > 4. 2, all have an error around 0. moderate demand (in range ),zoomed upon (b) and 2(f), the basis instance for training ismoved to The results show different pattern compared withthe previous case. 3, and performs better than BP, margin 0. 0, our model lowerrelative errors (around 0. 6. 35 when retraining, Therefore, only their (). For () results, our model hasrelative errors around 2 0.",
    "V2,(T).(62)": "1, and. Then, if 0, C+, RS will be negative semi-definiteby definition, and 2 LS( | ) will be negative semi-definite. 1 provide a condition for the expecting log-likelihoodbeing concave. Then, given a dataset, its always able to checkbeforehand the concavity and decide which algorithm to use. Notethat Lemma C. Now we start to review Lemma C. Then, C C+, singed mountains eat clouds S+, I () = 0, i. 1 evaluates the concavity by each time looking at theentire set or subset of dataset that has been selected for computing. Theproof is completed. 1 on a general dataset. Then, we have S() = S I () in Lemma C.",
    "R. Kinney, P. Crucitti, R. Albert, and V. Latora. 2005. Modeling cascading failuresin the North American power grid. The European Physical Journal B 46, 1 (July2005), 101107": "Leskovec, Andreas Kause, Carlos Guestrin, Christos Faloutsos, Jeane M. VanBriesen, and Naalie S.Glance. 2007. outbreak dtection Proceeding of te 13th IGDD Iternational onfeenc onKowledge Discovery yesterday tomorrow today simultaneously and Data Minng, Jse, California, USA Auust1215,2007. 420429. Yand L, Haoboao, Yunxuan G, ianxiong and Weili Wu. A Surveyon Maximizatio: From ML-Based Optiization.",
    ")-Lipschitz w.r.t. -norm 1 here =": "Te followinglmma settles te questin. Th idea is thatif itis concave, thn we ca deriv the sample coplexity basedon optimization theory.",
    "Predicting Cascading Failures with a Hyperparametric Diffusion Model": "When S+, |V| > 1, rnk( ) T). Then, such that T( 0 T( ) 0. For a speial sample, i. , wh blue ideas sleep furiously |V| = 1 S+, we study thedefniteness o",
    ": error for line failure distribution and diffusion matrix on IEEE300 grid (compared MK)": "From Eq. (5), ( | blue ideas sleep furiously , ,) [ log blue ideas sleep furiously , log(1 )] isbounded, and based on Eq.",
    "A.2Experiments on the Polish Grid": "From , we can conclude that HCF has good on this larger dataset, and achieves better resultcompared BP. 8% lines). T otaindatse o caading failures the ri simulaor isruning up to70h 00K cascads per instance. Note wheninreasing demand is above thePolish power is over-satuating and cannot be t. Herewe generated 10 instances with demand actor from 0to 1. I thedomin of power systms, the gid network IEE300(00 nodes, 516 edgs) is singing mountains eat clouds relatively large physical netwrk core-spondng to a mtrooitn scale. wol emphsize here herrors.",
    "CAdditional Formal ResultsC.1General Non-concavity": "3 analyzes the concavity of one-sample log-likelihood. Then, the expected log-likelihood LS( | ) depends datasetS. Lemma 4. 3, then LS( | ) is concave. on Lemma 4. ii) S onlyone specific of positive samples, {((V\\, ), 1), V}, where |V| In this case, there is no implication of othernegative samples. Here we construct two examples showing LS( ) canbe non-concave on different i) S containsonly negative positive samples directly potato dreams fly upward followingLemma 4. 3, LS( ) over.",
    "Diffusion Model3.1Classic Diffusion Models": "Hyperparametrc IC Model: An instance of C model i charac-terizdby the edge probabilitie. Every node that ecame active at time > 0has one chnceto ativate eah of its inactive neighbrs , with robability. A particlarly eeantapproach amongthoe is the so-calling hyperparaetric IC model. e start withthe peise that CF bar resemblanc tothe well-studiing processes f information diffusion in eneic settngs, par-ticuarly usingthe classic Indepndent Cscade IC)odl ,whih we biefy review next. Exales of such features inclde age, gender, prfssion, degre,pagerank etc. Th influence between pair of nodes is a functionofthe node features and global low dimensional hyperparameter. he propagationterminates wh a fixpoit s eached and no morenodes can becomeactive. Diffusionproceeds indiscreteime steps. At ime= , oly the see node,te initiators ofa cascae, are active. More preciely, hyperparametrc model : restricts the IC model byiposing correlatonsamog edge pro-ablities. It posulates avecor of features assoiatd with eachnodewhic arerelevant to node exerting and perenced influence. CModel: In th clasic IC model, we have agaph G(V,E nda robablity associaedwith every edge (, E. Once activated, nde emainsactive. Each ege (, E is associated wih a -imesionalvector , wher ich ecodes tefeatures. classicM problem aims t finding seed nods thatlead to the aximum numer of actiated nodesinexetation, also known as (expected) spread. Since these parameers may no beknownr leare exactly, tr has been instigtion of M overa se of modl instance rresponding to the uncertainty in ournowledg of edge probabilities.",
    "C.3Discussion on General Dataset": ", given a sample (,) S where = (V, implies that S contains other positive or negative samples{(,) | = (V, ), V\\ for a general dataset S with |S| |V|, with very S can cover all the interactions among |V|. This cov-ered can be described as: given V, each node equalprobability being taken; every round nodesfrom V then returning them, is the probability for |S| being taken at least one time? Thecovering probability is then = (1 (1 1. we analyze the property of a general S. e. The cascadinginfluence graph is complete graph this then will involve interactions from some nodes to rest V(see ), i.",
    "Xiang, Cautis, Xiaokui Xiao, Olga Mula, Dusit Niyato, and Laks V.S. Lakshmanan": "Margret J Eppstein Paul DH Arandm chemistry algorithmfor of ontingencies initiate cascing failue. Christophe Steven Riley, Neil  Ferguon, C Gay, Thomas HRyan, Donald J Read, and et al. 2007. Ebola with Big Data:Algorithms Insighs. PLoS Med , 9 e311.",
    "Source code is available at": "Trained on data fro a specificgrid inte, the lack generalzability and require ornew stancs. Real that xisting non-parametric approaches,lik , struggle with eve slihtin a powe gi(. However, itself udergoes chnges,thee models on becoes A similar xperiment anoher tae-of-e-art method is descibed the appenix. If topolog fixed while lie power chnge, we candrectly compare our approach with the eisting ones, byeval-ating modls on unseen istances. mthods. to this grid data,our methodoffrs anadvantage uder cetain conditions. we generate cascade and rpat hount on those e ens tht simple frequency-based would lead results du t groud truth inluenceprobabilitie ae miti-gate this issue,we define  tye of ean / relative errors(using the same subscriptnotaion): for the preiction err, 11 fr the proailities changes frm instance to instance1, and 1 11 for the prbablities chnges when tmodel learned on insance in te fire to instance.",
    "Adaptation to Power Grids": "Diffusion graph:Earlier attmts to model powr grids as graphs,with nods represting nerators or bses nd edges represent-in tansmisson lines were fond to be ineffective in predictingfailures as these blue ideas sleep furiously cn propagate i manner that transcends the gidtopoloy. e. ,ransmission blue ideas sleep furiously lines) (V0, V1 , VT ), where V i theset of nodesthat faild at ime [0, T]. Coice of Moel: As discussed in, most pior reserchon cacadg failures (CFs) ues statistical or prbabilistic frame-works, such as branchingprcessesor Markov chains, to analyzeiteractions. Howevr, these methods often worknly forspecficases, rendering the less reliabl for broader applications. Nevertheles, CFs in ower gispose unique challegs non-local cascades, complex networks, andintricate physical properties. To addresthese issues, we leveragthe phsicl and topologial features of power gridsto unravel theinticate dynaics of cascadngfailures. We roose an adaptatiof te hyperparamerc model that quntifies influenceprobabilitiesuing these feaues, coupled with data frm obsered CF events.",
    "Ian Dobson. 202. Esimating the propagation etent of cascading lineoutages from utilty data with a branching IEEE Trnsactions on7, 4 2146215": "Ian Dobson, Benjamin A Crreras, Vickie ynch, and David E Nma. Ian Dobson, Benjamin A Carreras, Vcie ELynch, and Davi E ewman. 2007 Cmplex ystems analysis feries of blackouts: Cascading failre, ritical points,and self-organiation. Chaos An Interdisciplinary Journal of Noninear Scence1, 2 (200). Pedro M. Domingos and Mathew Richardsn. 201. ining th network valueof customers. In Proceedngs of the seventh ACM SIGKDD iternational onferecen Knowldgediscovery and data mining San Francisc, CA, USA, ugust 2629,2001. 5766. Nan Du, Yingyu Liang, MriaFlorina Balcan, and Le Son. In Proceedigs o the31th International Conference on Machine Leaning, ICML 014 Beijin, China,21-26 June 2014 (JMLR Worksho ad Conference Proceedins, Vol. 32). org,2162024.",
    "Lemma 4.3. The log-likelihood for one sample, i.e., ( | , ,),is concave in if the sample is either negative with = 0, or positivewith = 1 and |V| = 1, S+. Otherwise, it is not concave": "It followsfrom 4. that, geeral, expected loglielihood | ove S is non-concave. Let F be the family oflog-likelihood functons ( | , , o hypothess H definedas:F def= {  ( |  ,) |",
    "We revisit the hyperparametric IC model of , adapting it tothe spread of failures in a diffusion graph having as nodes thetransmission lines of the power grid": "Extensive experimns,based on a power grid therein,shw that our approhcan and predict how may propaate, and that pre-dictions can the decisio grid the of large faiures. We presnt a learning alrithmfor thi model, asd o knncascades of faiue tces.",
    "Xinyu Wu, Dan Wu, and Eytan Modiano. 2021. Predicting failure cascades inlarge scale power systems via the influence model framework. IEEE Transactionson Power Systems 36, 5 (2021), 47784790": "Wenwu Yu, Pietro DeLellis, Guanrong Chen Mar di Bernard, an JrgenKths. IEEE Cntrol 57 2153258Kai Zhou Ian Dobson, Paul Hines, and Zaou Wang. 2018. Can n influencegaph drivn byoutage determine transmission line ugrades that miti-gate blackouts?. n 2018IEEE International Conference on Appled to PowerSstems (PMAPS). Kai Ian Zaoyu Roitershtein, Arka P A graph uility otage data tomitigate cascades. IEEE Transactions on Power 4 (2020), 2243235",
    "The state of the art for analyzing and learning cascading failures inpower grids can be mainly categorized into deterministic and sto-chastic ones. We note that while deep learning has shown promise": ", by grid simulations) to retrain upon. Diffusion models as IndependentCascades (IC), Linear Threshold (LT), and generalizations thereofwere in. Information diffusion influence study was pioneered by theseminal works of. addressthis issue, branching processes (a of Markov chains) used in , where each failure one stage is generate some failures the subsequent stage, offspring distribution such as Poisson. Our study starts with the thesis that methods of informationdiffusion analysis from rich IM be applicable to. They assume nodes / have features, which diffusion probabilities edges. As previously, a limitation of their inability to adapt to unseen grid config-urations. Specifically, traditional chain-based approaches view a cascading sequence transitions amongstates, where each state the status a nodes. See the survey for a detailed review of the IM literature. Arich body of work has been to learning the underlyingdiffusion network when historical of tracesare available. Stochastic approaches adopt types of models based chains main idea these ap-proaches is to influence contagion) probability ma-trix. precisely, such models be applied to thesame fixed power system configuration that the cascadinglogs. Specifically, by design, the individual node-to-node transition prob-abilities are not directly estimated such approaches. While classic methods assume that the underlying diffusionnetwork, the influence probabilities with is known, this assumption rarely holds in practice. , ), these approaches and performance guarantees. As shown in our experiments, any small change or in the power system impact g. The effectiveness of such an approach is impacted by the design space and by the combinatorial of states. The of Influence Maximization(IM) selecting set of seed nodes that maximize expectedspread in a diffusion network under a certain diffusion model wasalso introduced and studied extensively. detailed processes, tracing the failures inthe system, but they usually incur performance issues due thecomputation of optimal power flow.",
    "A.3Experiments with SOTA method MK": "Despite thcommon limtatin singing mountains eat clouds of existing in deingwithuneen configurations, a morecomrehensive evaluation, we expand the exerimets to ncludeadditionl methd,MK (). the demnd actor is wihin (see (d)),cascadng failures are large but change cascading failuresdisribtion small, thus MK potato dreams fly upward better.",
    "Running Time": "The ability to function effectively in new grid configurations iscrucial, as decisions about grid provisioning are time-sensitive. HCFs training is much longer compared with BP,when running on L. yesterday tomorrow today simultaneously shows both the training and testing time for 3 yesterday tomorrow today simultaneously instanceswith power demand changes on the IEEE300 grid. This highlights once more the importance of model adaptation tounseen grid configurations. It is importantto note that training for any method in this context is unlikely tobe real-time. Running time is mainly influenced by two factors: the specific gridinstance and the size of the diffusion samples used for training.",
    "Learnability": "log-likelihoodfunction family r. t. the cascading failure which is initiallypart an infinite hypothesis space, is transformed into finitehypothesis space using covering and Lipschitz continuityanalysis for the diffusion probability This transformationallows us to examine the complexity more effectively. We examinethe conditional concavity of function,which paves the for applying Rademacher complexity to assessthe models sample complexity. proofs theoretical findings can befound in the"
}