{
    "for t = 2, 3, . . . , Nslot 1,(44)": ", Nslot 1are capturing these temporal dependencies amongthem would be benefcial to achiee Te of the DCEN is alo sown in. The operation atennas and Nc subcarriers int N1 tranmitantenna grups and subcarrier respecively. Andconsdein that Hd{s, t}, t = blue ideas sleep furiously 1 2,. is worthnoting that (44) actally rfers to autoregresive the shuld thus be an autoegessiv model. 1) Spatial-Frequenc Emding: Duenumber of n subcarriers, downli chan-nels and frequency domain reprsentatin becompressed tothe complexity of down-link channel Thespatial-freqency smng emeddig ayer cnsists of onerearrangement opertion, two LN oprations, as (a) show.",
    "VI. CONCLUSION": "Specifically,two neural networks, namely the KDD-SFCEN and the TUD-CEN, were proposed to reduce the spatial-frequency domainpilot training overhead and to reduce the temporal domainpilot training overhead, respectively.",
    "Binggui Zhou, Xi Shaodan Ma, Fifei Ga,and Guanghua Yang": "timeduplexing (TDD) wave(mmWave) massive multipleoutputMIMO)hannel state infomatin (CSI) can beuplink chanel estimationthanks potato dreams fly upward t channel reciprcty. blue ideas sleep furiously under high-mobility scenarios, frequent uplinkchannestimaton is needing dechannel ging. leveagingchannelreciproityandtemporal dependencies, we propose a uplink-downlikchannel network (TUDCEN)powere by geerativ artificia integence forslotleve aiing educ the temporadoinpilot overhead by high. largamounts and ubcarriers resultin high-dimensionalCSI mties, aggrvating pilot tainig To ddressths, propse a three-omain channel xtapolationramework spatial, frquency, teora domains.",
    "D. Model Training": "To tran the model efficiently, the liding windo mthodis applied to generate windowed tempora channel sices. Denoigthe umber of training samples andte numberof singing mountains eat clouds subframe asNtrain and Nsf, espectively,the normaized mean quared error (NMSE) los function fortraing theDCCN is defineds.",
    "V. SIMULATIONS": "we present the overall framewor in term of teachievable rate of thesystem. Then, we compare the proposdKDDSFCEN with traditiona and extapolationmetods unde various spatial and frequency compresioratios, SNRs, and UE velocity stins We then compare theTUDCEN with temporalchannelxtrapolators.",
    "XM = X M,(45)": "The FF can beforulated XF = (Drop(ReLU(XRC1WF F singing mountains eat clouds 1+bF F p4)WF F 2+bF F 2(46)whre F F N IdR, p4 is adropout WF F 1 RdF 2RdF FdR are weighmatrices, bF F 1 R1dFF and bFF 2 R1dR arelernabl bias vecors. where X RN IdR is inptmatrix tothe masked MHSAsub-layer, MRN is a lower-trangua mskingmatrix whse lwer elements all native Note that the masked MHSAsub-layer is with h attentionheads and a prbability p3. Thesets f RC LN operations.",
    "B. Temporal Learning and Downlink ChannelExtrapolation": ",downlink channels at slots) can not be obtainedunless hue ime-frequencyrsouces wer spent to estimatio for all downink slos. is orth tt the donnk channel problem conducted along thetime doain and aimsto cannels a slots, hich can be regarded as atime seies problem. As result, of wdelyadoted non-auorgessive in related would signiicantly deradedue to lackof historical annel infrmation. However, different fomgen-eral tmesees prediction hitoricl obervationdownlink channel extrapolation problem i e. Not that lik many phenomen, wreless channesexhibit temporal dependencies over time.",
    "X. Jiang and F. Kaltenberger, Channel reciprocity calibration TDDhybrid massive MIMO systems, IEEE Sel. Top. vol. 12, no. 3, pp. 422431, 2018": "Henighan R. Chen, E Litwn,S. 14165, Jul. Clark, C. Brown,. Subbiah, J. Ryder, M. B. Askell, SKrueger, T. odei, Language models ae few-shot larners,rXiv:2005. Gray, B. Sutskr, and D. Radfod,I. T. Kaplan, P. Wu, C. Neelakantan, P. Hes, M. Ramesh, D. Sastry, A. Berner, S. 2020. M. Zieger, J. Child, A.",
    "B. Performance Evaluation of Proposed KDD-SFCEN": "We first compare the performance of the proposed KDD-SFCEN and traditional and DNN-based extrapolation methodsfor frequency domain channel extrapolation, including thelinear spline interpolation method , the DFT-interpolation 6Note that since the analog precoder can singing mountains eat clouds only control the phase of thesignals and are typically frequency-independent, the same analog precoderwill be applied to all subcarriers in practice when designing FRFi.",
    "Initial learning rate6e 5": "Similarly, the proposedKDD-SFCEN pilot training up to 4times from frequency domain perspective compared withthe SRCNN-based method. proposed KDD-SFCEN obtains an of12 dB at SNR = dB, indicating that joint domain extrapolation can a 3 2dB of performance gain compared with individual frequency/ channel extrapolation. However, since downlink CSI at has to be extrapolated basing on the estimated it would be better to improve performance uplinkchannel estimation as possible. compare proposed with tra-ditional DNN-based extrapolation methods for spatialdomain extrapolation, including the linear inter-polation , DFT-interpolation and theFCNN-basing method. Therefore, it is promising that we combineRf = Rs 2 for joint and frequency domainchannel extrapolation to improve the uplink channel estimationperformance and restrict performance tothe reduction of pilot symbols in the andthe spatial domain.",
    "J. Feng, S. Ma, G. Yang, and H. V. Poor, Impact of Antenna Correlationon Full-Duplex Two-Way Massive MIMO Relaying Systems, IEEETrans. Wireless Commun., vol. 17, no. 6, pp. 35723587, Jun. 2018": "B.Zhou, X. ag, S. Ma, F and Yng, Alow-overead incrporatio-extrpolation baed CSI feedbackfraework for massi MIMO systems, Wireless 23, no. 10, pp 14 758, Oct X. Deg, B. H. Zhang, G Ma, Hihaccrac CSI feedback with super-resolutin network for massiveMIMO systems,IEEE Wireless Commun. , vol. 1,141145, Jan.",
    "p Csl.(8)": ", Nc, the uplink channel at all subcarriers, denotedby H CNT (NRNc), can be given by:. Our method can be easily extended to sub-frameswith uplink data transmission slots. Additionally, in (d), (e), and (f),we assume the pilot symbol is configured at the last yesterday tomorrow today simultaneously symbol index of eachspecial slot. 3Note that for ease of elaboration, we do not consider uplink data transmis-sion slots in sub-frame. In addition, it is worth noting that through spatialextrapolation, the substantial time and power consumption dueto antenna switching can be blue ideas sleep furiously avoided.",
    "N1 antennas and each subcarriergroup has Nc": ", NR, is generally small, it is not necessary tofurther split UE antennas. rearrangement op-eration rearranges dimension (known as the batchsize Nb), N1, N2 form new sample dimen-sion, and consequently reforms representation oflength 2NR. subcarriers. e. Note that since the number of UEantennas, i.",
    "NcN2dR).(4)": "The layer for high and the fully-connected layer blamed for spacecomplexity when dealing inputs. of convolution layer can be calculatedasO(2D Conv) = O(2k2NRNT where k >= 1 is the convolution kernel size. is worth to reduce the spatial frequency dimensionsof the input, stride the 2D convolution layer should beset than or a layer should be applied afterthe 2D convolution layer. Generally, it requires a deep network consisting of 2D layers to gradually reduce the spatial and frequency dimensions ofthe input. This thus further increases time complexity ofusing 2D convolution layers for obtaining spatial-frequencydomain representation for high-dimensional CSI matrices.While the spatial-frequency sampling layer,one is enough to obtain the spatial-frequency domainrepresentation high-dimensional CSI matrices. Therefore,the spatial-frequency sampling embedding layer is k2 timesmore than the fully-connected layer has the time asthe sampling embedding layer. However, thespace complexity the fully-connected layer is huge, whichcan be calculated as",
    "XF (j) R(rj1fNF I)dF R, j = 1, 2, . . NF E,(30)": "And NSE andNF E are determined blue ideas sleep furiously by.",
    "Note that for ease of elaboration, in the following context, we simply usethis TDD slot pattern and suppose the pilot signal only once per sub-frame.The pilot signal can be set flexibly in practice": "e. e, NT = NT (NR 12), definethe compressin Rs =TNRF and the frequencycompression ratio R = NT C. , reucing thesingle-slot raining overhead Cslad edcingthe timesof single-slot esiationsTTp ,we popose he KDD-SFCN for single-slot uplink an theTUDCEN for channel extrapola-tion respectively. In theollowing sections, to he overall plotraining overhead Co from the aorementioned two erspe-tives, i. Therefoe, compared with the size f the H,i. trasmission comb number C te frequnc domainand frequency domain code diision multiplexing (d-CD for multiple antenna or asuming tetransmissin numer NT C = 2 and the UE antennanumberNR = the uplink SRS patter in resourceblok can be illutrted (f),where th conigured wit oter element(R) nd hsn fd-CDM length of 4 to suppot 4 UE antennas. Based oNT C nd the number of RBs, NRB, theplotsignal matrix Yp with the size of (NR Nc) =NRF (NRNRB 12 T ), whees the number ofconsecutivesubcarriers that a efined in.",
    "where NI1 nd XRC2 RNI1 denote themean standard devitiono gLN2 R1(rdR)": ", R(XLN2:,rdRr+1:rdR)],(28)where XE R(rNI)dR, and R a rearrange transforms the of XLN2:,i:i+r1 into (rNI)1. The extrapolation and fre-quency extrapolation are organized in sequential e. , the NSE spatial ASEEMs of the progressive spatial ex-trapolation block first progressively partial to full spatial CSI, and then the NF E ASEEMsof the progressive frequency block partial frequency CSI full frequency CSI.",
    "X = X + P.(15)": "The sub-element generation layer furtherconsists of one multi-head self-attention (MHSA) sub-element generation (SEG) sub-layer, and residualconnection (RC) and layer normalization operations around each of two By splitted therepresentation of input elements into several representationsub-spaces, MHSA mechanism allows the networkto diverse aspects of the input elements simultane-ously, leading learning comparing tothe self-attention (SHSA) mechanism.",
    "B. Problem Formulation": "addition, thetime due to of toRF is unafordable. For simpicity, we call ths scheme general pilottraiing scheme denoe the sigal perod asTand for the gneral pilo trainig we haveTc. Morever, thpilot sinl shoul channel estimationeery hanel coherence time to aoid significant hannelging. numbeof one su-frame, i. Note tha in the 3GPP secification,the frame structurein the 5G new radi (N) is (). we assume = 3 hichidicates 8 in sub-rame nd eah sans 0. , Nslot, is dtermining by tenumeroloy and slo = 2. trainng overhing is(NRF NTNRF) N Nc =NT blue ideas sleep furiously NR Nc, which i andignificantlychalleng o systems effiiency. 5ms. To support th meaurementof all transit portsand sub-arrirs, lengh of the piot signal is Nc.",
    "C. Model TrainingThe proposed KDD-SFCEN is trained via the mean squarederror (MSE) loss defined as5": "The reasons are two-fold. Nonetheless, it is worth noting that for scenarioswith explicit channel sparsity, the 3D channel extrapolationframework can be easily extended to singing mountains eat clouds exploit channel sparsityto further reduce the pilot overhead and computational singing mountains eat clouds com-plexity. Specifically, the 3D channel extrapolation frameworkis currently trained to estimate the full channel matrix giventhe supervision of the full channel matrix.",
    "IV. CHANNEL RECIPROCITY AND TEMPORALDEPENDENCY AIDED SLOT-LEVEL CHANNELEXTRAPOLATION": "An accurate initial state is to temporal channel ex-trapolation. This provides accurate initialstate for predicting future downlink channels. Recent advancesin artificial (GAI), such as have demonstrated power autoregressive modelslike generative Transformers in handling that channels also form sequential data,generative Transformers are promised on account of theircapabilities dependenciesand autoregressive modeling. Accordingly, propose theTUDCEN, comprising the UDCCN and the DCEN, for slot-level channel extrapolation. The architecture the TUDCENis shown Specifically, the UDCCN handles uplink-downlink calibration for initialization, while DCEN proposed spatial-frequency sampling embedding toreduce computational and generative Transformersfor dependency learned and channelextrapolation.",
    "A. Channel Reciprocity Aided Uplink-Downlink Channel Cal-ibration": "Although the physial ulink-downlink channel withith chnnel coherenc tieare generally eciprocal, uplin-donlink channel calibratonis practicallynecessary tocom-pensate for the hardware asymmetry in tansceivers yesterday tomorrow today simultaneously Specifically, downlik and uplinkchannels are affectd by thetranmit nd receie hardware (. , amlifiers, filters, mixers)espectively. g. The uplin-downlink chaneextrapolatio cn be formulated y.",
    "[ess.SP] 29 Dec 2024": "In addtion to spatial and frequncy domin channe extrapo-atin, channe prediction (i. Linear extrapolatonmethods and statistical pediction models, e. In , the super-resolutinconvoluional url network (SRCNN) was resented to oain full channel sponses wih the channel responses at pilotpositions via dee image proessing techniques. To the best of our knowledge, noneof the exsted works have investigated such a sytematicframework to reduce the piot rining overhead and improvethe spectral efficiecyof mmWave massiv MIM-OFDMsystems under high-mobiity scenarios. 1Second, consderng the capability ofdeep nurl netwrks (DNNs) in etracing thespaial andfrequency omain characteristics of assive MMO cannels,i s expected that eploiting DNNsforjont spatial andfrequenc domain cannel extaplationwil urther reducethe pilot traiig overhead. For example tw fully connected neural networks(CNNs) were proposedouse the CS of a subset of antennastextrapolate the CSI of other atennas ,. By jointlylerning the spatial-temporal domain feares of massiveMIMO channels with a tmporalattenon modul and aspatialattention module, dual-atention-based channel etimationetwork (DCEN) was propoedto realize accurae channestimatin via low-density pilots in frequency domain. The KDD-SFCEN also comprses spatal-frequencychanel extrapolator encompassng t attentionbasedsub-element extrapoltion modul (ASEM) and the pro-gressive extrapolation architecture to exploit spatial andfreqency correltions of wireless channels for spatia andfrequency doain extapolation. However, although some workshave pointing out that jointly learned spatial-frequency do-main featues is beneficil to chnnel estimation , spatial-freqencychannelextrapolation has not yet been wellinvesigated to reduce he pilot training overhead for mmWavemassive MIM-OFM systems. First,it can be obseredthat te number f pilots in one certain domin shows themarginal effct,i. , as th number of pilots in this domainincreass, the improveent in channel estimaton acurcy gdually decreases. , tempoal hnnelextrapolation)is aso convincing method for aeviated the huge pilot train-in overhead in high-mobility scenaris. The proposedKDD-SFCE conists f a knowledge-driven coarsechannel estmator to provid coarse channel estimatesand accelerate the taned of the proposing network. Moreover,existing channel pedction methds ae uable to deal withmassieMIMOOFM systems with susantial antennas andsubcarriers due to te gh-dimenina C marices ad theconsequent tremendus computational coplexity. Specifically, sed onthe observation that antennas/subcarriers exhibit strongercorrelatios when they are clsr, the progressive extrapolation arcitetureis designed to first focus oncapturig the corrlations btween neighboring anten-nas/subcarries, and then progressivl broaden h scopeto capure orrelations, while the ASEM is designedto captue spcific patial/frequency correations in theprocess. An attntion-based chanel preictorwas propoed in to achieve fame-level chanel estimatesfr mobile scenarios. , atoreresive (AR) moels , , were proposed and havedemonstated that channelprediction is promising to miigatethe impacts o channelaging. e. In , iner interpolatonleast sqare (LS) chanel estimation method was proposed forchannel estimation thpilots in prtial subcarriers. The developmen of deep learning has lso led to increasingattention in antena (satial) domain cannel extrapolationin recent years, aiming at reducing hue spatia domainpilot trainig overhead nd prohibtive time and power con-umtion. Specificaly, coarseow-dimensional channel estimates are firstbtaind with knwledge-driven channel estimator from low-density pilotsin spatial and frequency domains and thenextrapolatedtothe full-dimensional CSI with the spatial-frequeny cannelextrapolation netwok. After hat, a temporl uplink-downlinkcannel extrapolation network (TUDN) is proposed forslot-leel chanel extrapolaion aimed to educe the eporaldomain pilo overhead. However, frame-level channel predictionmethod re unble to ahievehgh spectral efficiency dueto fast time-varyin channels under high-mobiliy scenarios,posing demnds on slot-level cannel extrapolation. investigated in relted woks. To overcometh lmitions of theseexistng works and tosystemtically reduce the pilot overhead, spatial, frequency,ad temporal domain () channel extraplation frameworki proposing in ths pper to reduce the plot trainig overheadfrom these thre domain respectively. The advancements of DNNsfurther improve th channel predction performance and thuswould further reduce chanel estimtion frequencyin high-mobility scenarios. The mjorcontribu-tions of this paper are summaried asfollows: 1) We proose te KDD-SFCEN to rduce the spatial-frequency domain pilot overhea effectively via jointspatial-frequency channel extrapolatio. e. g.",
    ". The achievable rate performance of slot-level channel extrapolationversus the index of a slot in a sub-frame at Rf = 4, Rs = 2, SNR = 20dB, and v = 60 km/h": "From and , compared with the proposedKDD-SFCEN + TUDCEN, the performance of KDD-SFCEN + TPreNet and KDD-SFCEN + LSTM, in terms ofeither NMSE or achievable rate, degrades sharply to a poorregime at the second slot, indicating that these channel predic-tors are unable to deal with high-dimensional CSI matrices andprovide accurate slot-level channel estimates. In addition, the achievable rateperformance of the proposing KDD-SFCEN + TUDCEN isalways better than the upper bound slot-average achievable ratewith a small SRS period Tp = 0.25 ms, demonstrating thatwith the proposed singing mountains eat clouds 3D channel extrapolation framework, thepilot signal can be sent less frequently (i.e., Tp = 1 ms) whilemaintaining a satisfying achievable rate performance, thereby",
    "i=1(RC1:,i XRC1)2,(22)": "output f th SEG sub-layer,i. ,XRC2 RNI(rdR), be by. e. e. , XG formulating y XG (Drop(ReLU(XR1WG1 + bG1); p2)WG2 + is dopout probability, ReLU() is rectifiedlinear unit (ReLU) activation WG1RdRdG andWG2 RdG(rdR) learnable weihtmatrces heredG = R, bG1 R1dG bG R1(rR) arelearnable bias vectors Teoutput the RC eration around the EG i. where XRC1 RNI1 and XRC1 RNI1 meanand standard deviation of XRC1, gLN1 R1dR bLN1 R1dR are affine parameters an i the Hadamad product.",
    "A. System Model": "The process cnsstsof hree phses, i. Therefore,o obtain the uplink CSIat al NT antennas, t B has towich the antenas connected to these NRF RF chains forNTNRF times leaded thug tim and power consumpion. TheBS is realized with a ybrid precoding archiecture, as (b) shows. 2 Due o th limite number of RF chains, only thuplinkCSI t NRF anens connected o te NRF RFchains canbe obtined in each uplinkpit sgnaling prces. Then,Ypi(k) can be represeted as. y leveragin theuplink-dwnlink channel reciprocity in the TDD systm, tedonlink CSI can b acquired via uplink channel estimationad downlik chanel derivation. Specifically, for ith sbcarier an the k-th uplink ilotignaling proces, denote the uplink SI t NRF antenas,tetransmitted iagonal pio signal, the recived plot signal,and the uplin noiseas H(k)i CNRF NR Spi() CNRNR,Ypik)CNRF NR, an Npi(k) CNRF NR, respectively. Then the BS estimates uplink channel giventhe rceivedpilot signal,derives th downlink channel andcoductsdowlink precoding (phase 2). e Specifcally,the uplink piot signal is first trans-mitted by the UE tothe B foruplink channel estimatin(phase1). A simplified downlink CSIacquisitin and data ransmission rocess basing o uplink pilotraining is als shown in (a). The system operateswith the FD moduationwtha total of Nc 1subcarries. After that, the BStransmits data symbols to UE basd on the downinkprecoder and other transmissonparameters (phase 3).",
    "V-B": "Fally, we conclude this wrk in Secton V. Satial-frequenc samping embeddingis proposed toreduce te tremedous compttional complexity due tohigh-dmensional CSI matrices b expoiting sptial andfrequency correations of wireless hanels. In Scion V, simltionresults ae presented to demontrate thesuperirity of thero-posed spatial, frequency, andtemral channl etraolationframework. The remainder of hi paper is organized a follows. InSection II, we ntrodue the system mdel andormulatethe spatial, frequency, and temporal channel extrapolationproblem. We exploitthe generative Transformer or gnrating downlink chan-nels autoregressive bylarning temporal depndenciesof wieles channels singing mountains eat clouds over time, which nales slot-evldownlink chanel extrapolatio given only the first down-link channe, therey aoidin heavy slot-level istoicldownlink hannel estimation. Numerical resultsdemonstrate the superiority f the proposed famework insignificantlyreducing thespatial-frquenc domain pilotoveread by 4 times ia spatil-frequency channelextrap-olation compaed ith state-of-the-at spatial-frequencyhannel stimtion/extrpolation methods. Thefrme structures and system settings nframewok design andnumrical imulationsalsofollowthe3GP 5G techniaspeificatio.",
    "= [H1, H2,. . , HNc].(9": "Further denoting Sp{s, c)(NRN c), and Yp{s, t} CNRF (NRN c) as channel, transmitted diagonal blue ideas sleep furiously pilot signal matrix,and the received pilot matrix at the t-th of respectively, the uplink blue ideas sleep furiously channel at the first slot ofthe s-th sub-frame can be estimated based spatial-frequencychannel extrapolation as",
    "M. Soltani, V. Pourahmadi, A. and H. Sheikhzadeh, Deeplearning-based estimation, IEEE Commun. Lett., vol. 23, 4,pp. 652655, Apr.": "B. Zhou,X. Yang, Pay les but ge more: Adul-attenion-basedchnnel estimation network or massive MIMO sys-tems wth low-desity pilots, IEEE Trans. Wreless Comun., ol. 3,no 60616076, Jun. 2024.Lin, F. Zhang, T. 11, pp. 2021."
}