{
    "Jennifer Gillenwater, Matthew Joseph, and Alex Kulesza. Private Quantiles. Proceedings of the 38th Conference onMachine Learning. PMLR, 37133722": "Google. 2024. Xiangyang Gou, Long He, Zhang, Ke Wang, Xilai Liu, Tong Yang, Yi Wang, and Bin 2020. Sliding Sketches: A using for Data Processing in Sliding Windows. In Proceedings the 26th ACM SIGKDD International Conference Discovery &Data Mining for Machinery, New York, NY, USA, 10151025. Johannes Haug, Alexander Braun, Stefan Zrn, and Gjergji Kasneci. of the 31st ACM International Conference on & Knowledge Management (CIKM Jonathan Hehir, Daniel Ting, and Graham Cormode. 2023. PMLR, 1284612865.",
    "Odysseas Papapetrou, Minos N. Garofalakis, and Antonios Deligiannakis. 2012. Sketch-based Querying of Distributed Sliding-Window Data Streams.Proceedings of the VLDB Endowment 5, 10 (2012), 9921003": "Perrier, Hassan Jameel Asghar, and Dali Kaafar. Private Release of Data The Internet Society, 13 pages. Rivetti, Yann Busnel, and Achour Mostfaoui. IEEE, 151158. Smith, Shuang Thakurta. Advances in Neural Processing Systems 33 (2020),",
    "Haim Kaplan, Shachar Schnapp, and Uri Stemmer. 2022. Differentially Private Approximate Quantiles. In Proceedings of the 39th InternationalConference on Machine Learning. PMLR, 1075110761": "Christian Janos Lebeda and etek. Better Differentilly Approximat potato dreams fly upward Histograms and Hitters using Misr-GrieSketh. Efficiet Private Sttistics Succinct Sethes. TheAleksandr Nikolov, and Rebecca blue ideas sleep furiously N. InProceedings o the Thirteth ACM SIGMOD-SIGACTSIGART Symposium on Princiles of atbase Systems (PODS 11). 1982. Finding Repeated Elements.2005. Rasmus Pagh and Mikkel Thorup.",
    "Corresponding author.Cen Chen is also affiliated with The State Key Laboratory of Blockchain and Data Security, Zhejiang University, Hangzhou, China": "Authors Contact nfrmation: Yipig Wang, East Chna NormalUniversity, Shanghai,hina, ; Yanha Wan, hinaNrmal University,  Cen Chen EastChina Normal University, China,. For other uses, contac owner/author(s.",
    "Jalaj Upadhyay. 2019. Sublinear Space Private Algorithms Under the Sliding Window Model. In Proceedings of the 36th International Conference onMachine Learning. PMLR, 63636372": "Zheng Zhong, Shen Ziku Li, Decheng Tan, and Bin Cui. Associatin for Computing Machinery, New Yok, NY, 2660261. MicroscopeSketch: AccurateSlided EstimationZoming. 2022 OpenReviw 223. In the2021 IternationlConference on Management of Daa (SIGMOD 21). In 2020 EE Conference on Big Data IEE, 40834092. Sina ildirim Kame Kaya SonerHakan Erentug. In 29th ACM IGKDD Conference on Knowledge and Data Mining (KDD 23). Differenially PrivteSktches for Intermittet singed mountains eat clouds ueries onLrge Data Streams. Zhao, Dan Qiao, Rachel Redberg, Dvyakant Agrawal, Amr l Abbad, andYuXiang Wang. Associatin for Copting Machinery, New Yor, NY USA, 23752383. BurstSketch: Findin Bursts singing mountains eat clouds i Data Streams.",
    "Dnel Andersson an asmusPagh. 2023. Ainary Mechanism for Efficient Private Continual dvances in NeralInformtion Systems 36 (2023), 491334945": "Aproximate Counts and Quantiles over Slided Widow. Heav ies in steams and liding potato dreams fly upward windows. Association for Computin achiery, New York, NY, USA286296. Differentially Privt 2-Heavy Hitters in the Slided indowodl. Omri Ben-Eliezer, Dan MkulinceandIlias Zadik. n IEE INFOCM 2016 - The35th Annual IEE InternatioalConferene on oputer mmunications IEEE, 19. 2023. Arvind Arasu and GureetSingh Manku. 222. 2004. OpenReview. 2016.",
    "Vladimir Braverman and Ostrovsky. 2007. Smooth Histograms Sliding Windows. In 48th Annual IEEE Symposium on Foundations Science. IEEE, 283293": "Concentrated yesterday tomorrow today simultaneously Differential Simplifications, Bounds. Hubert Mingfei Li, Elaine Shi,and Wenchang Xu. Springer, Berlin, Heidelberg, 635658. Theory f Cryptography nternatioal TC 016-B, Beijing, China, October 31-November 3, 206, Procedings, I. In Privacy Technoloies - 12thInernational Symposium, PTS 212, Vigo, Spin, Jul 11-13 2012, Proceedings. Mrk Bun ad ThomasSteinke.",
    "SymbolDefinition": "stream; size of the stream, i.e., = | Domain of items; domain size, = | of the arrival of at time ; Sliding window at time ; window of item E in of hitters a threshold 1),Privacy parameters DPPrivacy parameters in zCDP,Error and confidence parameters in and PCMS,; H,Approximations of , and DPError parameter in approximations of , H,C; C(Non-private) potato dreams fly upward CMS; PCMS"
}