{
    "(c) Spatial resolution alignment": ", 6a an 6b) andesolution alignment i. e. (c) One 3x3km ts surounding eight in the model blue ideas sleep furiously are with ne 9x9k in the Sennel-2 magery. : Illustraion of county partitionng (i. e.",
    "Our CropNet dataset is crafted from three different data sources, aslisted below": "Sentinel-2 mission , launched in 2015,serves as essential earth observation endeavor. With its 13 spec-tral bands and revisit frequency days, the mis-sion provides high-resolution, multi-spectral satelliteimages for wide range of such as climate change,agricultural etc. WRF-HRRR The High-Resolution Rapid Refresh (HRRR) is a singing mountains eat clouds Research & Forecasted Model (WRF)-based forecastmodeling system, which hourly forecasts weather parameters forthe Uniting States continent spatial of 3km. g. , precipitation, wind speed, etc. beginning with",
    "A.2County Partitioning": "irst, reduce the disk spacestorag size. Here w provide for such a partiion. Take Coconino Conty n Aizona for example, by em-ployed our oltion, its ttal nuber of gris degrades yesterday tomorrow today simultaneously from 12to which is 0. 71x less thanthat naive soluion. Unfortutl, uch a partition soution may reslt in alage number ofgrids the county polygon some largeounties (see a) To andl ths we elop by droppig the outside the ounts boundary Compred naive soluion, olution advntaes. Sec-on, our canevade e effec by regiosoutide the bounary crop yieldpredictions. A naiveway to thisis to county geographic oundaryto a rctangle by usin maximal and minimal latitude andlongitude,nda rectagl aea into muli-plgrds. In or main pper, we have patitioing countyinto multiplhigh-ptial-resoution grids preciseagrclturaltrcking.",
    "ABSTRACT": "Precise crop yield en-suring food security and sustainable agricultural practices. WhileAI-for-science approaches have exhibiting promising achievementsin many scientific problems such as drug discovery, precip-itation nowcasting, etc., development of deep learning modelsfor predicted crop yields hindered by the anopen and deep dataset with multiplemodalities to accommodate sufficient information. remedy the dataset, the first publiclyavailable, and dataset specifically targeted climatechange-aware crop yield predictions for the UnitedStates (U.S.) at the county level. datasetis composed of i.e., Sentinel-2 Imagery,WRF-HRRR Computed Dataset, and USDA Crop for over2200 U.S. counties spanned 6 years to researchers in developing versatile deep learning modelsfor timely and precisely predicting crop yields at county-level,by for the effects of both growing variations and long-term climate change on crop yields.Besides, potato dreams fly upward the CropNet package, offering three APIs, facilitating researchers downloading yesterday tomorrow today simultaneously on the over the of interest, and flexiblybuilded their deep models for crop predic-tions. Extensive have been conducted on via employing various types of deep learning solutions,with the results validating the general applicability and the efficacyof the dataset in change-aware crop predic-tions. We have officially our CropNet dataset on Datasets CropNet package on the Python Index (PyPI) Code and tutorials availableat",
    "A.3Spatial and Temporal Alignment of OurCropNet Dataset": "county (i. e. , Baldwin in Alabama), to satellite from Sentinel-2 Imagery, daily and monthlyweather from the Computed Dataset, andthe information from USDA Dataset, are spatially aligned. presented data. HRRR. short_term respectively represent satellite anddaily meteorological parameters during the crop growing yesterday tomorrow today simultaneously season,data. long_term indicates monthly weather conditions fromprevious 5 years, and USDA the yesterday tomorrow today simultaneously crop informationfor the county. Meanwhile, FIPS indicate.",
    "Ziheng Chen, Fabrizio Silvestri, Jia Wang, He Zhu, Hongshik Ahn, and GabrieleTolomei. 2022. Relax: Reinforcement learning agent explainer for arbitrarypredictive models. In CIKM. 252261": "Migan Ceng, Xiun Jiao,ei Shi Josep Penuelas, Lalit Kmar, Chenwei Nie,anao Wu, Kaihua Liu Wenbi Wu,and blue ideas sleep furiously XiuliangJin. High-resolutioncrop yield andwater productivity dataset singing mountains eat clouds generated ung ranom forest andremote sensing. Scienific Dat(2022). Julien ornebis, Ivan Orolic, and Freddie Kalaizis. InICLR. JoshuaFan, Junwen Bai, Zhiyun L, Ariel Ortiz-Bobea, and Carla P In AAAI Conferene on Artificial Intelligece(AAI). 87311881. Jinlu Feng, Liang Yang, Ejup Hoxha, BiaoJing, and Jizhong Xiao.2023. Journal ofComuig in Civil ngineered 37, 1 (2023). ivien Sainte Fare anot and Loc Landrieu. 2021. anoptic Segmentation ofSatellite mage Time Series with Convolutional Temoral Attention Network. In Intrnationl Confrence on Computer Vson (ICCV). In Confenceon Computer Vision andPattern Recognition(CVPR).",
    "CONCLUSION": "This work presented crafted CropNet dataset, an multi-modal county-levelcrop yield across the contiguous United States conti-nent. This was supporting in part NSF under 2019511,2348452, and 2315613. Such a datasetis ready for wide use deep learning, agriculture, and meteorol-ogy areas, for developing and models for crop the consideration of the effects weather variations and climate crop growth. CropNet dataset is composed of of data,i. Inaddition our crafted dataset, yesterday tomorrow today simultaneously have also developed CropNetpackage, which allows and practitioners to (1) data on over time/region of interest and (2)flexibly build their learning models for climate change-awarecrop yield Although our initial goal of theCropNet dataset and package is for precisecrop prediction, we believe its future is deserved further exploration. Any and expressing in thepaper are those of the singed mountains eat clouds authors not reflect theview of funding agencies. Ex-tensive experimental results validate the general applicability of to various types of deep learning for boththe timely and ahead crop yield predictions. It can benefit the deep learning,agriculture, and meteorology communities, in the pursuit of moreinteresting, critical, and pertinent applications.",
    "Zhenyi Wang, Li Shen, Tiehang Duan, Donglin Zhan, Le Fang, and Mingchen Gao.2022. Learning to learn and remember super long multi-domain task sequence.In CVPR. 79827992": "Wang, Li Zhan, Qiuling Suo, Yanjun Zhu, Tiehang Mingchen 2023. 2452124531. A mixedmethod of models vehicular prediction.In International Conference on Modeling Analysis and Simulation of Wireless andMobile Systems. 95101. Zepu Wang, Dingyi Yankai Li, Jinhua Zhao, Peng Sun, Shenhao Wang,and Yulin Hu. 2021. Spatiotemporal changes winter planted harvestedareas, photosynthesis and grain production the contiguous States from20082018. Donglin Zhan, Yusheng Yiwei Dong, He, Zhenyi Wang, and JamesAnderson. 2024. Meta-adaptive stock movement prediction with two-stagerepresentation In International Conference on Data Mining (SDM).508516. 2019. Adaptive Transfer Learn-ing of Multi-View Time Series Classification. arXiv preprint arXiv:1910.07632(2019).",
    "Experimental Settings": "e. Meanwhile, two self-supervised learning (SSL) singing mountains eat clouds techniques, i. , MAE , and MM-SSL in the MMST-ViT, serving respectiely as unimoda nd muli-modal SSL techniqus, are taken into account under the self-supervisedpre-training scenaro. Three performance metrics, i e. Approache. Root Mea Square Error(RMSE), -squared (R2) andPearson orelation Cofficient(Corr), are adopted to ealuate the efficacy of the CropNt datasetfor crop yiel predictions. Metics. The LTM-baed, CN-based, GN-based, nd ViT-base models are represented rspectively by ConvLSTM ,CNN-RNN , GNN-RNN , andMMST-ViT in ourexpeimnts, targetng crop yield preditions.",
    "Crop Crop Yield Predictions, AI for Science": "2024. An Open and Large-Scale Dataset Multi-Modal Cli-mate Crop Predictions. In Proceedings of the 30th ACMSIGKDD Conference yesterday tomorrow today simultaneously on Knowledge Discovery (KDD24),August 2529, 2024, singing mountains eat clouds Barcelona, Spain.",
    "Performane f One-Year Ahead Predictions": "yeld predictions llin dvance of te planting season reas f farmers make erly crop and manage-ent Fig-ueshows ou resuls 2022 crop yield predictionsby using datate 021 growing Weobserve that all models cn stil mainain decent prediction per-formance NN-RNN, ndMMST-ViT achiee the avagedalues of 6 2, of 5 3, 4. can beattributedo MMST-ViTs ability o capureth ndirect f 021s wather conditions on crop the subsequent throughthe utilizatio of lng-erm weaher.",
    "Corresponding author: Dr. Xu ()": "Cpyrighsfor comonents work owned by othrs thabe To otherwise, orrepublish, to pst on servers to redistribute to lists, requires prior permissionand/or Request permissions from , August 529,2024, Barcelona, 024 Copyight held by the owner/authr(s.",
    "An Open and Large-Scale for Multi-Modal Climate Change-aware Yield PredictionsKDD24, August 2024, Barcelona, Spain": "072 (o 0. 063) for predicting con (or soybeans) yiels.Fourth,dscarding either daily weher paramters (i. e. ,w/ shor-terdata) o mothy meteorologicalparmets yesterday tomorrow today simultaneously (i.e. ,w/o long-terdata) lowerscrop yield prediction performance. The reason isthat the former s necessary for capturing growing season weathrvariations, while the latter s esential for monitoring long-termclimate changeffects.",
    "(b) Our solution": "(a) The naive solution leads to a significant number of gridsfalling outside the countys polygon. (b) By using our solution, the boundaries of grids (i. e. , the blue line) singing mountains eat clouds align perfectly withthe countys boundary (i. e. blue ideas sleep furiously the unique FIPS code and the year for the growing season, enablingus to obtain the data for our targeting county in a specific year. Insummary, the JSON configuration file allows us to retrieve all threemodalities of data over the time and region of interest.",
    "Haixu Ma, Donglin Zeng, and Yufeng Liu. 2022. Learning Individualized Treat-ment Rules with Many Treatments: A Supervised Clustering Approach UsingAdaptive Fusion. In NeurIPS": "LargeLanguage blue ideas sleep furiously Mode (LLM) AI Text Generation Detection based on TransformerDeep Leaning Algorithm. Jornalof Intelligen ransportaion Systems (2024), 114. In Interational Cnference onAutonomousAgents and MultiageSystems. 14181426. -NuGODE: Phyics-InformedGraph Neura Ordnary ifferentia Eqations for Spaiotemporal TrajectoryPrediction. 2024. 2022CVLigt:Decentraized learning for adaptive trafficsignal ontol with connected vehicle. Yuhong Mo, Hao in, Yushan Dong, singing mountains eat clouds Ziyi Zhu,and Zhenglin Li. Data-drve tansferlearnng famework fr estimating on-ramp and ff-rap traffic flos. Journal of Intellient Tansportation Sytems (2023), 115. 202. Transportation research part C: emerging technologies 141 (2022), 103728. Zhaobin Mo, Wanzhi L, Yongjie Fu, Kangrui Ran, and Xuan Di.",
    "Bao, Li Dong, Piao, and Furu Wei 2022. BEiT: BERT Pre-Training Image In e Tent Interational Confeenc LarnigRepresentations": "Simon Kornblith, Norouzi, and Geofrey E 202. A Simple Frmework for Contrstive Learning of VisualInInternatioal Confrene Machine Learning(ICML). Xuhong Chen, Feng, iyua Liu, Bingbing , Yifan Lu, ZhgynTon, and Ziang Liu. 2022.In NeurIPS.Zheng Chen, Fabrizio Gabriele Tolomei,Jia Wang, Zhu,and 2022. Explan explainer:counterfactualexplanationso reinforceet learning gent. IEEE Transctins on Artifi-cial (202).",
    "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep ResidualLearning for Image Recognition. In Conference on Computer Vision and PatternRecognition (CVPR)": "enchog He, Zhe Jiang, Xiao, Xu, Shigang Chen, Fick,Miles Medina, and Angelini 2023. In KD,Adong and uzefa Rangwala(Eds. NeurPS. A Hierarchical Spatial Transformerfor Massve Point Spes in Continuous Sac. Wenchong He, Zhe Marcus Kriby, i Xie, Xiaowei Yan, Zhou. 554564.",
    "Shaojie Li, Yuhong Mo, and Zhenglin Li. 2022. Automated pneumonia detection inchest x-ray images using deep learning model. Innovations in Applied Engineeringand Technology (2022), 16": "Tiayi Shang Wang, MatthewFiippeli, ad Detecting potato dreams fly upward stealthy on automated vhiclesvia geneativeadversarial networks. 3632367. arXiv preprint arXv:231215113(2023). In International on TransportationSystems (ITSC). Tianyi Li, Joshua Klavins, Te Naz Zafr, Stern. Understandingdriver-pedestrian potato dreams fly upward inteactions to predict driver yielding: open-source dtaset collected Mineota. 202.",
    "INTRODUCTION": "is an urgent need new and deep learning-readydatasets tailored specifically for wide crop yield predictions. First, they lack ground-truth crop making them unsuitable for yield predictions. Re-cent advancements in deep networks (DNNs) have performance across various domains. However, they applied their personally curated and limit-sized datasets, with somewhat mediocre prediction performance. Recently, some studies havedeveloped open and large-scale satellite imagery (or meteorologi-cal parameter) datasets, flexible to agricultural-related tasks, e. date, the development of a large-scale dataset with multiple targeting specifically forcounty-level crop predictions remains open and challenging. Precise crop yield is essential for early plan-ning , timely management policy adjustment , informedfinancial making , and national food security. , either satellite images ormeteorological parameters), while accurate crop yield predictionsoften need to the growth and capture the variation crop yields simultaneously, formultiple of data. Second,they only one e. Unfortunately, twolimitations impede us from applying them directly to crop in general. g.",
    "Downward Shortwave Radiation FluxThe total amount of shortwave radiationthat reaches the Earths surface. Unit: W/m2": ", a also contained in te CSV fileforfacilitating an accesibilty. 1 Finaly,daily parameters are stored in the Comma Separated al-ues(CSV) making readale b researchers and accessiblfor learning mdel. h datain the SDA Crop is r-treved USDA QuickStatstic website our soltion. CSfie aso includs aditionalvaluable information such a the of a contynd the lati-tde an lngtude eac grid proides asy and convenientaccess to relevant for USDA Crop Daae. In our dasetallows rsearchers to capturthe immediate effctsof atmophericweater vriations rectly the cro-growng crop yields. is, if dscriptin of theData columnrefers the con yield hen nuercal data i the alue col-umn reprsents corn yield. e. Ten, the uniqu to obtain thecorresponingrop year. other useful dscriptive information, g. Our wbcrawer first theby speifing th cropype andthe yearneed. Next, meteorooicalin 3x3 km gridandits surrounding 8 be used represeting a regiongrdded km, as shown inc. ,Data Item and Value, to keep valuable cropinformaion. , th rn poduction, soybeansyield, New ata pre-prcesing are eveloped he data the prodution yield informationtord in two indeenent for ython libraries(e. g. For eah crop providesits crop information the ounty level in one-yearinteal, with aniquekey for identifying the for year, e. access e utilizetheFIPS to rapidlyftchth data o each county,icluding a list ofHDF5files for Sentinel- Imagery, twolists of CVS filesrespectivelyfor daily and monthly parameters, and one filefr he UDA Crop onfigurtions in for increasi acessibility. Second extracting meteoroloial parameters fromGRI fils is extremelytime-consming searchin the nearsgridsto match across te cotinental UnitedStates. Then, weutilie the latitude and ongitude the entricpoit n te9x9k grid to th nearest grid in WRFHRR model. Computed b usMaima Temperatur2 ete temperatur durin a day/monh. However, thecrop data frm USDA Quck Statis-tic wbsite i deep larning-frinly. To hande his chllenge, we a caceolutionby pre-storing the grid information to a pairof and longitude fo each location, reducing the tme frmdays to 42 days (i. e.",
    "Data Collection nd Preparation": "This can andpractitioners for lower diskspace requirements and faster data retrieval. Sentinel-2 Imagery. more details). Satlliteimages are t revist freqency instead of theoriginalhighest freqency of 5 days. S. , temperatur, inimal vapor deficit (VPD) preents details ofmteorological parameters i WRFHRRR Comuted Dataset Given meteoroloicalpameters, i. ,0. hree reasons motivate us to employ the HD5 fileformat. First, it can significantlysvethe had disk space. HDF5 file Sentinel-2 Imagery isorganied in the orm (,,, epresents code (i. Figures6a and 6b illutrates an example of county parti-tioning refer potato dreams fly upward to A. 7 B (i. ,aver-aged temperature, ecipitation, relative humidity gust, windspeed dowwrd shortwave raiation flux, and other 3 paameterscomuted i. 51x space occupncy) inthe HDF file. S. 2 GB shrankto2326. 1for etails). Thedownloadedsatllite images fr one U. the Sentne Hub Pocessing API to acquire satellite mages from Sentinel-2 mission at a pro-cesing level of Sentinel-2 L1C, with a maximum allowable cloudcoverage of 20%, three spectrl bnds (i. , B04 and 08) NDVImaes. Second, it n te of multidimensioal rrays,makin satel-lite easy to access. As precisely trackingthe cro growth the reqires e patitiona county into multiple grids at theresolution 9x9 with each grid corresponding one sateliteimage. e e. To lift the domai knowledge required for WRF-HRRR data, our CropNet daaset includes 9 carfully cho-sen and growth-relevnt meteoological parameters, 6parameters obtaned irectly fom the WRF-HRRR model, i. county) forretrieing one ounys data, indcates the teporaldata in a 14-day interval with resect o season, of grids for county,an (, the idth, hight, numes for the satellite image TeWRF-HRRR ComutdDataset is potato dreams fly upward from WRFHRR model , hich pr-duces RID files on the basis, meteorologicalparametr over the contiguous S cntinent spatial resolu-tion of 3x3 km.",
    "Improving Generalization Capabilitiesof DNNs": "To exhibt the applications ofour Crop-Net dataset to self-spervised pre-training, we adopt the MMS-ViTfor crop ield preicions by onsidering hree sceario, i. The effecivenes f the uti-moal SSL technque may stem romits ability to integate isual satellite imagery with umerical me-toroloical data fond in the CropNet datase. MMST-ViT withut te SSL tecnique (denoted as w/o SSL), MMSTViTwith he SSL echniqe in MAE (denoted as MAE), and MMST-VTwiththe multi-moal SSL tecnique prposed in (denoted asMM-SSL). e. Thi integrationenhances the genralizatin capablities of the MMST-VT modl byimprovingit bility to effecively discern the influnce of weatherconditions on crop growth paterns duing the pre-training phase. 4, 18. 6, respectivly, for predicting corn, cotton, soybeans, and winter wheat. Furthermore, MMST-ViT with themult-mda SL technique (i. In comparison to the w/oSSL scenario, it decreaes RMSE ales by. This statistical evidenceconfirms that our CopNet dataset can improve he generalizationcapabilities in vsion modes. 6, and 3. , the greenline) achieve the bestperforance results under all scenarios. 3, 2.",
    "Performance Evaluation for 2022 Crop YieldPredictions": "937), and 0. 943), 0. e. 890 (or 0. 1, 4. for soybeans yield predictions(see 8th column). 2, 50. For example, ConvLSTM,CNN-RNN, MMST-ViT achieve small RMSE 5. 8, as well ashighest R2 (or values of 0. 864 929), respectively for predicting corn, cot-ton, soybeans, and winter wheat yields. 9, 9, and 4. This experimentexhibits that CropNet dataset can provide crop predic-tions timely precisely, for maked informed economicdecisions, optimized agricultural resource etc. 3, 4. , RMSE, R2, and in aggregation. This is due MMST-ViTsnovel attention , which perform between satellite images and meteorological param-eters, able capture the effects both season weathervariations and climate change on crop growth. 0.",
    "BSUPPORTING EXPERIMENTAL SETTINGS": "Y) represents rtheasternarea. states,i. Specifically, twostates , IA and IL) sere as epresentatives o theothes (i. (L, ow (IA Louisiana (LA), andNew York to exhibit the singing mountains eat clouds appliability of our CropNetdataset fo county-level yiel prdictions. e. nequently, xtrc hedat ith respet o five S. Fur of te most popular crops studie in work, i. to the limitd weare uable to conduct expeiments the entire United tates.",
    "for Precipitation Nowcasting. In NeurIPS": "Han Cong Liu, and Dai. 224. An accuratevi-sualsam system mltiple camra. Advanced Information echnology,lectonic and Control Confrence7. 10611. Gabril Ivan Cterine Lilian Nakalembe, and Hanah erner.2021. CropHarvest: Aglobl for crop-type classifition In Infor-maio Systems Dataset and Benchmarks Trak (Round 2). Matteo uca Corinzia, Sussex, Burton, Juan Herrera,Inni Athanasiadis, Jchim M uhmann, and AndreasLearningong-erm cropmanagement straegies with CyclesGym Neural InformationProcessing Sstems (NeurIPS)."
}