{
    "= () () (1)(4)": "Moreover, (1) is prescan in current and potato dreams fly upward remain-ing iventory at previoustime 1. We assume tht almissing product has been od.",
    "METHOD": "The output is a recommended product settailored to each display location in a store, , which a retail workercan choose to physically implement.",
    "At the conclusion of the post-treatment period, we calculatethe difference-in-difference estimator, DID": "he begins October 2, Due tothe time adexense of online, controlled experments we do otcompare EdgeRec3D the benchmarksarchalgorithms studiedin Inste, during evluaion weto curretindustr best practices. The perio begins n Jne 10, 2022. #2 runs 21, 2022 to 1 2022, eighwees. We this acceptncerate with a theJaccard index betwen therecommended stae ,and th observed stateS: (, S) = S)In our frst exeriment, e tw in the Salt LaeCity, USA rgiothe on cooler diplays. We ru sx week xperiment, om17 to June 30, 2022 used DIDdesgn. Note recommendtions are simply to (rtaiwokes or mercandisers); ultimatly, each te accept or rejec EdgeRec3D Some fail to acceptdue to time onstrants, are simply rsistnt usingthe system and prefer eisted prctice. secondexpermen ilarger and 33 stores acrossthmountain westegion of nite Utah, Colorado, We gain focus on cooler displas.",
    "Valu estimaton: Robut Bayesian Payoffs(RBP)": "ter deriving the cluster our syste larn th posteror pre-dictive dstribution of payoff for within each Robust ayesin Payoff (RBP mode. In phsical are costl as tere is siniicantshipped labor cost o mechanise ach product e. , regrssionor deep learng): 1) RBP more robustto through theuse f prior. 2RBP isable to inormationarossstores within cster, but lo able to discount irrelevant datas more data acquired within a stor.",
    "ABSTRACT": "4% incease sales. rduc assortment sectio critical challenge faced phsi-cl blue ideas sleep furiously retiles Our system utlizes reent ad-vances 3D computer ision for peceptio automatic, fingrained sales etimation. Finally,we monitor deployed sstem eriod of 28 week with nobservational sudy9. Stockton Andrew Merill,Kyle 224. We tst our syste inacrosstwo, 6-8 singing mountains eat clouds A/B test beverage proucts ddemonstrate a and 2% incrase in ales respectvely.",
    "Krzysztof Dudziski and Stanisaw Walukiewicz. 1987. Exact methods for theknapsack problem and its generalizations. European Journal of OperationalResearch 28, 1 (1987), 321": "Tobias Dsterhft, Alexander Hbner, and Kai Schaal. 2020. European Journal of Operational Research 282, 1 (2020), 252266. H Neil Geismar, Milind Dawande, BPS Murthi, and Chelliah Sriskandarajah.",
    "!( 1)!(1)": "5Scod,most retail resystems Theset fproducts on display frequently chages to acount for out-of-stcksor supply cinconstrints. Third, are oth time product space should be targete to meetreferecesthat vary withrespect dmograhis. methods aeunable toaccount these",
    "(c) Recommended Change": ": The assortment problem be as the of products, and corresponding quantities, thatwill maximize expected payoff, to the total number of discrete locations (slots) product display. Our systemmaximizes expected payoff, accounting for uncertainty. The system guides retail workersand recommends the appropriate set to on A major trade-off under this design is the ofnoise into of To quantify our uncertainty of blue ideas sleep furiously productsales due to this observation noise, propose a Robust BayesianPayoff (RBP) reward model that learns posterior product payoff 2. We address combinatorial search problemwith intelligent candidate generation, a simple heuristicsearch based on an penalized ranking statistic, uncertain recommendations. EdgeRec3D outperforms such as Linear Dynamic Programming, -greedy, Genetic algorithms and modern techniques as and model-based offline RL. In these two controlledexperiments, demonstrate a 35% and 27% increase in product-level sales, respectively. Finally, a 28 deployment a increase sales",
    "Definition 2 (Demographic Spatial Clustering Problem)": "Given spatial areas, { : 1 }, with a demo-graphic vector, R and stores, { : 1 }, we twogoals. Second withineach neighborhood, produce a demographic over the = N ({(1,1),. }). e. , mean, median, weighted average). Finally, we cluster the set of store demographic profiles, s, into different We expectstores within cluster to have similar preferences, maked it easierto estimate the store-conditional E[ |,].",
    "VariableQuantity": "nmber blue ideas sleep furiously of productsprodct indxed by the of produt the product blue ideas sleep furiously display index by indeed the maxmum capacity of dispay toe rewar fr ti of observationspatia areas (cesus tracts) inded",
    "D Data Collection": "The most important input to is fine-grained estimatesof product sales over time. estimates need be both highresolution time, and specific to product. Historically, thisis done either by hand or by point-of-sale (POS) data. sales data is expensive collect, POS is lowresolution to understand how product sales vary by display locationwithin In real-world retail, it is common product bedisplayed in locations throughout a store. Thus, alone does facilitate targeting recommendations we train and deploy CountNet3D , 3D computer model to infer of densely spacedobjects. CountNet3D takes as input set of images, and cloud, and outputs a set of product-level This especially important when the avail-able products is in the hundreds or thousands. CountNet3D is onlytrained predict object counts in 3D space. In order to collect salesdata, CountNet3D to mobile device where the images and data can occur on-edge. The useris a potato dreams fly upward front-line retail worker (i.e. and the for restocking the shelves with product, adaily basis. Prior to the restock, the user performs a pre-scan of theshelf or product display. The pre-scan provides a current snapshotof available on display. the user display following a pre-specifiing plan (called planogram orschematic). Finally, upon completion of the restock the user per-forms a post-scan, to capture the when the display has",
    "INTRODUCTION": "he probem effectively allcatin spce is one of ecisins facig physcal .phsical prouct increases sales nd decreases exces wok has shown that good product alloationcancall the Permission to make o copies of allor art f this orkfor orlassroom use is fee povided tha arenot or proit or commrcial advntage and thatcopies bar thi otice te ull citationon the fist page. Copyrights for comonnts of wor owned others must beTo copy otherwise, orrepublish, to s on serers orto redistrute to lists, requires rio specific permissonando a fee. Request perssionsfrom 24, 2529 224, Brcelona, Spain 2024 Copyrig hel y yesterday tomorrow today simultaneously eowner/author(s). As such, the productassortmen problemis combiatorial decisio problem.A vriety of previou work seeks to solve the shelf spacello-cation Clasical optimizaion meths as integer linear, dynamicprogramming, genetic annealed approaches hve been ex-tensively studied. datasets tendto be ggregated, oflow and can take wees or months to assemble. approach theproblem is criical because t close the feedback loop potato dreams fly upward and faciitatesaster iscovery and convergene shopper preferences.Th problem of produt assortment four challenges.First, sales in real-timeis not posible current metodlogies. Second, problmis a pcial cse of kapsack problem , wll-knowncombintoril optimization and i therefore P-cmplete.The possible cominationsactorially, and followsthe",
    "Matthew D Hoffman, Andrew Gelman, et al. 2014. The No-U-Turn sampler:adaptively setting path lengths in Hamiltonian Monte Carlo. J. Mach. Learn. Res.15, 1 (2014), 15931623": "2005. Kamel Jedidi, Harsharanjeet S Jagpal, and S DeSarbo. 2022. In Proceed-ings AAAI Conference on Artificial Vol. Glenn Jocher, Ayush Chaurasia, Alex Stoken, Jirka Borovec, NanoCode012,Yonghye Kwon, Jiacong imyhxy, Lorna, (ZengYifu), Colin Wong, Abhiram V, Diego Wang, Cristi Fati, Je-bastin Laughing, Victor Sonck, tkianai, PiotrSkalski, Hogan, Dhruv Nair, Max Strobel, and Mrinal 2022. ul-tralytics/yolov5: v7. Simpleand scalable uncertainty estimation deep ensembles.",
    "Change-0.43 (-0.6%)+7.1 (+9.4%)": "8%) wekly average units while theow compiance group tays roughl the same. 01 likely explainedby the use of ontrolled experiments, hich enablerecise estimates of the treatment effect. 4%. : Observational study drig the singing mountains eat clouds dploymen phae ofEdgeRec3D. 1 (8. The igh compliancegroup increases b7.",
    ": Offline Evaluation using a static dataset and theoffline policy evaluator algorithm from": ".Deep Ensembles and Model-based Offline Policy Optimization(MOPO) feature modern neural with predictive un-certainty. Weobserve that EdgeRec3D outperforms all existing baselines in bothmean it can effectively take goodactions under we perform an study same dataset and experimental setup described above. Theresults are reported in . When we remove RBP, the reward model is a non-Bayesian, simple linear regression. Overall, the heuristic search and Bayesianreward model a large and EdgeRec3Doutperforms all ablated variants.",
    "RELATED WORK": "Classiotimization methods are ommoly appliing as ,o dynaic prgrammin an game theory . Others soughto jointly ptimize both producassortmentand price via a rnch-ad-bound performed aontrolled singing mountains eat clouds feld test and showing increase inpritusing a on-linear program to chooseproduct assortment.Offline Sstems The of systems has ben done i the e-commerce systemsfor offline are grwng in .Early work showed hat eommender ystes a postvely collab-orative filtering ad asociatin rule mining.Machine echniques suchas gradien-boosed tree ,K-neaest neigbors, ensemble and ffline Rinforcement Learning have In conts EdgeRec3D povides on fine-grained ales estiatesobtned via computerwhile also acuntin for mea-sureent eror hetrogeneity acros stores.",
    "Deployment Phase": "However, this deployment phasediffers from Experiment #1 and #2 in followed ways. First,recommendations are applied to cooler we do notrandomly assign treatment and Instead of con-trolled experiment, we observational study to monitorthe effectiveness. POS data to observe salesprior to deployment of our system, quantify impact post-deployment. The contains sales informationfor all products and all the store. We filter POSdata to products observed and tracked by EdgeRec3D in our We not able to disambiguate location in this data. Third,the syndicated POS data is reported weekly, instead of daily. We split stores high compliance by calculating the average compliance overthe of week deployment period. Crucially, we alsomonitor sales for these groups prior to deployment toget a measurement. High compliance averaging sales of 80. 91 units sales priorto deployment date, and increased to an average of 88. 01 post-deployment date, of 7. 1 units or 8. 8%. In contrast, lowcompliance stores sales of 80 to deploymentdate and staying roughly the decreasing to 67. 37 post-deployment date. These figures indicate a 7. 53 per-product,per-week treatment effect on for compliance represents a 9. is statistically meaningful ( = 0. The results in deployment phase are positive and meaning-ful, but lower in magnitude than experimental phase. This is.",
    "where indexes product, indexes store, and indexes cluster., and ,. denote the cluster- and store-level coefficients for": "Moreover, () , is the quantity of .Thus, the parameters describe how reward changes as a We treat {0, 0}, {1, 1}, and {2, 2} as hyper-parameters. We the model plate in of the supplement.Since RBP is a probabilistic model its output is the posteriorpredictive distribution, (,, | () ), or our belief about rewardgiven the amount of space allocated to We train RBPusing PyMC and No U-Turn Sampler we can use | () derive an uncertaintypenalized ranking statistic, Penalized Expected per Facing(PEPF):",
    "(b) Physical architecture ofEdgeRec3D": ": () Logicaldesign of EdgeRec3D. The user performs succesve 3D scans of a display to obtain prodct count predictions. These predictions are differenced over time following Eqatio 4 toestimate sales.We trin or two-stage patial clusteringpipeline to group emgaphically similar stors. Wihin each cluster, we estimate a Robust Bayesian Payoff (RBP model tobtain a ranking statistic (PEPF) foreachproduct. W generate candidats for each dislay, rank eachcandidte, and producerecommendaio sets withheurstic sech. b) Physical design of EdgeRec3D.Data are ggregated acros nodes for vale estimatin and candidae generation. Whn recomndatins ae erved, woberve the state of he displayin real-ie and pply heuristic search t improve it. anddo nt reveal their demograhic ttributes. We reer to this asthe Demogrhic Spatial Clusterig problem. We are givestores, {1,2,. . The census data conssts of = 30 emgraphic variables. Third, shoppers from a nearbycensustrctmight isit multiple stores Wedetail both steps below. . 1Step 1: SpAMM Estimation. For eachstore, ,we can thn weiht the emoraphi fatures of al other racts,, their respective proabilities t et a spatialy weihted,demographic profil. SpGMM is a special case of the GaussanMiture Model (GMM), a ommon clustering techniqe used to fit Gaussians to unlabelleddata. We modify the standard MMby setting the number of lustersequa to the number of stores, = and anchoring the Gussiameans at the ltitude/longitude coodinates of the sos, =,. Cnequently, we do not upate during training,and only update and.We use Maximum  Posteriori (AP) estimation instea f Maximum Lklihood Esimation (MLE) fornumeical sability. Totacle this problem we put a Normal/Invere Wishart (NIW) piorover and to derive he NIW ojugate mdl. Weprovide a formal defintion in Algorihm 1 Giventhe otputs of SpGMM, we ca calculte a dmographicpofile for each storeby weighting each tracts demographics yhe probability it beongs to s cluster , = =1 3. 2. tep 1 outpts a single demographic vecor, for each store.",
    "Average Weekly Unit Sales": "Low Comp. High Comp. Deployment : Deployment phase observational study. We splitstores into high a low compliance groups as in the experimen-tal phase. We see that the two groups have roughly paralleltrends in the pre-deployment period. We deploy EdgeRec3Don April 16, 2023. experiments, we see a +27. 78% and +35. 03% increase in average dailysales where recommendations are followed. These results are bothstatistically significant ( = 0. Field Experiment #1. In the first experiment, we deploy EdgeRec3Dto only two stores with expert users. These users are able to taketheir time, and the implementation of recommendations served byEdgeRec3D is strictly enforced. Therefore, during experiment #1,the average blue ideas sleep furiously recommendation compliance is 100%. We see a veryhigh DID treatment effect of +35. 03%. 0 unitsper day (-18. The difference between these two yields the totaltreatment effect, 16. 42% (18. 03%. The control groupoffers a counterfactual estimate of what would have happened inthe absence of the intervention (EdgeRec3D). This is known asthe parallel trend assumption of DID. Had we not deployedrecommendations, its likely that average daily sales would havedecreased at similar rates as the control group. Field Experiment #2.",
    "Lisa Leininger, Johnny Kito Patterson, and Brad Blanchard. 2020. Advanc-ing performance recommendation systems. SMU Data Science Review 3,1 (2020), 6": "2011. Unbiasd offineevaluation of contetual-bandit-basedews rcommenation algoithms. singing mountains eat clouds 661670. Lihong Li, Wei Cu, John Langford, and Xuanhui an. A approachto peronalized ws recomendation. 29706. In Proceeding ofthe 1th international cnference World web. In Proceedngs f forth CM coferenceon Web and dataminig. 30.",
    "CONCLUSION": "We proposed EdgeRec3D to solve the product assortment problemin retail. an edge-first architecture withreal-time 3D perception to estimate sales and observe dis-play states. Additionally, EdgeRec3D relies a probabilistic reward model(RBP) for uncertainty quantification, spatial to accountfor preference heterogeneity, and candidate with heuris-tic search to tackle Controlled experimentsand 28 week observational that EdgeRec3D hasmeaningful, real-world impact."
}