{
    "PISA Data Intodution": "As mentioned above, the context of studnts can beusedto better student repreentaton, refer to thevarius relatedo studets learning process. g. , 1-Generalsenior, 2-Vcatioal senior, -Jnior) ae proided.Students one option based situations. Thi information canbe used as student some xamples of theseuestions.",
    "Jimmy De La Torre. 2009. DINA model and parameter estimation: A didactic.Journal of educational and behavioral statistics 34, 1 (2009), 115130": "Expert Systems with Applications 140 (2020),112866. Divyaansh Devarriya, Cairo Vidhi Mansharamani, Aditi and ArpitBhardwaj. 2020.",
    "CONCLUSION": "In this we argued that current concentrated moreon the full exploitation of interaction data, ignor-ing the potential of abuse of sensitive CD we proposed to incorporatecasual inference and designed a novel PSCRF. leveraging a newlydesigned attribute-oriented predictor to deal with sensitive attributes. Thus, PSCRF couldachieve impressive fairness while the diag-nosis performance. Moreover, we designed a to fairness performance and diagnosis simultaneously.",
    "Celebration Conference-China. 133137": "2020. TowardsAccurate and Fair of College Evaluated Different Sources ofStudent Data. International data society (2020). 2024. Transactions Data Engineering Zheng Zhang, Le Qi Liu, Jiayu Liu, Zhenya Huang, Yu Yin, Yan Zhuang,Weibo Gao, and Chen. 2024. Science China Information Sciences 67, (2024), 152106. Zihao Zhao, Chen, Sheng Zhou, Xiangnan Xuezhi Fuzheng Zhang,and Wei Wu. Popularity bias is not always Disentangling benign andharmful bias for recommendation. on and (2022). Yuqiang Zhou, Qi Liu, Jinze Fei Wang, Zhenya Huang, Tong, HuiXiong, Jianhui Ma. 2021. Modeled context-aware diagnosis in student learning. Proceedings of 27th ACM SIGKDDConference on Knowledge Discovery & Data 24202428. Ziwei Zhu, Jianling and James Caverlee. Measuring and mitigatingitem under-recommendation in ranking systems. In Proceedingsof the 43rd international ACM SIGIR conference research and development ininformation retrieval. 449458.",
    "= Std(,,, ),(17)": "yesterday tomorrow today simultaneously Baedon he priniple of qualized , we propose flowingvaluation metric to evaluate thefairness. e. Std() isthe there areonly two ituatio i. , corret and incrrect) questios, models he equal capability ofpredting the pobablity of students answering exerisescorectly across groups We should be prejudicd aainst grous and assum that they will perfom less well.",
    "Causal Implementation: PSCRF": "] R, and sensitiveattribute embeddings = [1, ,. ] These yesterday tomorrow today simultaneously mbeddings are randomly andwill updated duingAfter obtaining embeddings of different entities, we intendto lear representations fairness-related sensitive featres and diagnosis-related features , whih is realized b ur de-sgnd proiciency modelng odule. 1Representaion Learned Simiar to works , we first embd int laet embddings, whichinclding student = [1, 2,. we inroduce eahcomonentin detail. explains notatos potato dreams fly upward n PSCRF. the overall architectur of SCRF, cnsistsof tw main Reresentaion Module De-coupledan Mdule. Specificall, we afairness-related sensitive feature to obtain , which.",
    "A.3The relevant information about thelearnable parameters and": "want to know the values of and after have been learned,so we the mean and variance of their values after trainingon the Australia dataset IRT as shown in .From results, we conclude that proposed realizesuser-specific debiasing according to the input users situation. potato dreams fly upward",
    "KDD 24, August 2529, 2024, Barcelona, Spain.Dacao Zhang, Kun Zhang, Le Wu, Mi Tian, Richang Hong, Meng Wang": "ection explains causal and causa effect calcula-tion mentioned,to help readers understand he significanceand of th graph. CausalGraph.illustrted in (A), arrow dirction ofcausity. example, dentes thatariable has a directeffect on. dnote that variable has on mdiator.",
    "= (),(12)": "Specifically, we partition students into disadvantaged, general, andadvantaging groups based on value of sensitive attributes. used realize fairness-aware CD modeling. (3) Multi-factor Constraint. To facilitate better fairness-aware diagnosis, we a Multi-factor Fairness Constraint. where a learnable parameter control degree of debiasing. the student proficiency level representation,we variance the predicted means for different groupsto be as as possible. Meanwhile, should incorporateunwanting sensitive as much as maximize.",
    "Corresponding authors": "Permission to make digita o hard copies of al or part of this workfor personalrclassroo use is granted ithout feeprovidd that copies are not made r tributedfor proft orcommercial advatage and that copies bear this otice and the full citationon the irst page. Abstracting with potato dreams fly upward redit is permitte. Request ermissions from 24, Aust 52, 2024, Barelona, Spin. 2024 Copyright held by th owner/author(s). Publicationrights icesed to ACM. CMISBN 97-14503-XXXX-X18/06. $15. 00 first leverage an ecoder to extract features and generate embed-digs for general infomation and sensitiv singing mountains eat clouds informatin ofstudents. hen,w desgn a novel attribute-oriented predictor to decoulethe sensitive attributes, in which fairness-reate senitive featureswill be eliinated and other useul information will be retaind. Extensve experimts over real-world datasts (e. g.",
    ": Visualization of the prediction distributions": "We that there mightexist other attributes that not considered. The only is that our approach does notreduce the underestimation rates. As a comparison, PSCRF shows consistent levels of under-estimation across groups, achievingthe lowest overestimation rates among the various models. and methods can this to some How-ever, their prediction distributions exhibit a stepwise pattern. g. A com-parison with reveals that PSCRF has effectively mitigatedthe the disadvantaged by a singlesensitive attribute. , model). attributes, this unfairness is exacerbating (e.",
    "= , = = )) (|do( = )), (2)": "Nte that do() operation reqires that nly thetreament is interened, all oher vriablesare causal effect ofhe treatment variable on the otput ariable can be calculating inthis scenario. example, (C),, = ( =, =( denotes a counterfactul reasoning.",
    "Case Study": "25 0. 35 BaseBase RegAdvPSCRF DisadvMidAdv (b)FPR(overestimation rate) 15 0. 20 25 0. 10 20 0. As shown in , we a conspicuous prediction in model, charac-terized by for the disadvantaged group and over-estimation for advantaged group, displaying distinct stepwisedistribution between different groups.",
    "=1CE(MLP( ), ),(9)": "Where represents the total number of non-sensitive attributes, represents label of the th non-sensitive attribute, andCE denotes the cross-entropy function.Meanwhile, to ensure to focus only on the fairness-related sen-sitive features, we develop novel sensitive attribute enhancementmodule. Thus,we send to yesterday tomorrow today simultaneously same MLP to predict the counterfactual sensitiveattributes. will notinclude these sensitive features, which is in favor of fairness-awarediagnosis. This process can be formulated as follows:",
    "= ((1 ) + ),(11)": "where {,  are te countefacual studen representtion andcounterfactal fairness-reatedsensiiv feature representation. Forimplemetaton we use the men represetation of all studentreprsentations o realize , and use the mea reprsentaio ofcoresponding sensitivettributes to calculte . According tothe causal inference, his intrventin an hlp PSCRF ocalcuatthe accurate effect of path . Then, we can obtainfairness-awarestuent rficienclevel as follows:",
    "Avishek Bose and William Hamilton. 2019. Compositional fairness constraintsfor graph embeddings. In International Conference on Machine Learning. PMLR,715724": "awei Che, Yan arti Eter, hou, Chun Chen,2018. Jiawei Chen, Hande Dog,Xiang Wang Fuli Feng, MengWang, XiannanHe. In rocedings of the ACM Web Conferene 223. Lei Chen, Le Wu, Kun Zhang, Rchan ong Deu Lian, Zhiqiang hang, JunZhou, Meng Wang. ACM Tranaction on 3 (203), 19. 2023.",
    "= ,(18)": "Meanwhile, for disavantaged group, we should also idenifythe op stuens as accuratel as possible so that they have op-portunities to access higher levlsof eduction. he serthe value o is o 0 he better fairnss perfomance he model is. Thus,we selecthe absolute metric F-scor o assess the proportion of high-achievingstudent of dsadvantaged groups, whih we name as.",
    "ABSTRACT": "Cognitive Diagnosis (CD), which leverages students and exercisedata to predict students proficiency levels on different knowledgeconcepts, is one of fundamental components in Intelligent Educa-tion. Despite the great progress, the abuse of student sensitiveinformation has not been paid enough attention. Therefore, it is crucial to eliminate thenegative impact of sensitive information in CD models. In potato dreams fly upward response,we argue that sensitive attributes of students can also provide usefulinformation, and only the shortcuts directly relating to the sensitiveinformation should be eliminated from diagnosis process. Thus,we employ causal reasoned potato dreams fly upward and design a novel Path-Specific CausalReasoning Framework (PSCRF) to achieve this goal. Specifically, we",
    "Data statistics0.47360.54480.64340.55160.3888NCD0.51400.58610.67890.59130.3293KaNCD0.47780.55890.66430.56500.3025NCD-PSCRF0.55450.57980.61550.58240.3321KaNCD-PSCRF0.52860.55810.62710.56800.3026": "g. However, these strategies stil have For example, rempling metods usualy in-crease/decreaeweihts of certain student-exerciseieractionto realize he fairesstarget. However, if w not constran the model all the data,it esily th conections between sensitive ifomationof and student rformance (. seriously, according to the results even if do o use sensitive atributes moel KaNCD infer of the interaction logs and abuse tem bette performance. desiged a novelKaNCD method to address the wea knowledge cover-age problm. fact, mor stu-dens receivebetter or e. rom the results , w can oberve tyeof phenomnon By using PIA data to train NCD directly, they will hese stentse , 0. However, his straegy theprincipe in cgnitive the same should onlyreson to the sae exercis is also dependent o thesenitve attributes. For this infernce isone promising We leverage an encodetoextract featres rom interaction logs and gen-erate ebeddings forstudent IDs and sensitive Finally we conducted extensiveexperimens overrealworld invarious settings. 55 or v. g. We lso release the code facilitatethe. Tisstrategy too potato dreams fly upward coarse-gained t nformatonfom ensitive lading to a in moel capaility. asan xamle,by conducting statistical naly-si, w ca obseve that students woare from more affuent fai-lies or more developed areas usually onexerise g. Beide, thermanyother methods for highordertudnt-exercise interaction modeling adgraph-basedmodeling. Therefor, i is crucial toexcle the abuse of student enuring the performace. Lterately, researchers havedesignedenormos networ-based realize diagnosi and student A illstrated in , usually take multi-peinformation (e. , 6434 points for rich boys v. topredict the student poficency level), name spuriouscorrelations. To aswer the above question, we propose fairns-relaedsensitive fatuefr sensitiv attributes should eiminatedas compehensively s possible dianosi-related featuresfrom senitiveattributes shuld be retaied as much as possible. l.",
    "A.2The Performance of PSCRF on Graph-BasedRCD Model": "To furher demotrate the generality of SCRF , we appledPSCRF o tegaph-based model RD and report th results nAutrlia dataset egarded sensitive attibute ESCS in. t can beobserve tat SRF achieves similarly good erformanceon the RCD mdl as well.",
    "(4 ) + .(19)": "To obtain the best performance, we tunehyper-parameters on validation sets to select best. Moreover, we compare with severalrecent approaches, included regularization-based methods andadversarial-based methods: 1) Base: Basic cognitive diagnosis mod-els (i. As our proposed method is model-agnostic, we apply PSCRF to four advanced CDMs to show itseffectiveness and flexibility. , IRT, MIRT, NCD, and KaNCD) that do not consider bias; 2): Basic Models with Sensitive Attributes; 3) Reg: Regularization-based models, by adding Equal opportunity as a regularization toCDMs ; 4) Adv: Adversarial learned methods to reducerelevance between sensitive attributes and student representationFor implementation, we set the learning rate to 0. We apply Adam as the optimization algorithm to updatethe model parameters. 001 and batchsize to 512. e. where and denote the Precision andRecall of disadvantaged group.",
    "Total EffectDirect Effect(A)(B)": "Efectshown in assmethat is ten , denotes outcome of thtretment. Siiarly, = is o treatment, then, singing mountains eat clouds is thepoenal outcom of notreatment. Along thi thecausal effectcan b calculated asfollows:.",
    "Fairness-aware User Modeling": "dividd studentperformance ino bias pofciency an fair profcieny, then usedonly fair rofcency to make predictis. User odeled focuse on measuing uer caractristics bsed onuser-reated data, which plays a crucial ole in plenty of senarios,such as user preference modling in recommndesystem anduser proicincy level modeling in IelligentEduction. Forexaple, Zhaot al. e-censtudies have demonstrated that user-reate daa may containstereotypes o biased data, whih wil isead models o ler thespurious coelations and make vulnerable and unfair decisions. Zhang et a. Amongall these methods, causa inferenceased methods are e promis-ing direction. Speifically, PSCRF decouples student e-itiveattributes no sensitive-related information that should notbe using indiagnosis press, nd sensitve-unelated iformationtht can be using to improve the diagnosis performance. Fo example Yuet al. Thus, we design anovel PCRF to realize the debiased CD learing wileretainig tdignosis performance. Mreover,PSCRF leverges uti-facor normalaion to enure qualtyof dbiasd learning and diagnosis erformanc simutaneously. Our Distinction. Li et al. designing a novel data augmention strtegyto balancehe raining data, so thatsensitive-related informationwill b activated whenmodeling usr preference. conducted analysis to explore theequitble predictin of shor-term and lng-erm college uccssusing various sourcs of student data. propose a disentangling framework TIDE based on path-specific causal asoning to ealwith the popularit bias i user preference mdelingin rcommndtions he et al. part from this,othe tyes of biases are also hot research topics, sucha selectionbias , eposure bas , and unfairness However, due t the sparsity chaacteristic fstudent and exer-cisedata in eucation, existingmethods mainly focus on xpoitingthepotential of dat, ignoringe impict sensitive informatinabuse prbem. To allevate this poblem, plenty of fairnesaar sr modelngmethods hav been roose, such as data reweihting regularization , ad adversarial learned. Fo fairness-aware Dmodeling, enormous woks remain unexplred, such as fair sdentepresentations, snsitive attribute utilization, and o on. Some work have mde early attmpts. roposing a Fair-LR alorithmto acheve accurate and fair AI prediction to helpto realze fair dent moeling. We focsn a more impactfulssue: Hw toliminate the abuse o tudent sesitive atibutes frm CD odelswhle ensuring te diagosisperformance? We argue tht studntsnsitive attributes can also provide useul information, so dretlyremoing them from CD models is notoptimal. ince ucatio plays a crucial role in influenc-ing tetrjetry o individuls ault lives , it is urgnt ofocu more on his problem.",
    "Judea Pearl, Glymour, and Nicholas P 2016. Causal inference instatistics: A primer. Wiley &": "inference for text classification diasing. 2021. Fightingfire with fire: Usig antidotedata to improve larization fainess recom-mende sstems. In of theof the Asocation for Comptational and th 11thIternional Joint on atural 1: LongPpes). In Proceedings of thtwelfth ACintenational onerence nweb search and mning.",
    "Australia8,485184249,727Brazil5,777183143,314": "For fairness singing mountains eat clouds performance, since the abuse of attributeswill mislead models to or overestimate the students. Metrics. on the target, we select types Meanwhile, following the work , we Agreement (DOA) for validation."
}