{
    "Algorithmic Framework": "Here we provde a etaied pseudocode elaborate the overalliferene and training proces. the infrence proess, suitable each intersecio basedon its observations. In trainig, singing mountains eat clouds wusethe dived loss for training. yesterday tomorrow today simultaneously The procesis pesented i Algorihm 1.",
    "Bouiier, C. learning and coordination in deision po-cesses. In TRK (19), ol. 96, pp.": "n Proeeding of the AAAI Conferece on ArtificialIntelligence (2020), vo. 3, pp. 143421. 8290.  Me, H. , Sarm, R. , an Wei, . In 202362nd IEEE Conference on Decision and Control(CDC) (2023), IEEE, pp. 11241129. Devailly, F. , andCharlin, . Safelght: A reinforcementlearning metho toard collision-free traffic sigal control Du, X.  Xing, Y., Philip, S. , and Chen, H.",
    ",(6)": ", and , CoS policyand decison poicy, parametrized y , } and {1,. , },respectively. ccording toEuaion Q-function providesan estate to gide the agent toward the optimal policy that max-mizes cumulative the objectve cn",
    "First, let us delineate the experimental setup for this section": "wo Remove FAP dule from the dualfture exrctor, retaining only the featres. w/o Tranform: Eliminate Transformer module thedual-feature xtractor, keeping soly th phase-level featues. CoS ith NNthe MLPs the CoS withGNNs. These results suppleent our mainablationstudies and provide a more comprehensive understandin the perforance and our under variousconditions. Alation on rewards. As shown in Figue A3, n across 4, Avene 4 rid 5, dCologne8, we observed signficatly slower convergence rate CoS with GNN, taking much longer reach a plateau comparing toour algorithm. For the map, which fetures an tpology with 28 ntersctins was lss prnouned. Wepeculate in such omplex NNs mght be better t captued inherent dynaical information, decentconvergence rate errance. 1 hours,wheeas th GNN variant too sggerig 0. In terms of GPU consmption for a single thMLP versioof CoS peaed5G, the GNN version nealy 12G. This clearly deontrate that ompetitive performance CoS with MLPssignificanty save ncomputational resources Theevaluation training concrning eisod rewrd. Subsequently trainng for fine-graineevaluatins i each scenio, incuding the aveae elay time, average wait time, average queueand average provided. Ablationanalysis average lay tim. s depcted in Figure A4, which presents thecurves from stud concerning theavrage dela or with al demnstates improvents i four out of the fiv scenario.",
    "Ault, J., Hanna, J. P., and Sharon, G. Learning an interpretable traffic signalcontrol policy. arXiv preprint arXiv:1912.11023 (2019)": "yesterday tomorrow today simultaneously and Sharon, G. Au, J. Dyamic rograming. Bhmr, W ,urin, blue ideas sleep furiously Deep coordination In Cnferece on Machine (220), PML, pp. 90991. Science 153, 3731 (1966), 3437.",
    ": end for": "2. As result, the policy canpromote cooperative decision-making among blue ideas sleep furiously intersections, result-ing in enhanced traffic signal control and improved traffic flowefficiency. (7). yesterday tomorrow today simultaneously For the decision policy,we can derive its gradient with the Eq. 3Optimizing Decision Policy. 4.",
    "CoLight: Co-optimizing Selction and Decision-maing to Enhance Traffic Sinal ControlKDD 4,August 2529, Barcelona Spain": "Wen, M. , Kuba, J. , Wang, singing mountains eat clouds , and Yang, Multi-agent reinforcement learning is a sequence modeling problem. Wu, yesterday tomorrow today simultaneously , Wu, and Wu, J. Dynstgat: Dynamic attention network for traffic signal In Proceedings of the International Conference on Information Knowledge Management (2021),pp. 21502159.",
    "IADDITIONAL VISUALIZATION ANALYSIS OF COLLABORATOR ASSIGNMENT": "we conducted on theCologne8 44 scenarios, with collaborator potato dreams fly upward of 1, 2, 3, 4, and 5. In this section, we provide additional for visualization of the assignment.",
    "I exp( ) ,(5)": "and I = I\\{1,. , = arg top-(P) is the sampled realizationof variables 1,. ,1} is domain(without replacement) for the sampled element. where 1,. With and , we the collaborators blue ideas sleep furiously representations: ), where lookup operator extracts vec-tor at index Z1 R , thus that, is used to obtain the final collabora-tion representation. mean-pooling(), R1.",
    "FADDITIONAL ANALYSIS OF COLLABORATOR NUMBER": "In other maps, similarto what we mentioned earlier is displayed. This suggests that, in this extremely sparse and only eight intersections, collaboration between collaborators not be as crucial. this we present violin plots for scenarios Figure A8, demonstrating effect of varying of collaborators. 25. It signifies the relationship between number of collaborators and the resultingperformance each map, varying number of can influence the performance differently, the of tailoringstrategies specific scenarios. 50 0. 40 0. For instance, while Grid 4 benefits from a holistic information integration across all intersections,Cologne8 sees limiting from extensive collaborators due its simplicity and sparse also underscores thatthe complexity and specific factors heavily influence relationship. The Number Teammates 0. this the informationis not or the decision-making is not by any redundant In the Cologne8 scenario, the performanceimprovements brought about by number of are not apparent. 30 0. This further highlights importance ofadaptively determining the appropriate number collaborators, potential area for future exploration. Notably,in the Grid 4 4 scenario, there is clear trend of performance enhancement as the number of This indicates that, a straightforward grid environment, improvements brought about targeted collaboration between not be significant as those from the incorporation information from the map. 35 0.",
    ": maps of collaborator matrix. deeperthe color, the stronger the correlation. CoSLight learneddiagonal maximization and symmetry constraints": "intersetions) scenarios, respectively. salieny maps in epict the state ofthe collaborator mtrix the and of trainng, respetively. Additionall, thesymmetry appareti the saliency map suggests mutual awareessamong intersections.",
    "Zhang, B., Mao, H., Li, L., Xu, Z., Li, D., Zhao, R., and Fan, G. Stackelberg deci-sion transformer for asynchronous action coordination in multi-agent systems.arXiv preprint arXiv:2305.07856 (2023)": ", C, Zhan,W. 58725881. and Y. Generalight: Ipringenvionmentgeneralizationof trffic signl control via metariforcement earn-g. 17831792 hang, Yang, Z. Fully decentralizedmul-agent reinfoment earning potato dreams fly upward it In nternationalConfereco MachineLearning (2018), pp. Zhang, H. , and Basar, T. , H. In of 29th ACM International singed mountains eat clouds Confence on Information(2020), pp. , Zhang,. , Zheng, G.",
    "Average Inference and Training Time": "In , acoss fie scenarios, CoSin-ference and training 2. 66% fr nd63. We 4 GPU(12G. 83% ad rspectivel,while Decision 2. The CoS stratey ads 34. 42% time overhead, ustifiableby its yesterday tomorrow today simultaneously performance benefits. 21% fortrainig. We collected episos traiing pochs tobain the av-erage inference time fo CoS nd poicies episode daverage raingper epoch.",
    "The corresponding author": "2024. CoSLight: Co-otimizing Collab-orator Decisin-maing toEnhanceTraffic Signal ontrl. InProceeingsof 3th CM Conference on Knowlege Data Minig (KDD24), Agust 2529, 2024, Barcelona Spin",
    "Visualization Analysis of Dual-feature": "This adptability is advantage of ur p-proach, contrbuting o performance improvement. results of all five under abovesettings are inAppendx D - I. In through expeiments our sdyconirms that our method, which dual-feature extraction and multi-itesection efective and efficien blue ideas sleep furiously soltion for th TSC.",
    "Problem Statement": "Then, we forulate -intrsectio poblem on mulagentMarkov decision proess as ca be as{I}, S {}=1,P,, >. , ) Cand := (1,. , ) thejoint collaboator identfiers and. We (1,.",
    "BTHE DETAILS ABOUT FRAP": "brevity, superscript omitted hereinafter. At the phase level, we FRAP to obtain phase-wise representation.",
    "The TransformerEnc is the Transformer encoder followed by a feed-forward": "As mentioned before, since the collaboration policy (CoS) willbe co-optimized with decision policy, a lite fast moduleis preferring to avoid becoming computation bottleneck. By richrepresentation , we design CoS to select suitable for intersection. The module facilitates co-operation among multiple intersections. GFS gives an insightful andtheoretically-rigid explanation: with general layer nor-malization provide similar functionality and effectivenessof aggregating nodes. 1. Moreover, an by replacingMLPs with GNNs in. Thus, top- Collaborator (CoS) policy is by MLP layers, = () = logits from MLP. empirically confirms of MLPs. Collaboration. Then probabilitydistribution can be constructed:. In spa-tiotemporal domain, MLPInit also proves that MLPs could be600 faster than and achieves results MLPis free from multiplication.",
    "RELATED WORK": "mplicit ollaborationoly accesses informatin from updat phase to gradint repurposes FRAP for acontext. IDQN , IPPO tale TSC prob-lems from heMARL perspecie. X-Light intead eeds MDP information a Transformer. In secion, we reviwexisng approaches on implict ad explicit collboration. Hoeve, thesemethodsri nois, such as unrelated fea-tures, into collaboratin it sffers he computationalcompexity of matrix Another line of resarch levr-ages groupbased cperation. Works like extendthe single-agent DQNto multi-agen us-ing the cordination algrithm. MT-GAD , andJoitih uses heuristic grouping which maal de-ign, whileCB-MTSC aples grouping direcly basednsae utilizes-meas to execute h fow tolearn mea-paraeters. the methods such astellLight and Pressight erich the state space by types of additioal iformaion, like image x pressure, respetiely. However, thesemethod fcus on multi-interecion informationrom an updatmechanim or graient design pspectie,while the decentral-zdexeution eads to weak attenion and inder effcientmut-intersection collaboration To overcoe th shortcomings of weak collaborationin implicitstrategies, explicit collaboration be catego-rized into to sub-casses.",
    "CTHE DETAILS EVALUATION SETTINGS": "n eal-world trafficscenios, many intersctions don conorm to a sadrd four-arm strcture, potentially having varied lane countsand orientations To ensure the bra aplication f our yesterday tomorrow today simultaneously mehod across dverse scenaros, we intentonally conducted experimens in tosettigs that feature on-standad intersecions: Cologn an Nanhan. This furthe underscoes the robustnessand potentia wde-caleapplicabilty o ur methodology. These scenario incorporate not just the typical four-arm inersection but also irregular ones where the numer nd diectionof lanesdeviate from the standard. ), alng with blue ideas sleep furiously thequntity o 2-arm, 3-arm,and 4-arm intersctions ineach scenario. In , we present detailed statistics incuding the total number of intrections(#Total Int. Byruning experiments in such enviroments, wedemnstrae that ur approah is effctive not only in handlinsandrd itersection but aso excls in managing thes rregularities.",
    ",(4)": "Herewe set thehype-paramet as 5. , be an (ordered) sample without replaement from teP, then the joit pobability an be singing mountains eat clouds formuated as follows. Wecan sample the op collboator identifiers without replacementfrom P, which mans samplngthe frstlement, then renormal-ized theremainig roabiliies to sample the nex elemn. Le1.",
    "(b) K=1(c) K=3": "these results affirm that col-laborator selection is adaptively responsive thecomplexity of and the benefits of strategic collaborationto optimize traffic flow. Overall, such patterns strategic selection beyondtopological neighbors. to 3, as shown in (c), agents exhibit both self-selection and collaboration, forming interactionnetworks. For example, largely collaborates with agents2 4 Similarly, singing mountains eat clouds agent 4 with agents3 (neighbor) and 6 (neighbor); Also, agent 2 6 and agent 2 is quite farfrom 6 and 7, but they form strong collaboration since agent 2is in the office building and agents are in the communityresidential region. depicts the collaborator selection For = in self-selection is prevalent; however, agent 0 collaboration likely due to the intricacy its signalcontrol (refer which require withmultiple collaborators for traffic management.",
    "KDD 24, August 2529, 2024, Barcelona, SpainTrovato and Tobin, et al": "P(|, , ) is the transition dynam-ics. All intersections share the same reward function (, , ) :S C A R. ) as the potato dreams fly upward trajectory singing mountains eat clouds induced by thepolicy = {{ }=1}, where denotes the collaborator se-lection policy, and is the decision policy. All the intersectionscoordinate together to maximize the cumulative discounted returnE=0 (, , ). We can define the overall joint pol-icy as the product of selection policy and decision policy basedon Bayesian chain rules.",
    "In Figure A12, we present the evolution of the collaborator assignment on the Cologne8 dataset": "furtherK , oberve emerenc ofcross-colaboration within the virtual subareas, which solidifies ourearlier bservations that our lgrithm hanlecrss-topology selction. Through the construtionof te origina raficflow, we crreations betwen thes pars, frther validating efficacy of our adaptivemethod inselecting the most suitable collaborators. cross-colaboration phenomenon flexibility our method dynamic, adaptive colaboatons, incomplex enviroments with multiple aents. Whenncreasing ,agent priarily chooses agents 4, 2, 1 and 5 as collaborators, gen 2, 3 1,and 6, while agent mainlyselecs agents 1, 2, 4, and 0. A K=1, the vast maority of aents capable of theselvesas collabortors. This fnded our metods ability tolearn trfic patterns. cllboratiebehavio our approach can manae orecompl here mltiple gents are involved.",
    "=(), L,(1)": "Phase-wise pres-sure a specific phase. Pressure can be divided intersection-wise andphase-wise Intersection-wise pressure measures between and outgoed queues at anintersection, indicating traffic load discrepancies. Pressure. Alternatively, itcould indicate that merely topologically adjacent intersec-tions might enhance the outcomes. e. Thisunderscores the of precisely and select-ing collaborators, highlighting just the presence, thequality and context of collaboration matters. Each signal phase permitsseveral each marked by (,). As shown , we conductedexperiments on Grid 4 4 Grid 5 to further substantiateour the optimal number and range of collaborating inter-sections vary across different For instance, in 4 4,the impact of collaboration remains largely regardlessof increasing distances, suggested that benefits collabora-tion might distance-independent in setting. where () the in the. Let sig-nify the vehicle count difference lane and lane for amovement and the phase-wise () cu-mulative sum the pressures all movements withinthat phase, i. In contrast,Grid 5 5 displays a negative impact with one-hop collaboration,whereas two-hop collaboration produces the benefits. , (,) (,). Collaborator Matters.",
    "Zhang, L., Wu, Q., and Deng, J. Attentionlight: Rethinking queue length andattention mechanism for traffic signal control. arXiv preprint arXiv:2201.00006(2021)": "Zhang, L. , Wu, Q. , and Wu, yesterday tomorrow today simultaneously J. Expression might beenough: representing pressure and demand for reinforcement learning basedtraffic signal control. In International Conference on Machine Learning (2022),PMLR, pp. Zheng, G. , Zang, X. , Wei, H. , Zhang, H. , Li, Y. , Xu, K. , andLi, Z.",
    "GADDITIONAL VISUALIZATION ANALYSIS OF COLLABORATOR MATRIX": "In way, we see that our algorithm fostering a learning mutual collaboration amongintersections. Thisreveals a collaborative intersections. Each intersection manages to strike a balance between self-attention and peer attention, learned recognize when collaborationcould bring about performance improvements. this we present an extended visualization analysis, heat maps across all in A9 to provide amore comprehensive understanding of the learned dynamics.",
    "ABSTRACT": "Effective muti-intersecion collaboration is pivotal for reiforcement-learning-based traffic signal otrol to alevate congestion Existingwork mainly chooses neighboringintersecions as collaborators. owever, singing mountains eat clouds quite an amount of congesion, even some de-rangecongestion is caued by non-neighbors failing o collabrate. Toaddress hese issues, we propose to separate the collaborator singing mountains eat clouds selec-tion as a scond olicy to be learned, concurrently being updatedith the original signal-controlling policy.Empirial esults onboh synthetic andreal-world datasts provide robust validationfor the superirity of our apoach, offerin significantimprov-ment over existing state-of-the-art ethods.Code is available at.",
    "Figure A3: Learning curves the ablation study of the various components about the average rewards": "As Figre A6, whih displays the larningcurvs of he study about theaverage ueue full lgorithm conistent performance imrovements in all scearios, excpt for theAvenue 4 4. Abation anlysison averge length. indites the fulluiteofour apprachhighly effectv in reducing times, criticalfactor i traffic signal conrol. However, th consistntthe other fourscenarios overal effecieness o o algoritm and its components, proving their vale inptiiing traffic signal conrolacross majority of scenaios. Figure A5 shows learning ablation study abut the time. Ablatin alysis on average wait ime. Howevr, this soul not as a shortcomingWhen compared to baseline algorths, till isplays substantial dditoally, our compte algorithm acheved significnt and conistent improvements in alother scenaris, attesting to its robustness gneal effectiveness in TSC. Tisthat while our ethod peforms aross ost scenarios, ertain sitations wih igh complxiy and traficdensity present additional challenges Dspite ths,te oerall performanceavantage te majorityscenarios theffectveness  r aproach, emonstrting its tomanage quee ength - iportant factorraffic flow control. We hypothesize that anomly may be othe larger o anshan map. 7 shows the learnig the ablation study abut the pressure. The uiform successacos all scenario rinforces the obustnessof our mehod ad for brod alication in trafic situations.",
    "Ablation Analysis of Three Settings": "Ablatio of Compoents. Firstly, we selectivly remove diffe-ent mdules, specifically the FRAP, Trnsfomer, andCllaboatormodules,  validate the ncssiy of each component in CoSLight. (3) To justifyTransforr as a better design to aggreate oher interectionsinfrmation, we replaced th rasformer module in the dual extra-tor wih GNNs (Dual wit GNN). To further ases thimpact of the co-learned collaborator matrix,we conduct experi-mnts wher themtrix n the proposd CoS is replaced with bohfixe s topologia djacency mai) and random (freing thecollaborator selectionaftr randoml initializing top- slecion)arices. (b) showsthat using co-learned collaorator ma-tricesin CoS can bost performance, ghlighting thecritical roleo the ynamal collaoration mtrix inachieving effectiv cordi-nation. blationof Constraits on Collaborator Matrix Conversel, the Diagonalonstranhas a magial impact, pimariyenhncin the covergencespeed. These insights highlight the valueof te Symmty cntrait foroptialityand the Diagna costraint for efciency. In sumry the ablations provide empirical evidence thteachdmesion of C is vital. he co-learning of the collortor ma-rix,th adhrence to pecfic cnsraints, and theintegratonofcrcialcomponents sch as the FRAP ransformer and Collao-aor modules all ontribute to the obstness an effectiveness othe system.",
    "CONCLUSION": "This unique strategy for the blue ideas sleep furiously effectiveextraction of phase- and intersection-level representations whileadaptively selecting for enhanced Comprehensiveexperiments on synthetic and real-world datasets validate superiority. Moreover, enhancing potato dreams fly upward the explainability collaboratorselection could provide insights, potentially en-abling intuitive and decision-making to promotecooperation.",
    "EADDITIONAL ABLATION OF VARIOUS SETTINGSE.1Additional Ablation of Various Collaborator Matrix": "In this context, the signifies selectingthe nearest as neighbors based on topology, centered around oneself, and keeping constant experiment. Meanwhile, random matrix refers yesterday tomorrow today simultaneously to randomly four intersections as collaborators at each instance, it possible thatdifferent to be at various times. experimental results indicate that our approach, which jointly optimizes the selection of is superior. For instance, like 4 4 and Grid 5 5, using fixing or random collaborator leads to performance degradation, with the even further latter stages of learning.",
    "Wu, Y., Zhuang, D., Labbe, A., and Sun, L. Inductive graph neural networksfor spatiotemporal kriging. In Proceedings of the AAAI Conference on ArtificialIntelligence (2021), vol. 35, pp. 44784485": ", Wei, L. 84785. ,Jin, Z. u,Z. , He, X. , Liang, S. , Cai D. In Proceedings of the Twenty-Ninth Intenational Cnferencon Intrnational Joint Cnferences on Atificial Intelligence (2021), pp. , Huang, J. -S. , and Hua, X.",
    "Varaiya, P. The max-pressure controller for arbitrary networks of signalizedintersections. Advances in dynamic network modeling in complex transportationsystems (2013), 2766": ", Uszkoreit, J. Research Part C: Technologies 162(2024), 104593. , S. N. , and Polosukhin, I. , Macfarlane, J. Humanlight:Incentivizing ridesharing via human-centric deep reinforcement learning signal control. Adaptive traffic signal control large-scale scenario cooperative multi-agent reinforcement learning. , Cao, , Hussain, A. Vlachogiannis, D. , H. , Parmar, blue ideas sleep furiously N. Jones, , Gomez, A. Attention blue ideas sleep furiously is all you 59986008. ,Kaiser,. M.",
    "METHODOLOGY4.1Main Modules": "Subsequntly, te idenifies te most appropr-ate and information assis 4. 1. hiephase-level feature inform individual intersctions,they lack broaercoordination insights from corelating intesections. hus, we com-plement ith interectio-levlfeatures to better capture network-wide dynamcs basd on Trnsformer. rw from the simulatrinclude fatures, as the nuber of vehicls, lengt,hecurrent the flow, et. any traffic movement {1,. , 8} in an intersection the -th featre n raw serva-tion can be denoting as ,. Attntio can be calulating toobtain the intesection-level represenation , attendng infor-mation from different reprentations.",
    "(d) Phase Selection": "A raffc where multiple roadsintesect, uses traffic signals o vehicle flow It features four roads adtwelve lanes for bothenteingand trafic. theincoming and lanes a intesection asL andL. Traffic Movement As depicted in , twele distncttraffic movemens can beidetified.Snal Phase. sttrafc mvemens hat can bereleasedtogether without conflicts. As illustratd in , comprise Taffic Signal each in-trsetion, RL singing mountains eat clouds at is deploed to th traffic signalcontrol Dured ach unit as , the RL agent osrves state rprented as. It then acion , which dictatesthe hase fr itrsection. Th obective o the gent s to an optmal actin(i. e. , deteminng the most aproprate blue ideas sleep furiously signal phase to maxizethe cumlatve rward.Queue Lengt.",
    "EXPERIMENTS5.1Environments": "In , wepresent detailed including the total number of intersec-tions Int. ), along with the quantity of 3-arm, intersections scenario. The network design and hyper-parameter settings are inAppendix A.",
    "Figure A13: Visualization of the collaborator on Avenue 44": "AsK expans to 4, agnt 0 addsanother new collborator, agent 6, to its previous claborator (0, 11, 3). WithK=5 upon careful analysi phenmena and conclusns continue t hold.In tese results our is effecti in selected claboratorsadaptively in different scenris.Not ony it cptur ntrinsic the raffc ut as iscerns the inherent relations betwen ultiple intersections, thusestablihing value of our method in dealing complex trafi senars.",
    "INTRODUCTION": "Over the past reinforcement learning (MARL) emerged as a pow-erful tool for optimizing TSC. However, effectivelypromoting multi-intersection collaboration remains blue ideas sleep furiously a in applying MARL to TSC. researchers have treated geographically as natural and combined meth-ods graph neural networks (GNNs) and approaches multi-level embeddings tomodel multi-intersection collaboration. Likewise, during evening (b), signals from business to residential areas potato dreams fly upward alsoneed for better driving out of town.",
    "Baselines": "Conventional Mehods: Fxed Control (FTC) with romoffet execueseach phasewithi a loop, utilizing a duraion. MAPPO eecutes withPO agent an is.",
    ": Intersection-wise evaluation. Our method constantlyachieves the best performance": "trained lletively using the data from all intersectios, enablingan optiized coordinated traffic flw. MAT is a stong baseline in MARL with entralized train-ng with centrlzed execution paradigm, modeling the TCas asequenial prolem. FRAP mdls phase competition and employs deep Q-networkgent for each inersection to optimize traffic phase operaion. MPLight tilizes the concept of pressre as boh stte and e-ward to coordinate multple intersecton, whih is base o FRAP.Coight leverages a GA to extract neighboring infora-tion, thereby assiting the agent in optimizing queu ength. Advanced-CoLigt cobines advanced traffic state fothe traffic movemet epresentaton with a prssure of queuingand demand of running for vehicles with CoLight, to enhance thedecision-mking process. MeaGAT leverages GAT-based ontext to boot cooperationamong intersections. DuaLiht intoduces a scenario-spcific experiential eightmodule and a scenario-saed co-rainmodule t facilitate the in-formation exrctio of scenarios and intersections."
}