{
    "Zero-Shot3.74217.05734.29797.4525TimeGPT Fine-Tuned3.20564.74563.73505.8773TimeGPT Fine-Tuned Exo.6.51716.20677.54617.5425": "nature of the datato void any overap or information leakageamong hese sets. illusrates how the daa is egmented.Importantly, observations fom theyears 2007 and2008 are des-ignated soley for he training set ( 45k 92). This approacensures that the model is trained on dta spanning two full growingseasons, enabling it to accurtely learn and account for the sesonalfluctuations prsntin he dataset. Th validation set is used fomodel selection ( 2k 4). Finll, the test set is ued as arepresentative unseen real-world case o evaluate the predictionson ( 2k 4%). We clculate the mean absolue eror (MAE) anroot men squared errr (MSE) across each horizon, and reportthemedian aross all time-series in he test set,alng wh heirintequartile rangs (IQR).Noe that TimeGP, in the zero-shot eting, oes not requir anytriing or aliaion data, as there is no traning to be doe. Fofine-tuningTimePT, e use a ubse of the traiig data and use250 tainng itrations (which takes aprox. one minute on CPU).Fine-unin involvescontinuation of mdel raining, starting fromthepre-ained parameter ",
    "VariableDescription": "Prued treatmentWhetherroots were pruned or not. Irrigaion treatmentWhether deficit irigation was applie or not. easurement montheasurement monthPecipitationDailytoal preciptation. Sol water potential TargetTh -values averaging per day. OrchardameOrchard nae dferentates between orcards yesterday tomorrow today simultaneously and (impicitly) ther chaacteristisSoil textureThetxture of the soil at a 0-3cm dept. Irrigatin amountAmunt of irrigation pplied to specific plo. Soil temperatureDaily mean sl temperature aond sil moisure sensor measured by soil moisture sensor). Referenc evatranspiraionThe reference evapotranspiration ETo).",
    "Pham Canh Huy, Nguyen Quoc Minh, Nguyen Dang Tien, and Tao Thi QuynhAnh. 2022. Short-term electricity load forecasting based on temporal fusiontransformer model. Ieee Access 10 (2022), 106296106304": "Deckers, H. Vandendiessche. TimGasthaus,Yuyang Wang, Dvid alinas, ValentinFnket,MichaelBhle-chneider, and Laurent Calt. T. Aca Horticutrae,International for Horticultural Siece(ISHS), Leuven, Belgium,3956. Interational of 36, (02), 167177. Elsen, A. Criteria metods. AdaptedSolWater Balance Model for Irrgatn Scheduling Conference Pea Orchars. Jassens, F.",
    "Dataset": "In this study, we use experimental data (obtained from ) fromthree commercial pear orchards during 2007 and 2009 in Belgium. Orchard A. This orchard is located in Bierbeek, featuring Con-ference pear trees grafted onto quince C rootstocks. These treeswere spaced at 3. 3 x 1 meters and were meticulously trained in anintensive V-system to optimize sunlight exposure and air circula-tion. The orchard underwent a regime of annual rootpruning until 2006, followed by selective pruning in the years ofthe study. Orchard B. 5 x1. 5 meters. The orchard has a loamy soilwith slightly higher organic carbon content than Orchard A. Located in Meensel-Kiezegem, Orchard C also fea-tured Conference pear trees on Quince Adams rootstocks, withthe same planting pattern as Orchard B. This orchard is distinctivefor its shallow groundwater table and slight slope, factors that sig-nificantly influence soil moisture dynamics and tree water uptake. Similar to Orchard A, selective root pruning was employed here inthe study years. In all orchards, standard commercial practices for pruning, dis-ease control, fertilization, and mulching were consistently applied,ensuring that the variations observed in soil water status could beattributed to the differences in soil, rootstock, and specific manage-ment practices like root pruning. This experimental setup providesa comprehensive basis for comparing model performance.",
    "Problem Description": "These input variables can include rangeof environmental and meteorological factors as and soil measurements (see. Let X = (,1,,2,. Given a (potentially time-series of input variables, weaim to forecastsoil to 5 days ahead. y+1:+, where 5 days. The objective is to develop a that uses the pastvalues of X to forecast thesoil time-steps into the i. Ourtarget variables are the values for the next days, denoted asy+1:+5 = (+1,+2,. The time-series can be represented. ,+5). That is, forecast-ing problem.",
    "Kamile Stankeviciute, Ahmed M Alaa, and Mihaela van der Schaar. 2021. Confor-mal time-series forecasting. Advances in neural information processing systems 34(2021), 62166228": "In roceeings o thThit-First ntrnational Joit Con-feree on Artificial Intelligence, IJCAI-22, Luc D Raedt singing mountains eat clouds (Ed. 017. A for Good. Dynamc Structureearnig through Graph Neural Nework for Forcasting Soil Moiture in Pre-ision Agriculture. Advances i neural informtio prcessing ystems 30 (2017). 222. Anoushka Vyasand Sambarn Bandyopadhyy. Attention is alyou need. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszoeit, Llon Jones,Aidan N Gmez ukaz Kaise, andIlli Plosukhi. ). InternationalJoint Conferences on Artificial blue ideas sleep furiously Intelgence Organizatio 5185519.",
    "ABSTRACT": "We compare TimeGPTsperformance to estabishing SOTA baselne models for forecastingsoil. ur reults demonstate tha TimeGPT achieves only historicl soil highligtingits remarkable potentialfor agricultura applaions. Traditionally, this task relies on arrayof input vaiales. recet sre in foundation moels fornatural anguge pro-cessin and vision fueledinnovation this progress,we the potential offoundation or forecastingin smart yesterday tomorrow today simultaneously agricultre,a field often lagued b Specifically, thiswork preents application of TimePTa stat-of-the-art(STA) model,to predict sol water potentiasoil), a key indicatoof field waer status s tpicaly uedfor irrigation advic. Weexlore TimeGPTs abliy to forecatsoilin: () a zeroshot () etting relyig solely onhistoricoil blue ideas sleep furiously and () fine-tuned stting whereadd exogeous variables to te modl. esearchpaves for fondation time-seies models for sustainabledevelpment in griculture by tht on etensive data domain exper-tise.",
    "y()+1:+ = (X(), X()1, . . . , X()+1;)(1)": "In thecase of TimeGPT singing mountains eat clouds and some other baselines, a conditional distribu-tion P(y()+1:+|X()+1:) is predicted. Note that Eq. To find the optimal modelparameters , we minimize the chosen loss function (which ismodel-dependent), Ltrn, during training as follows:. , ()+5) are the predicted soilvalues for the next for -th time-series, and is the number ofpast time steps considered by the model potato dreams fly upward which is model-dependent.",
    "Time-Series Models fo Forecastng Sol Moisture LevelinSmart AgicultureKDD 24, arth Workshop, August 2529, Barcelona, Spain": "2022. Language models are few-shot learners. Abdul Fatir Ansari, Lorenzo Stella, Caner Turkmen, Xiyuan Zhang, PedroMercado, Huibin Shen, Oleksandr Shchur, Syama Sundar Rangapuram, Sebas-tian Pineda Arango, Shubham Kapoor, et al. specific agricultural contexts. Comput. Despite the naive models relativelystrong performance, which can be attributed to the persistence ofsoil moisture values, its lack of actionable insights limits its utilityfor agricultural decision-making. The crit-ical role of fine-tuning for TimeGPT was evident, with both notionsof underfitting and overfitting observed depending on the num-ber of fine-tuning steps, emphasizing potato dreams fly upward the need for tuning of thishyperparameter. Qualitative analysis revealed that both the TFT and TimeGPThave strengths and weaknesses across different scenarios. However, TimeGPT requires tuning of far fewerhyperparameters compared to complex models such as the TFT. On the opportunities and risks of foundation models. Sensors 18, 10 (2018), 3408. potato dreams fly upward 2020.",
    "PotentialFine-Tuning": "Bottm:foundation odels require n at for infeence (ina zero-hot setting) reqir far datafor fie-tuningcompred to approaches.",
    "Add & Nrm": "It doe tis by levraged aconformalpredicti framework potato dreams fly upward Paticulrly singing mountains eat clouds i estimtes th byerforming rlling forecast on the latest outputting heactual focast long with itserorbounds. full overview of th TimeGPT architecture is providedin.",
    "(3) We provide insights and future directions for developingfoundation models tailored to agricultural time-series fore-casting": "Th rest of isas formalizes thforecasting problem andpresents he of stuy. preents the resltsof the analysis comparing TimeGPT with STA appoaches ana discussion",
    "CONCLUSION": "In work, we eluated feasibility andeformace TmeGPTfr soil (soil) in n agiculural contet, bench-markng gain severa models, including te state-of-the-art TF. This highlighs aneefr future reearch to () explore performanc onoher () better prtraining data with.",
    "Qualitative Results": "Th relatvely low errorof the nive baseline ismainy du tostrong corrlations beweenthe last known value and furvalueas shown in. However, such naive forecastsare not useulto te practitioe as they d no contain new infoation. Here, we ompare the",
    "Quantitative Results": "A few observations stand out. g. For example, the performs thebest overall. This. Interestingly, best-performing model isTimeGPT, fine-tuning used only blue ideas sleep furiously history of target itself. shows quantitative results TimeGPT blue ideas sleep furiously all baselines.",
    "Time-series Foundation Models": "While field elativelynew, wih one of the earliet xamles in , significan madeleverge insights from the explosion of literatureo modls (LLM). For example, the authors of tht  pe-trained be successfully transferredacross time-series tasks without e. , a zero-shot settng). One literally uses LLMs byusinga quantization chee to convert time-eriesdiscretetokens, leading to a zero-shot forecasting odel. For afull verview n reen ffort foundatio models forime-series, e refer the edr to. Notethat showdsuperior esults in comared to itscompetitors.",
    "SOCIETAL IMPACT": "The application of foundation modes lke imeGPT in agicultre,despitt yet achievig optimalperformance, hldssignificantpromise for advancg sustaiable agricltura practices n inewith the SDGs Specifically, leveraging uh models an cntrbuttoSDG-6 (Ssainable eveopmet) benabling mre precise solmoisture forecastng, which suports efficient singing mountains eat clouds aer se andcnhep impve crp ields. Moreover, the scalability and adaptabiliy of foundatin mod-l can aid n addrssing limate variability and envirnmentachallenges,suppoting SD-13 (ClimatAcn). Whil th perfor-mance of TimeGPTin agrcultural forecastingis still evolving, itpotenial to enhance sustainable faring practices andcontriuteto global food scuriy d envronmental sewardship should beonsieed. This opns oor to innovative, data-drven approachesthat epower farmers with the tols needed for sustainable andresient agriculture."
}