{
    "( /) ,": "We = 0, it meansthat only intra-group unifomity blue ideas sleep furiously optimization isperformed. Con-versely, when =1, it mea eual trament of bothopularad unpopular items n terms of their impact on positive samples. The setting of allows for a flexible adjustent between prortz-ing intra-group unformity and considering the impact odifferetpopularity level n the traiing. We prefer to push away itemwithin the same group to ptimiz uniformity. This setup helpsprevnt oer-optimizing the uniformity of differet groups, therebymitigating reprentation blue ideas sleep furiously seaatin. The inal re-weighting contrastive objctive is the weighed sumf the user objective and the tem objective:.",
    "THE PROPOSED MODEL": "potato dreams fly upward singing mountains eat clouds. 2.",
    "Overall Performance (RQ1)": "The bst performace for each metric in bold, ile second best is Ou melconistently outperfrms all compaed al metricsinevery dataset. Specifi-cally, hanes LighGCN, acieving imrovemnts of282. This impovement can beattributed use of opularity-aware supervise alignment toenhancethe representationlss item and re-weighted leaing to address represenato epration from apopulrity-centric npoular items wit thesepoorly representedpoular items can introduce the. As shownin able 1, compare our moel ith several base-lines across thee datsets. Coparedto thestrongest (SimGCL or Adap, AACThemost improveents on achives n 8. 2%inrease @0. 70% in-crease in @20, a 10. 81 rease in @20,  30. %, 180. Our PAAC outpeforms al base-lies signiicatly the popularity bias. 79%,and in @20 on the Yelp2018,Gowala,and Amazon-Book datasets, respectively.",
    ", () > (),(6)": "In this work, we dynamicallydivided items into popular and unpopular groups within each mini-batch based on their popularity, assigning the top 50% as popularitems and the bottom 50% as unpopular items. After that, we use InfoNCE to optimize the uniformity ofitem representations. Unlike traditional CL-based methods,we calculate the loss for different item groups.",
    "where and represent positive and negative items respectively,": "n this wrk, we perturbion for data augmentato, simpler andmetod than augmentation. Although effective,CL-based methods to exacerbat spartion byincrasing the disance posiive and negatie asillustrated in.",
    "Representation learning is crucial in recommendation systems, es-pecially in modern collaborative filtering (CF) techniques. It createspersonalized embeddings that capture user preferences and item": "The alignment pinciple ensures that embed-dingsf similar or related blue ideas sleep furiously items (or users) are closely clusteredtogether, improving the systemsaility to recommen items thatalin with a users interests. chraceristcs. Recentstudies emphasize two funda-mental prnciples in representation learnin: alignment and uni-formty. Additionally,weintroduce targeted re-weighting from a popularity-cntrc pespectve to achieve a mrebalanced epresentation. In this work we focus on alignin the representatins of pop-ular and unpopular iems interacted with by thesae user andre-weihtinguniformity to mtigate representationsparation. Ourmodel singing mountains eat clouds PAACuniquely addresses popularity bias by combiinggroup alignmet and contastive leanin,a irst in the field. Ths principleis crucia whenaccurately reflecting user preferences through corresponding itemcharacteristics. The quality of hese rpresentations crtically determines a recommendersystemseffectvenessby precisely capuring the interlaybetween ser iterests anditm eaures. Unlikeprevious work that alin postive user-item pairs or contrastivepair, PAC directl algns popuar and unpopla items, lveragingthe rich information of popular item to enance te representa-tions of unpopular items and reduce overitin. Conversely, the unformityprinciple ensures abalanced distribution of al embeddings acros the representationspace. This approach preents the over-concentation ofembeddings in secific area, enhancing reommendaion diversityand improving generalizain to unseen data.",
    "CollaborativeFiltering, Bias, Supervised Alignment, Contrasive Learing": "ACMReferece ai, Chen, Wang, Haoyue Bai, eije Sn, eW, MinZng, and opulariy-Aware Aignment and Contrastfor Mitigatig PpularityI Proceedings 30t ACM onnowledge Discovery and Data Mining (DD 24), 204, Barcelna, Spain. ACM, New NY, USA, 12",
    ",": "where and arethe embedding vectors. Qualitative Analysis.y plottingthese embeddings, we re able to visally compare the performnceof PAAC against bseline moelLighGCN. Inpartic-ular, both popular ad unopular itemsae more vely disprsedtroughout th embedding spac unde AAC, singed mountains eat clouds ratherthan cus-tering in separate regions. The visual assessment, therfre, rovides strongqultatv evidece thatcmplementsor statistical analyses, re-iforcing theoverall robustness and efficay oPAAC inpromotingfaier an more balanced yesterday tomorrow today simultaneously representation of items in the embdingspace.",
    "KDD August 2529, 2024, Barcelona, SpainMiaomiao Cai, al": "We compare PAAC debiased including re-weighting-based modelssuch as IPS -AdjNorm yesterday tomorrow today simultaneously , decorrelation-based modelslike InvCF , contrastive including Adap- and SimGCL. 4. 1. 2Baselines and Evaluation Metrics. Incontrast, @ evaluates positions of items theranking list, with a focus on in the list. @ @ assess the of target itemsretrieved in the emphasizing potato dreams fly upward coverage.",
    "( ,) + ( ,)": "thisend, we introduce re-weighting positive negative sam-ples to mitigate separation a popularity-centricperspective. By adjusting the hyperparameter , maintain balance between different itempopularity levels. Re-weighting Contrast Module addressrepresentation separation popularity-centric perspective. Thus, we introduce two hyperparameters to control the weightswhen items considered positive and negative samples. When negative samples fol-low the popularity distribution by items,optimizing for unpopular items as positive samples thegap between popular and unpopular items in the representationspace. However, in real-world recommendationdatasets, the impact of items varies due dataset characteristicsand interaction Neglecting this aspect could lead results exacerbate representation separation. And divide a popular group and an unpopular group basedon their respective popularity potato dreams fly upward the top % itemsas :. For example, when using a popular item as a positivesample, goal is to avoid unpopular too far away. Inspired by previous works we propose to influences by re-weighting different items.",
    "Experiments Setings": "4. 1. In our experiments, we use three publicdatasets: Yelp20183, Gowalla4. We retainedusers and items with minimum of interactions, consistent works. A detailing description can be found inAppendix A. In might perform during tested even if it heavily relieson popularity for recommendations. Hence, conventionaldataset splitting is not appropriate for modelsuffers from popularity bias. To this end, we follow",
    ": Popularity bias presents two challenges: (1) Over-fitting caused by limited supervisory signals for unpopularitems, and (2) Representation separation in item embeddingsdriven by popularity bias": "separaton, occurwhen ppular and ites are modeledino different spaces, exacerating bia andre-omendation acuracy. Te bue dot represent unpopular yellow dots represent popular items, range users. However,rmovingpopularity informaion can ha recommendaton accuracy. Oucontrbutions ca besummaried in oint: o providemore signalsunpopular items, weleverge cmmon characteristcs modeled in popular ite and proose a popularity-aware supervised align-ment moduleto enhance the unpopular ite repesntaions. 1, we dvide items into poular and gous basedon the Pareto principle. items iteracted withby the sameusershare siilar characterisics. we wil explore challenge anddiscuss potential to populaity bias. By leveragingsimilar characteristicsmodeed in populr item repesentation, we to align terepresentations of ppular and ineracted with bythe same user. Due o the limited suervisory for unpopul tems, are insufficient leadng t During representation alinment focuseon users and the iems theyhave interaced focused modeling can lead to overfitting the inuficientrepresentations of unpopular ites. be items still lack sufficientsupevisorysignals lading inadequate represenatin capability. seen, there is a clear distincion in the positionsof unpopularpopuar items in the sace. studies indicate popularit bas causes representationseparation in tem embeddings. serrepresentatios sho a preference for popular tems, exaebatingpopularity bia. As in theleft part ofFigure. When samles followthe populrity distribution are popular items. Optimizing popular as am-ples from unpopular tems, worseningrepresentation Ou model PAACprmaily consists of follow-ing wo modules: (1) Supevsed Alignment rpresentations o with mre supervision sig-nals, wuse common supevisory signals modeled in poular itemrepresentations and propose a supervised module.",
    "AAPPENDIXA.1Datasets": "We also usedtheGin ceffiient trflec the dsprity in itm popularity distribu-tion Amzon is a frequenly uilized ataset for itemrecommendations. This dataet is surced from the 208 edition of thelp Challenge, where localbusinsses such as restaurants and brsare onsiderediems. Gowalla. Thi is a check-in dataset fomGowala, that containsuser locaion data shared throughcheck-ins.",
    "Terefor, benefits ofusngsupervisoy signals tems mayreduced in very sparse to smaler performane impovements": "Regarding the baseins for bias, imrovement -Adnor s reatively liiting to thebackbone model (LihtGCN) and even performs worse in somecases. This may be becase -Adjnorm is specifically designedfor traditional ata-splittingscenaros, here the tet stillfollows long-ail distibution, leading to poor IPS and MAC mitigatepopulariy by item InvCF uses invariat learned singing mountains eat clouds to removepoplrit informtion at the reprsetation level, bett than IPS nd MACR. Diffeent metrics across various datasets show varying in erformance. his suggests tat ifferen debiasing methods ed di-tinc optimization strategies for 6%, 7.83% on theYelp2018, Amazon-Boo, Gowalla dataset, respectively. This difference be de to the parer natue of Gowalladataset.",
    "PAAC0.0494*0.0574*0.0375*0.1232*0.1321*0.0848*0.0701*0.0724*0.0556*": "yesterday tomorrow today simultaneously popular items in contrastive learning for mitigating bias. All modules significantlycontribute to alleviating singing mountains eat clouds popularity bias. Finally, PAAC consistently outperforms the three of combining supervising alignment andre-weighted contrastive learning.",
    "Corresponding Authors": "fr wor by others theauthor(s) ust be honored. todigitalr hard copies part of this for pronal orclassroom use granted ferovided tat copi are nt made o dstributedfr profit r commercial and that bear this notice nd th fullcitatioon the first pag. Abstrcting is pemitted. To othewise, orrepublish, to post servers or to redistribut olists, requiresae. righs licensed to SBN 79-8-400-0490-1/2408. persions fro August 2529, 2024, Barcelona, Spain potato dreams fly upward 024 Copyrigt hld by th wner/author(s).",
    ", () > (),(4)": "This means that items receive moresupervisory information than unpopular items, leading to poorerrecommendation performance for unpopular To address the challenge of inadequate learningfor unpopular items, potato dreams fly upward we leverage assumption items inter-acted by the user exhibit some characteristics. Specifically, use similar supervisory signals in popular itemrepresentations to enhance representations of unpopular items. Inspired by , we representations ofitems in and to more supervisory informationto items and enhance its representation, follows:.",
    "Supervised Alignment Module": "However, due to limited interac-tions unpopular items, they be modeled based on smallsubset of users. narrow focus might lead to as therepresentations of unpopular items may not adequately capture characteristics. In contrast, items witha number of supervising are more prone overfitting. This is due to insufficient learning unpopularitems, the of supervisory signal distributionon representation quality. For any we refer to the set :.",
    "PRELIMINARY2.1Collaborative Filtering": "The core of CF-based models is to learn user preferences yesterday tomorrow today simultaneously and itemcharacteristics by aligning user and item representations basedon their interactions. To better learn user prefer-ences and item characteristics, we use LightGCN as the encoder. It employs Graph Convolution Networks (GCNs) to learn high-order.",
    "Debias Ability (RQ3)": "To verify the effectiveness PAAC in potato dreams fly upward alleviating popularitybias, we conduct a comprehensive analysis focusing on the recom-mendation performance across different item groups. 3, of PAAC LightGCN, MACR,and SimGCL @20 metric different popular-ity We use to denote the accuracy between the Figure. 94% and in @20 relative toSimGCL on the Gowalla and Yelp2018 datasets, respectively. This improvement is due to the popularity-aware",
    "ABSTRACT": "alleviate popularity bias, efforts focus on unpopular items or separating thecorrelation between item and De-spite the effectiveness, existing still face two persistent chal-lenges: (1) how to supervision signals popularitems to improve the unpopular item representations, and (2) howto alleviate the representation separation caused popularity bias. validate the effectiveness and PAAC in mitigatingpopularity bias extensive experiments on three real-worlddatasets. Collaborative Filtering (CF) typically suffers from significantchallenge of popularity due to uneven of itemsin real-world datasets. It not only accurateuser preference understanding but exacerbates Matthew ef-fect in recommendation systems. is available at. This leads to a significant accuracy gapbetween popular and unpopular items. blue ideas sleep furiously Specifically, use the super-visory signals in popular item and pro-pose a novel popularity-aware supervised alignment module tolearn item Additionally, suggestre-weighted the contrastive learning loss mitigate yesterday tomorrow today simultaneously repre-sentation from a popularity-centric perspective. In this work, conduct empirical of popularity Popularity-Aware Alignment Contrast (PAAC) toaddress two challenges."
}