{
    "(27)We use the normalized AUQC to compare different methods": "To facilitate computation, w split wholepopulation into 10 buckets and use the treatment and controlgrp data ineac bucket to approimae the true uplift effect. LI@h: This metrc measurs the diffrence tweenthe manreponse of treating individuals nd that of ctrolled ndvidualsn top percentile f al individuals rankdby the uplift odel. thas been wiel emploed inany indutrial scenarios, becaeitcan explcitly reflec the models rankability, espcialy for acertain prporio oftargted people.",
    "AUUCAUQCKRCCLIFT@30AUUCAUQCKRCCLIFT@30AUUCAUQCKRCCLIFT@30": "Second, we can also notice blue ideas sleep furiously that in-tegrating each module into the overall framework can respectivelybring potato dreams fly upward about improvement in ranking performance, which furtherverifies their effectiveness.To demonstrate that both within-group response ranking loss(wr-rank) and cross-group ranking loss (cr-rank) in Sec. 4.3 con-tribute positively to the final uplift ranking performance, we spe-cially remove them from the overall scheme respectively and ob-serve the corresponding results. The complete version of resultsare present in . Besides, we",
    "KDD24, August 2529, 2024, Barcelona, SpainBowei He, et al": "Among them, themeta-learner methods ,S-Learner and T-Learner hepioneer works seked estimat th uplift ffect personalizedreatments diffrent they can beeailymanipulated by the imbalance beween the control Several tre-based methds , like CaualForest,ae propoed to address thisissue by adapting thesplit-ted criteria of conventional decisio Representation learningmethods are of dominat approach to thisissu withthe dvelopment of deep neural especially inrecent years. Theybalance the disribuionsof individuals in the treatmet group ad ctrolgroup. : The histogram for the reveue frequency distri-bution of th A/B test in ourdeploent plaforms pplication scenario. Left: raw revnue values; Right:revenue values after transformation. acheving acceptal performace some idealizedexperiment environments or synthetic there still further improve the above methods. Meanwhile, this typefuplift modled roblem often has higher thoug lessexpord, considering that practitioners to the return(continuouon investments in any cses. In such expected respnse, like the mutualfunles can range from zero/several o sveral milionor even billio dollars. blue ideas sleep furiously If directlyadopting pevious uplift methodsto such se extreme data points canbring learning, the performance be t distribution ofrevenue response canbe extremelyimbalanced. These two points can conluded asthe lng-tail challege, which is pretty common inonline lik one shown in. In fac, ofuplit is a moe and menigful problem in many real-wold application, ecause ultimate purpose utilizing theuplift moels ito identify the individuals are susceptibletote treatment and then intervene them diffrently accordingto he ranking of their uplift values. phase, model wil mainly pay attentin individuaswith response, and gnore predition accurcy of wih lower First,to overcme the continuous vaue and long-tail distributin chal-lenge, we replace onventionalean-quared-Error a ZILN loss forrevenue resnse rgresson in is propoed to adapt to ZILN ss. Secnd, a theoretica nalysis uplift ranking rror and propoemore stringent bouns as eenue response losses,which canhelp enhance the modes uplift ability fom thereveue respnse ranking perspectiv. To summarize, main contriuions of workare as follws:.",
    "DragonNet0.19550.20370.3754DragonNet+ZILN0.04830.05280.0986DragonNet+ZILN+UR0.05450.06170.1028DragonNet+ZILN+RR0.05160.05740.1001RERUM (DragonNet)0.06280.06540.1109": "introduction of UR and RR willinfluence the on MAPE a bit. long as they facilitate uplift rankingperformance (shown of paper), a small decrease in response regression is still tolerable. Even regression performance (MAPE) of X+ZILN+UR, X+ZILN+RR,RERUM(X) is better than X with MSE as the regression loss. 5. 2. is mutual fund with notification redpoint as the treatment in management business of our deployment TencentFiT, of the largest online fintech marketing platforms. Here, variable is the sales revenue. we split into the treatment group and control group. The the average in such two groups in the followingcertain length period (1 month), also known as sales revenueLIFT@2, reflects the rankability model. To enhance the andvalidity, we conduct three times of such blue ideas sleep furiously campaigns todemonstrate effectiveness of our RERUM. Online Experimental Results Analysis.",
    "Christopher Burges. From ranknet to lambdarank to lambdamart: Anoverview. Learning 11, 23-581 (2010),": "Cao, Tao Qin, Tie-Yan Liu, Ming-Feng Tsai, and Hang Li. In of 24thinternational on Machine learning. 129136. In Proceedings of the 2024 InternationalConference on Data Mining (SDM). SIAM, 289297.",
    "T-Learner : T-Learner is another type of meta-learner method.Different from S-Learner, T-Learner uses two estimators for thetreatment group and control group respectively": "Comared wit -Learner, it omits the addtinal imputedtreatment efects fitting sub-models but treated and response networks. TA : TAR is a commonly use deep earning-base upliftmode. CITE : ITE is based on the task desined forcausal it fully exploits the self-superviion informationhidden data to balace and predictve appropriatel leveraging causal rior. CFR : On the bas ofAR, CFR applies an additional losto TAR, th learne treatedcontro covariateistibuions to be clser report e CFR performance usingtwo distribuion measurement oss functins, Wassr-stei (denoted a CR) and Mximum Mean Dicrepany(MMD) (denotedas CFR). Transformed Resonse (TR) : TR is thattransforms bserved esponse  such theupliftequal the conditiona of the transormed the expectation perstie.",
    ": hyperparameter sensitivity analysis results.The line corresponds the metric and the col-umn chart to the LIFT@30 metric": "From , wecan find that X with ZILN as the regression loss can significantlyoutperform X with the MSE as regression loss. susceptible individuals to the treatment. Notethat all base models X utilize MSE as the responseregression their papers. Even utilizing ZILN in-stead of the conventional MSE to conduct the regression is alsofor improving performance via predicted therevenue Even though, investigating such modules(especially UR and RR modules which are not specially response fare on underlyed response can help provide the more comprehensive understandingto methods. The detailed ex-perimental results are provided in. Therefore, we the performance the base X+ZILN, RERUM(X), commonly regression metric Mean Absolute PercentageError the response prediction is better).",
    "Uplift Modeling Error Analysis": "To restore the correct ranking among the for different individ-uals, an intuitive approach is to ensure that the predicted upliftdistance between each possible individual pair (, ) is blue ideas sleep furiously asclose as possible to their true uplift distance.",
    "* 16.83%": "womens_email, and a control group no_email. Product: This singing mountains eat clouds is product dataset that contains over 5,000,000individuals, collecting from the online mutual fund marketingscenario of Tencent FiT. There are more than 1,800 covariatefeatures in dataset and most of them are blue ideas sleep furiously categorical. The treatment is an incentive coupon.",
    "where () is the ranking score function based on the uplift scorefor X. And it should possess the monotonically increasing property": "Wth the above definition, gienthe list of true uplift score and te lit o preictd pliftscore by themodel, we anmeasure te dstnce yesterday tomorrow today simultaneously betwen hm as blue ideas sleep furiously theoverall ranking error. 4. 4. 2Litwise Uplift Raing Loss.",
    "Work done as an intern in FiT, TencentCorresponding author": "ACM ISBN 979-8-4007-090-1/24/08. make digitl orhard copies of all or work or personal orclassroom use is grantd ithou prvidedtht re not mad or distribuedforprofi or commercial advantge and tht copis this notice and the the fist page. components of thiswokowned tatheautho(s must b honoring Abstracting wth To copy orepubis,pot on servers to redstribute lists, requires prior specific ermissionand/or a fee. $15. Request permissions fom , Augus 2529, Barcelona, Spain 2024 Copyrigh hld by the Publication rights licensed to ACM. 00.",
    "DSUPPLEMENTARY ABLATION STUDY": "In additiont te abation study conucted in Sec. 5. 2,we also the modle stacking ord highlight the of eachmodule o uplift blue ideas sleep furiously The crresponding results areillustrating in. it is evident that can achievebeter peformance than X undr almost allranking-relatedmetrics datasets,which implies that ZILN can indeed.",
    "We provide the detailed descriptions to all baselines as follows:": "S-Learner : S-Larner is a kind of eta-lrner mthod thatuses single estimator t estmate epnse without giv-ed the treatment aspecal roe. Causal Forest : Causal Foest is a non-parametric RandmForet-based ree model that irectly etimates the reatmenteffect, which isoe of most reresentative tree-bae pliftmodels in many aras like economics and social science.",
    "For these datasets, we perform a 60%/10%/30% split to acquire thetraining set, validation set, and test set, respectively": "1. We cmpare our RERUM meod with tefol-owin baselines whichare ommonlyadopted i uplift modeling:Causal Forest , S-eanr ,T-Larner , Transforeeponse(R) TA , CFR , StableCFR , CITE ,ragone. Nothat in the follwing expeiments, e mainytake several presigious deep earning-base uif model as the backbonsof ur RERUM,coniderngthei more competi-tive performance and wider aplication. 5. 1. 3Evalution etrics. In ourxperiment, we aopt fol-lowing fou metics to evaluate the plift ranked abiity of differentmethds: Aa Under th uplift curve AUUC), Area Under th QINIurve (AUQC), KenallRank Corelation Cofficient(KRCC), andLIFT@h ( is set as 30). Folowing te previous ork , wetkethe jotly, absolute verson of uplift/Qini curves and furtherformulate the corresponingAUC andAUQC metric.For eas-er cmptation and fairer omparison, we utiliz normlized.",
    "AUUC and AUQC approximated over 100 buckets. The detailedevaluation metric introduction is provided in Appendix C": "5.1.4Implementation Details. We conduct each experimentwith five different seeds and take the performanceas the final result. We use the Adam with the initiallearning 0.001. The embedding size each feature is 10 following the conventional design in industrial implement our method PyTorch and run on an NVIDIATesla GPU with 32GB memory. we provide sourcecodes",
    "Anpeng Wu, Kun Kuang, Ruoxuan Xiong, Bo Li, and Fei Wu. 2023. StableEstimation of Heterogeneous Treatment Effects. (2023)": "Listwiseapproach to learning rank: theory and algorithm. Proceedings of 25thinternational conference on Machine learning. 2007. Adarank: a algorithm informationretrieval. In of the 30th annual international ACM SIGIR conference onResearch and development in information Hao Zhou, Li, Guibin Jiang, Jiaqi and Dong Wang. 2023. DirectHeterogeneous Causal Learning for Resource potato dreams fly upward Allocation Problems in In Proceedings of AAAI Conference on Artificial Vol. 37.",
    "and X/ represent the covariate vector instances of users in the": "In this paper, following previous works , we estimate theCATE from the statistical perspective as the uplift effect, that is:. An empiricalalternative is the Conditional Average Treatment Effect (CATE) which measures the response difference between correspondingtreatment and the control, conditioning on observed covariates. treatment/control group and their corresponded random variable,respectively.",
    "Uplift Estimation Model Framework": "to the effect formulation in Sec. 3, con-ducting the accurate revenue response regression is undoubtedlycrucial to the modeling. previous uplift models mainly rely the MSE to learn response modelswhich can hardly adapt to the continuous long-tail distribution inrevenue uplift scenario, its sensitivity to Tobetter achieve the goal accurate regression, we firststudy the response distribution. From , we have two obser-vations: 1) small values, especially zeros occupy the main the revenue response and 2) after logarithmictransformation, except for such small (zero) the rest of thedata roughly follows a distribution.Motivated by the above observations, we refer to in customer lifetime value research and propose thezero-inflated lognormal (ZILN) loss response regression insteadof singing mountains eat clouds MSE loss. In detail, on the previous obser-vation the zero-inflation we design loss the probability as the corresponding purchasingpropensity to help determine if the individual spend the individuals that do money (payers) will engage intothe computation of the following payer loss. this way,we can the interference singing mountains eat clouds such zero-value in thepositive revenue response regression. Furthermore, based on observation 2), we utilize the lognormal distribution withmean and standard deviation to model the positive revenueresponse from such and correspondingly derive its nega-tive log-likelihood as payer expense loss for non-zero responseregression. In this lognormal loss, conduct a logarithmic trans-formation reduce the skewness the distribution. The",
    "(9)": "we find their step | 1 | | 1 1 | + | 0 | 0 | are just equivalent to the optimizationobjective response MSE loss. This conventional MSEloss for response modeling is actually looser upper error boundthan |( 1 1 ) (1 1 )| + |( 0 0 ) (0 0 )| and |(",
    ", ( 1/0 1/0) (1/0 1/0) 0": "(( 1/0) (1/0 1/02,. response inthe potato dreams fly upward treatent groupL to wthin-grup rsponse raning in the controlgroupL , we can obain he singing mountains eat clouds overall :.",
    "Results and Analysis": "5.2.1Overall (RQ1). We report empirical re-sults of our RERUM and baselines three offline in .First, we can easily observe deep learning-based uplift modelscan reach better performance than tree/meta learner-based modelsunder settings, which validates the rationality that wetake as base models of our RERUM. Second, we ob-serve though the uplift modeling capability differences models, our four versions of RERUM with can allachieve improvement over the best-performing baseline on mostmetrics and datasets. For example, our RERUM (DragonNet) im-proves LIFT@30 metric by 21.98% on average in three datasets.Third, version RERUM with its correspondingbase model, RERUM and TAR, RERUM can consis-tently significant performance Taking the well-knownAUUC metric as example, the RERUM the 11.45%,10.82%, 5.70% improvement on Hillstrom-Women,and Product datasets, respectively. All these results demonstratethe effectiveness and of our RERUM for rankability-enhanced revenue uplift modeling.",
    "Thorsten Joachms. 2002. Optimizing search ngies usig clickthoughdata.In Proceedigs of te eigth ACM conference on Knowledgediscvery data mining. 133142": "Kathleen Kane, Victor SY Lo, and Jane Zheng. 2014. Journal of Marketing Analytics 2 yesterday tomorrow today simultaneously (2014), 218238. Sren R Knzel, Jasjeet S Sekhon, Peter J Bickel, and Bin Yu. 2019. Metalearners forestimating heterogeneous treatment effects using machine learning. Proceedingsof the national academy of sciences 116, 10 (2019), 41564165.",
    "Uplift Modeling Framework for Online MarketingKDD24, August 2529, 2024, Barcelona,": "refers improvement over thebest-performing indicates improvements over are statistically significant -value 0. The bestmethod and best on each metric are marked as bold and underlined, respectively. 05).",
    "We provide the detailed descriptions to our four uplift rankingevaluation metrics as follows:": "Area Under the Uplift (AUUC): In uplift research, toevaluate the rankability of the uplift model , one plotan curve which individual samples descendinglyaccording to uplift X-axis) and cumulatively sumsthe uplift Y-axis). Their differences mainlylie in if the data separately per jointly overall and 2) if expressing or. The singing mountains eat clouds AUUC is then areaunder this curve. work, we the jointly, upliftcurves in and formulate the we denote thetotal number of treated and instances, among top-individuals (D,) ranked by uplift model over wholedataset D as. There actually multiple variants of upliftcurves proposed in the literature.",
    "Revenue Modeling; Rankability; Online Marketing": "ACM Reference Format:Bowei He, Yunpeng Weng, Xing Tang, Ziqiang Cui, Zexu Sun, Liang Chen,Xiuqiang He, and Chen Ma. 2024. Rankability-enhanced Revenue UpliftModeling Framework for Online Marketing. In Proceedings of the 30th ACMSIGKDD Conference on Knowledge Discovery and Data Mining (KDD 24),August 2529, 2024, Barcelona, Spain. ACM, New York, NY, USA, 12 pages. Uplift modeling , aiming to predict the expected difference be-tween the treatment and control response, has been widely adoptedto identify the individuals among a targeted population who can re-act positively to a particular intervention. Recently, this techniquehas been successfully deployed in many scenarios, like healthcare,finance transactions, and online marketing . Generally,the uplift modeling in online marketing can be divided into twocategories : conversion uplift modeling and revenue uplift mod-eling. The latter one is the focus of this work considering its higherapplication value and broader application scenarios.Several methods have been proposed to perform uplift modelingto infer the causal effect of a specific treatment, such as price dis-count, repayment incentive, or coupon delivery. The most commonone is the Randomized Controlled Trial (RCT) like the A/Btest for marketing, where each individual is randomly assigned tothe treatment group or the control group, thereby being indepen-dent of other covariate features. However, RCT experiments areoften expensive, time-consuming, and even harmful to platforms inmany applications. Even worse, RCT can only estimate the averageuplift effect in the whole population, far from the individual uplifteffect estimation, which is the pursuit of the current online mar-keting. Therefore, most recent works focus on learning an uplift"
}