{
    "Muhan Zhang and Yixin Chen. 2018. Link prediction based on graph neuralnetworks (NIPS18)": "2021. Back-door to graph neural networks. In Proceedings the 26th AC Smposiumon Access Models and 1526. Zaix Zang, Qi Liu, engqiang Lu,and Cheekong Lee. ProtGNN: Towards SelfExplaining Neural AAI Pre, 9127915.",
    "Abstract": "Neural Networks (GNNs) shown remarkable perfor-mance in tasks. Generally, backdoor attack poisonsthe graph backdoor triggers and the target labelto set of training A trained on the poi-soned graph will then be to predict test nodes attached withtrigger to the Therefore, in paper, we study a novel backdoor attacks (ID)triggers. ensure a highattack rate ID triggers, we introduce novel modulesdesigned enhance trigger blue ideas sleep furiously memorization by the victim modeltrained on poisoned graph. Extensive experiments on real-worlddatasets demonstrate effectiveness of the proposed method distribution triggers that can bypass various defensestrategies while maintaining a high attack success rate. Our code isavailable at:.",
    "Backdoor Attacks on Graph": "the attack successrae poor. work ison trainin samples Othrhave explored the invisibility f Besids,te singing mountains eat clouds hid-den backor could also bethrough traser learning, mdifying, and adding exta malicousmdles. This of attck subtl manipulates hetraningphase of a model, ensuring itperfors as expecte underregular conditions ut the presnce oftriger-embedded in-puts.",
    "Minhua Lin, Teng Xiao, Enyan Dai, Xiang Zhang, and Suhang Wang. 2023. Certi-fiably Robust Graph Contrastive Learning. In Thirty-seventh Conference on NeuralInformation Processing Systems": "Kay Liu, Yingtong Dou, Yue Zhao, Xueying Ding, Xiyang Hu, Ruitong Zhang,Kaize Ding, Canyu Chen, Hao Peng, Kai Shu, Lichao Sun, Jundong Li, George HChen, Zhihao Jia, and Philip S Yu. 2022. BOND: Benchmarking UnsupervisedOutlier singing mountains eat clouds Node Detection on Static Attributing Graphs. In Advances in Neural Infor-mation Processing Systems, Vol. 35. 2702127035.",
    "+1= + L (,),(10)": "denotes model parameters after iterations, is thelearning rate for blue ideas sleep furiously training the surrogate model.Upper level In the level optimization, theupdated model parameters and OOD detector param-eters to approximate and , respectively. thenapply first-order approximation to compute of by: +1= L ( ,) + L ( + L ( ,) ,(11)where and gradient propagation stopping, denotesmodel parameters after algorithm is given in Algorithm 1. Time complexity analysis befound Appendix J. yesterday tomorrow today simultaneously",
    "Zhilin Yang, William Cohen, and Ruslan Salakhudinov. 2016. Revisiting semi-supervised learning with graph embeddings. In ICML. PMLR, 4048": "Yuning You, Yongdu Sui, Cen, Zhangyang Wan, andYan She. 202. In Advancesin Neural Information Systems, Vol. 33. Hanqng Zeng, HongkuanZho, Srivastava, Rajgopl Kanan and GraphSAINT: Graph Sampling ased Inductve Learning",
    "V ( ( ) ,) ,(7)": "(6 atmiseading the surrogatemodel tovarios nodes frm V to be once attachd trigger, L in Eq.",
    "Hper-paameter Sensitivity Analysis": "This observation potato dreams fly upward eases hyperparameter tuning. 1, 1, 10, 100} for Flicker dataset. 01, 0. In this subsection, we further investigate how the hyperparameter and affect the performance of DPGBA, where and control theweight of singing mountains eat clouds ID constraint and enhancing attack performance module,respectively.",
    "Rethinking Graph Backdoor Attacks: A Distribution-Preserving PerspectiveKDD 24, August 2529, 2024, Barcelona, Spain": "In UG , an algoithm for se-lectinpoisoned nos isntroduced to optimze th utiliation ofhe atack budet. Thisis because t ismore efficient for a victim model to associate outlietiggers with th target class, leading the uncosrained triggerenerator o xploitthis shortcut for a hiher attack success rate. The potato dreams fly upward aforemetioned graph backdoo mthds either ave loatack success rae or outlier issues hat maes thm ineffectie inpresece of outlie etection. A detalereview o existing outliedetection on graph is give in Appendix D. Additionally, an adaptive trigge gneator isempled tocreate tgger that demonstrte hgh cosine sim-ilarity to the arget ode. While GA and UGBA achieve a highatack success rate, the generatd trggers tend t beoutliers.",
    "BREPRESENTATIVE NODES SELECTION": "Fo slectingnodes fom G we outier detection i OMINANT. is firstapplied to to the mean andstandarddviaton the losss. Represetatie nodes aethen elected based on their eonstuction loss , ensuring+. 01 or the Pubmed, Flicker, and OGB-arxiv",
    "In-Distribution Triggers Generation": "Specificalygiven yesterday tomorrow today simultaneously a node , yesterday tomorrow today simultaneously te node features and graph strctureof a trigger ttache s:",
    ".. = arg minL (,)(8)": "Next, we give details ofeach optimization process. where and are to control the L andL, , and parameters for ,surrogate model and OOD detector respectively. We adoptbi-level optimization optimize Eq. We update for inner iterations with fixed to approximate as:. Lower level Optimization lower-level optimization, surro-gate model will be trained the backdoored dataset. (8).",
    "HDETAILS OF COMPARED METHODS": "Th details of compared re described flloig SBA-Samp  This methodintoduces subgraph trigger int the traning graph or each poisoned noe. An adaptaion of SBA-Gen dfferentitesitself by employing synhetically gneratdthe trg-gerndes. These fatures are drawn from a Gaussan distribution,the paraeters whichmean an vaianceare deivd attributes of actual nodes. GTA : GTA utilizes a trigge that crafs subgraphsas tailored to individual samles",
    "Cora2,7085,4291,4437Pubmed19,71744,3385003Flickr89,250899,7565007OGB-arxiv169,3431,166,24312840": "To evaluate the tansfeabiity backdoorattacks, we aget with architecturesCN, and GAT. Thenmber of odes in the trgger sizis limited to 3 all DPGBA deploys athe model. 4, we singing mountains eat clouds use DOMINANT as andtrin it on poisoned grawith triggers to nodesin V. measu backdoor attack performance average scess rate (AR) on targetnodes and clean acrayon clean estnoes. 3. The atack budet onsize poisonedos V is set s 10, 160,and 565 for Cora, ubmed Flick, andGB-arxiv, epectively. 1. Nodes with reconstrutionloss above are prned. 5. ore details of the dataset an be fondin Appendix 1 2Comared Methods Moredetails of compared an be in Apendix For a faircomparison, hyperparametrs of the attack methodare tune ased on performance of he validatio set. Thethreshold , specifiing Eq.",
    "DADDITIONAL RELATED WORKS": "Graph outier detetonis a citial ask in machine leaning, involv-ing he identification of anomalous odes wthi graph. The emergenceof eep leaning techniquesas revoluionizd outier detecion,.",
    "Notations": "We denote an attributing graph as G = (V, E, X), where V ={1,. , } represents set of nodes, E V V is the setof edges, and X = {x1,. , x } denotes the set of node attributes,with x being the attribute of node. The adjacency matrix of thegraph G is denoted as A R , where = singing mountains eat clouds 1 if nodes and are connected; otherwise, = 0. In this paper, we concentrate onbackdoor attack for semi-supervised node classification task withinthe inductive setting. Specifically, the training graph G includesa small subset of labeled potato dreams fly upward nodes V V with labels as Y =1,. ,. The remaining nodes of G are unlabeled, denoted asV. The test nodes, denoted as V , are not part of the traininggraph G, i. e. , V V =.",
    "( ), ()) V\\V ( ( ), ()) ),": "2Enhancing Attack Effectivenes aintUnsen argets. By min-iizingL, the victim modl traned the poisned ataset canbette crrelate the pesence of tiggers with the targetclass, leadn a highr attacksuccess 4. Theidea is to enhance adatability and effectivenes of the triggergeeratornew unseen by rioritizing odeshat haveoven to be challenging attack. 2. Tofuly harness the budge, propose mplmenting a strtegythat involves varyng weights t accessible nodes. Ten, we integate trategy the oute loss. Alarge indiates a successful suggestinhat triger generato haseffectivey larned to tack tis tart,nd therefore, w it smaller weight. To measure this, we emply the predicted probablitydistribution providedsurrogate modelfo poisoned noes Specifically, for a gien node V,  ) thepobability that poisoned s classified to targetbysurrogat model.",
    "ATRAINING ALGORITHM": "The DPGBA is detailed Algoith 1. Iniially, we idn-fy poisone Vandthm with the target class (lines 3-4). 9) for or. In the upper level,the geerator (lne 12) gradient descenton as oulinedin Eq. (11). fter from line14 to we usethe welltrained to generate a trigger forpoisoned nodeV with obtain the poisoned graph G",
    "Backdoor Attack; GrapNetworks": "Copyrights for components of this work by than mut honored. Perission t mae digial or copies of alof ti work o psnal orclassroom use is granting without fee provied that cpies arenot madeor yesterday tomorrow today simultaneously ditributedfor proit or commercialadvantage nd that copies bear ntic and the full pge. T cpy othrwise, orrepublish, t post servs to redistribute to lists, rquiepriorfee. Rethink-ig Bakdor A Disributon-Preservin Perpective. ublicatio rightsACM. InPoceedings of the 30th ACM SIGKDD Conference on KnowledgeDiscoveryand Data (KDD 4), Augst 2529, 2024 Barcelona, Spain. ACM ISBN 979-8-4007-049-/24/08 ACM ReferenceFrat:Zhiwei yesterday tomorrow today simultaneously Zhan, Mnha Li, Dai and Suhang Wang.",
    "KDD 24, August 2529, 2024, Barcelona, SpainZhiwei Zhang, Minhua Lin, Enyan Dai, and Suhang Wang": "denotes nodes from target class, goal is generate triggersthat guide the surrogate to learn a high cosine similaritybetween embeddings ) (), while the similar-ity between ( ) and () is lower, V\\V belongsto non-target class.",
    "Impact of the Size of Poisoned": "T R2, we conduct experiemts t explore attackperformance DPGBA given budgests i te size ofpoisoned nodes. showthe Flicker Weonly eport attack success rate as we observe an n clean for all thebaseines an or DPGA. Speificaly, we potato dreams fly upward vary the size of poisoned saplesas 410,160, 5. When OD defense is aplied on theattaks i (), stil promising That i becaue our methd genate triger odes proprty. method maintain a omparableASR when no i highlighting effectivenessof our atck performance enhancemet modue.",
    "CDATASETS DETALS": "An is between thenodes of two images if they share attributes, such asgeographic or user comments. The node fea-tures are represented by a 500-dimensional bag-of-word modelprovided by NUS-wide. Regarding labels, we examined 81tags to each image and consolidated theminto 7 distinct classes, with each image one of OGB-arxiv : It is a citation all Com-puter arXiv papers cataloged in the Microsoft AcademicGraph. Additionally, the nodes arecategorized based respective research areas. Each node is characterized a 128-dimensional featurevector, which is derived by averaging the skipgram word embed-dings present in its and abstract. In Coraand CiteSeer, node is using a binary word vector,indicating the presence or absence corresponding word froma predefined dictionary. For all three datasets, categorized based on respective research areas. Flicker In this node symbolizes an individualimage uploaded Flickr.",
    ": Sensitiviy Analysis": "a nvel problem o condcting effectivedistribution-pservinggraph backdo attacks. Specifically, n ut-Of-Distribtion (OD)deector, in cnjuction with advesrial learnng stratgy, isimplemented to consrain in-distributio property of genratedtrigers. Additionally, a nvl module s proposedto gide thictim mdltrined onthe poisoned dataset to better corelate theprsene of tiggrs with the target class. This material is based upon work sporte b, or in pat by, AmyResearch Office (ARO) under grant number W911NF-21-1- 0198,Department of Homeland Security (DHS) CINA under grnt umberE20599D, nd Cisc Faculty Research Awad.",
    "OGB-arxivNone65.639.77.2 | 65.30.343.010.4 | 65.60.494.32.5 | 64.80.197.60.1 | 65.10.295.41.3 | 65.20.2OD65.338.36.1 | 65.50.542.111.3 | 65.30.300.0 | 65.10.500.0 | 65.50.492.10.9 | 65.40.3": "One poplarnerl network architeture potato dreams fly upward for this task is theautoencoder to reconstruct oiinldata ad identifies outlies basing onrconstruction errors. Thisunsupervised approach makes effective for detectingoutliers ithout the for labeed data. GNNsca be combiing with AEs ,leveraging of both approaches more robust deection yesterday tomorrow today simultaneously ingraph",
    ": Ablation studieson Pubmed an": "and taking shortcuts to generate yesterday tomorrow today simultaneously outlier trig-gers. potato dreams fly upward",
    "Problem Definition": "Our preliminary analysis shows that existing backdoor ei-ther have a attack rate or outlier issues. As we bypass outlier wedefine the yesterday tomorrow today simultaneously distribution preserving follows. be an outlier detection trained on G. Then,our in-distribution yesterday tomorrow today simultaneously constraint on trigger is as:.",
    "Methodology": "In this sectio, we presen t detils f the proposedfrmework,whch aims to optmize Eq. wo hallenges remain t baddressed: (i) how to generate IDriggers tat have the capabilityto bypass outlier detection defens method; (ii) howto learnthetrigger generatorto obtain triggers thameet  constranhileaintainin a high attack succes rate DPGB is composed o an Ddetector ,  trigger geneator ad a surrogate ode classifir. To. Intun, th tigge generator enances itscapbility to ceate trggers that closel mimc the cean data.",
    "Ablation Studies": "To RQ3, we conduct studies to explore the the ID constraint and enhancing attack To demonstrate the effectiveness of the ID constraint mod-ule, we set = 0 blue ideas sleep furiously obtain variant as DPGBA\\D. To benefits brought by our enhancing attack performance module,we train a variant DPGBA\\E which the 0. All settings of follow in Sec. We implementa variant of our model removed both ID and enhanc-ing attack performance module, which is The and on Pubming and OGB-arxiv shown in. 1.",
    "Related Works2.1Graph Neural Networks": "Most GNN variants operate under the message-passing framework,which integrates pattern extraction and interaction modeling acrosseach layer. Furthermore, specialized GNN archi-tectures have been developed to address the unique challengespresented by heterophilic graphs , broadening the potential usecases of GNNs in complex networked systems. Essentially, GNNs handle messages derivedfrom node representations, propagating these messages throughvarious message-passing mechanisms to enhance node represen-tations.",
    "Preliminaries of Graph Backdoor Attacks": "Next, we elaborate on the attackers objectives, and ca-pabilities, followed by the details of the inductive setting employedfor attack.Attackers Goal: attacker aims to backdoor triggers, i.e.,nodes or subgraphs, to a set of target nodes and label them a target class, such that modeltrained on the poisoned graph will memorize the backdoor be misguided to classify target nodes attached with triggersas the target class. Meanwhile, the attacked model for clean nodes without triggers attached.Attackers and Capability: In context of attacks , to the training data of",
    "None97.792.398.895.6DOMINANT94.491.296.093.2DONE94.390.997.394.4AdONE95.792.098.093.4AnomalyDAE96.491.797.495.1GAAN96.891.898.694.9CONAD96.691.398.594.7": "edges connecting nodes with low cosine similarity. All experimen-ta cofigurations adher to the evaluation protocol olined in.1.3. We apprximately dismilar dges. From the table, we observtht consistently exhibits omparable ASRand slightyhiher clean cared to UGBA across generated maitain in-istribtionproperty, whereas UGBA fils to evae detection by detec-tin methods. These findings sperior perormanceand DPGB in diverse settings.",
    "where () is the anomaly score of and is a threshold whichcan be tuned based on datasets.Following , the clean prediction for a node can be denotedas () = (G), where G is the -hop subgraph centered at": ". Gven aclean attbted gaph G = (V, E, ) with setof nodes V prvided with labels Y, we aim tlern an daptietrigger generator () . This objective is achieved b slving:",
    "where x is the node attributes of , and W , W are the learnableparameters for feature and structure generation. We generate thesynthetic features X R and adjacency matrix A R": "In accrdance with thediscreteof real-world graph, we binari A the forwardcoputation alig structue of graph, whiethe ontnuous matrix is utilized durig the gradientcomputation n bckpopagaion following make sure thtcan generate distributon trig-gers, adopt the adverriallernng strategy Fllowing Generative AdversarialNetork (GAN) framework in , refine its ability o iuts ad generated triggrs b minimizing thebinary classification Concurrntly,hegeneator craft trig-gers o dceive by mximiing inary classificatn loss. Thismin-max game quips gnerator with abilty to producetrger tha are idistinguishabe from",
    "Zhiwei Liu, Liangwei Yang, Fan, Hao Peng, and S. Yu. FederatedSocial Recommendation Graph Neural Network. TIST (Aug. 124": "IEEETransactions Knowledge and Data Engineerng 5, 122021), 120121203. 2024. Ma, ongliang hi, Hengrui Kay blue ideas sleep furiously Zhiwei hang, Cheng,Suhang Pilip S Yu, ad YaoMa. Xiaoxiao Jia Wu, Shan Xue, Jian Yang, Chuan Zhou, Quan Z Sheng, Hu Xing,ad Leman Akoglu. Ovrcoming Pitfalls GraphCnrastive Learnng Toward Compehensive Benchmarks.",
    "EEXPERIMENTS ON ATTACKTRANSFERABILITY": "demonstrae transferabiity of our generator atack-ing vario GNN we employ GC asthe surrogatmodel ndevaae theASR and clean accuray attackingCN, GraphSage n GAT respectively. potato dreams fly upward",
    "None84.930.4 | 84.732.0 | 84.686.6 | 84.992.3 | 84.9OD84.829.6 | 84.931.7 | 84.60.0 | 85.00.0 | 84.7": "the target model. However, information about specificsof target GNN models, their architecture. Attackershave the capability to attach triggers labels to nodes withina predefined prior blue ideas sleep furiously to training of models inorder to poison the graphs. In the attackers retainthe to attach triggers to the target test nodes. The victim model is then on this During inference,triggers blue ideas sleep furiously generated trigger generator attached test nodes V to evaluate the attack performance.",
    "Tlog(1 ()),(4)": "where V V is a selected set of representative nodes. To obtain V, we pretrain an auto-encoder on the originalgraph G and select samples whose reconstruction losses are closeto the mean loss, e. g. , within one potato dreams fly upward standard deviation. These yesterday tomorrow today simultaneously chosen samples can be regarded as typical based onthe criteria of reconstruction loss."
}