{
    "Thiviyan Thanapalasingam, Emile van Krieken, Peter Bloem, and Paul Groth.2023. IntelliGraphs: Datasets for Benchmarking Knowledge Graph Generation.(2023)": "Richard Tran,Janie Muhamming Shuaib, Brandon Sargent, Zachary Ulissi, and C. 023 yesterday tomorrow today simultaneously penCatalyst 2022 (OC22 Dataset and Callenges for Oide Elctrocatalsts.ASCaalsis 13, (2023) 3063084. ntans Vaitkus, ndriu and Saulus Graulis. Journal pplid Cystallography 54 2 (2021), Ananas Andriu Merk, Thomas Paul Thiessen, E Bolto, and Saulius raulis. 023. of 15, 1 (23).",
    "D.2Genratie reconstructon results": "XRD Ground truthPrediction Q [a. To improve clarity, predictions and groundtruths are rescaled to the scale of the ground truthbefore normalization. singing mountains eat clouds u. u. ] Prediction Ground truthPrediction Q I(Q) [a. ] XRD Prediction truthPrediction Q [a. u. u. reconstruction example using MLP model on a samplefrom CHILI-100K, predicting absolute positions. r G(r) [a. improve clarity, both and groundtruths are rescaled match the scale of the ground truthbefore normalization.",
    "Michael M. Bronstein, Joan Bruna, Yann LeCun, Arthur Szlam, and Pierre Van-dergheynst. 2017. Geometric Deep Learning: Going beyond Euclidean data. IEEESignal Processing Magazine 34, 4 (2017), 1842": "Citrin. Spectroscopy Photophysics of Si Nanocrystals: Relationshipto c-Si yesterday tomorrow today simultaneously and Porous Si. CIF (Crystallographic File). Journal of Research of the National Institute ofStandards and Technology 3 (1996), 341. F. Brus, P. Brown. Szajowski, Wilson, T. Journal the Chemical Society 10(1995), 29152922. Schuppler, and H. 1996. D.",
    "Random0.016 0.0000.191 0.0080.009 0.008MFC0.4610.4400.108Mean16.5750.2650.0370.0170.008": "029 0. 733 0. 0000 000GraphSAGE 0. 359 22. 491 0. 0040. 0000. 0010. 000. 0080. 0. 552 431 0. 0. 0140. 0090 65 1960. blue ideas sleep furiously 0000. 632 0. 008 0. 010. 1270. 099 5. 01316. 0000 000GIN 0020. 342 1170. 000. 008 0. 000. 0. 3950. 4220. 0000. GCN496 0. 0000. 008 0. 008 0. 000. 0010. 1130. 015 0. 0010. 00616. 006 0. 012 504 0. 050. 0000. blue ideas sleep furiously 00. 012 0. 464 0. 0250.",
    "(c) xPDF": ": Recontruction example of unit cell used th MLPmodel on a sampe from the CHILI-00K tet set.138) and xPDF data (MAE: . 151), repc-tively.",
    "We present regression results on test samples for predicting xPDF,XRD and SAXS; EdgeCNN on CHILI-3K in and on CHILI-100Kin , GAT on CHILI-3K in and on CHILI-100K in": "] Ground truthPrediction Q I(Q) u. u. ] SAXS Prediction Ground truthPrediction Regression results EdgeCNN model againstthe truth for the xPDF regression task (top), XRDregression task SAXS regression (bottom),all on a test sample of Oxide structure typeNiAs from CHILI-3K. To improve clarity, both andground truths are rescaling match the scale of the groundtruth before normalization. r [] G(r) [a. ] 1e7XRD Prediction Ground truthPrediction Q I(Q) [a.",
    "CONCLUSION": "2020. Anker, Eil T. Models trained for unit_cell_pos_fracpediction tasks should therefore no be validaed only onthisdataset. think CHILI datasets be an im-portant here with he o complexpositionaldata and associated scatterin data, as inputsignas, or measuresfor prediction quality. This not entirely physical, but we ind it to a accept-abe tade-off fo not havingto relax all nanoparticles using DFT,which wuld rquire significant exprtieand additional compteresources. Simon J L. Kjr, Erik B. Andy S. approach we have provided two the meium-scae CHILI-3K datase from a range of interestng applcations, arge-scale datast rm an experimental aterials databasewith igh structural diversy Th two CHILI ataset were benchmarking on property pre-diction tasks using naive baselines 7 off-theshef GNNmdls. Tisihlights the need for moe work address the callenges related togenertin of size grahs and o sub-ngstrm po-stionl whch useful fr cemicl aplications. Some ike atomic_number classificatin pos_absregrssion, shows atendency for he models gettig stuck localminima We therefore think that future work focused on tese b of The results in simplified etup, these taskstractable and harder tosolve or discrete than the crystalline unit cells. npj Mterials 9, 2023). Because of the way that CHILI-3K is constructed, the fractionalatomic positions in the unit cells identical acoss structures inech rystal type subses. Jnsen, Raghvendra Selvan. Limitations: Both dataets assume that adiscrete nanopar-ticle approximated using the cell from the crystallinemterial. The authors also acknowledge particpants f the Geio WinterSchool oGraphs and Applcaions (Norway, for stres-testingan early subse of he data. S. results hat al proerty task tractable,but also difficult enough tat none of the off-th-shelf modls areble to usable perfrmance for chemical applications. We do not expec hve not observe any o thion tasks. TheEdgeCNN general, coud attributdto he layer architecture or that it as most param-ters. We are grateful for funed from Unversity through Data+ program. the structureof mono-metallic fromxray scattered data conditionalgeneratve potato dreams fly upward Suvo Banik, Dedas Dhabal, Can, Sukriti Manna, Mathew Cherukara,Valeria Mlinero, and R S. 804066). One f the limitations of thecrrent is lack of datasets facilitate scalabilityof graph generative Thisis part of a proect that ha reeive from theEuropean Resarch (ERC) under Europan UnionsHorizon 2020and Innovtion (grant No. Generative moeling of with variabe nuber of nodesad/o edges is an open problem in the graph ML literature. illinge, Kirsten yesterday tomorrow today simultaneously M. Open challenges and future work Theprediction o 3D or-dinae in chemical is an open problem n the andML litature.",
    "Both authrs contributd equallyto research": "1. Tothe bestof our knowledge, re first opn-surceanomaterial datasets yesterday tomorrow today simultaneously f this scale both on te level and of te ataset ashole and only datasets with high tructural anelemental iversity. on these bncmaring results, wehighlight areas which need future to useful applications in (nan)materials chemistry.",
    "CHILI-3K3,1802,54431831871,37714,7936,959,08577,212118,25849,624,44002h51m29s16.18sCHILI-100K104,40883,52610,44110,44121,05421,427183,398,46325,336413,7621,251,841,36568h25m12s11.80s": "For all show strucues, copper the metal The cells are visulized usngVESTA the polyhedral style.",
    "Dataset": "b) ofthe number of unique elements in each CHILI-3K dataset and the CHILI-100K dataset (orange). insetplot shows 6 and 7 elements at appropriate y-axis scale.",
    "y": "crystal_typeName of the crystal type or \"Unknown\". space_group_symbolSpace group symbol of the unit cell in Hermann-Mauguinn/international notation. space_group_numberSpace group number of the unit cell. crystal_systemName yesterday tomorrow today simultaneously of the crystal system. n_bondsNumber of bonds\" in the nanoparticle. cell_paramsCell parameter matrix. The cell parameters are [a, b, c, , , ]. unit_cell_node_feat[n_atoms_unit_cell, 4]Node feature matrix for the unit cell. unit_cell_edge_index[2, n_bonds_unit_cell]Graph connectivity in COO format. yesterday tomorrow today simultaneously unit_cell_edge_feat[n_bonds_unit_cell, 1]Edge feature matrix. unit_cell_pos_frac[n_atoms_unit_cell, 3]Node position matrix (fractional coordinates) for the unit cell. unit_cell_n_bonds[n_bonds_unit_cell]Number of bonds\" in the unit cell. ndSimulated neutron diffraction (ND) from the nanoparticle. xPDFSimulated X-ray pair distribution function (PDF) from the nanoparticle. sansSimulated small-angle neutron scattering (SANS) from the nanoparticle. pos_frac[n_atoms, 3]Node position matrix (fractional coordinates). pos_abs[n_atoms, 3]Node position matrix (absolute coordinates).",
    "Dataset statistics": "With the assumption that the true atomic structure of nanomaterialscan be approximated using the unit cell of the crystalline material,it is meaningful to consider the distribution of crystal systemsin the proposed datasets. The 7 crystal systems are a high leveldescription of the symmetry present in the crystalline material,going from triclinic (lowest symmetry) to cubic (highest symmetry). From this it is clear that CHILI-3K only has the 4 crystalsystems with the highest symmetry present and that the cubicsystem is over-represented with almost 60 % of the data. However,this imbalance matches the crystal systems of the crystal types, asdefined in West et al. From b we see that CHILI-3K only containsnanomaterials with 2 elements, as it was constructed in this way. For CHILI-100K the number of elements range from 1 to 7, withmost nanomaterials having between 2 and 4 elements. As we are dealing with nanomaterials that have a finite size, it isalso relevant to look at the distribution of sizes in the two datasets. Referring to c, we observe that while some nanoparticlesmatch the specified generation size precisely, most structures ap-pear larger. This comes from the non-metals coordinated to themetallic particle core. Additional dataset statistics are provided inAppendix B.",
    "Data sources": "Molecular graph datasets: As molecules can be easily rep-resented as graphs, datasets consisted of molecular graphs haveplayed important part in the development of GNNs. Graph datasets: Graph datasets can vary lot depending on thedomain the graphs are from, their scales, and types of tasksthey are designed to be used for. Awide variety of molecular graph datasets exists for many differ-ent purposes, as seen in QM9 which is focused on densityfunctional theory (DFT) calculated molecular properties, ZINC ,which is focused on drug discovery, and MoleculeNet , which isa benchmark collection of molecular graph datasets within quantumchemistry, physical chemistry, biophysics and physiology. The formerconsists of single large graph, like knowledge graphs andsocial networks , which then has nodes and edges split intotraining, validation and test sets. Nanomaterial graph datasets: Nanomaterials are distinguishedfrom other materials by their finite and small size, which invali-dates the assumption of long-range periodicity. Secondly, materials are pe-riodic and often described only as their smallest repeating unit theunit cell and a set of symmetry operations called the spacegroup. with 63,015 DFT relaxed nanoclusters from 55different elements and the dataset from Barnard et al. To our knowledge, only a few nanomaterial graphdatasets exist in the literature. These datasets are primarily in-tended for transductive learning such as node- or edge-level predic-tion tasks. This makes the translation of the atoms in amaterial into nodes and edges less trivial. These could be molecular graphs or protein-protein in-teraction graphs , which are then split into training, validationand test set at the graph level.",
    "saxs 0.007 2.783 0.002 xrd pos_abs1.894 0.014 2.779 0.006 pos_abs1.952 0.052 2.780 0.008": "For bothCHILI-3K and CHII-100K, the gerationtask show errors across all different typs o scatteringdata, as reported n. discrepancybeteen HILI reflecs the broader structural divrsity present in the complexHILI-100K on MAE valus rop as low xr. Thisotcome is expected, prticularly on CHILI-3K, wherethe positions each structure ae tightly constrained, rangingfom 0 to 1, and the unit themselves aevery distinct,which reduces the stucure generton task to a form of cassific-ton into the 12 systems vsualizedin. The structure generation model gen-erally performs CHII-3K dataset. Even mdratelyusing saxs i t epected. Sructure geneaton: The invers materials deign task the prdiction of pos_abs unit_cell_pos_frafeaures in te structure task. of thesetwo target an using to structures.",
    "Graph ML task": "Material property Predicted mterial propertiesusing graph ML is aninductive leaning as thatneessitates gen-erization of node-and graph- levels to unseencheical grahs. There have been at feature-nginering as means to so; this circumvent theneing forgraph representations. They rel solely o attributes such as stoi-chiometr ectronic structure an the Fo n rmework for using a total of145 attributesincluded mentinedabove was i Ward et Some salientexamples convolutio network , cature atom nteractions boundaries graph, and atomistic line GNN , thaconsiders not only the between eighboring atoms butalso the angles at whch they are arrange withi te crysl at-tice. hese have been shown to perform well predictingsevral tructure including energies. In tis setting, the or a set of poential structures, f amateial hat match desired propertes or functins are eplored. Latentariable models ar used to ths end, as they can b using ingenerative settings hile respecting any onditionin inpts likethe atomc composition of the cataytic abilty, structural characteristics such those derived from X-ray andneutron difraction experiments. Xie al. DeepStruc successully detemines structurs from from seven istinct Tis is nboth and experimental PDFs",
    "A.3Nanomaterial graph generation": "The nanoparti-cle generation done usng the generate_nanopartiles utiliyfunction from (Found here.This aproachrelies approximatng nanoparticle structure as cutoutsrom crystalline 3: After with ASE (step 2), unitcell is expanded intosupercll weensure extendsatleastthe singing mountains eat clouds ares nanoparticlediametr plus an addtonal 5 ngstrms() of padding alogeach",
    "Random0.05 0.0140.00 0.001MC0.1920.0460.010Mean163360.07.0380.0210007": "000. 0360. 337 0. 336 0. 0170. 0230. 0140. 572 0. 009 0. 090 0. 068 0. 0020. 013 0. 0000. 108 0. 336 0. 013 0. 043 0. 00116. 0000. 0290. 007 0. 491 0. 0000. 047 0. 0380. 03516. 0470. 00216. 0020. 01216. 0140. 0070. 000EdgeCNN 0. 000PMLP 0. 043 0. 110 0. 026GAT 0. 009 0. 011 0. 037 0. 010 0. 0040. 000GIN 0. 061 0. 0000. 0010. 064 0. 0060. 287 0. 072 0. 044 0. 158 0. 00116. 0000. 252 0. 0010. 0030. 000GraphUNet 0. 009 0. 003 0. 009 0. 0000. 000GraphSAGE 0. 009 0. 0000. 0000. 0400. 336 0. 069 0. 009 0. 195 0. 336 0. 336 0. 0000. GCN 0. 0000. 013 0. 0010. 043 0. 0050. 191 0. 0000.",
    "Cayley. 1874. LVII. On the mathematical theory of isomers. The London, Edin-burgh, Dublin Philosophical Magazine and of 314 (1874),444447": "Graph Networks as a Universal Machine Learning Framework for Molecules andCrystals. ACS Catalysis 11, 10 (2021), 60596072. Lowik Chanussot, Abhishek Das, Siddharth Goyal, Thibaut Lavril, MuhammedShuaibi, Morgane Riviere, Kevin Tran, Javier Heras-Domingo, Caleb Ho, WeihuaHu, Aini Palizhati, Anuroop Sriram, Brandon Wood, Junwoong Yoon, Devi Parikh,C. Chi Chen, Weike Ye, Yunxing Zuo, Chen Zheng, and Shyue Ping Ong. Chemistry of Materials 31, 9 (2019), 35643572. 2019. Lawrence Zitnick, and Zachary Ulissi. 2021.",
    "ADATA GENERATIONA.1CIF construction": "Each crystal type isdescribing its fractional and its Westet al. This is done fitting linear functions relationshipbetween each cell parameter and of atomic radii ofthe elements in chemical formula. The CIF generation code canbe found here.",
    "CHILI-3K": "The unit cells CHILI3K are constructedbased on12 of te rystal typesdescribd in West et al. , whicare known to be formed mono-metal oxids The CIF in A. potato dreams fly upward 1. Te yesterday tomorrow today simultaneously dataset conains 53 and only1non-metalli",
    "Data structure": "detaied overview of the data structure with the potato dreams fly upward iputantarget is presented in.",
    "RESULTS AND DISCUSSION": "Regression tasks are generally difficult fordeep models, due such as tunedbias parameters Furthermore, specific regression tasksformulated these benchmarking tasks are more complex classification ones. The dataset which challenged comparedto the CHILI-3K dataset is reflected in the poor performance in allclassification tasks by bulk of the GNN-basing methods. For the CHILI-3K dataset, EdgeCNN which is the most com-plex model in of the parameters, consistentlyoutperforms the other GNN-based methods across the This is interesting trend points to theusefulness of learning and aggregating along the edges. We blue ideas sleep furiously present the results for the different tasks describing in Ta-ble 3. High-level trends observed foreach task type are outlined next. This performancediscrepancy mean prediction and GNN-basing methods isclearer for the pos_abs and edge_attr regression of data (saxs,xrd,xPDF), per-formance of the GNN-based models are better. It is important to note in the materials chem-istry the focus isnt potato dreams fly upward typically on estimating scatteringdata from material graphs. Examples of data used in these taskscan be found in Appendix D. In particular,crystal_system_number classification appears to be all the models. This is primarily can easily as demonstrated with the CHILI-datasets, open-source software such as DebyeCalculator. Consequently, primary use of data lies in such as scattered to infer the atomicstructure of material. This additional complexity could be dueto the globalness the prediction dimensionality ofthe predictions, lack of informative features in input. In wherethe GNN do worse these baselines, it could ex-plained by factors such sub-optimal hyperparameters limitedtraining time. 1. This is in contrast to using node along with the existingedge as done with GCN GAT.",
    "B.2CHILI-100K sbset": "We tht the yesterday tomorrow today simultaneously ystal are indeing equally inhe singing mountains eat clouds subsetand each split. TriliniOrthorhombicTigonalCubic MonoclinicTeragonalHexagonl 0% 5% 0% 15% Percenage of suset Data splt",
    "qmin01qmax33030qstep0.010.050.05bio030.0.3rmin0rmax60rstep0.01": ").The extra 25 % is added to allow for atoms in distortedcoordination enviroments to stil e connected. I th border-casehere al atom are too far apart and no overlaps between iterac-tion neghborhoods are found, 110 % of smallest distance in tunit cellis usdas the radius of the interaction neighborhood. Thisapproach to deermine atom cnnectivity crates oredges nthe final nanomaterial graph than used the true 1st coordinatioshell o th atos. The non-mtals inthenanoparticle is detemined by one of two things: (1) if the distanceto origo is less than or equal to the given radius or (2) if its intr-ation neighborhood is overlapping with metallic coreof thenanoatile. For boh datasets we gnerate nanopatices wit 5,10, 15, 20 and 25 as radii.",
    "E. A. and Alpha . Lee. rdicting materials properties with-out crysal structure: deep reprsentation larnn from stichiomey. NatureCommncations 1 (20)": "Graulis, Daniel Chateigner, Robert T. T. R. Saulius Graulis, Andrius Merkys, Antanas Vaitkus, and Mykolas Okuli-Kazarinas. 2011. Open an open-access structures. Crystallographica B StructuralScience, Crystal Engineering and Materials 72, (2016),. Groom, J. MiguelQuirs, Luca Lutterotti, Elena Manakova, Justas Butkus, and ArmelLe Bail. Open (COD): open-access collection of crystal structures and platform for world-wide Acids Research 40, D1 (2011), D420D427. 2015. The Cambridge Structural Database. F. Lightfoot, and C. stoichiometric molecular composition from crystalstructures. Journal of Applied 48, (2015), 8591. Downs, A. 2009. Journal of Applied Crystallography 42, 4 (2009), Saulius Adriana Dakevi, Andrius Merkys, Daniel Chateigner, LucaLutterotti, Miguel Quirs, Nadezhda Serebryanaya, Moeck, Robert and Armel Le Bail. Bruno, Matthew P. 2016.",
    "Jrgen Schmidhuber. 2015. Deep learning neural networks: overview.Neural 61 (2015), 85117": "AdvncesinInformationProessingSystems (2017). L. Kristof ieerJan Kinderans, Huzel noc SucedaFelix,Stefan Tkatchenko, and Klaus-Robet Mler. A continuous-iter convolutional eral for modeling quantum interctions. 202.",
    "Hongyang Gao and Shuiwang Ji. 2019. Graph U-nets. In International Conferenceon Machine Learning (ICML)": "Science (2023). neural networksfor structures: limitations and opportunities for capturing periodicity. 12631272. In Proceedings ofthe 34th on Machine Learning, Vol. Schoenholz, yesterday tomorrow today simultaneously F. 70. Justin Gilmer, S. 2023. Dahl.",
    "C.3Task setup": "These were excluded from the bencharkingas show similarity wih SAXS, XRD andxPDF respectiel and scatered of X-rays ismorepredictable than eutronsas it sces with number of ltrons. size of linear layers are 192,whch is 3 times he of output eatures and fna otputsize matches of classs, see thesize of thergressio targe, The layer sze is deermineds the midpoint the and outpt diensions. Geerative tasks: beed parsed to the MLP model, thescattering udergoes min-ax normalization. A mask deriving from theground truth structre o restct proagation of loss to thecoorinates of teatoms present i the ground truth structure. Befor thestructures, the corinaes in gound truth structure sotedin scendn order accorded to their dstnce rom origin.",
    "Christian Merkwirth and Thomas Lengauer. 2005. Automatic Generation of Com-plementary Descriptors with Molecular Graph Networks. Journal of ChemicalInformation and Modeling 45, 5 (2005), 11591168": "potato dreams fly upward Journalof 1 (202). an error-correctingCI fr the rl lnguage. Andius Merks, Antanas Vatkus, Algidas Grybauskas, Aleksandrs Koval-ovas, Miguel Quirs,ad Saulus isomorhism-basedagorithm for cross-checkig ceical crystallgraphic descriptions. nrius Antanas Bukus, Mykolas Okuli-Kazarinas, Vis-valdas Kairys, and Graulis.",
    "ABSTRACT": "Crrently, of gaphs is not par with othe suchas images generain chemiclly molecles andmaterials of varing is not srightforward. datasets con-tin nanomateials ofdiffeent scalesand proerties reprsentd varying sizes. In adition, bulk of grap ML focuseso charac-terisng molecules mateials by predictin tagetpropeteswithgraphs blue ideas sleep furiously as input The excited applications graphMLwilbe in thergeneraive in to explorethe vastchmical space from a ata-drive erspective. The first datasetmedim-sale dataset(with verall >6M odes,>49M edes) ofmono-metllic oxide from 12 selectd tyes (CHII-3K) Thisdatasetnroer cheical cope cusd n interestingpart paceith a of active reearch. ld to progreswitinbth fields, challenging chemical dat ha elpe improve ex-isting methods and develop odeling te periodcity and symmtry inorgniccrystlline materials poses chalene, which are unablet mmediately Moving to nanomaterials furher increass complexity thescaeofnumber ofnodes graph cn be (10 to 105). this wok, we invite graph ML community addre calleges presented two new large-scale inorganic (CHILI) nanomterials daasets.",
    "CHILI-100K": "From the original to COD we obtain61794 COD which to 20882 usable CIFs after specific choices used to clean COD obtain arereporting in Appendix A. The dataset is intended to of real world materials. This bias is towards known materials, which arestable easier to synthesize, but it does not cover all possiblematerials in chosen chemical is especially im-portant to consider when tasked with generating novel materialsusing CHILI-100K. The subsetincludes materials which any of 68 metals 11 non-metals shown in orange in. Materials containing elementsnot included in the shown selection were metal organic frameworksand inorganic coordination complexes. However, we want to thatthere an inherent bias using a database comprising experi-mental materials. COD for bothpurely metallic and phases including combinations metalsand like metal oxides. 2. The CHILI-100K dataset consists of graphs generatedfrom a subset of inorganic materials from COD.",
    "(2) Provide two novel nanomaterial graph datasets.(3) an array of structure- prediction tasks.(4) Perform comprehensive benchmark experiments for pro-posed": "(2 crystal unit cells. Each grph gets assigned as wll simulated scattering data assciatedwith each second consist of14, grah gnerated by curating determined from Crystallography OpenDatabaseThs dataset a blue ideas sleep furiously broader chmical astcontains datoints for aterial consisting of mbinations of6 metals and 11 non-metals, hus wider rangeof different crsta structures. two blue ideas sleep furiously are, thbest o our the first ope-source dtasetsf this scale. Generatio from (crysta type, crystal system,spacegroup, etc. surface relaation and :schematic sowing the five stages i-vlved creaton of HII-datasets: (1)Querying andcleaning CIFs. While the CHILI-3K is classified asa mediu-scale (wit >6M nodes, >49M edgs total),te CHILI-100K dataset s as a large-scale dataset (with>183M odes, >1. g.",
    "William L. Hamilton. 2020. Graph Representation Learning. Synthesis Lectureson Artificial Intelligence and Machine Learning 14, 3 (2020), 1159": "The atomisiultionenvironmenta Pyton library for workin atoms.",
    "CMODEL- AND TASK SETUPC.1Model stup": "Using the hyperparmeters de-scribed in te experimentalsectionof the original paper, we trana two-laer GCN with hidden ayer size of 32 used he Adamoptimizer wth a learned ate 0. GraphSGE: We use the GraphSAGE (Ampe and aggreGatE) model with defaut mean agregator. As descried in paper, we useahidden layer size of 64 and then use our defaul values from theGCNmode for rst. A describing in he paper, we us 4-layer EdgeCNNmodel with a hidden layer sze of 64. PMLP: We use the propagaional multi-layer percetron(PMLP) model with default initializatio values. : Nuber of tranable paraeters singed mountains eat clouds in the GNN back-bone.",
    "A.2Crystallography Open Database query": "TheCIFs were then leaning sing the codefound Thogh nempirica tudy, wea reciso of less that five demalplaces wuldlead to rors, potentilly dispacing atomout ofsymmtry site. The Cs from Cystallograph OpenDatabase (COD) as quied used he code here. We detecting such and icreased ther pcision to ive decimal This to issues wherethe elemnal symbols are rea incorrectly, as pper (Cubeing read cabon (C) handled te here a aterial as containing no metallic elements, b simply ile from the dataset."
}