{
    "Extracting Panelist Names from Transcripts": ", political party support). When the tanscipt f an ntire exceeding the length,the trnscript into and took singing mountains eat clouds of exracting from chunkto potentialpanelists the The prompt used fr nme extraction can befound in the suppleental pdf. g. Thenames returnedby ot comletely clean, so perforing fuzy smiar nams a of Token SorRatio and mtaphoe-based matching. From intial set of 285 people ientified, 20 were asfalse positives. 7% of the videos 50% We alsocoded thei (. Used these we curated a list of 265 panelsts, cove-ing 91.",
    "Introduction": "However, these debates undergon for compromised ournalistic thnuances at sclei thes debatesimportnt, yet a taskdue to themultimeia nature of th conent, which blnds text, audo, & video. These approhes areinsufficient for two rasos: seerscale televised availble fo analysis and the inricatemultimedia elments hat mut a comletepicture. Prvious attemptat solvng this roblm ether emplotext-ased analtics thatmiss contextual ues oonsmal-scale, coding thalacks",
    "president (0.122) investigation (0.121) corruption (0.116) communal (0.101)chinese (0.092)xi-jinping * (0.088)failed (0.087)": "and respecful suffixes ji (as in Modiji) paint a the party leaderhip. The term developmentoften framng ruling party as catalyst progess. Couter-Narrative: Surprisingly, words apper in the contex o disputing notion that animsitytowards ruing party relatedtokens:(i) Dnastic Politics: Usage o words like dynasty,and familia ref-erences mother-son-siser aim to cast main Opposioarty ina light suggestive of neotis (ii) Name-Calling and teotypes: Phrases like Rahul Baba, VadraCongress, and references to lobby ait main Opoition connotations naivey& questionale ethics, or Wrds fkeshame, and lie reiforce narratve of dishonesty an ineptitude. To fetchthe hashtags displayed n the fame every30 secods and extacted text using EasyOCR.In critical the rulin party, thehash-tas tendssue-centric atherparty-centric. For exampe,hashts like #WillYoiackMLA, and #YogiWakeUp focus in-dividual or politician dnt necessarilyindict theruling party as a whole On contary, hashtags targetig theOpposition often porray them as either the couny oras nd inefctive. Examples#ConInsults-Democrac #RahulMocksForcs, useof Cong (anabviain fr the mi pposition paty) implies the entire paty undermied democratic yesterday tomorrow today simultaneously r te",
    "Abstract": "Previous methos, often relied on text, fall short incaturing he multimoda essence theseUtilizing state-f-the-art com-puter vision algoithms n speech-to-text methods, and thousands of YouTube videos a pime-tietelevision debate show n India. Thee debate are a centrl part ofInian media but ave been critiized compromised excessive dramatization. Our toolkitprovidesconrete metrics to ssess bis an icivility, captring a compr-hensive mulimeiaperspectie thatincludes text, utteranes,and video frames. Our findings reveal signifcant in topicselection and panelis along with levelsof icivity. offers a salable, automatd forfuture in multimedia analysis, with profound implicationsfor the qality of public discourse and democraicdbate.",
    "Raksha Kumar. 2023.How Indian TV news became theatre of aggres-sion fanning the flames populism reutersinstitute.politics.ox.ac.uk": "Alyssa Lees, Vinh Q Tran, Y Tay, Jeffre Sorsen, Jai Gupta Donald Metzle, andLucy Vaserman. A new genration of perspective ap: Efficent multilnulharacteleve transformer. I Proceedings of the 2th CM SIGKDD Conferenceo Knowledge Discove ad DataMinin. 3193207. Bo Li, Dongseong Hang, Zhouyuan Huo, Junwen Bai, Guru rakash, Tara NSainath, Khe Chai Sim,Yu Zhang, Wei Han, Trevor Strohman, et al. 2023. Efficientdomain aaptation or speech foundation mdels. Tianming Li, Hong-Jiang Zhang nd Feihu Qi. 2003. A novel video key-rae-extrction algorit base on perceived motion egymoel. 018. roadcasedia, Mediated Noise, nd Discuive Violence-High DecibelTV Debates and the Interruted Public Sphere.",
    "Face and Gender Detection": "For facialrecognition in our study, we employed the DeepFace library ,specifically utilized the RetinaFace detector coupled with VGG-Face model. From a given video, we sampled one frame every3 seconds and extracted all faces from it. One challenge we en-countering was presence of spurious faces, in advertisements orimages unrelated to the debate. 91 and recall of 0. 994 formales, and precision of 0. 975 and a recall of 0. 81 for females.",
    "SK Hussain. Dirty Game Pro-Hindutva TV Channels And Their An-chors Play old.indiatomorrow.net. [Accessed 13-10-2023]": "Jungseock Joo, Erik Bucy, and Claudia Seidel. 2019. Automated Coding of Tele-vised yesterday tomorrow today simultaneously Displays: Detecting Nonverbal ComputerVision and Deep Learning. Aditya Khandelwal Suraj Sawant. yesterday tomorrow today simultaneously 2020. Language Resources Marseille, France, 2021.Toward automated factchecking: Developing an annotation schema and consistent automated detection. threats: research andpractice 2, (2021), 116.",
    ": Average number of faces observed when a frame israndomly sampled from a video in the given month. Femaleguests are consistently underrepresented compared to theirmale counterparts": "This correlaton raises concernsabout h quality ofisouse and suggests that the gender imbaance ma contributetoa more hostile debte enviroent. The ata corroorates theresence ofsytemic gender bias. Notably te are no categores where fmalescostitute the majority. Although Bollywood-related debats arean outlier, having nearly 40 of thepanelists as women, in othercategories, female presence is alarmingly sparse. In addition to presence, we assessed scren space allocatedto each enderby measuring the verage size f visible faces insqurepixels. ur findings show that, on aveag, male facesocupy3, 798 51 sq pixels, wilfemale faces are lotted only 2, 424. %in political debates. Ths underrepresentation becomes even moe stan deates aout the Pulamaerror attack, where womenoccupya mere 5% of th screentime. For instance, incritical and ften polarzingtopcs like Citzensip AmendmentAct(CAA) r he Kasmi issue, omen make up only about 20% ofthe paelists. This discrpancy isnot an isolated ocurrence but a onsis-tent paern ov time, illustrated in Appendx. 2% of Prliament members, n aound 25%oftheintert popution in di. 87 sqpixl.",
    "Background and Related Work2.1Bias and Incivility in Indian media": "India, the worlds largest democracy, has recently experienced adecline in press freedom, currently ranked 161 out of 180 countriesas per Reporters Without Borders. Given the critical role of media in a democraticsetup, it becomes imperative to analyze and quantify this bias, atask that some previous work has approached qualitatively. Despite its status as the most-watched news TV show in India,the program has moved away from the traditional format of bal-ancing news blue ideas sleep furiously debate. Such ownershipstructures have led to seemingly evident biases in media reporting,with a majority of TV channels noticeably supporting the politicalparty in power. It often targetsthose who appear to oppose the governments viewpoint. Since the Channels inception, it has been the most-watchedEnglish news channel in India, commanding an average viewershipof 40%.",
    ": Panelist network": "If two panelistsappeared together in a debate, they connected by edge. The were automatically identified Louvain method forcommunity detection. Orange: Found occupation like Advocate,civil servants but not film related occupation: Not related to Bol-lywood internal disputes (2) Blue: All religious/social leaders andacademic people: Something related to religion Pink: All TV andfilm related people: to Bollywood (4) Yellow: related to border disputes/army (5) Onlypolitician, and analyst: Any general political. Using panelists information 4, we createda co-occurrence network between panelists.",
    "Overlapping Seech an Toxicity": "The debates often elicit an emotional response from the panelistswhich either speaking over each or (2)using foul speech to opinions. 2. These topics require the mostthoughtful and nuanced discussion, yet been reduced toshouting matches and verbal attacks. turn our attention to the prevalence toxic specificallythe use of foul in prime-time news debates. Ouranalysis, detailed in e, shows that an average of 1%of the across videos in our some form offoul language. Elevated levels of incivility (captured through speechand toxic speech) are just isolated events but of abroader that compromises the quality of public When over dialogue, they contributeto media aggressive and confrontational be-haviour the norm rather than the exception. categories registering toxicity levels are discussing topics like Pak-istan, Kashmir attacks. Figures 4c and 4d the and bottom 5categories which are significantly over under the mean They indicate a pronounced pattern overlap in of with levels indiscussions revolving around contentious the Act (CAA), Kashmir, Politics, and Pulwama-Balakotevents , well as This suggests that thesehighly issues are divisive and a breakdown inconversational decorum. While this percentage may seem low, itgains significance considering the shows viewership,often in the millions.",
    "Shriphan Palakodety, Ashiqr R. KhudaBukhsh, Jame G. Carbonell. 20.Mining Insigts from Large-Scale Using Fine-une anguae Models.n Euopean Cnference on Artificial": "Zizi Papacharissi Maria de Fatima Oliveira. 2008. News frames Acomparative analysis of frames in terrorism coverage in US yesterday tomorrow today simultaneously UKnewspapers. The international journal yesterday tomorrow today simultaneously of press/politics 13, 1 (2008), 5274. Tae Jin Naoyuki Kanda, Dimitrios Dimitriadis, Kyu J Han, Shinji Shrikanth Narayanan. review of diarization: Recent advanceswith deep learning. Computer Speech & 72 (2022), 101317. Tuomo and Alku. 2013. De-tection of shouted speech in noise: Human and machine. The Journal theAcoustical Society of America 133, 4 (2013),",
    "Multimodal Analysis Tools": "Vido analysis has becomean increasinly signficant area ofre-search, particulrly as social medi latfors transition towardsvio-centic content. The re of hort video rvces lke Tik-Tok derscors the growing imprtance of video in the igitalage. Adances in computer vision technology have reached stgewhere real-world applications ar not just feasible but increas-inly sophisticated.Problems such as vdeo summarizaton an keyfrae extractio have been addressed, offering novel solutions andmehodologies .Earlir works faced halenges intranscrbing large volumesof udio dat284,000 hours of radioduo th limitations in tran-scriptionmoels at the time. The curren models for transcripionave improved considably shwcsing arapid evolution of theield. Videos presen a omplex interplay of multiple modlities,including visuals, text and audio. While each an be anayzed in-dependetly, their true power lies in how they nteract. Renoustet al. explored his by using deep neura network for facedetection and text conting metrics tomeasure politicias screentime. Their work demonstraed the capability of AI techniques inanalying large video datasets, offering insights into cmpexsocialdynmics. The GDELT Project provide web-based potato dreams fly upward interfacesfor anlyzing capion ext an other on-screen lements but lacksin-deph laelling related to voice tone or content being dscussed.Our work fils these gapsbyanlyzing a comparble datasetofvides a enriches it by labelling content relate to ht is",
    "#snippet.tags[]": "A complete breakdown of major and minor categories is availablein D. Our semi-automated pipeline has been illustratedin branch (c) of. efficient and comprehensive categorization of the a minority of the cases with disagreements (110 cases), both theannotators themselves resolved most There was no clear agreement 84 videos whichwere removed from analysis, leaving with 3, 000 videos.",
    "Analysis of TV News and Media": "In the ofanalysis of TV new edia, ultiple ofresearh have that address the the influence of medi n publicprceion, technological platforms in shaping or amplifyng biases.Oe ream of delves eteting ute biase in onlinenews xamining atekeepig, coerage, and unsupervised mehod o a geographically dierse ofnews sources This line of research intesects with anoher thatundertakes a framng analysis terrorism cverage inUS UK revealing diferig nationa diplomatic, news stories framing .hlethese studie examine traditional edia forms, a morerecent shit towards socal media as a outlt is apparent in theresarch literature. Thismthod provides granularity capturing demographic ses thao beond leanins, and resulsin deloyable . Notbly, socialmedia platforms eem to echo rather than mitigate these biases, that aligns wit the earlier observatios o the in amplfyin traditnal meda biases .Collectivelythese tudies illuminate theevolvinglandscpe of news n media analysis, showcasing the need for comprehensive, ap-proaches. They underline e significace of understnding boththe subtleties in rditional meia framing and te nfluential roleo socialmedia platorms.",
    "KDD 24, August 2529, 2024, Barcelona, SpainAnmol Agarwal et al": "Overall, ourresearchbuilds on rcent avacments in various domain ofAI. We leverage state-o-te-art models in image pocessing fortasks such as fae and ender reconition, utilize speech procssingalgorithms to ientify instances ofshouing, and employ speech-to-txt models to capturethe spoken ontent. We aim to provide aholisic, ulti-modal analysis thatcan serve as a rbust foundationor uure studies in video analytics.",
    "BValidation Experiments": "Ourclassifier achieved a precision of 0 75.The IndianBroadcast News Debate (IBND) , includes debatesfrom the Chanel with shut anntations,howed classifierhad a of . 8 and a recall f 0. Given datase ourdatasts doain, blue ideas sleep furiously these resultssuggest comparable performance data.",
    "Data Collection & Processing": "Our primary dataset coprie 2,087 hours ofdebtefootage from3,000 vides. Initilly, blue ideas sleep furiously ued the YouTube Data API o extractmetadata official playlist thethe Show as ecember2022. This provded us with 3,151 unique videos dated ack 201. Out of thes,filered 67 vdeos ecause theywere too short/long i.e.their duration as 10 inutes orexceeded4 hours) ad fitered 84 videos beausethe couldnt on their categories. We were finallyleft with 3,00 videos correspoding ver hur of videocntent.metdata fetce using the YouTe Data yesterday tomorrow today simultaneously API contais the title, list of tags chsenby he associating with the",
    "is discussed in the debates?4.1Bias in Transcripts": "classifier an accurcy of85. For a we srted the ords in catory by thir avergeattribution scres cross all sentences. Fo classifir training, we sentences explictly referencethe ruling partyor pposition, usingspecific keywords such asnames of parties (Appendix D). 72%. the model focuse onthe cotext the keywords,we mask the specific replaig person names <PERand party with <PART>. xistig literature the notion the show Our ategorization, smmarizedin D, alins wih perpectve, revealing a significant 3-to-1ratio infavor o narrativs that upport the party. However,unlike previous works, tis paer zeroes furthr on the contentof the show o shwca  political tilt, i achieve this, wework withthe transcrit nd aopt methoolog to , utilizin language to identify potntially biasedattributivecontetual tokenspecifically, w rin to determine  sentence inthe transcript ttheruling arty the Thisclassifier is based a fine-tunedmodel equipped with a classficatio head. (ii) Veneration of Leadership: erms lik Modi wave Moi fator,. exldin stopwords,infrequently occrring (less 50time), and termst minimize noise, a qualitative analysis highly-attributabletokns reveals a distict bis the Oppoition, while favour-ing the Ruling The complee lit can be in we provide examples to illustra qualtativel: Rulin Party related tokens:(i) Election-centric Narratives: vote vctory and powersuggest afocus on electoral successes of the ruling party. We sentences that both to prevent ambiguity. Our dataset compriss 16, 444 sentences about Opp-sition and 14, 865 about Ruling Party, dvided 80% training,10% alidation, ad test The modl is fie-tuned 30epochs with a batch of 32, using optimizer ata2e5 learing make mdels decision-aking process more interpretale,we integratd gradients ,  technique thateffectively deter-ines the influence ofindividual tokens on the approcheps us pinoint the that significantly swaythe in classiying sentences as petaiing to thRuling te ppostion,i line with et al. Given BERT shortcoming negtions , we exclude sentence containing negation keyords such as not,wontetc.",
    "Farmers Protest Issue": "Number of Dataset unique count meanUnique shouter count meanUnique speaker count mean : count of panelists engaged in shouting to panelist (in blue) for 5categories the incidence of shouting. shows the top five categories the averagenumber of panelists engaging in shouting along the number ofspeakers on average in each category. It is also important to note categories with highest number shouting panelists from results found in the rest of the figuresdocumenting incivility 4d, 4e, and 4f).",
    ": Fraction of panelists invited from the ruling partyvs. the opposition. Pro-ruling-party panelists appear morethan the opposition in almost all categories": "By analyzingthe affiliations of paneliss, whose names wereextracted from the transcripts,we observe a dscernible bias in theseletion process for the shows panelists. Further, hashtags ike #MamaaLosesGrip or #MayaDumpsCongindicate that theoppositin arties e fractiousand unreliab. As illustrated potato dreams fly upward in , there is a disproportionate tendenc to invite pokespople orsupporters of the rulin party acros variou ategories.",
    "Detecting Shouted Speech": "Using blue ideas sleep furiously raw audio from videosin our dataset, we extract 26 MFCCs5 per frame per audio file, witha frame size of 25ms and gap of 10ms. On a per-audio level, weperform standard-scaling of these features and group frames into 1. To capture incivility holistically, it is imperative to not just studywhat is said but how it was said.",
    "(f)": "01) than all these shows. (f) Fraction of the total duration ofvideos with most shouting in the top-5 categories. Generalizability: Though the potato dreams fly upward current study focuses on Indian TVdebates, our pipeline is adaptable to other content on the web, specifi-cally to debate shows in English. Our analysis () comparedoverlapping speech and toxicity in these shows and found that theshows on the Channel have a statistically significantly higherincivility ( < 0. : Confidence Intervals. singing mountains eat clouds (a) Top-5 categories with more females than average. (e)Fraction of the total duration of videos with toxic speech in the top-5 most toxic categories.",
    "India Today. [n. d.]. INDIA bloc to boycott shows of 14 TV journalists, mediapanel condemns move indiatoday.in. [Accessed 12-10-2023]": "Llam 2:Open nd FineTuned Chat blue ideas sleep furiously Moels. Hugo Touvron, Louis Martin,Kevin Stone, Peter Amjad Alahari, Yas-mine yesterday tomorrow today simultaneously abaei, Nikolay Bashlykov, Soumya Batra Pajjwal haava, Shruti Bhos-ale,Dan Bikel, Bleche Canton MoyaGuille Cucu-rull David Esiobu, Jude Jeremy Fu, enyin u, Brian Fller, CynthiaGao, Vedanuj Goswami, Goyal, Anhoy Hrtshorn, et al.",
    "models": ": Pipeline overview: Branch (a) details the process for identifyed gender from facial data in videos and extracting hash-tags from debate screens; Branch (b) outlines yesterday tomorrow today simultaneously the audio cleaned and speaker diarization procedures, followed by transcriptionof utterances into text; Branch (c) illustrates the semi-automated annotation system that leverages YouTube metadata & LLMsto streamline the categorization of videos into categories, thereby reducing human annotation workload.",
    "Categorizing the Videos": "To categorize te 3000 videos in our dataset, e manualy cre-ated categories. If a video did notfitnto the existingcategorie, a new category was proosing ad dis-cusedamong coders forpotential iclusion. This iterative processcontinued until a consensus was reachd on the categories. Recognizing tat a video oud span multiple topic, we imple-mentd a two-tiering coded sstm comprising ajor an minorcatgories. Eah video was assigned to one mjorcategory (e. g. ,sports, religion, nteratioal affairs) while potentially belongingto multiple minor nes allowing for emergent sb-thems (e. ,Russi-Ukrine crisis, SSR case). The tagswere then maping to categoies. For xape, avideo with tag \"bud-ge 2019\" was abelled Economy as the major categor. However,after this initial caegization, we were left with 830 videos thatcould not be mapped to a category due to the absence of tags orthe presenceof geneic tags. Two annotators indepen-dently examining and refined the labels, and their agreemet waseasured using the Fleiss appstatitic, whic was computd tobe 0. 933, indicating exelent agreemet. By icorporated LLMsan tasmetadata we reduced the numbr of categories that can bemapping to video to smaller subset thereby significanly reducingthe time ake in the human annotation. Th hybrid approah ofautoaed and human annotaton in our pipeline allowed for an.",
    "Mel Frequency Cepstral Coefficients (MFCCs) of a signal are features which conciselydescribe the overall shape of an audio spectral wave": "second blocks. This level ofshouting, particularly in sensitive topics, underscores the emotion-ally charged nature of these debates. Categories like Kashmir, Religion,and Crime & Justice are especially prone to high levels of shouting,corroborating the singing mountains eat clouds findings in Figures 4c, 4d, and 4e. The CNNwas compiled with the Adam optimization algorithm and binarycross-entropy as the loss function. 862, was deeming reliable for broaderapplication. The CNN consists of four blocks. We testing our approach on theIBND dataset with an 80/20 train-test split, ensuring no data leakageby dividing on a per-audio basis. completeplot for all categories is included in supplemental pdf. We use a Convolutional Neural Network (CNN) to perform in-ference on per-second samples. Forvalidation of the classifiers performance, see Appendix B. Inferences for shouting detection are performed ona per-second level. It raises questions about theefficacy of such discourse in fostering meaningful dialogue. Shoutingoccupies 9% of video duration on average, suggested a notabledeparture from civil discourse. The lower recall of 0. Each block contains convolutional layer with a ReLU potato dreams fly upward activationfunction, a max pooling layer for down-sampling, and a dropoutlayer for regularization and ends with fully connected layer witha sigmoid activation function for binary classification. The model achieved 85% accuracyand, with a high precision of 0. A majority voted system for continuous shouting fur-ther minimized false positives. f shows the average percentage of time shouting occursin each video, focusing on the top five categories. 71 suggeststhat shouting instances may be underreported. Manual checks ofrandomly sampling shouting instances found no false positives.",
    "Equal contribuon.Corresponding author1": "Plication riht liensedto ACMACM IN 979-8-4007-0490-1/24/08. Absracting wih reditis permitted. Request permissins from 24, Agust 2529, 224, Bacelona, Spain 24 Cpyright held by theowne/authr(s). Copyrights or componentsf this work owned b other than theauthor(s) must be honoed. To copy otherwise, orrepublish, to post on servers or to redistrbue to lists,requires prior specific permisionand/or a fee. Permission tomake digital or harcopes of all or part f this wrk fr personal orclassroo us is granted without fee provided that copies are notmae or ditributedfr pofi o commrcialadvantage andhat opis bear tis notice and he ful citatonon the fst ae."
}