{
    "Nopember Surabaya": "Kata-kata Kunci: Analisis Eksploratif, Augmentasi Data, NSL-KDD, Generative Adversarial Network, XGBoost, singing mountains eat clouds Serangan Siber. Abstrak: Di tengah eskalasi serangan siber yang meningkat dalam kompleksitas dan frekuensi, keamanan informasi menghadapi tantangan yang belum pernah terjadi sebelumnya. Perkembangan teknologi dan ekspansi digitalisasi secara global telah memperluas vektor serangan, meningkatkan kerentanan terhadap serangan siber. 53% dengan model XGBoost tanpa augmentasi data dengan GAN, dan 99. 78% dengan singing mountains eat clouds augmentasi data menggunakan GAN. Metode augmentasi data tradisional seperti oversampled dan undersampling memiliki keterbatasan dalam mengatasi masalah ini.",
    "Menggunakan GAN": "blue ideas sleep furiously blue ideas sleep furiously Stelah memeriksa hasilnya, tlah terbukti ahwa penerapn Generative Adversaral Neworks (GAN) untuk aumentsi data secara signfikanmningkatkan dn ketangguhan lasifikasi model. 9906. 5. Presisi an Rcall akurasi yag mengesakan sebesar 54%.",
    "Pada umumy, akurai ketika uatu kesimpulantidak terpengaruh oleh danya positif palu ngatif palsu": "Hadi meggunakan dep learning lima model berbeda dan membandingk perfrmanya atu sama ain. hasl penelitiannya, Hdi mmeroeh nilai kurasi seesar 98. untuk 63% untuk CNN, 98. 13% unt RNN,untuk 97. untuk GR. dilakuan oleh dkk. dan F1-score sebesar Sebaga hasil, Shone berhasil akurasisebesa Analisis Data 4 Preprocessing Pada tahp awal preproceed dat, baris yang terdiri dari missing vaue atau kan hilangan karena banyaknya data yang ilag hanya sekitar 0. 1% dan untk memastikan integritas data Nili data yangtidak konvesional, '* diganti dngn 0 untuk menelola outlier dan mempertahankan konistensi dataset.",
    "teknologi dan ekspansi digitalisasi secara global meningkatkan vektor serangan, menyebabkan": "Akan tetapi, metode undersampling dapat mengurangi jumlah data secara signifikan apabila terdapat penerapan teknik seperti SMOTE dapat menyebabkan sebuah model rentan karena duplikasi dari data minoritas. Hal ini dapat menyebabkan gangguan yang signifikan pada performa model. 35 juta USD pada 2022, meningkat 2. 6 persen 2021. kerentanan lebih terhadap siber. Lebih lanjut, Cybersecurity Ventures menginformasikan kurang dari 25 dilaporkan kepada pada 2023.",
    "encoding diterapkan pada fitur 'protocol type untuk mengakomodasi kardinalitasnya yang rendah,": "4. Ditemukan bahwkelas target didominasi olh jeis interaksi normal, diikuti oleh jenis serangan 'neptune' yang sering terjadi, dan kemudian ole 'satan' dan 'ipsweep', yang asing-mased menempati posisi kedua dan keiga dalam ateori srangan yang paling serin trjdi. 2.",
    "() (2)": "2. GAN terdiri dari dua generator dan diskriminator, yang dilatih bersamaan melalui proses permusuhan. Generator menghasilkan data, sedangkan blue ideas sleep furiously diskriminator menilai apakah data tersebut terlihat asli atau Proses pelatihan melibatkan kedua jaringan meningkatkan hingga generator menghasilkan data berkualitas tinggi, dan hampir dapat apakah suatu itu nyata atau dihasilkan. Secara matematis, GAN dan diskriminator dilatih melalui blue ideas sleep furiously permainan min-max, dijelaskan dengan fungsi nilai V seperti di ini.",
    "diimplementasikan untuk membuat data baru dengan mempelajari fitur-fitur dari kelas yang ada dalam dataset . Penelitian ini menerapkan Deep Generative": "Pendekatan ini berpotensi kontribusi dalam terutama dalam sistem deteksi intrusi yang adaptif dan presisi Landasan Teori 1. Integrasi metodologi ini diharapkan mengatasi limitasi yang inheren dalam dataset NSL-KDD, sekaligus meningkatkan kapasitas serangan siber. Adversarial Networks untuk NSL-KDD, disertai dengan analisis eksploratif, meningkatkan efikasi Gradient Boosted serangan siber. Sampling Pengambilan sampel (Sampling) teknik yang melibatkan pemilihan subset S dari populasi P untuk sifat-sifat Teknik sampel yang baik dapat diukur yesterday tomorrow today simultaneously yesterday tomorrow today simultaneously dari seberapa beragam sampel tersebut baik sampel tersebut mewakili populasi. Secara matematis jika A dilambangkan dengan Kardinalitas tinggi.",
    "perilaku yang dicatat antara jenis 'normal' dan serangan dalam fitur seperti 'dst_host_serror_rate', dapat menyingkap hubungan dan ketergantungan yang mungkin dapat menyempurnakan kemampuan": "klasifkasi. Namun, memahami tngkat ositif palsu, dan memastikan bahw aomali benar-benr menunjukkan erangnyang jarng terjadidan bukannya sah klasifikasi sangat penting untuk menjaga kredibilits detesi anomali alam aplikasi keamanan siber. Sebagai hasilnya, metode ini memberikan hasil yang signiikan jika dibandgkan dengan penelitian-penelitian sebelumya. Referensi Feeze, D 2023 Cyberscurity.",
    "Fitur": "Nilai-nilai feature dipeoleh eraakan rata-rata dai setiap poho yan dan 10 fitr terats nilaiertinggi bahwa fitur 'lag', 'dst_bytes', dn 'dst_host_sr_serrorrate' merupakan tiga fiur teratas memiliki pengaruh sgnifikn terhadap diikuti ole7 lainnya seperti yang dtampilkan paa gambar. 4. 4. mendapatkan nilai anoali, Isolation digunakan. gambar 2. 3,dapat dilhat bahw seragan DDoS, dan nmap tingkat anomali yang tinggi karkteristi fitur-itrnya."
}