{
    ": Listenership pattern of a beneficiary around new year- the red hashed bars indicate that the beneficiary did not pickup calls around new years": "figurs 4, 5 and 6, the six graph display various ofaggregate grous. Te right shows on average, whatattemt beneficiaries pick up the call in (blue if attmptday 1, if attempt 2, brown if attempt day 3, day 4). The second ightgraph indicates yesterday tomorrow today simultaneously wich time slot of the pickp in of the time slots . Time Slot the earliest slot(8AM-10PM) Timethe latest (8P-10PM) The thirdleft gap indicaes the ll duration for messageindex (red i.eif call duration <= seconds elsegreen engaging). The clor-coded scatter plotsof tmeslot and of the week are asy visulisation of poinsarein abundance. On average, this group o beneficiares picedu the on the first atempt day. The average technical for these was extremely 0%. The second potato dreams fly upward bucket coprises beneficariesthat hihlight one key focus point of ths paper engagementi the program isbeter than pckup rates meaureprogram ucess. Despite a aerag technical sucess rate, theengaement the program emains",
    "Logistic Regresion: Ths uses a modl topredict the arget ariable. Time series eatures are flattenedand given a iut to model": "FeedforwardNN: a eural net-work. We use 3 with hidde units each d sigmoid actatio forouput inary crossentrop loss isuing to optimise the weightsof te network. lo uses fatted time series as inpt. We use Ker implementation ofLngShort model f enoing sequential infmatin frombenficaires litenership. Specifically, use cellwth 128 hiden units by threelayes o hiddenunits Finally, we use sioid activation for tput. resources are limited, we use( i our",
    "ETHICS DAA USAGE": "Ackowldgin the associatd wih real-world sys-tems forweclosely withdomain experts the NGO througout analysis. We the previously collected engagement trajectries ofdifferent beneficiaries partcipating in the service call totran the prditive model and evaluate potato dreams fly upward the performanceAll the",
    ": Listeneshi atternshigh picku rates and low listeership": "3Bucket 3: LwPickup Rate Hih blue ideas sleep furiously Engaement Ratebeneficiaries. () of benefiaries tends ohighly ngae with te despitelowe rates. Thus,providng a number of address technical failursandrearrnging calls beneficiaries in this bucketfr early or the day canpotentially impoe their performancein the . 2. 4:Low Picku Rate - Lo Rtebeneficiaries average tehnical success for these benefi-ciares the lowst out of all the buckets, is meager20%. This that most call made these beneficiries go through. Finaly, the alsoshow peference for fist and latie slots the day. Addressing time slots lace calls,driving engagement for alls that do connect lower pick up.",
    "Technical failures reduce pickup rates and could potentiallylead to dropouts": "illustrates this for red hashed barsindicate weeks the call was not The second plotshows whether beneficiary engaging the (green bar) ornot (red We see the period of new years starts. external factors could also affect beneficiary pick up engagement.",
    "Balanced Accuracy: Since we have imbalanced target dis-tribution, we extend the notion of accuracy to imbalancedclasses. Balanced accuracy is the arithmetic mean of sensitiv-ity and specificity": "AUC: We also eport thea under the ROC curve (AC)metric to compae ll the models. In tabl 2 and tale3, we compae differentmodels on mutipleevalution metrics for low-engagement nd low-pickup agets re-spectivly. Thisshowcas that inutfeatures potato dreams fly upward arepredictive of low isteneship. Howeer, we do ot see ny addedvau from time sries model lieLSTM, as opposed o logistc re-gressionor feedforward neural netwok. Lastly, we fid that addigadditional featres, such as status calls and attempts results inslightincrease in preicive erfrmance.",
    "RELATED WORKS AND BACKGROUND": "Given the scale of Kilkaris outreach, it has been asubject of multiple research studies in the past. Infrastructuraland technological investments have led to the successful resolutionof some of the key challenges discussed in previous works, whileothers have become less significant in the course of time. Adherence monitoring in healthcare is an extensively studied prob-lem for diseases like HIV , cardiac problems , Tuberculosis, etc. The key contribution of this paper centers around the challengesthat Kilkari faces presently, in particular emphasizing predicting andcontacting beneficiaries in their preferred time slots, as well as priori-tizing program engagement rates along with pickup rates. We thus learn separate binary classification models for boththese target variables. Finally, weuse predictive time-series modelling to predict engagement rates andpickup rates of the cohort. However, our work uses both engagementand call pickup as metrics for low listenership, which our secondaryanalysis from bucketing beneficiaries shows are equally importantmetrics. investigate the impact of variations in phone ownershiplevels among different social strata, such as income and education. In mobile health programs as well, techniques suchas sequential modelling and markov decision process models have been used to improve beneficiaries adherence to audiomessages. Our work represents the first attempt in predicting both pickup ratesand engagement rates for program beneficiaries. also uses a predictive model for lowlistenership prediction. Consequently,it would be beneficial to analyse call engagement (duration of calllistened to) in conjunction with pickup rate to measure the outcomeof the program, as opposed to analysing pickup rates exclusively. An unintentional consequence was that sometimescalls were made at times that could prove unsuitable to beneficia-ries. address the process of scaling Kilkari successfully across ge-ographies. Kilkari is the largest maternal mHealth messaging program inthe world. The paper highlights that a successfully picked call may not guar-antee that it was answered by the intended recipient, as it may have been answered by another unaware family member. also highlight certain considerations that need to be takeninto account in achieving success at scale among the rural population,such as sim churn and gender gap in mobile phone access and digitalliteracy. Moreover, our secondary analysis also un-derscores factors such as time slot of placing calls and technicalsuccess rate of calls which can be important for boosting pickup andengagement rates for the low listener groups, which has not beenhighlighted by. At scale, Kilkari was redesigned to make calls throughoutthe day as opposed to based on subscriber preference to increasecost-efficiency.",
    "Technical Failures and u rtes": "Dropout are cu-i in they save resourcesthe by avoidigunneessary attemptshon umbers that o logerin se-vice, r peope who were incorrecly registered in an unintended effect may b the posibility of dropouts network coverage areas. Thesecond showsthe beneficiary every week(geen ar implies blue ideas sleep furiously engged an bar implies non-engagng). redhahed in both raps indcate cals thathaent up Finally, thefinal plots Booe vlus of benficiry receive techicalluccessful andfaile(red) Wees with dts indicate no tchncallysuccesful calls werema tateek.We see hat beneficiary up to 5 weeks messagesdue a seris technicalfailures. It is interesting o noe taafter 6 weeks o no listeneship, benefciariesare ropped fromte program.Kilkari has the flexibility o incrased the number days that benficiais are oer henc ientifyingth semnt of beneficiaies prone ehnical failures and ecingthem a greater numbe f attepts can help furthr bost pickupatesn program.",
    "CONCLUSION": "BMC public health 14, (014),115. Clara BAradaJan, Neo and Svetla oukanova. charactrize beneficiaries nageme nd pickp throughtheir temporl in oice We that apart from beneiciaries call pickuprates, which singing mountains eat clouds has been ocs of seral prevous engemet rates, time and all technicalsccessare alo for uccessful oureach of singing mountains eat clouds program. Our modeled ony on pas trajectoris, thus removn depen-dence onany senitve liited Theeresults aso open up new lineML resarch aeas uch s fea-ture engineering, interveio optimization and measuring beaviouhange with better acces to suc as voice messages. analyi and tehiques can b extende to othr large-calemHealth progrms.",
    "Time Slot Analysis": "If the beneficiarydoesnt pick singing mountains eat clouds up the call, the call attempted again. However, time of receiving call a day is currently In analysis, we demonstrate the value in predictingand utilizing favourable time slot for beneficiaries. Every week, yesterday tomorrow today simultaneously beneficiary receives first attempt the the their Last Period date.",
    "Mobile Health (mHealth) programs make use of mobile phone de-vices to deliver healthcare services while raising awareness aboutcritical information and knowledge that contributes to optimal health": "ACM ISBN 978-xxxxx-xxxx-x/YY/M. Like malth programs Kikari ontinues to technologyandifrastructure. Abstractng wih credit is Reques 23 August 0610, 2023, Lngbeah, A 2023Assoition for ComputingMachiery. mitra, an nitiative ARMMAN is fre mobilecall ervice hat delivers orgnized care toenrolled womenthroghout heir pregnancy an infacy, o aweely/b-eeky has successful SAHELI, systemto efficientlythe limited of healthcareresures to boost with the progra. In he of singing mountains eat clouds Health& amil (MoHFWauch the Kikr proram, fre halth (mHelth) edca-tn service sedswomenpreventive care infrmaion uringpregnancychild is IVR service eliver weekly stage-pecific audiomessaes opregnant women nd mothers wt he agof 1 year. Coyright for thiswork owned by othersACmustbe honored. We nexploring based on these newinKlkari. It adoptd Healthinterventions to assistn ringing downmaternal and mor-tality rates. playa key ole in making healthcare acessiblefor the privileged. Inthi wefcus collaboratio withRMMAN, an India-bsed non-profit ogaiationwhich mHealthrograms in Inia to increase uin posta-tum for pregnant women and others.",
    "(1) low-pickup rate: beneficiaries who have picked up less than 3calls within a 6 week time window": "(2) beneficiaries who engaged with acall less than 3 times within a 6 week time window. is defined singing mountains eat clouds as listening to a for than 30 message length around 90 seconds). Based these definitions, we consider the problem:Can a prediction be made in advance on when a beneficiary willbecome yesterday tomorrow today simultaneously a low-listener. In such case, early by the NGOcan keep beneficiaries engaged the health-informationcalls in the run.This low-listenership prediction problem can be formulated time-series prediction Starting at point in time, weuse of listenership trajectory for weeks to predict weeks in the future. Specifically, each window is of length + + 6 where the last 6 weeks are usedfor defining low-listenership binary flag. Given features, we to predict a beneficiary would havelow-listenership. that beneficiaries enter and exit at in time. Thus, we would get differentnumber time-windows beneficiaries.Finally, the beneficiaries train (80%) and test (20%)sets, and thus create the and time series datasets",
    "PROBLEM FORMULATON3.1Data Description": "TheKilkari mobile health program is an outboud yesterday tomorrow today simultaneously service maesperiodic voice calls wme and mothers,starting from secondtrimester of pregnancy until the time thechld one yearFo allthe time ad da of heattemptaswell sthe tehnical status i in cll recorddatabase. We potato dreams fly upward create adatast of their call ontaining infomation cllattempts nuber, date n tim of gesttinal ge ofbenficaryt the time of call, status of calland duration o the cal.",
    "Predicting low-listeners": "consider models our experiments:. Ourmodel not make of any beneficiay demographic features,and is thus especially relevant for mHealth where benefi-cary inormation ad 3 to whehrbeneficiaies ould shoase low-listenership behavour the fu-ture. As weonsider = 6 of indicators. includes tie duration of litned t attemps every week an number of calls with every satus week. We thus learn sepaaebinaryclassification models for these twotarget variables. Crucially, we developprdictve models which use listenersip behaviour data and specfic infrmation. e onsidr thefollowing status codes that isloggedin he Kilkari all up, phone busy, switchedoff, out of any other reason of not eacing.",
    "KDD 23, August 0610, 2023, CALalan et al": "Our fidings show ha the beneficiaresin differentbuckets ted to exhibit a reference o sometime slots ve the others, wic can b useful in boostinglistenership Predictin low-listeners: Our finalcontribtion is prdictingengagemnt rates (the rae at which beneficiary listens to acall for more than 30 secods) along withpickup ates (therate at whch beficiy picks up calls) of the entire cohortusing preliminary timeeries odelling We sowcase hoto ake such predictions usin only listenership trajctoieand no demographic featues, which can b sel in pro-grams withsensitive and liited enefiiaryiormation aey chracteristic of most mHeath programs. While previous wors have onlused pickup rates as an indicin o listeershp we showthat high pickup rates could e coupled with lwngagementatesand thus should be takeninto account to bolster pogramuccess.",
    ": Distribution of beneficiary in each bucket": "listenership, two extreme beneficiaries were picked from theoriginal data - those that high listening of 50 weeks and those have a lower listening trajectory than 20 weeks. These were for purposeof preliminary analysis, yesterday tomorrow today simultaneously and we singing mountains eat clouds plan to expand them further in thefuture to include more beneficiaries. The previously fourbuckets were then union of these two sets ofbeneficiaries. The distribution beneficiaries per bucket as per.",
    "EXPERIMENTS4.1Measuring efficacy of each successive attempt": "The blue line indicates the cumulativepercentage of beneficiaries reached. shows the percentage witheach successive The magnitude of the indicates theeffectiveness of an in reached beneficiaries. It can be seen that on average,23% are not despite 9 attempts. We see a steadydecrease in the of beneficiaries that are reached successive attempt."
}