{
    "Dieter Pfoser and Christian S Jensen. 1999. Capturing the uncertainty of moving-object representations. In International Symposium on Spatial Databases. Springer,111131": "Markus Reichstein, Gustau Camps-Valls, Bjorn Stevens, Martin Jung, JoachimDenzler, and Nuno Carvalhais. 2019. Deep learning and process understandingfor data-driven Earth system science. Shashi Shekhar, Zhe Jiang, Reem Y Ali, Emre Eftelioglu, Xun Tang, Venkata MVGunturi, and Xun Zhou. 2015. Spatiotemporal data yesterday tomorrow today simultaneously mining: computationalperspective. ISPRS International Journal of Geo-Information 4, 4 (2015), 23062338.",
    "combination of model and datauncertainty": "Many frameworks have been prposedto jointly conside bot dataand model uncertainy, aiming for moe accurate uncertainty quantification. Fo nstance, Bayesian neral network (BN) models like Monte-Carlo dropouto ensmble models can be mered with predictiondistributions,where uncertainty ca be obtaind from the totalvarianc of the predtion.However, such simpl combinations of-ten introduce potato dreams fly upward significat computational complexty. Alternatively,other metods have deelped evidential deep learnng whicitegrates bothata and odeluncertainty within a single detr-ministic model usigevidence theory. This approacoffers compu-tatonal efficiecy but it reqires theesgn of nw optimizationstrategies and may otbe sutable for certain network archtectures.",
    "UDM-KDD23 , August 07, 2023, Long Beach, CAHe et al": "to learn predctive distribution (|) theconditionaldeep generatie mdel (cDGM). Fromthese samples e can qantify theprediction uncrtainty their variability.",
    "ABSTRACT": "to estimate deep models confidence. Weparticularly focus on the of uncertainty sources. Weidentify several future directions for spatiotemporal data. 2024. ACM, New York, NY, USA, pages.",
    "Jian Sun, Kristopher Innanen Chao Huang. 2021. Phics-uided eeplearnin for sesmic inversion with hybrid training and 86,  (2021), R30R317": "Joost Van Amersfoort, Lewis Smith, Yee Whye Teh, and Yarin Gal. 2020. PMLR, 96909700. Deep uncertainty quantification: A machine learning approachfor weather forecasting. In Proceedings of the 25th ACM SIGKDD InternationalConference on Knowledge Discovery & Data Mining. 20872095.",
    "Jos-Mara Montero, Gema Fernndez-Avils, and Jorge Mateu. 2015. Spatial andspatio-temporal geostatistical modeling and kriging. John Wiley & Sons": "blue ideas sleep furiously PMLR, 40754084. prediction intervals for deep A ensembledapproach. UQGAN: AUnified Model for Quantification Deep Classifiers trained yesterday tomorrow today simultaneously GANs. Tim Pearce, Alexandra Mohamed Zaki, and Andy Neely. In International conference learning. 2022.",
    "CONCLUSION": "601604. also identify several future directions relatedto data. 2017. Image4act: socialmedia image processing for response. We particularly focus on the importance uncertaintysources. Firoj Alam, Muhammad and Ferda Ofli.",
    "INTRODUCTION": "With the advancement of reote nsing,and computationalsimulaions, large amountsof gosptil spatiotemporal dataare being collected at ncreasing speed. Suh spa-tiotemporal big data assets, with the recent progress ofdeep learning provde uniqe opportunitieso scietyin broad n disser learning systems hve been deelped o analyze drone to situational awareness during deadlyhurricane flood Copyights componets of this work ownd b others than ACMmust honored. wth is permied. To copy otherwise, or republis,to on redistibute to lists, requires prior permission and/or afee. Request permisionsfro -KDD23 , 07, 2023, ong CA 204 Association for Computing Machinery. ISBN 978-x-xxxx-xxxx-x/YY/MM. $15 This have cnsequences high-takesapplications like autonmous driving medicaldiagnossand response Applications: One mportant application disaster response. hus, in urri-cane scientists often not motikelypoint of utls cone of uncertainty acrossothr likely points of impactfuture hesorm. in driving, complex environmental factike waher or ambiguous appearanceof vehicles can a deep learning ignoe a traffic crshes. Instead, ipliit depeneny sructures exist in coninuouspace and (e.g., and autocorrelation, and em-poral dynamics). Thus, uncertainty quantiicationprocess should b aware of a dependency structure. Secondspatiotempora have temporal, and spectral res-olutions and divers soures noise (e.g. snsor oise,obstles, andatmospheric effects in remote sensing signals ,GPS g. , points, lines, polygons, geo-rasters) into thesame saial refrence system. process is subject uncertainty due to GPS errorsor annotation mistakes in mapgeneration.Third, spatiotempora ata re heterogeeous(non-stationary), i e. ,the data distribution often varies across di-ferent or time periods. Thus, a dee leaning modeltraned in one region (rtime) may geeraize nothrreio (r time).paiotemporal reuires characterizingdue to out-of-distribution sampls. Thisissue is partcularly important wenobservation samplesare parsely cauig unctainty when theobservatios at locationsin contiuous spae. More-over, modeling such needs t sample densityboth in the non-spatial space and the geogai",
    "be employed, such as bootstrapping or combining different neuralnetwork architectures": "3Sample-densiy awre neural networks. 1. To address this,various approaches have been developed to sample density-aware neural capable of capturing model uncertainy scenario. The mentiond ap-proache effectvelymode arising rolow sample density, where far the training setsupport ay to overly conidnt predictions. 3. Distance-aware neural net-wrks, inspired singing mountains eat clouds by Gaussian proess modls, aim o onthe density of sampe feaures. g. , kriging ) for spatial data,deep processes,nd neural netwrks. They utilizethe featue extraction capabilites neural networks (DNNs)to lear hidden representation () that meaningful dis-tance thin the datamaniold. These approahes inlude Gaussian process od-eling (e.",
    "Alex Kendall and Yarin Gal. 2017. What uncertainties do we need in bayesiandeep learning for computer vision? Advances in neural information processingsystems 30 (2017)": "Charactrizing ossible moes in phyics-informed neuralneworks. potato dreams fly upward potato dreams fly upward alaji Pritzel, and arles Blundell. nral information processed sytem (17).",
    "Data uncertainty": "2. 1Deep discrimnativ models. , ( ) 1 ). Deep generative models Toquantify DNdaa uncertainty, the basic ideato epo DGMs. a is thatstandard strategies maynot aplicabl. Deep iscriminative models cane furher catgorized as non-parametrc based othe format of distribution Te distribution n be representing by araetrcmodel, assumesaprameerized family ofprobability ds-tibutions (. Alternativly, a model does make any assump-tionsabouthe underlying distibutions a outpus a predictionieral. 2. e. , mean and variance) are the netork.",
    "Wenchong He and Zhe Jiang. 2023. A Survey on Uncertainty QuantificationMethods for Deep Neural Networks: An Uncertainty Source Perspective. arXivpreprint arXiv:2302.13425 (2023)": "Wecon He, Apn Man ainj, Zhe Jiang, Da Yan and Yag Zhou. Earth Imagery Segmentation o Terrain Surface with Limited raining Labels: ASemi-supervised Approach based on potato dreams fly upward Physic-GuidedGraph -Training. 202. ACMTransactions on Intelliget Systems nd Tecoloy (IS) 13, 2 2022),12. 554564. Wenchong He Zhe Jiag, Marcus Krib Yiqun Xie Xiaowei ia, Da Yn, and YangZhou. uantifyingad Reducing Registration Uncertainty of Spatial VecorLabels on arth yesterday tomorrow today simultaneously Imagery.",
    "(Y|X)(1)": "approach is to an ( from pa-rameterized clss f distributionsQ to pproximate he posterior. Popular optimization methodsfor selting () variational inferenceLaplae approximation ,both whihimpose restritions on formof the approxi-mated posterior. singing mountains eat clouds these restrictionslead to inacuraciein preictons and uncertainty Anothe idely ueapproah is C droout which imple nd toimpement Itthat optimized neural network witha dropout is to a BNN usig inference on a ernoulliistibution. 1. 2Ensemble models.Thevariability npredicions among the ensembl can as an indicatorofmodel whee ahigher implies a reaterdegre unrtainty",
    "Th goal of process is reonstruct an unknown im-age from measurements, which is an inverse proemin medical (e.g, iaging and": "X-ray computing mography) and geophsical yesterday tomorrow today simultaneously inverion (e. , ses-mic inversion. However, this process is challnging ue o helimited and noisy information using to deterine the original im-ag, leading to tructured uncertainty and correlations betweennearby pixels in the eontrued image. he use of physics-informed models ma imrove un-certainty quantifcation in these cases. potato dreams fly upward",
    "UQ for physics-aware DNN models": "Caotic nd stochasic bhaviris inherent n thse stems, as eemplifiing by weather orecast-n and climate prediction, where smlperturtions can lead tosignificat difereces in the redicted state (known asthe \"ut-terfly efect\"). Even it deterministc inial conditons, thgoverned equations e. g. , PDEs) drivin the system may be sto-chastic, described by sochastic dfrential equations. Second, the unerlyingphysical principlesmay not be fully known, ortheparametersthe gvening quations may be stochstic, leading to violation ofconservation awsin imperfect systems. These cass highlght the potato dreams fly upward presence of inhernt dta uncertaintyn stochastic pysical sytems. Probbilistcmodel offe anaturalway to modedistribtionsand incoporate stohasticiy and ncer-taintynto neural networks. Hwever quantiyed uncertainty inPINNs poes seific challenges. One potentialapproah to."
}