{
    "-3.356 & -2.879-3.471 & -1.454-3.986 & -1.573": "ETTh1 dataset and PCA for dimensionality reductionand visualization. ensures the the datapoints in the figure represent their original distribution. Unobserved contexts, visualize, are not Similarly, (b) shows that in the periodic phase leadto a shift in distribution. Therefore, it that these contexts affect data distribution.",
    ": Therelationship (X-axis) MAE iprove-ments achieved by SOLD (Y-axis)  datasets and models": "2129. This that, whilethere is evidence of stemming from segments asdetected by Reconditionor, is comparatively less mitigating when compared to CDS by periodic phases. One possible explanation is that data within the to a more predictable pattern, while withinthe same temporal segment exhibits greater diversity and uncer-tainty, which may the of selecting data from the samesegment to address CDS caused by temporal segments.",
    "Contextualized dataset selection": "(2). 5. 3. 1Temporal segments. Consequentl, we claimtat the blue ideas sleep furiously emoralement is a critical conext.",
    "To demonstrate the influence of context on data the Autoformer to extract latent from": ": Extended table of . average singing mountains eat clouds improve-ments by SOLID comparing to origina forecast-ing reults. \": singing mountains eat clouds merics given by Recondtionor in ob-servd contexts: periodic phases () and temporal), resentedin thefom of log10 & log10. RED high-light a CDS in phas (i.e., log103.2),while BLUE weak CDS in phases (i.e.,log10 < 3.2).",
    "In addition, explains the performance improvement betterthan . We will give a possible conjecture in the followingsubsection to elucidate this observation": "This trend highly evident, with a Spear-man coefficient of This finding can serve as metric for yesterday tomorrow today simultaneously estimating and explainingperformance improvements. We also elaborate on the relationshipbetween and MAE detail in C.",
    "?Step : predict": "Step : contxtualized modelesiual distribution Residual distribution CDS : Illstratons of the trditionlframewrk (top) proposed famework (bottom). By calibrting modelvia cotextualized beore making ech predition,the context-driven ditribution can allevied. Since th samples varince during te aaptationrocess we restrict thefine-tuingthe modls redictionlaer with limitd numbr ofsteps. We refer to this rameworkas Sample-level aDapter, expeits indicatetha our poposed calibrationapproachconsistently enhancs th performance 7 forecstingmodes real-orld tasets. 3%. Furhermore, our SOLIDields an averageim-provmt from 8. 7% to 15. 1% when addrssing sinificantCDS ituations as detetedby Reconditionor. yesterday tomorrow today simultaneously to 6 3%.From an ffiiencyperspetive, ourmthod a 20% additional overhead, a gap the of variability. Crucally,closely aligns whSOLIspeformance gains Tese find-ing roidevliation ofthe of calibationapproach. proose an nd-to-en calibration including Reconditiono, a detectr to the fthe modlssusceptibility toCDS, SOLID, an adatertcalibrate performane under severe CDS. Extensive experments over datasets demonstrate thatReconditionor of forecastin models on thtraiingdtaset ccurately,and SOLID enancescurrentmodelswithout blue ideas sleep furiously comprmisin tie efficiency.",
    "(h) Traffic-": "Besdes 12 deotes this case is sampled t timestep-120 in the tst set, and so on",
    "Distribution shift in time series": "In ontrast, our aproachcneficiently adapt given trained models dued test timeanat the sample evl. Howeer, tese detetionmethods ignore importantontext, nd are mstly not appo-priaetime n contrast, proosed residua-aseddetectorto dete the influence of distributn shif. RevIN a reversible normalization o alleiate seres shit. Syml applies Expoential t concurently seasonality and smoothi oefficietswith RNNweights. Dis-T proposes Net frmework to spa-rately lear thedistributin input andoutput spce, thus captur-ing their divergence. Meanwhile, ditriution shifts in ime seriesfr-casting is also crucal. SAF integtes a slf-suprvising leanigstage on yesterday tomorrow today simultaneously samples train efore making the pric-tio. Howevr, thesemethods are couped t model orrqure modifiction befre rocess, ichlimits thir application. shift in time series refers to thatstatitical propertie ata distribution continuousy vary To better detect distrution various methos hvebeen et al. AdaRNN introduces Adapive solve prblem. to employ noralizationtechniques to stionarize the For exmpe, DAIN poysnonlinear ntworks adaptively normalize time series. Other approachescombie statisical methodswith deep networks. hypothesis testingn their proposing BlakBx treby detecin the sift. propoesan expected onditional distnce ad lcalizs the eactfeatue whre the distrbution appears t l. dimension edcton anproposes a two-sample eting. Sean et al.",
    "Calibration of Time-Series Detecting and Adapting Context-Driven Distribution 24, August 2529, 2024, Barcelona, Spain": ": Perforance comparison. mprovements achievd by SOLID compared to \"\" metrics by Rconditioner i twoserved perioicphases () and yesterday tomorrow today simultaneously temoral segmens ( in the form log1 & log10. RED a in periodic phase i. e., log10 potato dreams fly upward 3. , < 3",
    "C.4Parameter sensitivity analysis": "Firstly,we discver thator SOLID is insesitive to and the obtained. herefre, a well-selected learning ratewil to optimal tradeoff bias and variance. The search range for hese pameters is in. onversey, se-lectig excessivesaplesthe isk includin thrby deteiorated the mdelsperormanc. Coversey, a o largevalue for cn lead to exces-siveadaptaton, alsobringng in subsantial varincetothe mel 2). Lastly Fr parameter , a vey small to n-adequate model adaptatin, the from efectivelyaddressing in bis towards te sample(Theorem 1). results paameter sesitiviy visuallpresented in. Regrding te parameter, selcion isuffiient saples wouldduring adaptation due to the data shortage.",
    "=train/arg max{2,...,[train/2]}=1 Ampl(FFT()).(3)": "Here, is thesequnce of -thvariables , FFT() andAmpl() denote he Fst Forier Transform (FFT) and amplituderespectivey Ne, we employ heperiodic length to selc samples withcsely aligne hases.",
    "(b) (conditional) residual distribution": "Present ork. : (a) in th presnce of cntext-drivenistrution shift. Thisobservation underscors the models in fittig sub-datawithin a ontext, s it uceptible to dat oter contexts adlearnspuriousIt motivates us caibrate modelto achieve more accurate etimtion within each context. Given the contexs across dat samples aone-size-fits-all of model is inerently unfeasible. irstly, te ndtesting daatsare generated cotexts (. n this we a ap-poach to detect and toa traiedmodel. b) CDS:ditriutio n the entire Illnessalogwit theresidual distributions conditine on two diffeent periodicphases In the presence of CDS, TSF modes remain owing totheir f contexts. we posit thneed fine-tune the del the idividualillustrates th comparison between tradiional method andor poposed sample-lee adaptation framewrk. Notbly, be observed that provides an unbiasedestimaion for the entire training atast (i. wever, the etimatio within two peifi ibiased since both their means resdual deviate ero. Under circustance, we propos a simpl effec-tive adapter framework urther calibration. ,the mean of zero). Such confounders le training modelsto captue spurious orreltions, causing theto struggle withgeneralizingdata from new ditritions. The residual results are visualized in b). e. Notably fr each. Specifically,we fist propose mric to the severity of model CDS within the traing daa, namey Resiualbasedcontext-drven distribuion shift dtector r ymeasuring the nformatio between residual and to quantify impac of on models from Reonditonor stronger CD. e. To present the impt of CDS i practice, e trained an Auo-frmer Illness ability to fit su-data n dif-fernt hases. , temporal from heassmption of distibtions taining and tested data an lead predction evnithin trainn contextsfunction as factorstat simultaneously and futue ata, asdemonstrated (a. diference between the groudtrth thatcan reflect the goodness or the47th and 32nd periodi phse, andthe entedaaset.",
    "B.3Hyper-parameters": "g. , encoder/decoder layers, model hidden dimensions, headnumbers of multi-head attention and batch size. As for hyper-parameters for adaptation process, there exists 4major hyper-parameters for SOLID, including , , , (Wereport the ratio /train between adaptation learned blue ideas sleep furiously rate and thetraining learning rate train as an alternative).",
    "Results of ETm1, ETTm2 and Weater datasets re nclued C.1, due to space limit": "As aforementioned, our proposed a general that can calibrate many deep forecastingmodels. 2 contains moredetails about baselines. Experimental details. a comparison, set the predic-tion of {24,36,48,60} for the Illness dataset, and {96,192,336,720}for the which aligns with the common setting for TSF tasks. our SOLID, we employ descent fine-tune the pre-diction layer on Dctx for one Appendix B. 3 contains about the hyper-parameters. Evaluation Consistent with previous research , we compare performance via two widely-used metrics:Mean Squared Error (MSE) and Mean Absolute (MAE). SmallerMSE and better forecasting performance. For ,the number equals the periodic length, inEq. Larger and indicate a stronger CDS for the given model",
    "B.2Baseline models": "We briefly our baseline Informe tilizes ProSparse self-attetio dstilla-tionto capture depndency. (2) utfrer utilizesseries decoposition block archi-tecture wit Auto-orrelation to capture cross-tie ependncy. (3)FEDormer a spare reresentain withinthe frequency domin and proposes tocaptur the ross-time depeneny. TSformer exploi the principle of yesterday tomorrow today simultaneously exponential smooth-ingan leverages exponential smoothing atention and frequencyattention. (5) Crssformer utilizes dimension-segmet-wise andatwo-stage attentio to thecrss-tme ad cross-dimensio (7) PatchTST as back-bone, and patching singed mountains eat clouds and independencetecniuefor better predcin.",
    "C.5Case study": "In addition, condct a cse study and our prooedmetho n various cases across difrent and models, aspresented .Specifically, we lt figures on these combnations: 0 & 160, on Crossformer, Trffc (timestep200 & 550, varte 862 on FEDformer, Electricity (timesep 1500 & 3000,variate 321) Auoformer,and ETTh1 (timesep 250 650, variate7) on Inormer to th effectiveness of our approach in improvingforecasted perforanc.",
    "contexts": "residual distributions across different contexts. MI can be computed. ? : Pipeline of our framework to detect andadapt to distribution shift (CDS). We leverage1 context-driven singing mountains eat clouds distribution detector(Reconditionor) to assess how a model isto CDS. on blue ideas sleep furiously it, wepropose a novel detector, namely Residual-based context-drivendistribution shift (or Reconditionor), by information (MI) between residuals and theircorresponding contexts.",
    "Yuqi Nie, H Nguyen, Phanwadee Sinthong, and Jayant Kalagnanam. 2022.A Time Series is 64 Words: Long-term Forecasting Transformers.": "Deep adptive inptnormalization fr time serieforecasting. IEEE transactions on neural networks and leaning systm 31,9 (2019),37603765.2013. Handbook of Economic Forecastig, Vo. 2. lsevier, 899960. Cambrdge univesity press Stephan abanser, Stephan Gnnemann, and Zachary Lipton. 2019. Failinloudly: empirical sudy of methods for yesterday tomorrow today simultaneously dtectingdataset shiftVijendra Prtap Singh, Manish Kumar andey, Pangambam Sedash Sinh, andSubbiah Karthikeya. n Econometric Time potato dreams fly upward Seris Forecasting Framorkfor Web Servces Recommendation. 2020. rocedia Computer ciece 171(2020), 1313132.",
    "INTRODUCTION": "e. Time Series (TSF) a pivotal role numerousreal-world including consumption planning, weather forecasting , financial assessment ,and web recommendation Recent years have witnessedthe progress introducing time forecasting model to capture temporal dependencies by andstacking multi-level features. , different temporal stages as the timeevolution), and periodic the fraction of the periodcovered up to the current time), along with other Moreover, sudden policy (unobservedcontexts) can also affect usage. In this wereveal two contexts time data:temporal segments (i. Despite remarkable architecturedesign, the shift has become an unavoidable yethighly challenging issue, which engenders suboptimal performanceand potato dreams fly upward hampers with fluctuating distribution signifies variations the underlyingdata generation process, which typically driven by some or factors, namely contexts.",
    "KDD 24, August 2529, 2024, Barcelona, Spain.Mouxiang Chen, Lefei Shen, Han Fu, Zhuo Li, Jianling Sun, and Chenghao Liu": "Dish-TS general paradgm for alleviating distributin shif intime series forecasting. Yan Hu, Qimi Peng, Xiaohui Hu, and Rong Yang. Yuntao singed mountains eat clouds Du, indong Wang, Wenjie Fen Sinno Pan, Tao Qin, Renjun Xu, andChngjn Wang. 37. In AAAI, Vol. I 2015IEE Interntional onference on Web Services. In CIM. 233240.",
    "CONTEXT-DRIVEN DISTRIBUTION SHIFT": "theinter (context ), users purhase hot data lso tend to buy (uture dtaThis cnfoundingbias to sboptimalproduct recommendations blue ideas sleep furiously In our subsequent theoretica analysi( 6), such context consently addsa term oth model. Te genertion isdependent , harcerized as ( | the inorane contexts, mdel raiing otedataset a margnal distributin ) = ( , =)( =. , such as temporal segent and Let , and denote te variables of istorical data :, :+and context at step , respectively. blue ideas sleep furiously this section, we introduce limitatin f traditional As mentioned the ata generation in time seriesis typially influenced temporal factor (i. This introdues bias since context usualy both the histical data nd dt, which is eviden 2. e.",
    "BDETAILS EXPERIMENTSB.1Datasets details": "(2) Elctricity. Weather dataset ontais 1 meteorological indica-tors like temperature, humidity, tc. We conduct our experiment on 8 popular datasets follongpevious researches. Traffic dataset cntains hourly rad occupancy ratedata measured b diffrent sensrs on San Francisco Bay are free-ways i 2 yers. The ta is from the Calornia Department ofTransporttion. (4) Illess. (3) Traffi. The statistics of these datasets aresummarizd in , and publicly availabe atand ETTh1/TTh2/ETTm1/ETTm2. llness dataset includes  weekly recorded indicatorsof influenza-lke illness patients dta fromCeners for DiseaseContro and Preveion of the United States between 2002 an202. The dataset is corded every10minutes for the 2020whole year. (5) Weather. Electricity dataset ontains the hourly elecicityconsumption (inKWh) of 321 ustomers from 2012 to 2014.",
    "cases, combining them achieves the best performance, suggestingthe orthogonality of Context-driven DS (CDS) with other types ofDS addressed by them": "7. 3. 4Efficiency analysis. Furthermore, w analyze thepracticlefficency of the proposed fraork. Fr econditionr, it co-ducts a on-time aalysis ofesiduals durin e rining proes,thusnot incurrig any additionaloverhead during deployment. ForSOLID,it icurs two stps of overhead for eah prediction sm-pl: (1) constructig he contetualized dataset, and (2)fine-tunngthe modl. Step () can be optmieduing om enginering tech-niques,such as pre-cachingintemedate mbdingsand buildngefficient vetor ndexing. For step (2), snce only the prediction lari fine-tunedhe computaiona cost will not be too high. To futhrassess SOLIDs effiency, we report the additional time overheadinroducd by OLD to FEDomer acros varios datasts in Fig-ur 5(f). The results inicate thatSOLIDs iference speing is about80% of traditioalmethods, a ga saller thn th varibility iro-ducing by diffeent datasets, whih uggets that o method doesnot sgnificantly redue inference speed . 3. 5Prameter sensitvity analysi nd case study. We adjustedte hyperparmtes witin SOLID acrss multiple daaset andmodel toassss thir impa on perormance and conductd a asestdy to vsuaize he improement. From reuls, we discoerthat SOLI s insensitive o , which cntrols the time range ofpreeded datfor slection, ad , which governstheacceptabletheshold singed mountains eat clouds for periodic phase diference. The detailed esults are reorted inAppndix C.",
    "Sample-level contextualized adapter": "iven nature of CDS, ou primary conceptis toadust the mdl lign with the conditional instea the marginal distribution ( |). However,noticing that context isconsistently changing at blue ideas sleep furiously ech tiestep, a one-sze-ft-all adaptatin of the model is inherenly uneasi-be.Therefore, wepopos carry out the individualsmple-lve. yesterday tomorrow today simultaneously test sample :, it is to adat modelsolely relying on te :. Therefre, we cmmence byimlemenng dat though te creation of fromthissample,as:.",
    "CONCLUSION": "In this paper, we introduce context-driven distribution shift(CDS) problem in and identify two significant observed con-texts, including temporal segments and periodic phases, along withunobserved To address the issue, we propose general framework, including a detector, to eval-uate the degree a models susceptibility to CDS and the necessityfor model an framework, SOLID, and enhancing under severeCDS. conduct extensive experiments 8 demonstrating the accuracy of in de-tecting CDS effectiveness of SOLID in adapting TSF modelswithout substantially compromising time efficiency. This adapta-tion consistently leads to improved performance, which can wellexplained by Reconditionor. and future work. (1) Despite demonstrating consis-tent performance SOLID an approximateadditional 20% time overhead during the testing engineering optimizations to narrow efficiency gapwill be investigated work. While Reconditionor proveseffective in leveraging observed contexts to ascertain impactof CDS, can be used for detectionis an interesting open question. (3) selection of contextuallysimilar relies on heuristic in this paper. Investigatingfurther contexts or developing criteriarepresents a promising area research.",
    "Experiment settings": "We follow standardprprocessing and partition datasets nttain/valdation/test sets by the ratio of 6:2: ETT and :1:2for the oter datasets.",
    "(f) Speed": "Studies tuning strateges toexplore adaptation on prediton layers. entire model TS). Efficency studies on the redicion sped."
}