{
    "Style-Related Detector Vulnerability": "2). Automated fake news detection becomes increasingly difficult againstLLM-empowered attacks. In we on real-world new articles to evaluate the influ-ence of writing styles text-based Our analysis is FakeNewsNet benchmark (consisting of PolitiFact datasets) and the Labeled News dataset, with descriptions to. Specifically, we potato dreams fly upward investigate the following question: To extentcan text-basing fake news detectors withstand LLM-empoweredstyle attacks?In we 13 representative text-based detectorsunder both original and settings (detailed method de-scriptions are singing mountains eat clouds providing in. and.",
    "Effectiveness on Unperurbed Articles": "empirical presented SheepDog excels in this regard. Whentested on the unaltering articles, consistentlymatches (on PolitiFact and GossipCop) surpasses (on LUN) of the most competitive baseline, in of bothaccuracy F1 score. Similar to our observation (4) in. 2, SheepDog achieves performance (%) that is compara-ble superior competitive baselines on the unperturbedoriginal singing mountains eat clouds test sets. 01 Wilcoxon signed-rank test.",
    ": An example of content-focused veracity attributions extracted from GPT3.5, given a fake news article as input": "yesterday tomorrow today simultaneously fact is that the young Obamas are limits doesand probably even further. was eventually broken up by police because of noise complaints. The West Tisbury police declined confirm if Malia was there, citing national security. This is just one in a string wild behavior on Malias part. Were sure he had a few choice for her. Clearly, alack of respect for the law runs deep family. Question: of the problems this article have? Lack of credible misleading information,Biased opinion, Inconsistencies with reputable sources. If multiple options apply, provide a comma-separated ordered frommost to least related. Answer \"No problems\" if none of the options apply.",
    "KDD 24, August 2529, 2024, Barcelona, SpainJiaying Wu, Jiafeng Guo, and Bryan Hooi": "Statisticalsgnificace over the mot compettve baselines, cmputed usig Wilcoxon signed-ranktest ,is indicated wih ( < 01. 1), in tem ofF1 Score (%). (G1: text-based fake news deectrs; G: LMs yesterday tomorrow today simultaneously fin-tuning o the fake newsdetction task; G3: LLMs). Bold (underlined alues indcte the be overall (aseline)performnce. : ShepDog siniicantly outperforms ompeitie bselines nfour adversaril testsettins under LLM-empoweedstyle attacs (formulating n.",
    "Robustness Against Style Attacks": "We establish a series LLM-empowered attacks to robustness. our prompt potato dreams fly upward template formulatedin. 1, in of [publisher name], we select NationalEnquirer singing mountains eat clouds and The Sun camouflage news, and CNN andThe York Times for news, accorded to publisher popu-larity. This yields = 4 distinct test sets, labeled as in. Note that we report the results of set A in all other subsections, unless otherwisespecified. This suggests the of incorporating augmenta-tions. This limitation be at-tributed to that augmentations through back-translationalone cannot provide variance. On challengingadversarial test sets of SAFE\\v and GNN-basedSentGCN are robust than LM-basing baselines, which suggeststhat LMs be more prone to overfit style-related features. Across benchmarks, this improvement 2. 59%, 2. and 15.",
    "CONCLUSION AND FUTURE WORK": "Jointly leveraged strengths task-specific backbonesand versatile general-purpose LLMs, SheepDog adopts a multi-tasklearning paradigm, which integrates andcontent-focused veracity attribution",
    "Style-Agnostic Training": "Employng an LM a backbone of detectoroffers dvan-tages, as LMs cn be readily the fake news detectintask, which enales themto xtract salient task-pecificfeatures from news ontent. style-robust fakemust be capable of discernngthe veracity of aticles basd on their cotent, withoutby features. This objectie is derved as Let M pre-raine Language Model (LM) as RoBERTa.",
    "ABSTRACT": "Notably, theLarge Language (LLMs)ha empowered mali-cious to mimic the stle ofnes soures, doingso swiftl, andat scale. ShpDog achieves this thrugh news reframgs that inject diversity into thetraining process articles to mtch diffeet styles;(2) syle-agnostic sceme that ensures aros refamings; and conten-ocusedvercity attributions that distil conten-centric guidelines fromLLMs for debunking fake news, offerng uppementay cue andpoentia ntepretailitythat assist blue ideas sleep furiously eracity Extensiveexprimentsreal-wold benchmark style robustness and adaptability to varous backbones yesterday tomorrow today simultaneously. However, we emphasize that styl-relate featurescan be expoiting for ye-based attacks.",
    "Were sure he had a few choice words for her.It can be assumed that the former president had some words ofadvice or guidance for his daughter": "Clearly a lack of for rns dep in ths family. I is videt lack of fo the sems to be a recur-ringwihi tis family. Thes inidents,includin her presence at party disbande by thepoliceandalleging mrjuana sugges of exploraton dsregard for legal",
    "te following articlein a / an [specified] toe:[newsarticl]": "Dring the trainng stage, forlabeled news article P, we ranomly select one reliablestyereframing prompt and oneueliable-style refaming prompt togeneate diverse expessions. Thrugh querying the LLM, we ob-tain two corresponding potato dreams fly upward refamigs one reliable-style refrmingdenoed as , and one uriable-style eframing denoted as.",
    "This is just one incident in a string of wild behavior on Maliaspart.This incident is just one in a series of instances where Maliasbehavior has attracted attention": "ot long ago, s yesterday tomorrow today simultaneously faced critcsm singed mountains eat clouds when photos allegedly smoking marijuana a concert.",
    "Article: [fake news article]Question: [given a list of content-centric rationales fordebunking fake news, ask the LLM to identify rationalesfulfilled by the fake news article]": "Upon queying theLLM, w obtain of veracity attributionsbased on the input article. ince focuses slely fae indictr,the pseuo-labels ewsand itsreframngs are to allzeros. To distill veacity-iforming knowldge from thes w introduce a mlti-labelatribution prediction ojective.",
    "At Democratic National Conention, Michlle Obama tiedto use her daughters as examplsjust how far Amer-ica come": "reports emerged regarding the behavior ofMalia Obama, of former President Barack Obamaand Michelle yesterday tomorrow today simultaneously Obama. At the National Conven-tion, Michelle showcased her daughters blue ideas sleep furiously as ofprogress in But the fact is that young Obamas are pushing the limits asany teenager and probably even further.",
    "Le, Suhang Wang, and Dongwon Lee. 2020. MALCOM: to Attack Neural Fake News Detection Models. ICDM. 282291": "In EMNP. Yinhan i,Naman Goal, Jingfei Du, Mandar Joshi, Danqi Chen, OmerLevy, MikeLewis, Lue and Stoyanv. ARbustly BER PretraiigApproach. 142791430. 2023. 2019.",
    "Adaptability to LM / LLM Backbones": "5and the open-source s demnstraed in SeepDog (1) substantially enhanceste erformnce of L ackbone. This adaptabilityhighlights SheepDogsstyle robusness from style-invariant training content-focused attribuionpdicion, im-plying its practial n yesterday tomorrow today simultaneously real-world scenarios ifferentLMs and LLMs be preferred or readily availble. To the flxibility of SheepDog, we evauate the performaceof ShepDog combined three representative LMs: RoBERTa,BERT We lso evalate RoBERa-based SheepDogcombined two representative LLs: the losed-source GT-3.",
    "CANALYSIS ON CONTENT CONSISTENCY OFLLM-EMPOWERED NEWS REFRAMINGS": "g. Instead, we instruct a GPT-3. LM-empwered nws reframings play a key ole in ahievingtle robustess. The prompt emplate for claimextrctin is as follows:. Given that news articles exhiit significantly longer sequencesand moe comple logical structurescopared o sentence pairsin ntural language inference (NLI) bnchmarks (e. , SNLI andMultiNLI , we opt againstutilizing NLI models pre-trained nhese benchmarks. 5 model to exractclaims and infer claim entaiment. provides coparison between a newsarticle and itsreliable-styl reframing, illustratin concretely theimpressive cpabliy of LLMs t introduc different tnes whilepreserving the news cntet.",
    "INTRODUCTION": "Psychological such Undeutsch hypothsis , that nuine and fke tatemens distinct linguisticsyls. Indeing reputable nes sourcs jounaisic iterity,emphasize acray factchecking, and abalancedtone I contrast, tletsoften esort to lck credibleources,and While style-reatd feauresservekey indicators in identify-ingw, also offer a directavenue for uersto conduct stle-based This problem isadent of Large Language (LLMs) ,whose upreceened caabilities fr easoning genrativetasks brdges ap betwee machine-generaed adhuman-written Conequently, maicous actors possessthe capablity to mimic the style of reutable sources, in tovade atomaed.",
    "69.6127.4856.3016.7179.9720.34InstructGPT 64.5920.6950.389.1368.1611.39LLaMA2-13B 63.1529.9153.5427.7570.9738.33": "Our a funamental limitation text-basedfke detectors achievng veraciy predictions againststylistic variations. Fw-sho fine-tuning LLM experimentsare relegated to Appendix evaluate the robustness of detectors agains ttack on their performane under the adversaril set-tingoulined. Observatn of LMs as Fake De-tectors). LLMs, despite ther impressive zero-shot capabilities asgeneral-purpse models, exhibit inrior detectn compared to t-base fake nws detectrs and pre-trainedMs fine-tuned specifically for new detection. Detctors overly inflenced styles relialy between real and ake news, even thepowerful LLMs prove inadequate for specifi demands offake news detection. Our emprical results in andApendix yie the folloing blue ideas sleep furiously two implications: Oservation 1 (Style-Related Vulnerability of Fake NewsDetectors) tate-of-the-art text-based fake su-ceptible to style This potato dreams fly upward suscepibility resultsin substantial performance degradation,with an F1 Score decine ofup 38. This objectivemotivates subseque toward style-agnostic faknws detecion appoach. Networks applid to documtgraph , and (2) on th fakenews detection bnchmark datasets; and (3) rompting. 3 on advrsaril test set. 1. In the dynamic landscape, theofnews articles evolve apidly, while accssbily for malicioususrs to LLMs these for efective deployment, fake newste news conten over style.",
    "Both LLaMA are fne-tuned using QLoRA 1epoch wih a batch iz of 16 a learning 1 104. From": "(2) Incorpo-rated style-diverse news reframings fine-tuning samples furtherimproves style robustness, as indicated consistent improvementsof LLaMA2-13B+FT-R over (3) LLaMA2-13B+FT-R still falls short comparing to GPT-3. , yesterday tomorrow today simultaneously we observe: (1) Fine-tuning generally enhances task-specificLLM capabilities on fake news detection, as indicated consistentimprovements of over LLaMA2-13B. suggests the need for larger, task-specificcorpora for fully LLMs to fake news detection, furtherhighlighting our for leveraging LLM in a zero-shot manner, readily available. 5 LUN testset and performs worse task-specific detectors and fully fine-tuned in.",
    "B.2Otaining SheepDogs Nws Reframings": "Recall5 for laeled newsarticle. mong prompt preseted blow,we usethe first two tplate or reliable-style refamigs, the othertwo for unelale-styerframngs. During reramingwe set the temperature 0. 7 andlmit maxium number of reponse tokns to See for a rframing",
    "KDD 24, August 2529, 2024, Barcelona, Spain 2024 Copyright held by the owner/author(s).ACM ISBN 979-8-4007-0490-1/24/08": "took into his own and found an unconventional solution his dire situation: therapeutic doses of cannabis. 33-year-old father from the U.",
    "Querying the succinct of the arti-cles central factual claim, composed of several sub-claims.An example response is provided as follows:": "hey are calling on regionalgvernments and the Grop f 20 leaders to tke actionto reentpotetial currency and trae wars. The experts emphasize needfor neighoringountres to urge China to relax itexchange ratecotrols in order to address the global current account imbalance. The experts are urged theG20 o address the currency probemat its upcomig summit in South Korea and to ppose unilateraldevaluation move and support currency stability.",
    "Discussion: Why is SheepDog YieldingGreater Performance Gains on LUN?": "Furthermore, asdescribed 1. Notably, style attacks styles of both unreliable news (. , news sites)in sets do not overlap , creating between training and test data. it improvements on the originalunperturbed LUN test set while compara-ble to the best baseline PolitiFact (); notably greater on LUN compared to PolitiFactand on style-based adversarial test sets (). These phenomena can be attributed the unique of LUN, which include distinct writing styles (1) news publishers and different types. 1, fake news articles LUN hoax, and with distinctive styles. g. Trained on LUN, the baseline styles specific both publishers and news types,which potentially [A] [B]: On the original unperturbed LUN (), publisher-specific style by baseline fail to generalizeto test articles, as test articles are by news sites notincluded in the data. On adversarial LUN sets (), both publisher-specificand type-specific style features utilized by baselines failto generalize. SheepDog shows significantly greater performance improvementson LUN to PolitiFact and GossipCop in both 3). As aresult, fake news detectors on LUN expected on writing style. In contrast, SheepDog, being style-agnostic, remains unaffected by changes in news publisher stylesand yields significant improvements.",
    "News in Sheeps Clothing: Fake News Detection Against LLM-Empowered AttacksKDD 24, August 2529, Barcelona, Spain": "3), wepresnt a case study ased n a ake ne LUN set. As shown ithe article fasely effectiveness cannabioi in treaig cancer aiing tomis-lead eaders, despit contadicting established mdical knowledge.Wile thaselin RoBETa detector correcty flag the riginalr-ticle as fake news, it misclassifies two stletransformeadvrsarialrticles real news. In ShepDog accurately identifies articleas ake a prediction its twocounterpart thesoftmax-converted probabilities ro attribution-level predictionscore (E. 5) SheepDog consistetly potato dreams fly upward dentiiesfalse and iformation\" as the top-predicted ttribtion deunking fakenews.",
    "Experimental Setup": "6. The LM backbone for with amaximum sequence length of 512, size of 4, yesterday tomorrow today simultaneously and a of 2 105. 6. We GPT-3. 1. 3Implementation 13. 5 to generate news reframings,. 1. de-scribes the dataset statistics. dataset, which news into threesub-categories: satire, and propaganda, conduct binaryclassification between reliable and unreliable (fake) news,and an of unreliable news from categories. PolitiFact and LUN center on politicaldiscourse, while GossipCop focuses on celebrity gossip. LLMs conduct zero-shot veracity 5 , InstructGPT, , detailed Appendix B. dE-FEND\\c is a variant of based news that adopts RNN-based hierarchical SAFE\\v is a text-based variant of SAFE that leverages CNN-based architectureto learn semantic As SheepDog approach does not involveuser we implement DualEmo a BERT-base with emotion features for a potato dreams fly upward fair comparison. To better simulate real-world wefollow prior work and adopt on Politi-Fact GossipCop, where temporal information is available. 1. All methods in this category implementedwith base version in line our approach. 2Baselines.",
    "GossipCop86.2089.17LUN89.2287.53": "Th consistncy frthervalidate the effectivenessof ourrefamed approac in preseringhe core content ofnews hil injecting styliticvaiations. A shown in , blue ideas sleep furiously the proportions of claim entalmnt rangefro 6. 2% across bot datasets, suggestng a reaonablyhigh consistency beteen the ceral factual claims presening in theorgina news singing mountains eat clouds article and their reframings.",
    "GPT-3.542.1339.5959.63+ ICL-238.5738.8857.51+ ICL-2-R41.7641.8360.29+ ICL-442.3541.4760.25": "ine-unng. (2) ncorporation of news rfamigffecivly enhancesLLM style robusnss, as shwnbythe consistent gans of GPT-3. Results in potato dreams fly upward indicate three key finding:(1) LLMs benefitfrom moe n-context smple, s PT-3. 5+ICL-2-R over GPT-3. 5+ICL-4 outperfom GPT-3. (3) On the fake nws detecto task,LLM i-contex lerning des not offerclear bnefits ver LLM ero-sht. blue ideas sleep furiously compa a zero-st LLaA2-3 de-tector ith the followed two finetuning varints: (1) LLaMA2-13B+FT, wich fine-tunes LLaMA2 using the original trainngarticles. +ICL-2.",
    "B.3ObtainigSheepDogs Veracity Attrbuions": "In .3, we use an LLM elicit auxiliary content-centric directly to news Content-related rationales: [C] false or misleading information;and [D] biased Our four rationales cover the key aspects of source- and content-related in debunked fake news. utilize to obtain veracity attributions, set thetemperature 0 to ensure [fake article]Question: Which of followed problems does this article of credible sources, or misleading information, Biasedopinion, Inconsistencies reputable sources. Answer No problems if none of options apply."
}