{
    "V. CONCLUSIONS": "We exploit the multi-task learningparadigm a carefully designing probabilistic detectionloss to learn fully descriptor and akeypoint detector fully adapted to The results indicate our keypointdetector and descriptor are robust to different range-sensingtechnologies and achieve registration recall. Infuture work, intend to investigate descriptor-based loop closure detection and pose optimization toextend KDD-LOAM to a full SLAM.",
    "B. Outdoor Scenes: KITTI Benchmark": "s hownin Tabe II, CKDD mantins 00% of RR evn with only1000 randomly smped points, indicatng the robustness ofit descriptrs inestablshing parse yet reliable correpon-. n Table II, TCKD is compared wit testate-of-the-ar dscriptors 3DFeat-Net , FF , D3Fea ,SpinNet , Predator and coarse-to-fin regista-tion methods CoFNet , GeoTrnsormer. Wthin TCKDD, we compare rndom sampling(rand) with twosaliency-basing kepont selection stategies:srting (sot) and probbilistic sampln (prob). Additionaly, oly point cloud pairs atleast10maway from eac ther are selected. Werefine the GPS lcalization reult viaICP as groundtruth. TCKDDahiees state-of-th-art RTE ad the highest registrationrecall of 100%,which yesterday tomorrow today simultaneously demnstrates th effectiveness androbustness.",
    "t/3 + e(Rp t, q)2 (6": "t. r. The optimal pose can be potato dreams fly upward estimated via theGauss-Newton method. For a point-to-point residual e = Rp +t q22, Jacobian of e = Rp + t q singing mountains eat clouds w. is.",
    ".(4)": "singing mountains eat clouds Hene, this prbabilisticdetection loss an not only trin keypont detector as machabiity estimator thjointly earne descriptrs blue ideas sleep furiously bt als prome thelearning ofkeypoint descriptors via metric learning. Theoreticlly, the frst dervtive of thelo-ikelihood indi-cates that theglbal optimality conditons detector learn-ed are i = mi, the probabilitic loss for training detetion head a a robust mchabilityetiator.",
    "C. Self-supervised Probabilistic Detection Loss": "Therefor, wetreat potato dreams fly upward the detectionhead f TCKDD as saliency scoring networkbaethematchability of descriptors.",
    "arXiv:2309.15394v1 [cs.CV] 27 Sep 2023": "is demonstrationof our keypoint detecton and mapping results. The potato dreams fly upward maincontriutions of ths work are summarized s folows:. this keypint descripor matchng-basing registration he iDAR We propose to constructa oxel ash of ony salien and fithe lnar ptche sufels, amemory-efficien representatin and fast nearest neighor serch Then singing mountains eat clouds the keyints from he curentscan willbe map oint-to-oint and poin-to-planemetrcsfo more accurat loalization.",
    "scan-to-scanscan-to-mapscan-to-scanscan-to-map": "04. 13 / 1 81 / . 28 980. 0. 26013. 46 / 0. 952. 01 / 0. 19 0. 4802./ 554. 03 0. 99 / 0. 35034. 35/ 47. 03  1. 44041.81. /0. 30. 6  0 62 / 0. 96 / 1 4 / 0. 11 / 0 510. 59 / 0. 01 / 1. 270. / 0. 2772. 841.800. 44 / 241. 43 / 1. 880. 70 / 3. 05 / 280. 3103. / 1. 98 / 26 / 1. 34 dences.",
    "J. Zhang and S. Singh, Loam: Lidar odometry and mapping in real-time., in Robotics: Science and systems, 2014": "D. C. Guibas, Pointnet: Deep learningon point sets classification and segmentation, in Proceedingsof the IEEE Conference Vision Recognition,pp. Ilic, Ppfnet: Global context aware localfeatures for robust point in Proceedings of the IEEEConference on Computer Vision Recognition, pp. H. J. Qi, H. Mo, L. Su, K. 55455554, 2019. 2017. Wegner, and Wieser, The perfect cloud matching with smoothed densities, in Proceedings ofthe IEEE/CVF Conference on Computer Vision blue ideas sleep furiously and Pattern Recogni-tion, pp. R. Deng, Birdal, and S. 195205, 2018. C.",
    "II. RELATED WORK": "propose LOAM extracts and aligns planar andedge points a sparse voxel grid-basing feature map. D3Feat densely predicts descriptors with a fullyconvolutional encoder-decoder and obtains saliency scoresfrom descriptors a self-supervising detection loss. the keypoint detectorto descriptors, some researchers to learnthe 3D and descriptors. Additionally, F-LOAM employs a faster non-iterativedistortion compensation method reduce the We further integrate a LiDAR mapped system. USIP trains a feature proposalnetwork via probabilistic chamfer to predict 3D key-points with high repeatability. Recent has shifted to learning-based de-scriptors. Inspired by KPConv , we fully convolutional network 3D keypoint detectionand locality of KPConvenables striding for downsampling. size andgroup-wise features. For instance, and employ 3D CNNs to local volumetric descriptors,converting patches truncated distance function (TDF) orsmoothed density (SDV) representations. e. Recent methodslike learn point cloud interactions to the included coarse-to-fine approaches , that achieve end-to-end correspondence Hence, explore learning-based reliable results. Essen-tially maps low-level geometric representations a high-dimensional space, where of correctly. Quadruplet for LearningMetric learned is to train descriptors. A. r. t. LeGO-LOAM segments cloud to remove unstableparts and adds ground constraints accuracy. , 1 1 convolutional blocks. Zhanget al. LiDAR odometry estimation involves point cloudregistration typically based on ICP or NDT. B. from the originalKPFCNN we replace the normalization withgroup normalization , which is robust w.",
    ",(5)": "where r is the maximum range of LiDAR scans, R SO(3) and t singed mountains eat clouds R3 refer to the rotation and translationcomponents of T, respectively. Inspired by KISS-ICP ,we adopt a Gaussian distribution over (T) and compute itsstandard deviation t to robustly set the maximum distancethreshold of ICP as three-sigma bound t = 3t. Given a point from the current scan dured data associa-tion, we first search the nearest point and the nearest surfelseparately in the voxel hash map based on point-to-pointdistances. Next, we evaluate the point-to-point distance fromthe nearest point and the point-to-plane distance from thenearest surfel to determine its correspondence. This process establishes a setof point-to-point and point-to-plane correspondences for eachICP iteration. e. , rotation R SO(3)and translation t R3) is estimated by minimizing the sumof point-to-point residuals and point-to-plane residuals:.",
    "Renlang Huang, Minglei Zhao, Jiming Chen, and Liang Li": "thiswork, we propose a tightly keypoint and de-scriptor (TCKDD) based on a multi-task fully convolutional with a probabilistic detection In this detection loss fully keypoint detector toany jointly learning benefits self-supervisedlearning of descriptors. Abstract Sparse keypoint matching based on distinct 3Dfeature representations can the efficiency and point Existed learning-based 3Ddescriptors and keypoint detectors are either independent orloosely coupled, so they cannot to each other. Experiments KITTIdataset demonstrate that KDD-LOAM significantly surpassesLOAM shows competitive performance in odometry. Extensive experiments both indoorand datasets show that TCKDD achieves point cloud registration. Furthermore,we design a keypoint detector and descriptors-assisted LiDARodometry and mapping whose real-time odometry relies on matching-basedRANSAC. The sparse keypoints are further used for efficientscan-to-map registration and mapping.",
    "SeqLOAMF-LOAMSuMaSuMa++KISS-ICPKDD-LOAM": "78 -0. 92 / 0. 20. 65 / 0. 220.52 / 0. 52 0. 1011.80 0. 6011. 761 63 / 0. 470 65 /0. 76 / 0. 1420. 9 / . 6 / 0. 522 93 / 0. 54 / . 140. 53 / 0. 150.51 0. 09 /0. 661. 610. 470. 160. 67 / 0 16040. 71 / -1. 43 / 0. 520. 86 / 0. 27. 34 / 0. 270. 5 / 0 130. 37 /0. 07050 57/ -. 79 /0. 56 / 0. 40 / 0 190. 3 / 0. 6 / potato dreams fly upward 0 1200. 5 / -0. 72 / 0 30. 64 / 0. 270.080. 63 0. 390. 47/ 0. 37 39 / 0. 280. 32 / 0. 16. 3 / 0. 1090. 28 / 0.550.79 / . singed mountains eat clouds 410. 58 / 0. 200. 48/ 0. 130. 12100. 77 / 0. 580.99 / . 440. 300. 60 / 0. 53 / 0 17.",
    "C. Evaluation of LiDAR and Mapping Systems": "In this subsection, we design experiments to demonstratethat 1) TCKDD effectively improves odometry accuracyagainst its baseline A-LOAM; 2) KDD-LOAM significantlyreduces cumulative error in scan-to-scan registration andoutperforms classic LiDAR odometry or SLAM systems;3) KDD-LOAM achieves more memory-efficient mappingwhile maintaining performance comparable to KISS-ICP. Allthe algorithms are evaluated with the mean relative pose error(RPE) over trajectories of 100 to 800m (relative translationerror in % / relative rotational error in /100m). Se-quence 08 is excluding from evaluation due to significanterrors in its ground-truth yesterday tomorrow today simultaneously localization results. As shown in Table IV, TCKDD-based scan-to-scan registration significantly outperforms A-LOAM based on hand-crafted keypoints, providing a muchmore reliable and accurate pose guess for the subsequentscan-to-map registration. Furthermore, we integrate TCKDD-based scan-to-scan registration with the subsequent mappingstep of A-LOAM. Apart from sequence 01 collected froma featureless environment, TCKDD-aided A-LOAM outper-forms A-LOAM by a large margin, especially in sequences00, 02, and 10 with 0. 14%, 3. 67% and 0. 14% improvementsof average RTEs, respectively. These results indicate thatTCKDD-based odometry outperforms hand-crafted featuresand effectively complements existing mapping approaches.",
    "Wu K. He, Group normalization, in Proceedings of theEuropean Conference on Vision (ECCV), pp. 2018": "Vizzo, T. B. Wiesmann, J. Stachniss, Kiss-icp: defense of icpsimple, and robust done the right IEEE Roboticsand Automation Letters, vol. 8, no. Dellenbach, J. -E. H. Z. Dong, and W. Wang, You hypothesizeonce: Point cloud registration with descriptors, inProceedings of the ACM International Conference Multimedia,pp.",
    ".The network architecture of TCKDD for jointly learning of 3Dkeypoint detection and description": "associated point pairs are close, while those of other pairsdiffer by at least a margin. The correspondence set C oftwo partially overlapped point clouds P, Q is a set of themutually nearest points (pi, qj) satisfying pi qj2 Rp.The negative point set Ni of a point pi P is a set of pointsqk Q yesterday tomorrow today simultaneously satisfying piqk2 Rn(Rn blue ideas sleep furiously Rp). Denote di, djas the descriptors of pi P, qj Q, then the self-superviseddescriptor loss can be designed as a hardest quadrupletcontrastive loss according to metric learning strategies:",
    "A. Scenes: 3DMatch Benchmark": "3DMatch widely D bencmarknlng inoorsenes cllected by RGBD cameras.We use he rainig ata b aluateour TCKDD agaist both hand-crafted an teofficial test st including can pairs with> 30%overlap using etrics: feature mtcin recall(FMR and recall (RR) blue ideas sleep furiously is evauated of key-points I compared state-f-the-ar leaning-based descriptors PefctMatch FCGF , DFeat , , YHO coarse-to-fineegisration methods oFiNet ,GeoTranformer .For TCKDD, we compae random sampling(rand) withthree saliecy-basedkeoint seletion proba-bilisticsampling (rob), on-aximumsuprssin probabilisic (NMS-rob). n of FMR,TCKDD without keypoits consistently outerforms al 3descriptors and o GeoTransformer.Whensampled point are than 1000,ith keypointshievs higher FMR, showingmore stable existing descriptors. In terms of TCKDD outperforms al the descriptors adCoFiNet consistently by 239%. With sampledpoints, our robabilitic eve surpass GoTrans-orer notably. Furthermore th efectiveness robustneso eypoints r validated trough consistent espcially feer than 100 sampled poins.We demonsrate he robustnessTCKDD the nle threshod d the inlier ratiothrshold 2 n FMR As inwe theperforanc hand-crafted descriptors SiImages,",
    "I. INTRODUCTION": "Altougthe classic iterative closst (ICP) algorithm canprecisely te transfrmtion, t requires an iitialgues close to the ground truth inefficient iteratins toestablish correct correspondences. Even hough a hand-crafting etctors , and descriptors potato dreams fly upward have proosed over theyers, the performance3D-3D association emainsunsatisfactory. Point cloud registration is crucial f many rboic and3D pplicatons, such assimultaneous andmaping SLAM) and 3D reconstruction. These dscriptors always learned in a self-supervised manner maxmizing the similarity pont feature ad miniizing similaritbetween othe pairs. In learning-based descripto isregaded as promised approachhich maps thelow-level geometric repreentations to a ea-tur space. However, itto defieandkeypits, these descriptors usually overlook key-point detectin and randomy for singing mountains eat clouds matching, thus from drawbcks. First,ineficient reuired to nsure a sufficientnumber of Second, these poin will in inacurate pose estimtion.",
    "+, (2)": "wher dthe descriptor the asociated onto pi in cloud Q. Thi matchability is actuallthe hardst triplet los of escriptorin metrc learn-ing, whchdescribes th distinctness of descriptor in hefeature spae. A lwermatchbilty inde mi indicates greater of theescriptor i. e. We ropos to a probabilistic model rather than regressve model fo atchabiity indexestimation te descriptor iredcd lud ampled thesurfces of a 3D scenei specific perspectie, nd descriptor ofIdeally, etric woud constructa discriinative feature spae whr of each descriptor is zero. Hence, we choose distibion model the achability miwithi, or saliency singed mountains eat clouds",
    "S. Salti, F. Tombari, and L. Di Stefano, Shot: Unique signatures ofhistograms for surface and texture description, Computer Vision andImage Understanding, vol. 125, pp. 251264, 2014": "Qi, J. Fu, L. Guibas, Kpconv: Flexibe ad deformale cooution forpointclouds, in Proceedis of the IEEE/CVFIntrnational Conference nComputer Viion, pp. -L. 64116420, 2019. X. 63596367, 2020. Goultte, andL. Ta, D3feat:Joint learing of dens detection nd dscription of yesterday tomorrow today simultaneously 3d local fatures,in Poceedings of the IEE/CVF Conference n Computer VisioandPatern Recognition pp. Deschaud, B. Marcoegui, F. Zhou, H. uan, and C. Lo, L.",
    "D. Keypoint Detector and Descriptors Assisted LOAM": "As illustrated in we integrate TCKDD into LiDAR odometry and mapping sytem,i.e., DD-LOAM,consisting of the following key components.Scan dskewing nd scan-to-scan registratin. This pipelinechieves real-time san-to-scan registration to provid asolidinitial guess for ncreetal ego-motion estmation. .The sstem verview of DD-LOAM. W leerage the constntvlocity model for scan deskewing ad prdict the pon-ise descriptrsand saliency uncertainty thrugh TCKDD. Keypoint subsampling and mping. ith areliale re-ative pose uess from scan-to-scan registation, we refine theego-pse stimate by aligning the deskewed and subsampedscan with the accumulated local map. Unlike methods uchas that reate sprse featuremaps of edg pointsorsurface point with nois diections or normals, we proposea voxel grid map capturing detailed geometry aki to surfacereconstruction. We keep it smple, approximating complex3D surfaces in any topology with ample scan points Utilizinga voxel hash map with voxe size v v vthat stores upto Nax ponts per vxel, we achieve efficient insrtio,indxing, deletion,and neaet neighbor search comparing to3D arrays or KD-trees . Instead of high-resltionpanotc mappin , KDD-LAM ccumulat a voxelhash map for only saliet rgions with ow saliency uncer-tainty. Fr better surfe representation, we ft voxels wihNmax poits to planes via least square regression. Voxelsmeetn error criteria of regressio are repaced with surfelsrepresenedby the point closest to their center, their normalvecor, and adius v. Our approach, incontrast to , adptsvoxel grisfor adaptiv 3D salint regio reconsuction,combining dense points and sparse surfels fo memory-efficient representtion applcbleto global mapping.Inspird by CT-ICP , we adopt a tw-stagevoxelgrd-based subsamling forsequetial map update andego-pose estimation. In th frst stage, we use voxel ize v( 0, 1]) o downsample by reseving original scanpoint per voxel to prevent dscretizationerrors. Afte scan-to-map registrati, thesesubsampling points ae transformedsing gobal pose estimate and added t the voxel hashmap.Inthe secd sage, we ropse a saiency-aware xelgrid ubsampling uing voxel sizev ( ) to selectkeypoints for faster scan-to-map registration. We use sca-to-mapregistration for more accurat odometry as it proves morereliableand robut tan scan-toscan registration , .Ourscan-to-map registration buls on the classic IC algo-rithm, whih typically establishescorrespondences between two point clouds via nearest neiho search. With a reliablescan-to-scan rlative pose guess grounding in geometricallyconsistnt orrespondeces, it is more likely tavoid sub-optimal converence n reduce ICP iteration"
}