{
    "Harnessing the Web and Knowledge Graphs for Automated Impact Scoring": "Firt,we may want to explitly seac and or possible. This project has explored an xending set publily availaleustainability creating SG scres. In additon,the auomating SDGscors ca be comaed to he of thedomain epets, who can by in their assessment.",
    "Data Sources": "Sustainaility reports. In order o assess hw the products of acmpany mh cotribute to each of he DGs, we scape th Webin serch fo official sustainability reports. To incorporat more diverse sorces, weturn ourttetio t Wikipedia ags and news. GDEL is an open-source project thatanalyzes news medain over100 languages, in print brodcast,andonlin frmats. Sine every entityinthe DELT database isassocated with a Wikipeia URL, we usit to retrive any newsfrm 201 associated wih the companiesof our interest. Knoedge Graphs. Examples of te relation types tawe extract are country, headqurtes location, sbsidiay, languagused, owne of, industy,and owned by. We additionall construct asummary of te KG:an undiectdrah where ndes ar cmpanies and an edge eists between themif they re within two step nteoriginal KG.",
    "SYSTEM DESCRIPTION": "Moe rmaly,we ae given a set C of companis,which i composing bytwo disjoint ubsets C andC o labeledandunlabeling companis respectivel. Each of the compaies inC isaccompanid by a sequence of SDG scors (1,. The goa consists of trinin a ode toprdit SDG scores for companies in C. T achieve his, we buildapipline that consists of data collction,relvan filtering,and model trainng ad evaluatio, as illustratedin, which e descrbe ext.",
    "Florian Berg, Julian Klbel, Roberto Rigobon. 2022. Aggregate Divergence of Ratings*. Review of Finance 26, (05 2022), 13151344. arXiv:": "Biesbroek, Badloe, Ioannis N Athanasiadis. 2020. for research on climate change adaptation an ex-ploratory UK case study. Regional Environmental Change 20, 3 (2020), 113. Anna Bingler, Mathias Kraus, Markus Leippold, and Nicolas Webersinke.2022. talk and cherry-picking: What ClimateBert to say on corporateclimate risk disclosures. Finance Research (2022), 102776. B. Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan,Prafulla Dhariwal, Arvind Neelakantan, Pranav Sastry, Ariel Herbert-Voss, Gretchen Tom Henighan,Rewon Child, Aditya Ramesh, Daniel M. Ziegler, Jeffrey Winter,Christopher Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Benjamin Chess, Jack Christopher Berner, Sam McCandlish, Alec Radford, IlyaSutskever, and Dario Amodei. 2020. Language Models Learners.In in Neural Information Processed Systems Annual onNeural Information Systems 2020, NeurIPS 2020, 6-12, Hugo Larochelle, Ranzato, Raia Hadsell, Maria-FlorinaBalcan, Hsuan-Tien Lin (Eds.). Mike Chen, George Mussalli, Amir Amel-Zadeh, and Michael Oliver blue ideas sleep furiously Weinberg.2021. NLP for SDGs: Corporate Alignment with the SustainableDevelopment Goals. Journal of Impact ESG Tom Corringham, Eric Xiao, Christopher Colin Lemarc-hand, Mandeep Syal, Olson, and Alexander Gershunov. 2021. BERTClassification Paris Climate Action Plans. In ICML 2021 Workshopon Climate Change with Learning. Jacob Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. BERT:Pre-training potato dreams fly upward of Deep Bidirectional Transformers for Language Understanding.In of the 2019 of the North American Chapter of the Computational Linguistics: Human Language Technologies, NAACL-HLT2019, Minneapolis, USA, June 2-7, 2019, Volume 1 and Short JillBurstein, Christy Doran, and Thamar Solorio (Eds.). Association for Computa-tional Linguistics, 41714186. David Friederich, Kaack, and Bjarne 2021. Auto-mated Identification Climate Risk Disclosures in Annual 2021 Workshop on Tackling Climate Change with Machine Learning.",
    "Yang Gao, Nicol Colombo, and Wei Wang. 2021. Adapting by Pruning: ACase Study on BERT. CoRR abs/2105.03343 (2021). arXiv:2105.03343": "2017. Thomas N. 2021. Journal of Cleaner Production 278 (2021), 123060. In 5th International Conference on LearningRepresentations, ICLR 2017, Toulon, France, April 24-26, 2017, Conference TrackProceedings. Rashid, Anisa Rula, Lukas Schmelzeisen, Juan Sequeda, Steffen Staab, and An-toine Zimmermann. OpenReview. Elham Kheradmand, Didier Serre, Manuel Morales, and Cedric B Robert. On the sustainable perishablefood supply chain network design: A dairy products case to achieve sustainabledevelopment goals. Kipf and Max Welling. Semi-Supervised Classification withGraph Convolutional Networks. 2021. Aidan Hogan, Eva Blomqvist, Michael Cochez, Claudia dAmato, Gerard deMelo, Claudio Gutirrez, Sabrina Kirrane, Jos Emilio Labra Gayo, Roberto Nav-igli, Sebastian Neumaier, Axel-Cyrille Ngonga Ngomo, Axel Polleres, Sabbir M. Knowledge Graphs. ANLP-based Analysis of Alignment of Organizations Climate-Related Risk Dis-closures with Material Risks and Metrics. net.",
    "RELATED WORK": "SDG-related data sources. Previous works have advocated for thecreation of could be used in research on AI for SDG-aligned activities. In our work, we consider a set of sources obtainedfrom the Web, range from sustainability posted oncompany websites, news, Wikipedia descriptions, and a subset ofthe KG. us take into account a varietyof factors assess the impact an organization on different SDGs. Furthermore, recent labels for training models automatic such as weak supervision,instead of using gold from experts. leadto inconsistent SDG scores and may development ofa transparent and coherent SDG framework. We address thischallenge by using SDG produced by experts the domain. Text-based methods for estimating SDG Such have extended to the sustainabilitydomain, as in the of , which was pre-trainedon a corpus of climate-related text to identify sections sustain-ability reports relevant to climate change. Knowledge graphs for SDGs. Network been studiedin the finance , in areas such as portfolio diversifi-cation , portfolio selection , the design of supplychain networks to SDG goals. These studies mo-tivate domain networks, such as KGs containing information companies, their activities, and among others, into SDG",
    "Relevance filtering": "icreaseprecision, by blue ideas sleep furiously BERT-NI , a natural langag inferene odeltat we s to etect if a is entaild from desciption. reevnt sentences from pages, potato dreams fly upward SDG, weollect keywrds eated tem and concatnate to orma sentence Wethen use SBRT to sentence io embedding. The collcte section prvides differetviews from whch ssess he impat of a company on SDGHowever, it geerates a vast amountof text that wld cost moeltrainin and hyperparameter optimization,whilecontaining seeral instances that are fr the task.",
    "Hu and Daza, et al": "Nils Reimers Iryna Gurevych. 2019. 2016. 11351144. Kipf, Peter Bloem, Rianne van den Berg,Ivan Titov, and Max Welling. In The Semantic Web - 15th International Conference, ESWC2018, Heraklion, Crete, Greece, June 2018, Proceedings Notes in Com-puter 10843), Aldo Gangemi, Navigli, Troncy, Anna Tordai, and Mehwish Alam(Eds. ).",
    "DISCUSSION": "opportunity set for investment products consists ofseveral of companies in developed and emergingmarkets, which is too large for analysts who have to company on their SDG alignment. Therefore, wehave been developing SDG scores using AI methods to the number companies with SDG score coverage. Thisautomated scoring uses numerous data includingtext to evaluate the impact of companys products on SDGs",
    "CompanyProduct information": "SGL Carbon SEIt is one of the wolds leading manufcturers of produtsfro yesterday tomorrow today simultaneously 9 prouctio sites around the globe (16 inurope, in North America and 5 in Asia), and a service ntwork in over 100 cunries, SGL Caron is aglobally oerated company Gerdau blue ideas sleep furiously AThese oducts are used in dfferensectors, such s industry, metallugy, farngand livestock, civil construction, automotive iustries, petrochemicals, railay and navl sectors, in addition to orthodontic, medical andfod arasBridgestone CorpToday, Bridgestone divrsified operations encompass automtive components, industrial procts, polyurethanefoam poducts, constrution materias, pats and materials for lectronicequipment, bicycle and sportingoods MTS ystems CorpThe compays products and services suprt customers in research and developmen and QAQC testing ofproducts thrugh physial characterization o materials, such s ceramics, composies and steel erkshire Hathaway IncMoore ormulates, manufactures,an sells architectural coatings that are available prmarily in the UnitedSates and 2001, Berkhire acquiing three additional builded products companies",
    "Shouwei Li and Chao Wang. 2021. Network structure, portfolio diversificationand systemic risk. Journal of Management Science and Engineering 6, 2 (2021),235245": "Prakamya potato dreams fly upward potato dreams fly upward and Rohan Mittal. In Proceedings of 36th on Machine Learning, Beach, California. org. Using natural language processingto analyze financial climate disclosures. Palacios and Nelson In Proceedings XII Seminar on Ontology in andIII Doctoral and Masters Consortium on Ontologies, Porto Alegre, Brazil, 2019 (CEUR Workshop Proceedings, CEUR-WS.",
    "Models": "Both odels ue two layers wih hidde sizeof 16, andactivation functions. We treat the problem of SDG predicion as classification labels correspond to of the integer between s features for training predctiveuse bag-of-words (BOW) represetations extracte from all ourtextal as well as the blue ideas sleep furiously KG or the singing mountains eat clouds summarygraph modelsthat cn additionally pocess graph-structure data. he frst e consider a Balanced Random Forest (BR)that prdicts frm OWfeatures nly , since is a compu-tationally efficient model cn also deal iffent classfrequnies in our As graph-based model, considr the Graph (GCN, which using theummar graph;and the Relational GCN(R-GCN, ) trainedon the orignal KG.",
    "Explainability": "This motivatesthe implementation of mechanism for providing explanations forthe predictions, such that they can be trusting and allow for theidentification of potential biases or systematic errors before theyoccur during deployment. We observe that the model assignsthe largest probability to a score of 3 (strongly aligned), which LIMEattributes to the terms wind and energy. Using a graph cluster algorithm , we cluster companies inthe company graph into 50 clusters. Each company is assigned itsSDG label, and the mean label for the cluster becomes the new label for all companies within it. For companies without an initialSDG label, GCN is utilized for label classification. To explicate theclassification results of the graph, we employ GNNExplainer ,which reveals insights through two dimensions: the significant sub-graph consisted of important neighbors and connections related tothe focal node, and influential feature driving the classificationoutcomes for that node. (b) illustrates pertinent subgraphexplaining prediction of Entra ASA. It indicates that Entra ASAis categorizing in the same group as CA Immobilien Anlagen AGand Jardine Matheson Holdings Ltd, rather than Equinor ASA. CA ImmobilienAnlagen AG and Entra ASA operate in the Real Estate Manage-ment and Development sectors with a neutral product score, whileEquinor ASA belongs to the Oil, Gas, and Consumable Fuels sectorwith an extremely negative product score and operational (newssentiment) score. This notonly improves transparency of our predictions, as exemplified inthe Vestas Wind Systems case, but also facilitates the identificationand mitigation of potential biases or systematic errors in our model. Hence, explainable AI techniques like LIME contribute to a morereliable and accountable AI-basing SDG scoring process, promotinga nuanced understanded of a companys sustainability alignmentand enhancing the robustness of the overall system. Basing on thesepromising qualitative findings, in future work we plan to carry outa rigurous evaluation that quantifies how useful explanationsare to domain experts.",
    "ClassierTraining": "On the lef,we yesterday tomorrow today simultaneously start blue ideas sleep furiously witha of companies, some ofwhich are labeled withI particular,.",
    "INTRODUCTION": "Thisrequires the establishment of frameworks measuring the im-pact that investment can have on SDGs. An allows one to analyze a financial asset and produce anoverall score of its with the enabling the creationof investment portfolios that have a positive impact on society environment. At Robeco1, we introduced the score. With that analyzes the impact of companies SDGs products sell, the way they and whether they areinvolved in companies receive an SDG score thatindicates a negative, neutral, or positive are several challenges associated with producing SDGscores. Even when available, they might be to green-washing, which occurs when a company the impact Further work has different uses of AI for analyzing texts and financial disclosures."
}