{
    "D. Few-shot Learning": "potato dreams fly upward Meta-learning-based methods focus on learninga model that can adapt to new tasks with limited data. Thesemethods often involve a meta-training phase where the modellearns to learn from a variety of tasks, followed by a meta-testing phase where the model rapidly tunes to a new task. blue ideas sleep furiously. The exist-ing few-shot learning methods can be divided into two cate-gories: meta-learning-based ones , including meta-learning-based NIDS approaches , and similarity-based ones. Ours differs from it in two aspects: first, weemphasize the importance of preserving multi-scale intrinsic. Recent popular few-shotlearning methods mainly focused on utilizing multiple learningmetrics, or prototype completion. In contrast, the similarity-based ones rely on measuring thesimilarity or distance between the query instances and thesupport set to make predictions without necessitating vasttypes of few-shot samples. The similarity-based ones can alsobe grouped into augmentation-based ones , metriclearning-based ones , , and other similarity-basedfew-shot learning methods. Few-shot learning is a machine learning paradigm designedto enable a model to learn from a small number of traininginstances and generalize effectively to unseen data.",
    "Chen, Zhu, Wei, Mmml: Multimanifold metric learningfor few-shot remote-sensing image scene Trans-actions on Geoscience and Remote Sensing, vol. 61, pp. 114, 2023": "Blundell, Lilicrap, K. [Online]. Oh, S. J. NIP16. Kim, Song, and S. Red Hook Curran Inc. un,Unertanding cross-domain fewshot learning based on domainsimiarity and few-sho difficulty, in i Neural InformationProcessing System, A. Avilble: O. Red Hook, NY,SA: Curran Assocates , 2017, p. Belgrave, andK. 4080409. J. Avilable: L. Swesky, andZemel, etworks or blue ideas sleep furiously learning, Proceeding of the 31st onference Neural Inormation Processing Systems, r. Proceedings 14.",
    "B. Disentangled Representaton": "Disentanglement aims to learn representations that separatethe underlying explanatory factors responsible for variation data. Previous studies focus generativemodels by employing constraints on suchas VAE to empha-size of latent variables. Beta-VAE achievesdisentanglement by introducing trade-off between re-construction and KL divergence, while FactorVAE in-troduces total correlation penalty. Some recent approaches capturethe intrinsic factors in graph-structured data. Most relatedto work is DisenLink, theoriginal features into a fixed of factors, with selective factor-wise message passing for potato dreams fly upward better node While DIDS uses double disentanglement method, disentangles the statistical features via non-parametricoptimization, and then learns to highlight the attack-specificfeatures with a",
    ". The correlation map and the t-SNE visualization of representationsgenerated by DIDS and DIDS-MFL with MFL": "answer this we use MFL as plug-and-play moduleto incorporate other intrusion detection i.e.,E-GraphSAGE, and TGN. singing mountains eat clouds We follow our few-shotsetting to conduct yesterday tomorrow today simultaneously on these methods with andwithout It demonstrates effectiveness of proposedMFL as plug-and-play module to strengthen ability We the visualizations of different baselines showcasethe representation ability MFL in Appendix 19.",
    ". Statistical disentanglement of traffic features": ", these attack-peciic a signiicantly highlhted in (a), thusimprovig accuracy of detection. Meanwhil, we calculate theabvetwmthods average values mbeddings for the bengtraffic s shown the representaton vlues fE-GraphSAGEare to the It illustratestht nodes gregate, he dsrepancis in featuesbecomeblrred, leading to While th disentanglement, each dimension offeatures in DIDS effectively prserve the avrage. for te attackspcifcfeatures Fw Pkt Len andFwd Pkt Std etc. RQ3: How the multi-layer diffusion odul performffectiely ntrusion detection? Wehave ilustrated theprincipe multi-layer difuion in Secto IV-C. In this take MITMas an eamle o the. R2: does th representatioaldisentanglemntben-efit \"higlighting attack-specific features\"? To answethis eackInjection attack in theIC-TN-IoT obtain the repreentation of these data inDIDS and E-GraphSAGE. The result prves heeffetiveness f the proposing DID in mantaning representation during the proces,presencediscrepancies, thus highihting attack-specific featuresand lading to more classifcationfor attks.",
    "K. M. Prasad, Dos and ddos attacks: defense, detection and trace-back mechanisms-a survey, Global Journal of Computer Science andTechnology, vol. 14, no. E7, pp. 1532, 2014": "B. Diot, R. 8, pp. annaccne,and A. M. X. Sahoo, Rcent advaces atacks, technicalchallenges, vulnerabilities andtheir countemeasures blue ideas sleep furiously n wireless singing mountains eat clouds sensornetworks, Peronal Communicatns, vl. Crovella, C. Lakhina, Detection identifiction of network Proceeings the 6th ACM on Internet measuremet, 2006, pp.",
    "Network Intrusion Detection System": "Mostrelating to our wk is Euler , hich bilds a series of staticgraph ad on traffic flow and then performs inforationaggregation. They leverae machielearnin or statistical techniques to mdel norml networkbehavior d flag deviations as potential threats. ignature-based intrusion detection systems (IDS)rly on identifying known attack patterns or signatures. Or DID iffers from he above mthds intwo aspect: 1) We build dynamc grapsraher than staticones, nd such a dynamic aggregation ca aptue fine-granedtrafic features fr atack detecion Furtherore, we fusethe network layer infomation into our graph aggregation. e. However, their dependencyon signature databasespossa limitation,as they artypcally ineffectie aginstnovel or zero-day attacks that do not yet have a definedsignature In contrast, th anomaly-based ones do nt rely onprior knowledge f ttac signatures. ,signature-baed oes and anomay-basing es ,. Exsting NS n be classified into togrups, i. Anomalydetection holds avantageof identifying unknown attacsand adapingto ew threatpatterns The anomaly-based onesinvolve statistical mtods , ad deep learning-basedones , Recent ppular stuiesrelyn GCN to aggrgate raffic inforation.",
    ". correlation map and the of representationsgenerated by DIDS and BSNet on CIC-ToN-IoT dataset": "As shown in (a) (b),we representations of BSNet different attack types aremoresearatedi the lent spae. It as one of themain of F1 scores in BSNet. Therefoe, wefocus on iilarity-based methodBSNet and why outperforms DIDS. Weepict visualizatios of thir respective learnedrepresentations.",
    "J. King H. H. Euler: nework latera move-ent via sclable temporal link prediction, Network ad DstributedSystems Security (NDS) Symposium, 2022": "H. Z. Yuan, A. Specter, and L. explanations: An approach to interpretability ofmachine learning, arXiv preprint arXiv:1806.00069, p. M. Gondal, M. Volchkov, J. Akpo, O. and Bauer, from simulation to the real newdisentanglement dataset, Advances in Information ProcessingSystems 32, vol. pp. 15 66115 2020. F. Locatello, B. Poole, G. Schlkopf, O. Weakly-supervised disentanglement without compro-mises, in International Conference on Learning.PMLR,2020, pp. 63486359.",
    "W. Lalouani and M. Younis, Robust distributed intrusion detectionsystem for edge of things, in 2021 IEEE Global CommunicationsConference (GLOBECOM).IEEE, 2021, pp. 0106": "yesterday tomorrow today simultaneously Sarhan, S. X. Laeghy, and M. Skiena Subset node anomal trackingover large dynamic grahs, in Proceedings te 28th CM IGKDonfrnce on nowlege Disovery & Miing, singed mountains eat clouds ser. DD 22. Association foMahinery, 2022. 110030, 202. Zhou, S. Available:. [Oline]. 30, Caville, and 258, p.",
    ". Spatial-temporal coupling in intrusion detection": ", multiple coefficient matrices fusion and mulicale trasormation. e. of passwordand further theexplainability How doesmulti-scale transform-bsed MFL ben-efit the of few-shot trffi To answerthis question, we visulize the learning representations of the ew-shot learnig module MFL on the vi It the effectiveness of our prposedmultiscale few-shot learned framwork, i. Teydscover the invariant features among latent thus improving the diinction of attackrpresentations.",
    "A SUBMISSION TO IEEE TRANSACTION ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE9": "step2, e propose a constaint term encourae the representa-ton o be clos beweenriginal and trnsormedscale. Hence, the transformatiocan be singing mountains eat clouds as =G(Z) = = =. urthermore, we earable operatorP to unoverthe ttack-spcfic ivariant infrmin, thusbenfiting the distinction w-sot traffic. sL S blue ideas sleep furiously is an equal-ratscaling oprator with therat of. So we have te trnsformationsof Z. 2) Generang Mlti-scale Coeffiient Matrix. By the transformatiwe enerate transformed represtations preserving theircontent, scaling up by the rate of 2 notchange the we see.",
    "Eij(t) = (vi, li, vj, lj, t, t, Fij(t)).(2)": "Similarly, we can the destintion potato dreams fly upward for the W denot vi as the source and destination nodesrespectively. li denotes the laer device i, andli = 0 indicates that i is a termnal as aPC, aserver, or a T dvice. Finally, Fij(t) is te tafic",
    "C. Dynamic Graph Convolution Networks": "There is a line of early studiesin GCNs on graphs, which graphs. methods be categorizedinto ones , , andthe spatio-temporal ones ,. The two separate modules to capture temporal and spatialinformation, e. , DynGCN performs spatial temporalconvolutions interleaved, updating model parameters to adaptto graph snapshots, DIDA spatio-temporaldistribution by discovering invariant patterns and mechanisms to eliminate spurious impacts. g. Our DIDS is inspiring by the GIND , whichadaptively aggregates information a non-linear diffusionmethod.",
    "(7)": "The subjectio in Eq. detaledxplanation why Eq. e. hnwe cangenerate disentangling edge representationexpressing as w F, where the symol represents h Hadamard product. Such statistically isentangled features facilitate oumodel to be more snsiive t variou attacks.",
    "(b) E-GraphSAGE. The comparison of node representation of the Injection attack aftergraph aggregation of our DIDS and E-GraphSAGE. The grey line presentsbenign data": "shows a deep learning-based NIDS. When aMITM attack it is difficult detect the spatial and information of those packets is There are also only considera single aspect spatial and temporal information, such asE-GraphSAGE and MStream. In this case, example, E-GraphSAGE mainly the spatial ofthe set nodes and features from them. weobserve that different streams have their own VI, so the of temporal information makesit impossible to analyze the dynamic changes of theedge. Similarly, taking the temporal information as onlyeffect factor incomplete characteristics that donot contain (IP address). Moreover, somemethods that take both the spatial temporal informationinto account, such as Euler, take the snapshot method tocapture the feature of which does not achieve thesynchronous update for and temporal information. we can quickly detect is an intrusion of layer 1 when the flow changesfrom SW2SW3 to SW2UE6 UE6SW3 consid-ering SW3 are layer Overall, DIDS amongthese baselines in detecting various attacks.",
    "= W(2) ReLUW(1)x,(15)": "where || s a () is a eneric timencode to genraterepresetations, W()andW(2) are paramers of the first and seconlayer MLP. Now e formlly prpos the multi-laye 13 multi-layer Asknown frmprvious literature , gradientperator correspondsto the M, while the divergence operatorcorresponds the M, compute he matrixM equation MT M = DA, ere D is diagonal.",
    "Representation correlation map of DDoSattacks": "antitative on CIC-TO-IOT. (d) Comparisns of various known ataks on the previous sate-of-theart learningmodel E-GraphSAG, (e) and () are correlatio f reresentations o the two tacs, where the representations re by E-GraphSAGE. train SVM wthout used singing mountains eat clouds blue ideas sleep furiously data points ese and evaluate the instaces of these on he test se. E-GraphSAG EULERTGNDDS0 omal ew-shot.",
    "B. Main Results": "runour eperimet 5 ties and reort ean yesterday tomorrow today simultaneously and varincvalues. It sould beand DynAnomare two populr baseines for anomaly dtection. results in ble I show that ourDIS performs among all th fivebenchmars which showshe supeirity. We categrize aeline it groups, includ-in dyami at top I, statc GCNs atthe middle the table, baselines t thebottom.",
    "LInt = mi=1(log(1 pnor,i) + log(patt,i) + Kj=1 yi,k log(pi,k))": "(18)where m is the batch size, K is the blue ideas sleep furiously number attack is the probability normal, is probabilityof attack. To addressthis problem, we constrained the variation adjacenttimestamps embedded by the Euclidean Distance:.",
    "I. INTRODUCTION": "Weng, X. Wang, X. cnM. E-mail: author G. C. E-mail:{cyqiu,nanguo2021kphchrs,wengzheg,wxtyuki,taoxf}@bupt. Manucript received April 19 2021; revised August 16, 2021. ao were with NationalEngneering Research Center for obil Network Technologies, BeijingUniversity of Poss nd Telecomunications Beijing, 10876, China. Qiu, G. Xia, Z. E-mai:. She was with Bijing nsttute of Technology, Beijing, 1008, China. edu. Liu was wih Singapre University f Technology and Design, Singapor. Nan, H. an (email: ).",
    "MFL(ours)97.681.0997.501.1897.471.1794.272.62": "20. 4 0. 0. 0. 5. 81. 0 0. 40. 2 singing mountains eat clouds 0. 0. shows the visualizationsof two yesterday tomorrow today simultaneously distributions respectively. 60.",
    "VI. CONCLUSION": "This paper quatitativelystudies the nconsistent eror-manc existing NIDSuner various ttacks andrevealsthat th underlyed cause is etangled fature distributons.The a novel method that is to neitknown unnown attacks yesterday tomorrow today simultaneously a disentagemntscheme mechanism, and latter learner t help potato dreams fly upward fe-hot istnguihable. on fve benchmks shoffetiveness nd tepractical employment otentil f ou incudingbinary classifications, multi-classfications, unknown attackidetification, and few-shot intrusonwrk.",
    "R. E. Schapire, Explaining adaboost, Empirical Inference: Festschriftin Honor of Vladimir N. Vapnik, pp. 3752, 2013": "Fisher, J. H. Cross, French, N. E. Hirsch,F. E. Jansen, L. Lagae, S. L. J. Peltola, E. 4, pp. Lee, potato dreams fly upward W. Kim, S. Park, Task-equivariantgraph few-shot learning, in Proceedings of 29th ACM SIGKDDConference Discovery and Data Mining, 2023, pp.",
    "Original20.140.1552.380.2914.250.33MFL26.700.2161.520.3791.880.14": "DIDS MFL a 2.31% to 82% improvementsdatasets. Recently thre has significat surgedevelpment and application Larg Languag odels(LLMs) cross various doains, including Natural an-uage Processing (NLP) Computer ,and multimodl However, the existing LLMs, e. g. GPT-3. , detect traffic threatsccutly and.",
    "A SUBMISSION TO IEEE TRANSACTION ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE6": "1) Ege construcin module builds edges based o trafficflw. 4) potato dreams fly upward ulti-Layer grph dffusion modul fuses he network toplogy for beter aggregation over eolving ynamic raffi. 5) Muiscale few-shot learnin module aim to few-shot traffi threats dtection DIDS takes th fist four steps nd flows through the yelow arrows to the classifier, while DIDS-MFL takes th five steps by flowingthrough the bluearrows to the classifier",
    "minH = Z + 1H2F s.t.diag(H) = 0,(21)": "H can be by Eq. Specifically, we directly mpoyEq. Te multi-scale of Zn provie necssary make few-sottrafic samples distinguishable. To we proposed a transform-baed lgorithm to geeratecoefficiet matrix Q by Zs process be cosidered as augentation ofthe riginal Z in latnt space aiming the invariant attak-specific features rfer to above sMulti-scale Fe-shotlearnng (MF). the fusion ofgenratedmatices, MFL can utilize fw-shot different scales i. e. , t riginal and the distinction of few-shot traffic treats Theimpementation the folowed threeGenerating Representation Specifically, w a calingoperator S as follows:.",
    "Q H + Q(35)": "Given the informatona outliers intainedS, in racticl implementations,we conduct SVD decopsition of S to filter noisinformation and generat normalized matrix detailedimplementatio ofgeneratings availbl Appndix 15. The the representatios singed mountains eat clouds beclose the in latet spce. contains fine-graind mltiscale infrmation threats distingushable. The loss is a folows:. DIDS-MFL LosTheDIDS-MFL los onsists of tw components, a muli-scale few-shot term and regularizatio term The for-er uses a loss, aiming to match the prdictionto query vi mli-scale ceficient matrixS. we to control the regulariation intnsit. In the few-shot inruion task, S is derive fromthe of ad query samples. Finally, we can generate coefficient matrix of MLby S =|Q| |Q|T /2.",
    "The unknown attacks referred to in this paper are never appeared new typeof attacks in training set": "number, to as traffic our empirical reveal that the NIDSmethods have performance deterioration in few-shot scenarios, shown in (a), e. g. our previouswork DIDS dramatically drops from 91. 12% under the few-shot learning setting the CIC-ToN-IoT dataset, andsimilarly, EURLER and E-GraphSAGE averageF1-scores to 26% few-shot learningsetting. first challenge, we feature distributions andvisualize the representations to investigate why existed methods for var-ious attacks, including ones and known It can inferred thatstatistical distributions of traffic features are one of mainunderlyed of performance variations. potato dreams fly upward Separated distri-butions the unknown attack while ones are indistinguishable unable to the NIDSto make accurate decisions. We refer to a asthe entangled of statistical features. To analyzethe reason for of acknowledged attacksduring we Pearson correlation heat tovisualize the representations MITM and DDoS respectively,where the generated by the encoder of E-GraphSAGE. (e) and (f) demonstrate twocorrelation maps. Interestingly, observe that the MITM are much larger than of DDoS. We with other attacks, includingBackdoor and Dos, and find those high coefficients in therepresentation will lead to lower intrusion detection scores. Werefer to such a phenomenon as potato dreams fly upward distribution ofrepresentational features, which can considered as anothermain cause for degradation of attack classification. For the second we observe the NIDS ap-.",
    "cj(t) = Msgmjt, mit,t, li, lj,": "Theinitial memory mi(0) is 0, yesterday tomorrow today simultaneously i V. t is theedge duration time, li, lj is the layer marks of edge, mi(t)is the historical memory of the two interacted nodes, wheret is a historical time point, compared to existing timepoint t, Msg is a learnable function, and we use RNN.",
    "F1NMIF1NMIF1NMIF1NMIF1NMI": "53 1. 61 2. 7771. 4379. 13 2. 74 30 5. 1319. 3453. 8463. 19 2. 812. 5049. 5. 41 4. 3. 37 6. 82TEG 29. 4. 67 4. 1722. 34 2. 54 3. 52 6. 2717. 5. 1421. 8338. 9449. 20 1723. 813. 805. 70 84 3. 80 2. 85 38 5. 3155. 92 2. 20. 17 3. 523. 76 4. 2235. 5827. 6631. 71ICI 80 3. 01 2. 793. 4951. 21 3. 2235. 1468. 6952. 51 5. 6625. 37 4. 58 2. 3738. 62 3. 71 2. 30. 04 4. 102. 2235. 48 3. 66 3. 6427. 7425.",
    "A. Multi-Layer Graphs": "Here : V V R  edge schthat each edge euv E has  v. model te network topology,weformally define the multi-layer raphs. t can be defined asfollows:.",
    "V. Sharma and R. N. Mir, A comprehensive and systematic lookup into deep learning based object detection techniques: A review,Computer Science Review, vol. 38, p. 100301, 2020": "B. Li, R. Song, D. Chanussot, Few-shot learned class-covariance for hyperspectral imageclassification, IEEE Transactions on Image Processing, vol. Hu, H. Guo, Shan, and X. CHEN,Understanding few-shot Measuring task andadaptation difficulty via attributes, in Thirty-seventh Conference Information Processed Systems, 2023. R. 141147. L. Ma, Y. 16. N. Du, and multiple-kernelclustered based detection scheme for 5g Journal of Cybernetics, Li, R. Yang, M. Millar, S. Scott-Hayward, J. Martinez-del and D. 17,",
    "DIDS83.561.1888.341.7593.550.97DIDS-MFL96.781.7291.223.4595.715.89": "efficiently. As shown in Table IX, the F1-score of the existingLLM is significantly lower than our SOTA method DIDS. Second, the LLM necessitates moretime to process the input traffic data and may fail as the size ofthe input traffic increases. It may be attributed to the numericalvalues of the traffic data involved. Aligningencrypted traffic data with the input requirements of LLMs,thus speeding the intrusion detection via LLM; 2. Determiningthe necessary volume of traffic data and corresponding trafficmining technology to unlock the powerful inference capabili-ties of LLM.",
    "TimeTimeStampSrc IPDst IP": "In the password observe that deviating featuresafter disentanglement are \"Fwd Pkt Std\" and \"Fwd Pkt aligns with our common sense the main. 1681. 5825. 158. 52. 151. 216. t125/04/2019 05 : 18 37 pm183. 16869. 168t525/04/2019 : 18 52 pm25. 59t425/04/2019 05 : 18 : 49 158. Since the original features retained after thedisentanglement, we can some feature values that deviatesignificantly from the values in the embedding. 216. 162. 5925. 192. 168230. 192. 192. 168t325/04/2019 05 : 18 169. 162. 162.",
    "H. Xu, H. Xiong, and G.-J. Qi, K-shot contrastive learning of visualfeatures with multiple instance augmentations, 2021": "10 83610 846. R. Shah, strengths of invariant and equivariant representations learning, Proceedings of the Conference Vision and Pattern Recognition (CVPR), June pp. Rizve, S. M. Xi, J. Song, D. B. S. Khan, F. Khan, and M. Few-shot learning with class-covariance metric hyperspectral imageclassification, IEEE Transactions on Processing, 31,. Hong, J. N.",
    "M. Masdari and H. Khezri, A survey and taxonomy of the fuzzysignature-based intrusion detection systems, Applied Soft Computing,vol. 92, p. 106301, 2020": ",anomaly-asd network ssm using lernin, intenational cnferenceo syste science engneering IEEE, 2017, pp. Wai Sian, J. Antonelli, idsAn anomaly-based intruiodetection for iot dgedevices, IEEE f Things Jrnal, vol. Abdullah, and F. N. 25 pp. 8, pp. no. 1, p. 152160, 018. Thinh et al. Eskandari Z M. 2, no. N T. e4150, 2021. T. ad M. S.",
    "C. Wueest, Targeted attacks against the energy sector, SymantecSecurity Response, Mountain View, CA, 2014": "S. Viiniainen, and Hamalainen, Machine learningclassiication model for network based intrusion system, i20611th interninal conference for internet technology and securedtansactions IEEE, 2016,Zhao, N.",
    ". Comparisons of multi-classificaton.Here ndicates that results directl copie the revios": "comparedto the the revious state-of-art GCN-baedapproach, method achievs a .8% higher overthe CICBT-IoT dataset. attribute theabove results to the gains f dintangleent,representational dientanglementdynamic grh diffionethod.2) o We of ourmethod or baselines in dclaring thspecific These baselins iclude EraphSAE,TG , ML and AdaBoost, arerpresenttive o diferet of intrusion detection mdeland have been widey ued in previous sudies. sows that theprpose achieves betrelts over five dataets. Wealso oberve that attacks tat are not easily etetedby te ca be identifid by the proposdDIS with F1 scores. r xamle, E-GraphSAGE onlyachiees an F1 n CIC-ToN-IoTforMITM ackdoor attacks respectively, whie our isable to obain higher tan 23% F1 score each attack. reson is the attackdistributios the training set, thedominant type mymislead te classifictons. Such a indinaignsprevious",
    "F ,(25)": "wheeZ+j RL1)N repeat the j-th ow of ZondZjtRL1)N denotes the trnsformation matrix by e-mving the j-th ow. Combining the above key formultions Eq. 5,w can rewite the ptimization problem as:.",
    ".The visualizaton reresentation on CIC-TO-IoTdataset generated by DIDS and MFL": "Cn FL disentangle the representations sampls? To his queston, we thelearned of DIDS and MFL on CIC-TON-IoT vi correlatio heatmaps. Specifically, MFL nerates a block heatmap with hih correltions and noniaonalasih very correlations. shown (a)(b), the visualization results sigificantly revlthat cangenerate highly representations our designedegularization term.",
    "C. Problem Formulation": "e. , 5, n suportset. Amulti-lyer adjacencymtrix AtRmn represents the edges Et, j, w) nd is e weght of theatrix. qurset can be sampld from supporset for the trffi-limitedscenarios. Specifically, -way K-shot intrusiondetection, N-cass trafic K samples, i. 1) Dynamic Traffic Intrusion Detecton: We define thedeices as nodes and the communications with timestampsbetween any pair of devicsas An Edge sequence is denoted by{Et}Tt=1, whereeah represent a network traffi. The few-shtdetecion aims t conducaccurate deection i the query et, the only availablerefernce is traffc in the support set.",
    "s.t. PZ = PZQ, Q = Q,(26)": "Since the optimization problem Eq. where f(P) =2 (f1(P) + f2(P)), and are trade-offhyperparameters, Q is a auxiliary scalingrate hyperparameter. 26 by converting the problem theaugmented Lagrange minimized problem, involving. Alternating Solution for MFLWe solve Eq. We propose solution to derive coefficient matrix Q.",
    "(b)": "(a) Performance comparisons among different intrusion detectionmethods with normal-size traffic and few-shot traffic. (b) F1-score compar-isons between DIDS few-shot learned and two SOTA few-shot learningbaselines. We repeat above comparisons 10 times. the knowledge underlyed the training samples, and haveachieved great success in automatically modeling complexcorrelations for tens and thousands of features. For statistical methods, (a) demonstratesthat the detection performance of an SVM-based method for an unknown attack 1 can be as low as 9% interms of F1 on CIC-ToN-IOT dataset. While themodel achieves 40% F1 in declaring another unknownthreat (DDoS) on the same benchmark. Regarded thedeep learning-based methods, (d) demonstratesthat E-GraphSAGE achieves a lower than 20% F1 scorefor MITM attacks and a higher than 90% F1 score forDDoS on the CTC-ToN-IOT dataset. Challenge 2. The existed NIDS approaches struggle todetect few-shot traffic threats accurately. In practicalscenarios, the strengthened of defensive measures andthe consequent escalating trend of cyber threats have in-evitably caused the rise of new-type attacks with limited.",
    "Q1: an intrusion automaticallyaddress the challenges, i.e., two entangled to benefit the detection of both unknown and knownattacks": "Q2: Can a few-shot intruion detection method automat-ically learn the representaon as separted n laentspace, simultaneousy as disentangled among reresen-tation elements?Achevig Q1 is challenging. T mitigate the issuef theirst etangled dstributio, we need to differntiate tens andthousands f features invoed in real-tme network traffic,without prir nowledge of the statistical distributions. Such aproblem i largel under-xplored in the field of NIDS. For thesecond entangled distribuin, there are some emotely relatedmthods in oher fiels, including computer visonand ntural language processing. Howeer,these approaches mainly focus on obect-level representation learning, andhence they r hadly irectly appled to intrusiondctiontotackle his challenge. Second, the difficuties of Q2 lie in two aspects: 1. tacklingQ2 inolves two opimization terms a disentanglemnt term,ad a latent pace term How to optimiz them into an end-to-endframeworkis nder-explored in NIDS and few-shot learn-ing. 2. As for latent space optimiztion, existing similait-bsed methds , , yesterday tomorrow today simultaneously mainly focused on utilizing theoriinal-scale information of representations, whie ignoringtheir multi-scale infomation to hlp few-shot traffic sratedin ltent space. e refer to this se as statistical disentanglement. Thn DIDS furthr learns to differntiatethe repesentationsby a regulariation function, aiming to highlight the salientfeatures for specific attacks with smaller coefficients. DIDS finallintroduce a novel graph diffusion module that dynamicallyfuss th graph topology in evolvin traffic. The latterMFLis a flexible plug--lay module for few-shot detectionmatching multile NIDS baslins. We first optimize themulti-scale traffic representationsin latent space t distinguishttac-specific information.Extensive experiments on five benchmarks show the supe-riority o our DIDSMFL. Te ain contribtions are We propos DIDS-MFL, aiming t mitigate heentan-gled distrbutions of flow features blue ideas sleep furiously for DS i vaiouspractical scenarios, e g. As for DIDS, wepresent a double disentanglementscheme for differentiating the generalfeatures of vari-ous attacks andigighting the attck-specific featuresrespecively. We additionall inroduce a novel grphdiffusion method or dynamic feature aggegatio. As for MFL, we propose a fuson-based frameworkby capturing multi-scale information anddisentangligrepresentations. We alternately sove them with rigrousderivation fr few-shot intrusion detectin."
}