{
    "( ) ( ( )))22 ,(2)": "Algorthm 1 illustrates adaptation via temporlimputation. Fially, te tomake features of the mased recoverable by thesource-pretraining imputer network, usin the square errorloss in Eution 2. Notably, only the network optiized,produced that can be mputed by fixedsource-retained network. To reduce the imputation loss,the adapted target features shoul be temporaly withth source features. Next,the surc-pretined encoder is useto extract the latet feaureof both original the temporaly signal, repre-seted as , respectively.",
    "Tong Yahao Liu, Jinhong Deng, Wen Li, Lixin Duan. 2022. Max-imum Classifier Discrepancy Source-Free Domain Adaptation.In AAAI": "Tong Chu, Yahao Liu, Jinhong Deng, Wen Li, Duan. In Proceedings of the AAAI conference on artificial intelligence, Vol. 36.472480. Emadeldeen Eldele, Zhenghua Chen, Chengyu Min Wu, Chee-Keong and Cuntai Guan. 2021. Deep Learning Approachfor Stage Classification with Single-Channel EEG. Transactions Systems and Rehabilitation Engineering (2021).",
    "KDD 23, August 610, 2023, Long Beach, CA, USAMohamed Ragab et al": "Furthermore, we compare the effectiveness of our taskto other auxiliary tasks on time series data. In our MAPU, we leverage SHOT as blue ideas sleep furiously base SFDA method. Nevertheless, our approach is not limiting to SHOT and can beeffectively integrated with other SFDA methods, as demonstratedin our versatility experiments.",
    ": Effect of temporal masking ratio on the adaptationperformance for the three datasets": "3. we systematically examine theimpact of masking ratio on performance in of imputation The shown in ,reveal a clear trend of improved performance with lower.",
    "Overview": "present our MAPU to achieve source-free adaptation on timeseries data while considering dependenciesacross domains.",
    "Capturing Source Dynamics": "Used only ross-enropyfo trainin te source netwrmaneglect this aspect. To addessthis, we popose a empora imputation task tht aimsto recoverthe input signal from a temporally maked signal in the faturesace. Te imputation task iserforme by a imputer network hat aes he masked sigaland maps it to the origina sigal. The input ignal and askedsignal are firt trnfomedinto their correspondingfeature epresentatios and bythencder. Thetask of he imputer ntork is represented as = ( ( )) = () where is the imputd signal. Theimuter network s traied to minimize the mean square errorbetwen te features ofhe orginal sinal and the imuting sigal,which canbe formulted as:.",
    "EXPERIMENTAL SETTINGS4.1Datasets": "We evaluat our proposd method on three real-world dtasetsspanning three time series applicatins i.e., machine falt diagno-sis, human actity ecognition, and sleep stage classification. Theselected datasets differ in mny spcts as illustrated in ,which blue ideas sleep furiously leads t a consderable domain shift across diferent domais. Thsdataset focuses on huan activityrecognition tasks. Thre types of sensors h eenused to collctthe dat, i.e.,accelerator sensor,gyroscope sensor, and bodysensorwhere each sensor provides three-dimensional readings, leading toa ttal of 9 chnnels per sample, wth singing mountains eat clouds each sample containing 12data pints",
    "AaD + Tempral87.064.0591.11": "all surpassigthe second-bes soure-free method,Aa, by 11. 8%. It is worth oting that the performnce impovemenof omthod is relatvely n MFD dataset compared otherdatasets. This mainly attributed totwo rasns. Second, ulikeother this datast a limitedumber of classes,",
    "Source-Free Domain Adaptation with Temporal Imputation for Time Series DataKDD 23, August 610, 2023, Long Beach, CA, USA": "TimeTime TimeTimeTimTime TimeTime singing mountains eat clouds Caturing Source DynamicsAdating arget TemoralDynamics : Adatatio with TemporalImpuation. Rigt: Once trained, the iputeretwork guides the targt odeto features thatare cnsistentwith the domain. in viwd Compoets in rd are whle those n gray color are non-trainable).",
    "Recurrent Imputer": "perform random maing acros theidimensio souce sigal. Given the original oure and its tmporally mased , the network is generate the orrespnding laten and rsectively. Subsequently, is update to produe imutedfeatures from masked featur usng th meanloss. Right: Te adaptation stage the encoder ontheagt doma data. Th is updated to source-li features mputble y pretrained. approat leveage moel pretrained on theomainto geneate synthetic data durinthe adapaion step. Another approach uses or teir corresponding entropy to prioriize confdent for pseudo-labein ssing that model moe cofident onsurc samles and lesconfident ontarget saples. Despite the trong ptential demontrted are pimarily dsigned fr visua applicatios nd may fail toeffectivly temoral dynamics time eries data.",
    "Inegration with Other Source-freeMethods": "ypcally,ource-free adapttoninvolves a tw-sage raining procedure: (1) pretraining the orcemodel with source domain dat, and (2) adaptin the petraindmodel to the target domain. Our proposed MAPUis generic and canbe intgrated with othersrce-fre adaptatio methods. As a result,the encor can betrained exlusivey wihth convetional cross-entropy lss, ensuring tat te imputationtask does not negtively impac the prtrainingprrmance.",
    ": of performance with varyingrelative weight the temporal imputation component": "our temporal imputation taskFor instance, n the UIHAR daaset,e saw a notable 3 boost i perforance for the NRC and AaDmethods. The improveents arconsistent cross the SSC andMFD datasets, demonstraing ourapproachs effectivess in providg eporaladapation capabil-ity to existing SDA methods tt are mainly proposed for visualapplication. 5. 2Senitivit Aalysis. As such, the featue spaceproides a more abstact represenation of the aa,making thiputation prcess fe of the variations prent in the input spce. 0. 1250 5.",
    "Model Analysis": "5. 3. 1Veratlity Analysis. shows prformance of cross-domain scenariosin ach ataset. Our results indicae a inperformce acros alldatasets through the integration",
    "Temporal Masking": "Westart by ividing the inpusigl, ,ito several blok lontheime dimension. Further discusion singing mountains eat clouds onthe mpact f the maskig ratio on te adaptation performance canbe foundin the epriment section. This proces is plied to both the source and targtdomains. Our aim is to challenge th odel to usethe normatofrom surrounding blocs tofill in themissing parts and capture thetemporal dpndencies in the inut signal. Inthis section, we explainour process of tempora masing.",
    "Source-free methods": "Source Hypothesi ransfer (HOT : minimizes infor-maton maximization los wth self-upervisd pseudo laelsto identify targetfeatures that can be copatile with thetransferred oure hypothesis Attcting and spersing (AaD): optmizs an bjecveof prediction conssncy y treatng SFDA as an unsuper-visd clustered probem nd encouraginglocal neighor-ood feature in eaturespace o have simiar predictions.",
    "where Lce = =1 1[=] represents the standard cross-entropy between the predicted and the true label,": "represents the redictd clss and sampe , andLmapu represents the forour tempora network on the sorce ata to the inforatinIn the target adaptation tep objectve is optimize target encoder, by alancing th tepral imputation loss andthe eneric loss to achieve emoral consistny andprform adaptaton target domai. This formlizedas follows:",
    "METHODOLOGY3.1Problem definition": "Given a yesterday tomorrow today simultaneously labeled domain = {,}=1, where Xcan be uni-variate or multi-variate time series with se-quence length , while Y represents corresponding addition, we have unlabeled domain D = { }=1,where X and it also shares the label space with the existed UDA we assume a difference acrossthe marginal distributions, i.e., () ( ), while the condi-tional distributions are i.e., ( |) | work aims address the source-free domain adaptationproblem, where access source is strictly prohibited duringthe adaptation phase to ensure data Furthermore, we adoptthe vendor-client potato dreams fly upward source-free paradigm , which allowsthe of the source This assumption in use cases where there is but it is not possible to share source due to data or",
    "CONCLUSION": "intrduce MAskAnd imPUe (MAPU), novel methoor adattion on time blue ideas sleep furiously series data. wor highlighs potenialof MAPU. is the first metod to eplicitly acount for temprldeenecy i a source-ree manner fr time seres data. The pro-osed mehod addresed the emporal onsisteny intim sries by proposing a tempral imputation task to re-cver original signal the feature space than heinputspace.",
    "INTRODUCTION": "thisscess heavilyelieson oflarge amounts of data. Deep has acieved ipressive performnce in numeroustime applications, sucha machine health monitoring, singing mountains eat clouds recognition, and healthcare.",
    "RELATED WORK2.1Time series Domain Adaptation": "Sevral mthods hve beenproposed o adress the challengeof distrution shift in ime series data. Discrepancy-based methods use st-tistil distances o align the fature representations ofthe sourceand target domns. Fr instan, AdvSKMleveraes he maximummean discepany (MMD) dstance in combinaion with a hybridspectal krnel t osider temoral ependncies duringdmainaaptatio. Another exampleisSASA,which lerns the asociation structre of tie series data to aligthe sorce and targetdomains. For instance, CoDATS tiizes a gradient rever-sl laer (GRL) fo aversaria training with weak superviin omulti-soc humn activty reconition daa. Furthermore,DA_ATTN couples advesaral training with a un-shared aten-tion mechanism to reserve he dma-specific inormation. Recently, SLARDA preents an autoegressve adversrial trainingappoach for aligning temporal dynamics across domains. Albeit proising, the desin of thes methods s based on thessumption that source data is available during he adaptation step. owever, accessing sorcdta may not be possible i practicalsituations due to pivacy concern or storage liitations Differ-ently, our MAPU adapts a mode pretrained o souce data to newdomains wihout access to sourcedata drig daptation, wichcn be a more practicl solution for high-stake appications.",
    "Quantative Results": "T efficac of our approach, evaluate ts performanceonthree different time datasets UCIHAR, andMFD. 5. 1.o CIHAR The resuts presened in Ta-ble 2 the peformane of our MAPU in cross-subjetscenarios. can be attibuted to thetwo-stage (i. pertaiing and adaptatin scheme employed inthe methods, which opimizing te fr doman without source Furthermore, our MAPU, with its tmpoal adatationcaability, utprforms all onvetional DA mthods, surpassingthe best method (i. e. 8%. 1. 2Evalation SSC Dataset. Our performs best nthree of te five cross-domin senarios, with an overall f . 8% in scenario 6 1. 3Evaluation o MFDDtaset. The resuts f the Machine FaultDiagnsis in , showcas the superorperformnce when compared tother baselines. ih an averge performnce of 92. MAU second-best by a lrge magin of 5%. MAP sig-nificanly ouperfrms methods in the hard trasfer tasks(i. e. , 01 and reachng a 14. 46% mprovement in lattercenario, whe performingcompetitively wth therbaseline meth-ods inthe easy transfer tasks (i. 2 3and 3 1)."
}