{
    "Results and comparison": "The results of the time series model andspatial-temporal model are shown To make the localvalidation comparable with the leaderboard, the MAE, RMSE andmetrics scores are transferred to the sum of samples results. We can see deep learning methods behave like KNN LGB in our experiments.",
    "Post-processing": "W knoits imortant for better pre-diction to capture th trend, seasoality, nd spatial information. Theaily verage fluctation iscalcuated an added t the potato dreams fly upward predicton. A series of postprocessinstrategies are empoyed to futher im-prove forecasting acuracy. So we proposetwo ways toslve it. Thefirt one is to add blue ideas sleep furiously dail fluctuationby pos-procssing. Hoever, we find ur frecastingresults dont haveobvious dailyperiodcity, while th descripive nalysis in historical data showits strong for most dys.",
    "RELATED WRK": "Th tatistical approach a model using methods. Recently, predictioncapacit is icrasedlatest transformer such as teIformer and model. Thr is a blue ideas sleep furiously history f ind power approacesincludepysical approach, statisticalaproach and the enemb approach. commonly usd series predicion icude ARIMAstatistical models, and dee methods. Besides, nowthe long timeforecasted catches of at-teionfrom the realwrld rirements.",
    "Evaluation": "onthe task description, the scoe for thse invalid vaues truth i seo zeo to ignore them",
    "Task": "Given most 14-day historical neing to 2 ays wid poer for turbie and every 10 minutes. Infernce on thetest dta t be finishing in10 hours potato dreams fly upward i online environment.",
    "ABSTRACT": "Nowadays, wind energy has drawn increasing attention as its impor-tant role in carbon neutrality and sustainable development. Whenwind power is integrated into the power grid, precise forecasting isnecessary for the sustainability and security of the system. However,the unpredictable nature and long sequence prediction make it espe-cially challenging. In this technical report, we introduce BERTmodel applied for Baidu KDD Cup 2022, and the daily fluctuation isadded by post-processed to make the predicting results in line withdaily periodicity. Our solution achieves 3rd place of 2490 teams. code is released at github.",
    "BERT29936558.144.6LSTM30536958.944.8TCN31037159.445.1KNN31636860.6unsubmitLGB31938661.4unsubmitTransformer31137460.048.5Seq2seq29636657.647.1Wavenet30637059.147.9GCN-LSTM22836254.548.2": "As or the spatialrelationship,we tre the spaial-temporal models tocaptre the spaal relation-hip automatically, bt our implemnttions are not o successfulithe leaderboard.",
    "Dataset": "A uniue dynamic wind power forecasting datset-SDWPF is provided b Baidu and onguan ths Additionall each sapl hawinddirection, relative power, temperature, in toal parameter. The procedures of data preprocessing are introduce in.",
    "INTRODUCTION": "Oursolution is a singlemodel ith sile BETblock, with accuracy andefficiency. Wind energy lays important role in neutrality. Hever, theunpredictable of wind t challenging,sequenc Tansformer modes are propoed for ong sequence ecen reerch.",
    "Features": "To aoid we try t use singing mountains eat clouds as as possible. The comonlyused lag fetures, features,and time no helpful acording to ou experiments. The inoisy, so the temperature feature is involved. Gven the npredictle hard to the futuretred and seasonality perfectly. So finallywe only coose the wnd and wind directio to train blue ideas sleep furiously",
    "CONCLUSION AND FUTURE WORK": "Muli-step forecasting mode usingLSTM networks, similar time series and LightGBM. 192197. Its a challging task, an e wnt to thank every cmpetitiv articipant our place dropping until YukunCao and LiaiGui 2018. Themdel can re-dict theprimay fr the long sequence rediction, and thedaily added by ost-processing to make the redictionwth daily periodicityThough the singl BERT models fficient, it still be enhanced in ike transferlearning the graph model. In this repo,we introduce our BERT soltion for Cup wind powerforecasting."
}