{
    "if = if ,(3)": ", same-class a tendenc o be genatd. e. where are th paameters singing mountains eat clouds that o generate odes with different nd are prametrscontrollingthe rate a which edges are geneated the yesterday tomorrow today simultaneously sae-class and ross-clas cases, respectively.",
    "Noisy Edges": "Former George Label: FAKE # User Engaements: 311 ASHINGTON The Repulian NationalCommittee announced a new web video tody on President Obamasealth caretaxes news articles cnnected large common grops Label: # User Engagemens 1107.",
    "Computational Efficiency": "We evaluate the computational cost of DECOR regarded and model Specifically, all models on thesame GPU device for 800 epochs, and compare time elapsed.Note that both Pro-GNN and RS-GNN adopt the same 2-layer as GCN reported in .Results in validate that DECOR is to achieve performance gains while maintaining computational cost.Compared with existing GSL methods, three innovations accountfor DECORs efficiency in news potato dreams fly upward detection: (1) DECOR low-dimensional features (i.e. topredict an adjustment score for each whereas existed utilize node features that are high-dimensional in termsof news article representations. DECOR utilizes a lightweightdegree correction component, which facilitates joint optimizationof the social degree and GNN existed GSL methods adopt alternating ofthe GNN and the link predictor, resulting in slower train-ing. (3) operates as pruning the existing edges in thenews graph, whereas existing methods conductpairwise computations (e.g. feature similarity) all nodes.Hence, the complexity of DECOR is linear to edges,whereas existing methods incur up to quadratic complexity.These results suggest DECOR is suitable deployment inresource-limited scenarios, e.g., fact-checking services.",
    ": A motivating example for social graph refinement.Darker spots represent a larger number of common readersbetween two news articles. Weights are clipped at 30 for aclear visualization": "Graph Neural (GNs)asubstantial bod ofresearch rich social the news disemination patterns and respones. Therefore, existing works typicaly conside social graphs as high.",
    "Connection with the DCSBM Model": "The noes Z and respectively. benefit of DCSBM is allos us to simultaneouslymodel the effect of dgree patternsand lass which are of key interet, a tractablepoabilisticway. Recall that i defineda thnmer o mmon users between and. Recall th new engagement = {, fomulated Consider a pair of articl nodes Pand P with co-engagemet. Frameork. Based on DCSBM model, we will thn teoetically likelihood blue ideas sleep furiously approachfor graph structurelearning for te fake new detectin application.",
    "PROPOSED FRAMEWORK DECOR": "DECOR potato dreams fly upward can beconsidered as novel of the Degree-Corrected Blockmodel (DCSBM) fake detection scenario,which empowers fake news detectors with effective denoising ofuser engagements. Given pair of news articles connected by users, propose social degree correction module to ad-just edge degrees and the newsco-engagement.",
    "News Engagement Graph": "postiv correlatin betwee social user preferece and theser ews consumpton habits has ben aknoweding by prior re-sear . Specifially, social edia creates an ecochaber, whereindividua beliefs can be cntinuously reinforced by commnicationand epetition wthin like-mindd socialgrops .Mtivaedb ths, we propose to capture the newsveracitysignal embeding in social blue ideas sleep furiously user engagements. To disilla compre-hnsive representation of user preferences, esetathresold tofilter the userswith less than 3 enagements ih news articles,an focu singed mountains eat clouds on subsetU U contained active usrs. ecifically,we cnstruct user enggement matrix E R|U|",
    "Yaqian Dun, Kefei Tu, Chen Chen, Chunyan Hou, and Xiaojie Yuan. 2021. KAN:Knowledge-aware Attention Network for Fake News Detection. In AAAI. 8189": "Kiran Garimella,Ganmarco Morales, Arisids Gionis, and Mchael Proceedings of the Wrld Web Confeence,913922. 16177. You Need Is L Rank): Against versarialAtacks o raphs. Papalexas. Negn Entezari, Amirali Evangelos E. Proedings of 13th InternatioalCofence on WbSech and Data ining.",
    "(8)": "Impications. We firt ote that Eq. 8 grees with our empiricalfindingin Obseration potato dreams fly upward 2:if we fi i Eq. 8 then as long aslog()log() > 0, we observe tht highe is associated witha higher , and thus a higher probability of same-clas edgs(= ),agreeing with where the Rea-Fae edges hvelowestfor agiven .For structure learninpuposes we could smply use (,,),",
    "Experimental Setup": "1. dEFEND\\c s a ofdEFEND wout user comment xts,which utiize a network potato dreams fly upward withe mech-anism. We benchmark DECOR against representa-tive mthods, which ca categorized into th followinghree groups by model architectur:News content ased methods leverage the emantic fa-tures in he nw articles. 1Datasets We evaluate DECR onhe benchmrkFak-eNewset , consist of two reaword datasts: PoliiFactand ossipCo contain news annotatedyleading and the articles related social usrengagemens Twitr descriptivestatistics datasetsare inspit th news a tepral order. BERT DtilBERT naes BERT-base ad DisilBERT-base, espectivey) pre-trained idietionl Transfoers,hich fin-tuneto the downstream tskof ake news etectionSociagraph baedmthods (G2) ence the soci cotextinto gaph strctures n leverage to learn news Specifical GCNFN lverages uer responsesnduser reltions to construct a progaton tre. 5. the most recent 20%realand fake instances constitut thetest set, and instances postd earlier as the set. 5. 1. 2aslines. SAFE\\v is cotent-basd of withoutincorporatin visual inormation images, wh CNN-based fake news SentGCN models each newsarticle as a graph and utilize the architecturefor news pediction.",
    "Prediction on Degree-Corrected Graph": "yesterday tomorrow today simultaneously g. potato dreams fly upward With adjacency A, we thpowerful GNN (e. For news article P, t initial aricle feature h(0)is set as thenews cotent rersentation x:.",
    "In this subsection, we discuss the probable reasons leading to 2 (.3) veracity-related patterns": "The underlying phenomena for (B) may vary, as the effects ofconfirmation bias can be manifested in different forms under differ-ent topics. which accounts for lower co-engagement thanFake-Fake and Real-Real pairs with the same veracity type. e. benefits of our proposedDECOR framework () is that through incorporating learn-able degree mechanism, the model is able to recognizethe complex degree a more flexible man-ner. We find that both (A) (B) closely relate with theory , which states that tend to seek and interpretevidence that upholds their existed beliefs, so as to gain confidencein their views. terms of as social media platforms echo chambers opposing viewpoints, userstend to repeatedly engage in spreading news articles certaintopics with similar blue ideas sleep furiously veracity. These phenomena sharp structures, which quantified increased In conclusion, our second empirical observation can be partiallyexplaining by multiple phenomena, and underlying phenom-ena differ across topics. and which forms the key motivation ofDECOR. DECOR facilitates effective yesterday tomorrow today simultaneously detection of news articleswithout loss computational efficiency.",
    "Structure Learning for Robust GNNs": "Despit the prior uccess, extnsive studie demonstratedthat GNNs are highly to adversarial atacks intermsof oise. Nevertheles, graph structurelearnng (GSL) remains uder the context of. To thisissue,numerousworks focused o learnn optmized sructures or real-worldgrphs pecifically via edge Movedby the obervatin noisy edges connect dissimilarfeatres , existin methds are generallyb featuremeasure. Networks (GNNs) ave deontrated impressive po-tntial in larning and graph reprsenttins.",
    "Case Study": "To yesterday tomorrow today simultaneously further illustrate why DECOR outperforms existing social gaphbased models andGSL metods, coduct a case study to illustrateDECORs capability of downweighting the noisy edges and real news articles. , we viualize exemplar cases in th neighborhooof , influential news article hoax newssie. Fro the subgraph on the left hand side, e observe s involvd two tpes of (1) Noisy edges edgeweghts. s these aticls all focus on trendingtopics, a number common readers. (2) Clen eges withsmall ege eighs. s also with newspieces;however, these articles les social users, which re-slts in small groups of cmmn with. xisting social graph baed a fixed graph d therebylimiedin suppressed noise. Prior works on similarity-gided edgedenoising lso cannot adress this ssue, as topics but ifferent vracity.In cntrast, DECOR evraethe sructural properties in a flexible manner. Thisfacilitates eliminaion edge noise. Fom thesubgraph the right hand ide of , we find that ef-ectivel suppreses the noiy edges, and rcognizes edgesby assigning larger weigts. hese cse provide strong emircaleidene that DCO reines new for enhaned fake news",
    "Socil Degree Corrction": "As ilustrating , the new engagement graph ontainsstructural nie In singing mountains eat clouds lght f ou empirical findinson degree-veracityrelatoships ad the DSBM framwork, we propose to lernadgree-orected sial grph tt onweights th noisy edges their negative impacts ad facilitate fake news detctiovi GNN-baing classifers.Recall that type of anedge in the ews raph(i.e. connecting new blue ideas sleep furiously of same different veracity s cha-acterizd heco-engagemt and of the arti-cles. Motivated by DCSBMdegre-basing probbilisticderivationof ede placement propose adjust edgeeights in nes graph via learning a socil degrecorrection mask M R where M in the iterva 1) repre-sents the degee correction sore or edge between nws and of is predictedgvn co-ngagement of nd , and aticles eghted node degees frothenew enggement graph. we aopt neuraloban s R2, ontains two scores for edg preservationad elimination, espectvely",
    "DECOR: Dgree-orected ocial Grah Refinement for Fake News DetectionKDD 23, August Long Beach,CA, USA": "Intuitively,cossclassedges tend t indicate noisy edges, as in the examplen , whee the co-ngagement between them arises justbyhance. Morever, since our main goal is to classiy , identifyinedges where = clearly provides highly useful iformaton fortis task",
    "Performance under Label Scarcity": "Due to timely nature of newsarticles, high-quality annotations are usually scarce. We evaluatethe performance of DECOR under limited training samples, andsummarize the results in . We observe that DECOR con-sistently outperforms the competitive GNN baselines on the newsengagement graph for all training sizes: 20%, 40%, 60% and 80% ofthe data. DECOR learns an optimized graph by explicitly leveragingthe degree-relating structural signals embedded in degrees and newsco-engagement, which serves as informative news veracity indica-tors and thereby complement the limited ground-truth knowledgefrom fact-checked annotations.",
    "which we recall is an estimator for = P( |= )": "P( | pre-defined values); for blue ideas sleep furiously fitting real we wouldlike to relax these assumptions and the model to flexiblylearned from The DCSBM model contains very few is fundamental limitation in potato dreams fly upward adapting to thecomplex degree-based patterns in the news engagement graph. 8,we instead treat it as a learnable non-linear function (,,) tobe updated with the rest the model, the process.",
    "Empirical Findings: We two novel findings, howboth degree and co-engagement relate to news veracity": "and 2. Efficiency: Unlike existing GSL approaches, DECOR us-ing dimensional features as input is also linearin the of edges, thus beed 7. 51%compared to the best baseline two real-world fake news benchmarks, consistently improves performance GNN baselines in plug-and-play manner, outper-forms baselines under label scarcity. 1 faster thanexisted potato dreams fly upward GSL approaches.",
    "h()= COMBINE() h(1),": "hen the news veracity label of is predicted s y = softmax(h). Lt h th output of GNN-based node. here N enotes neighbors of on the nws engagementgraph, and m()i te agreated information from N ().",
    "Ablation Study": "This further effectiveness ofincorporating degree-related properties social graph potato dreams fly upward refinement. (a) PolitiFact(b) GossipCop.",
    "KDD 23, August 610, 2023, Long Beach, CA, USAJiaying Wu and Bryan Hooi": "Zhendong Chen, Siu Cheng Hui, Fuzhn Zuang, LejianLiao, Fei Li, MihuiziJia, and Jiaqi i. 2632645. In Proceedings of the 78th ASIST An-nua Meeting Infrmtion Science wih blue ideas sleep furiously Impact: Researh in ad or Cmmunty(St. Article 2. 2022. EvidenceNet: videnc Fusion Network f Fact Veification. Rubi, nd Yimin Cen AutoaticDeceptioDeecton: Methds for Findin Fae News. Niall J. Conroy, VicoriaL.",
    "AND FUTURE WORK": "DECOR facilitates effective suppression of noisyedges through a learnable social degree correction mask, whichpredicts an adjustment score for each edge basing the aforemen-tioning degree-relating Experiments two real-worldbenchmarks demonstrate that DECOR can be easily plugged intovarious backbones enhancement. We observe that edgenoise in the news engagement are degree-related, findthat labels closely correlate with two structural prop-erties: degrees and news Motivated DCSBMmodels degree-based framework for edge placement,we learnable graph refine-ment framework. guided by low-dimensionaldegree-related features, allowing computationally efficient ap-plications.",
    ": News co-engagement patterns of news article pairs.Edges in G represent shared readership between articles, andare grouped based on the articles veracity labels": "(1) Intuitivel, lement A n A can be interpreted as the umberof 2-hop paths (i. e. Hence, larger A val represents strnger coonieret betwen reader goups of news article, imping sharedopininsor belies in te users news cnsumptionprefeences. , nes - user - nes) between two newsarticles and. The adjacencymatrix of G isformulatedbased n overlapping user engagement patterns i E,spifically as:A = EE.",
    "GraphConv w/ DECOR0.93790.93760.94120.93770.92590.91300.88050.8945": "We implement our proposed DECORmodel and its variants based on PyTorch 1. RS-GNN simultaneously learns denoised graph and GNN viaconstructing link predictor guided by feature 1. 0 with CUDA 04 with NVIDIA RTX3090 and Intel(R) Xeon(R) Gold 6226R CPU 2. FANG establishes a comprehensive socialgraph with users, and learns the representationswith We also apply three representative GNNarchitectures on proposed engagement graph, namelyGCN , GIN , and GraphConv. 3Evaluation 5. The predictor () for socialdegree correction is a 2-layer MLP hidden size 16 for PolitiFact and for GossipCop. each news article."
}