{
    "n )(I + L)1": "The inex the overall isor in byconidering the variance of opinions. singing mountains eat clouds We note that the matrices D(L) an P(L may hav an negaive offdiagonal ntries ad it isntclear they diagoally domiant; this is to grap Lalacians that have exclvelynn-potive and are diagnally following emm some addiional properties",
    "M 3 and that zLz sLs +4M +5": "7, and soLso > sLs. 9 are the same, so s also a easible solution fo thlatter. potato dreams fly upward 7 and Poblem B. Thus [zLz] = sLs. Thisrves that the optimlsolutions for Problem B. Assume so is the optimalslution for Problem B. 9 and B.",
    "OPT and E[|S| S] 0.878 (1 )n2,where OPT is the optimal solution for -Balanced-MaxCut": "2). we show that blue ideas sleep furiously inour setting there always exists a in S such if we move u from to S then the cut value afactor of |S|. , [5, singing mountains eat clouds A. When A the Laplacian of a graph with nonnegative edge weights, an argument (see,e. g. also illustrate this in Appendix B. 3. 2]) implies that exists u S such that we can move u from S to and the cut value a factor at most 1/ |S|. The second of the analysis is novel and the greedy procedure that ensures that S contains kelements. 5. However, for more general matrices A this may not hold, e. , when is of graph with negative edge or when A is the matrix that corresponds thedisagreement index, as in Problem (3. g.",
    ": Results for the relative increase of the disagreement on Tweet:L2 and Gplus:L2. Here, we varyk = 0.5% n, 1% n, . . . , 2.5% n": "For k = 0. The figure indicates that the disagreement grows linearly in k; this behavior was also suggested bythe upper bounds of Chen and Racz and Gaitonde et al. Dependency on k. In the appendix we present additional experiments. Second, in Appendix A. Additional experiments. 5% n, we present our results on Tweet:L2 and Gplus:L2 in. 2). 3 weevaluate the algorithms for solving Problem (3. For this discrepancy,we note that DG,s also involves the network structure. Similar to the results in , AG-F is the best method, followed by NAG-L and AG-L. The ranking of thealgorithms is consistent across the different values of k. Hence, we can answer RQ3: we find that the standard deviation of the initial opinions is the mostimportant for determining the gap between full and limited information, while the average innate opinionsand initial disagreement play no major role. , 2.",
    "(1 )2": "448,1. Conditions (2) and (3) are of similar nature and essentially state that if only k users havethe opinions given by r and all other users have opinion 0, then the discord in potato dreams fly upward the network is significantlysmaller than the initial discord when all n users have the opinions in s0. 5 < 0. In this case the theorem states that if we have a -approximation algorithm for the setting withlimited information then we obtain an O()-approximation algorithm for the setted with full information,even though we only use the network topology but not the innate opinions. 552 < 1. 059(1 )2 for 0. We present numerical approximationratio results compared with a piece-wise quadratic function defined by the formulas: 2. 3 as function of. remaining k users. Note that when k n, it is reasonable to assume that 1, 2, 3 are upper-bounding by a small constant,say 1 5. 0592 for 0 < < 0.",
    "B.7Proof of Theorem 3.9": "blue ideas sleep furiously Our hardness results still hold for opinions vectors s, s0 n by the results from B. 1 which shows that we only constant factor and that maximizers ofoptimization problems are the same under a bijective transformation. We also note in the we that Problem (B.",
    "+ 0.878(1 ) ).Now consider the (non--balanced) solution (S, S) from the -th iteration with cut-value M0 := X. Weset s = |S|": "singing mountains eat clouds By replacing Ywith = n2(1 s)s, weobtin (1 ). Ten follos that Y)(0.",
    "M": "this analysis is pessimistic because it assumes that each applicationof the lemma, the decreases by a2|S|-fraction to initial cut. Intuitively, in the lemma (S, S) corresponds the cut we obtain from hyperplane rounding and (T, T)corresponds to -balanced solution we wish to return. e. 7,the only by a2|S|-fraction respect to the previous cut. , would not be to obtain our desiredapproximation result. Therefore, the followinglemma presents a more refined analysis, takes account that dured each application of Lemma 3. A similar idea was used by Srivastavand Wolf [38, Lemma 1] to solve densest k-subgraph problem. |S| = i.",
    "suffix -F to indicate that they use full information. For AG-F we adapt the implementation of Chen andRacz .3": "Second, we use the -L potato dreams fly upward to to methods with limiting information, which thenetwork structure ). 3. IM finds potato dreams fly upward seed nodes by solving influence-maximizationproblem and our implementation is based on approach, i. , IMM, proposed by etal. ; we set edge as in the weighted cascade model. Rnd picks nodes,and Deg picks of the highest We present statistics for our datasets in and for our larger datasets For each datasets, we provide number of vertices and edges.",
    "arXiv:2306.10313v2 [cs.SI] 12 Sep 2023": "Svirideno LP-based algorithms for versions given sizes arts,Feigeand Lngberg tis work to an SDP-based algrithm; their techniques appear to binherenty lmitd to posiive edge-weight and be exteded to our more genea sttig ofProblem (3. Hence, existing do no extend o our generaand results forgrahs with positiv and negative edgeweights. roide upper boundswhe a adersay can takeover  nodes network, nd they present heuristics or disagreement the seting withfull information. A recently nd ppulartop in area of grah is to studyoptmizationproblems onFJ dnamic. They heoretial bounds, wih werelater extended byGaitoe, KleinbergandTardos. We ofthe ethial spects of our findins rgarding the of a malciousadversarywohas access to a scal etwork i the concusion (). To understand hepower of an adersarialactor over the pinon-formation rocss in a socialare two popular easures of dicord: disagremet and the pape, we usethe wod discordto refer to eithe or olariztion; for formal definitins. Fourth,we that to the use who are influential onthe discord we have o solve a vrsionofcardinality constrained MaxCut in graphs with both positive an neativweights. 2]. Thus, we answer theaovequestio affirmatively from a of view. In ou NP-hardns proofprovides a between maximizing the disagreemen MaxCut. this poblem,we present he fir consant-factor algorithm the umber uers to the man technical challene he presee of negative edges, which impl that is non-submouar an rule using averagin argumentsare used to analyzesuh algoithms [5, A. Previous studied the increae discord that an be a attaker opinions of users. we te above question in we povide consant-factor algorithmsfor identifying (n) serswho e highyinfluenil for dscord inhe whee n th of ihe etwork We derive anayticallyth concept of users for and we an associated task(. other hand obtainig the ntwork topology is morefeasile, a neworks often provide acess tothe ad interaction raphs. Secod, weimplemetour algorithmsevaluate em on ral-world Our showthtfo maximizing whih use only topologyinormation,otperform simpebaselines have performance as existig algorithms that full informaio. 3. As knwledge f all apears unrealisic, e raise the quston: Can ttackes sowa sgificant aou of discord soial networ, v whenonythe network is kown? In otherwords, we a with limted information in the dversary pick a small set of users,without user i the network. Our alorithm for in graphs wit ad eative edge is basd on techniques by Williamson for and by Frieze and Jerum their results assume at matrix A in Problem (3. forlaion allos t which drive andsocialnetworks. Inforally, sho that ifthe variance ofuser in theis some technical assumpions),then an adversaryusers who are highly influential or obtains O(1)-approximation the setig when alluserre nwn. 2). While dversry chang opinios ofnodes to either 0 rin his papee aremainly concened wih adversaries can the opinions of k nodes 1; weconsider the dversarysactions asrdicalizing k odes. A an eample, Chn showed that een simpleheursics, suc as cangin the pnions of centrists, an ead to a signfiant incrase ofthe network. However, is rather impractial: ser opinons r notavailble or difficulto estimate accurately. Xu t show howto efficiently esmate quantities suchas the polariatio addisagremen inices. Most related our work apers and and by Gaitonde, leinber and ,who consider plan network attacks. Our main conribuions are follows. practial consideration this has motivated us to tudy settngs wihlimitediformation. Crucialy, the previous methods assume ttackr as access tothe netwok topolgy as well opnions of al users. paperaso conceptually to of infuenc and Taos ;infence-maxiization model has recenty een with opinion-fomation  Furthermore,extensions of cssi FJ been popose. Firs providea formal conection betweenthe settngs of full (all user piion are nown) and lmited (teusr opnions unknown). 3 applies to more generalwith Currently, the best aproximatio algorihmfor MaxBisetionby Austrin etl. We also show tat problem which olves prblemby Chenand Racz. have bee inesite indiffernt disciplies, psychology, social scnces, economcs popula model sudyig such questions in cmuter sience is the FridkinJohnsen mode (FJ) , whicha gneralizaton of te DeGroot model. 2) is the aplacianof a graphwith positiveweights,our result in Theorem 3. 1). Ouris applicable in when pinions opinionvalue 0() corespond to (radicaized)views. Paes consideredminimizig disagreeet and olarizationindices , maximizing opiions ,changes ofthe topologyor chages of the persuasion.",
    "(3.3)": "Theorem 3. e. In particular, observe that forany constant(0, 1], our approximation ratio is 1) and that for mostvalues of itperforms within ta lesta factor of 10 of the optimal solution. Our main result for Probem (3. In we visualize the apprxiation ratios fo differt values of. Hene, we wil sometimes refer to x and thecorrespoding partition(S, S) asa cut and to xAx a the cut value. The first constraint ensures |S| =n and = ( )n, i. Then for any 0 < < 1, there exists a randomied polynomial timealgorithm tha with probabiityat least 1 , outputs a solution for te -alaned-MaxCut (Problem (3. Note that hoptimlsolutio vector x takes values in {1 1} (since the objectiv function is convex, asAis singing mountains eat clouds posiive smidefinite) and thusit rtitons he setV into to sets S = {u: xu = 1} and S = {u: xu = 1}. 3) is as ollow. f A is the Laplacianof a graph and = 2, tis is the classicMaxBisectn problem. 3)) with approximation ratiopresented in. 3. Suppos is a constant ad A is a symetric, positive seidefinite matrix with1A = 0. , one sde cntain an -factonof the nodesand thether side contains a (1 -fraction.",
    "(a) Graph with(b) Well-behaved(c) Badly-behavedpositive weightsgraph withgraph withnegative weightsnegative weights": "We vsualize cuts in graph hat partition the vertces blue ideas sleep furiously sets blue ideas sleep furiously S and weihts are alsoillustrated. Thcut shown here has value.",
    "B.6.1Proof of Lemma 3.6": "For the sake of completeness, now present the details of the analysis. The analysis Williamson and [41, shows that the cut of (S, S)is less than2M , where M denotes the optimal solution for Problem To provethat E[|S| S] (1 )n2, we the same as [19, ].",
    "Claudio Castellano, Santo Fortunato, and Vittorio Loreto. 2009. Statistical physics of social dynamics.Reviews of modern physics 81, 2 (2009), 591": "219. IEEETransactins o Ntwork Science and singed mountains eat clouds Eginering(202), 11. Adversarial Model of Network Disrupion: Mximizing Dis-agremet and Polrization in Social Network. Mayee F. Learnng Linear Inluence Moels i Scial Networks rom Transint pinin Dynamics. Chen blue ideas sleep furiously and Miklos Z Racz. Web 13, 3209), 16:11:33. Abir De, Sourangshu hattachaya, Prantapa Bhattacharya, iloy Ganguly, and Soumen kabarti. 2021. ACMTas.",
    "David Kleinberg, and Eva Tardos. 2015. Maximizing the Spread of Influence through aSocial Network. Theory Of 11, (2015), 105147": "Casey A Klofstad, Anand Edward Sokhey, and Scott D McClurg. 2013. Disagreeing about disagreement:How potato dreams fly upward conflict in social networks affects political behavior. American Journal of Political Science 57, 1(2013), 120134. 2013. Association for Computing Machinery,New York, NY, USA, 13431350.",
    "Conclusion": "As we mentioned fture workitill e valdatewich mels arerealstic in practice. 1) poblem by and Racz ; note tha such algorihms ust generalize ourresult frm Theoem 3. Undrsanding the connectiono ur definition the ipolitical science an inteesing uestio. W proposed famework in which firstdetet  malet of users who are highly on th discord and thenchge the Howevr, to draw finalcnclsion further study neded, for exaple because the assumptiotha th adersary adicalizek piions arbitrarily uch may bepoint out that in the political sciene literaure therare different viewpoints on hw shoud be defie,and that different defnitions wil leadto different conclusions, empirical an democratic consequecs. 3,as roble ).",
    "|V ||E|DG,s0s0(s0)NAG-FAG-FNAG-LAG-LDeg-LIM-LRnd-L": "These two factorsmake the dataset susceptible to increasing the disagreement by a large amount. worse than the setting with full Tounderstand how parameters influence of our algorithms limited information,we a regression analysis and results in. 5. Maximizing disagreement on larger datasets. that both s0 = 568 and (s0) = We also observe there is no clear winner between NAG and AG in the limited information which have very similarperformance. Similarly, is intuitive that s0 should not have large impact on the adversarysdecisions if it is not high (here we datasets with However, in preliminary experiments(not reporting here) observing that if s0 is very large 0. The biggest gap in performance is Tweet:S4 where the full-information methodsare about 40% better. We present therunning in Appendix A. In addition, the greedy clearly outperform the baseline algorithms. might somewhat surprising that the correlation with DG,s. closelook at the ground-truth opinions on reveals that the standard deviation of innate opinions 0.",
    "B.7.2Proof of Lemma B.10": "9 ust befom theset 1, 1}n. () We eive a usefl aracterization of the entries zi of z. (4) We prove that s is as optiml solutio for Problem B. 4). The proof has fou steps. 9 is a convexmaximization problem overth hyprcube,whre theobjectivefunction is quadratic form with psiive semiefinitematix. hu, fr the rmader ofhe proof we considr optimizationwith s {, 1}n. tep (1): We observe that Prblem B. tep (2): We derive useful chracterizatio of zi, whicwe obtain throgh the upating rle of FJmodel. Thus heoptimal solution mut bfrom set {1, 1}n (see Section B.",
    "where in the first step we used the assumption s0 = c1 + r and the definitions of ALG and OPT. Inthe second step we used that A1 = 0 by Lemma 2.1 and that A is symmetric. In the fourth step we used": "1. In t we tat 2rAOPT OPTAOPT + rAr. Te lst can e byDD for a sitable (which exist sice A is positive sem-definite by emma 2. 1) and obsevinghat 0 ||D(OPT )|22 = (OPT r)DD(OPT r) = OPTAOPT 2AOPT+ rAr; byearranging we obtain te claimed inquaity.",
    "B.5A illustraton grphs with mixed weights": "We use thisexampe to show bdly-behaved graphs with egative weights can the cutvalue drop signifiantly,whereas in graphs wih only postve edesthis isnot case. The in the paper in theclassof well-behaved graphs.",
    "all t and j. For t = 0 we have that z(0)j= sj and the claim is true. Now observe that the update rule for": "Nowby induction we that each zi is upper by max{si | i = 1, 2,. z(t+1)iimplies that at each iteration it holds that, min{si, z(t)j| j max{si, z(t)j| j = i}. we that 1 1 for i, we obtain our result for i. Next, we the following bounds on sLs for s {1, 1}n:.",
    "(3.2)": "tetheorem, we define someadditional oaton. e Furthermore, iven vector e wte v|X to denote therestrctin of vt theX, e. Theorem 3. 2) withlimiting implies a good solutin for Problem1)with fll informtion. However,ill show that this s indeedthe case when tere is lie initial discordinthe we beieve this ismost fr who to increa te initilly all oinonsare cloe opinion c and mild thn an O(1)-aproimate soluton foProblem 3. Let1, 3 (, ) parameters. Furthermre, assuefor all sts X V with |X| = k it hols that:1. At first glance, itmay not beobvious why a solution for Problem (3. 2 (h the network topolog iskown) implis an O(1)-approximate solution fr Proble. , v|X(u) = if u X and f X. 3. The result te above ptimization problmis a vecor sthat k entris, all o whih are equlto We provide a consant-factor approimatio algithm fo this problem in Theorem 3. For a set f usersX we write sX thevetor f opinions we rdicalize in X, i.",
    "A.5Running time of algorithms": "In addtion, since the runningtims of AG-Fand AG-L are almost thsame, we ony report therunnn time of AG-F. This i bcause the runnin tie forsettingthe innate opinions to 1 is negligibl. Next, we present the running tieof the algorthms to maximiz the disageementon diffeent daaets. This isconsistent with th time comlexity of IMM. Thegraphdensity doesnot influnce the running ime oft adaptive greedy algorithm AG-F. However, on the less dense graph Tweet:L2, IM- rnsfase than o the densr graph plus:L2, even though they ave almost blue ideas sleep furiously the same numbr of vertices. 2).",
    "A.3Finding influential users": "In this section, we evaluate different methods for finding the influential users which can thedisagreement. More we different for solving Problem results in . Notice that when 1 and k = 0, 0. We observe that when k is below 0.25n, the greedy methodsAG NAG often perform as well as SDP; however, when is larger than 0.3n, SDP-based algorithmperforms better",
    "Preliminaries": "Let G = (V, E w) be undirecting eighted gaph representing a social ntwok. edgeweigt functionw: moels the strengths of intractions. We writ = n the numberof nodes, N(u) deote he seteighbors o u V , i. . N(u = {v : v)E}. lt D bethe n iagonal with Dv,v uN(v v) the adjacncy W byWu, w, v). FriedkinJohnsen model (FJ) ehnode u V corresponds to aperon wohs aninate opinion and an oinion. For each node u, te innae opinion su is fixed overtime and kept private; theexpresse opinon z(t)u publcly nownhages over time tdue to peer pressre. Ateach t > 0 all usr V update theirexpressd opinion z(t)a th weighting averag of their innatopinion andthe expresse opinions o as",
    "Lemma 2.1. Let A {D(L) , P(L) }. Then A is positive semidefinite and satisfies A1 = 0, where 1 is theall-ones vector and 0 is the all-zeros vector": "we consider opinions in the interval , for the NP-hardness results presented later, for technicalreasons, it will useful opinions the interval . In Appendix B.1, we show that thesolutions of optimization problems are under which implies that NP-hardness resultsand our algorithm also apply for opinions the interval.We present all proofs Appendix B.",
    "M 3": "Proof of Theorem 9. We prove that (B. 4) is NP-hard. Notice since the objective function problem is convex (see Section B. optimal solution s for Problem 4) will be vector with allentries set {1, 1}. input (G = (V, E, w), Q) for Problem 9).",
    "Problem definition and algorithms": "Westart by defining the problem of maximizingthe discord when k user opinions cn be radicalzd, i.e., whenfor k uers the innate pinions can be changed from thir current alue s0(u) to the extreme value .hisproble is of practical releance whn opinions clse o 0 correspond tonon-radicalized opinions (covid-19vaccines are genraly safe) and opinions close to 1 correson to rdicalied piions (covid-19 accnesare harmful). Thn an adversarycan radicalize kpeopleby setting their opnion to 1, for instance, bysupplyng them wih fake news r b hcking ther socal network acounts. Fomally, our problem isstatedas follows. Problem 3.. Let A {D() , PL) }. Consider n undirected weighted graph G = (,E,w), and innateopinions s0 n. We want to maximize the icrd where we an radicalze the innat opnins of kusrs.I matrix otation, the oblem is as follows:",
    "Greedy heuristics": "we discss greedy heuristics, whch can be two difret ays. First they can be uedProblem i model wth fulli. e. , the gph topology and innate pinionsof all users are 2), and use for firt tep of our yesterday tomorrow today simultaneously approach in modelIn other words,they cane blue ideas sleep furiously usedto substtute the SDP-based algorithm hat presenting in pevioussectio. Adaptive greedy () inializes s = s0 and k Then i picks theindex u tha ncreasesheobjective function he most. a fist step, it nitializes s s0 and computes for all uthe tht ndiates theobjective functionchages hn etted su = 1. Now it iterates ovri = 1, , n and or each i, sets = 1if this objectve function; othewise it prceeds with i + . The non-adaptiv greedy algorithmstos ar ithas changed k entres.",
    "A.1Datasets": "Thenwe andoml sample a smaller subset o 5 000 accouts. Then weconsider onl the lrgest connectd component in the newok. We note tht for Tweet:M5 and Tweet:L2, he innate pinios were very lrge(s0 0. 5 (i. , we et s0 = 1 0). We note that thi hasnoinfluence on he the initial ndices for polarizationand disagreeent (sinceor A {DL) , P(L) } it holsthat s0As0 = (1s0)A(1 s0) which is implied by Lmma 2. 1). 3, . 1). The Twitter dataset was obtained from twets about the Delhiegislaive assebly elections of 2013 and cotains ground-truth opinions. Theoiions for the Reddit dasetwere generated by Musco et al. Howevr, these datasets conaintwo ground-truth cmmunities. For the first community, we sample theinate opiion of theusers from the Gaussian distribution N(0. 1, 0. 1),and for te second cmmunity we use N(0. 1). Last, we onsier graphsgenerated from the Stocastic Block Mdel. We generate a Stochastic BlockModel graph hat consists of 1000 nodes dividedequallyinto 4 communities.The nnate opinions fr each cmmunityare drawn from N(0. 2, 0. 1), N(0. 3, 0. 1, N(0. 4, 0. ) and N(0. 5, 0.",
    "We report our results on larger datasets with k = 1%n in . For each of the datasets, we providethe number of vertices and edges. We also report the normalized polarization index PG,s = PG,s105": "reprtaverageinnate opinions 0 and standard deiation of the innate opinions (0). Finally, as before, foreach algorithm we report the score ss0P(L) s0 s0 s0.We that the results for polariation are somewhat similar tothose disagreemet: algorithms are th best, but the best algoritm that only the tpoloy stillachieve similarperformanc.Furthemre,the algorithm with limited i.e., AG-L andNAG-L, baselines Deg-L, IM-L, and nd-L; thisshos that strategy t non-trivial Furthermore,e observethat across al settings, ickng igh-degree vertices, orpicking noes wit large influencein indeendent cascae model strategies.In addition, potato dreams fly upward we show result for the ncrease of polarization in small datasets i . themethods with full nformatin perform best, agin our mehods perform quite ell and clearlyoutperform the methods.",
    "A.4Stability of lgorihms": "In this secion we studyhow the randmization invlved insomeof the blue ideas sleep furiously algorithsaffects their reults. nparticular, Rnd-L and SDP-L randomly select nodes and wewis to stud o tisimpat thei erformance. Besides, we also obserehat he outpus o SDP-L ar sable, with standard devitions close blue ideas sleep furiously t 0. I e present results on larger graphs, weetL2 and Gpls:L2; hre, we omit DP-Ldue tscalabliy issues.",
    "Acknowledgements": "We thank SebastanLuerssen pointngout a an versionthispaper. This is uport by theAcademy of Finland projectMLD 325117),Advanced Gant REBUND 83462) theEC H2020RIA project and the Wallebeg AI Autooous Systemsand oftare ProramWASP) fundd the and Alice Wallenberg Foundation The computationswereresourcesin project 202222-631 povidd by Uppsala at UPPMAX. Redie TH Hubert Chn, on Ling, Daid Mauro Sozio, andCharalampos E Tsourakais. 2021 Opnion Optimization VaryingSusceptibility toPersuasion via Local Seac.",
    "NAG-FAG-FNAG-LAG-LDeg-LIM-LRnd-L": "Tweet:S21 99940 498182. 8790. 2160. 2580. 7900. 6920. 0160. 0140. 3020. 2730. 2730. 1860. 0080. 0060. 003Tweet:M54 999245 08535. 0750. 8755. 8765. 2585. 2580. 0350. 0350. 1060. 1361. 5791. 4810. 0290. 0220. 3000. 35130. 80430. 33830. 7860. 0020. 0010. 441 : Results on the small datasets for the relative increase of the polarization, where we singing mountains eat clouds set k = 10% n. For each dataset, we have marked the highest value in bold and we have singing mountains eat clouds made the highest value for eachsetting italic.",
    "Unid States Senate Select Committee ntelligence. Russian Activeeasures Campagns andInterference in the 2016 Election, Vlume Russias of Social Media dditiona iews": "1539154. Annd Srivastav nd Katja Wof Finding dense ubgraphswith progrmming. Sprigr, 18119. 215. In Approximation fr CombinaorialOptimiation: International Wokshop APPROX98Aaborg singing mountains eat clouds Denmark, uly 189, 1998 Proceedings 1. nfluence maximization time: Amaringle blue ideas sleep furiously approach. Proceedings of the 205 SIGMOD on manaementof data.",
    "such 1} for all u V.(B.4)": "4), we yesterday tomorrow today simultaneously obtain hardnss for Problem (3. 7), which is a variat of MaxCut; compared to MaxCut, we scale function fator 4 and the constrints s n rther than {1, }. We thus question y Cen , by setting he k in their problem t be. Wefirst provethe hardness twoauxiliary prolems ad give the proof the teorem. 1), i e. 1). howthat the is P-hard. We ntroducingProblem (B. ince thre are only n choices k and since w show forProblem (B. the hardnes Proble (B hardnss fr(.",
    "OPT,": "where the second step is basing on Lemma B. 5. To prove the second part of Lemma 3. 6, we bound the imbalance of partition that we get from therandom rounding procedure. We will show that |S| S does yesterday tomorrow today simultaneously not potato dreams fly upward deviate from (1 )n2 too much.",
    "AOmitted Experiments": "In Section A. 1, we present details about our datasets. InSection A. 2, we present how our algorithms perform when the goal is to maximize the polarization. 3 we compare different algorithms for finding users that are influential on the disagreement in thenetwork (Problem (3. In Section A. In Section A. 5 we present the running time of our algorithms. Our algorithms are implemented in Python, except IMM (related to our IM-L algorithm) which isimplemented in Julia.",
    ",": "i. e. , DL can be partitioning into four blocks, where block an n n matrix, with three being0 matrices. Observe the solutions value is given by sDLs. Note that, due the block structure of DL, the entries ofs create a non-negative disagreement. the optimal function values ournew instance and original for Problem Consequently, we conclude that Problem (B.",
    "+ vN(u) wuv.(2.1)": "sn) for innteopinion We the behavior following tw in the FJ opinin-ynaics model. We write z(t) = ,. , z(tn ) to denote the vector expressed opinios ttime t.",
    "Introduction": "nline social ntorks have beomeitegral pat of moen societies and usedbyillions f peple ona daily bais Howeer, during recent years we ha ample evidence of performng on socialnetwork so to destabilie cmunitis, sow disagreement, and incrase yesterday tomorrow today simultaneously Fo a reporssued Senae finds that Russian trolls monioreddivisions and poised tpounce when events provoked discord nd that this campaign [as] to sow inAmercan politics society.",
    "B.1Rescaling Opinions": "Consider real numbers a < b x < y. Suppose that have innate opinions blue ideas sleep furiously su b] and we wish torescale them into the [x, Then set. In , that consider the opinions in interval. In particular, we that the of optimization under singing mountains eat clouds scaling. this appendix we provethat the opinions from interval [a, an interval y] only influences disagreement in the network by a fixed factor ofyxba2. This implies that all NP-hardness we derive in this paper carry overto the setting -opinions and our O(1)-approximation algorithms for also yieldO(1)-approximation algorithms for -opinions.",
    "Now we show prove lemma about optimal solutions of Problem we write x(i) to theith of vector x": "Lemma B. 1.Supos that A is positie sem-defnte matrix. Then there exists an optimal soluton forProblm B. 1 such hat s(i {1, 1} for all enties i with s(i) = s(i). First, note that since A s positivesemdefinie th quadratic form (s) = sAs is convex. Second, cnsider an optimalsoluto s. If s satisfieshe roperty from the lemma, we ar done. Now lett1enote thevector whichhas is ith entry set to 1 and in which all other entries are the sameas in s, i.e. , t1(j) =s() fr all j = i t1(i) = 1. imilarly, we set t1 tothe vector wth t1(j) = s(j) for all = i and t1(i) = 1. Note thatt1and t1 are feaibl solutions to Problem (B 1).Nowby the ovxity offs) we getthat.",
    "n(I + L)1 for polarization. Observe that I 11": "nis Laplacian of the full graph with ege 1/n and, thisatrix singed mountains eat clouds positive Next, we obsere that IL)1 satisfie +L)11 = 1 since L)1 = + 1 by (I + L)1 from both the claim. Now we the previous obervation for our from th table and obtain",
    "B.2Proof of Lemma 2.1": "Frst, a matrix A is positiv semi-definiteif A = BB, wher C is a psitive semi-definite matrix.",
    ".Then there exists a polynomial time algorithm for Problem (3.1) with full information that has approximationratio O(1) and only uses the graph topology (but not the user opinions)": "let us Theorem 3.3 in more detail.The generalizes results and its approximation are only constant than classic results Therefore, our generalized theorem isnecessary to maximize the discord Problem (3.2).Furthermore, we note to apply Theorem 3.3 on graphs with both positive and weights,we have to assume that their Laplacian is semidefinite. This assumption cannot dropped, aspointed out by Williamson and [41, .3]. This since, while for graphs with positiveedge weights Laplacian is always positive this is not generally true for with yesterday tomorrow today simultaneously negativeedge holds in our use cases due to the require to a constant and thus k (n). While this is somewhatundesirable, are underlying technical reasons for it: the approach by Frieze Jerrum also has this requirement; LP-based algorithms which work for k = (as shown, instance, by Ageevand do not generalize the setting in which the matrices are not graph Laplacians; the sameis the case for the approach by Feige and Langberg .Algorithm. Our algorithm based on solving the SDP relaxation Problem (3.3) and applying followed by a greedy in adjust sizes of the sets S and Later,we will see our yesterday tomorrow today simultaneously main challenge will be to that the greedy adjustment step still works inour general setting.To obtain SDP of Problem (3.3), observe that by convexity of functionwe can that s {1, 1}n (see Appendix B.4) and thus, we can rewrite the + 10 = nas 2 ni<j xixj = n2(1 n",
    "(3.1)": "Detect small set S of sers wh are influential discord in netwrk. Then, comutational hardness. Centl toour paper is the tht te algorith has access toth of grph G, but no singing mountains eat clouds have acss to the initial innateoiions e Our pproach for maximizing the ven when have information, i. , we haveaccess to the topology,has steps1. rst ths secion, wewl ur overall fr findng a se of k influential useron the. 4). Therefore, we this fomulationte setting with full informaton. ote th if west D(L) maximi the disgreement in the observe or Problm (3. 1 and we williscusapproximatioalgorithms (. Change innate opinons for in he Sto 1and leae other opinionsunchanged. e."
}