{
    "RELATED WORK": "are a ew works that ted to locatn informtion inGNs message process in spcial domain (POI relation prediction). GNNs fr Urban Aplications. Howeer, as pointedout by He et ,these damage he network topoogy and tampr withthe oiginal real-world dependencies on he graph. Here we biefly review relate GNNs for urban appica-tins and GNNs with heterophily. branch tens modify GNN achiteture to hndlethe dfference information graphs in tothe Laplacian smoothing of tyical GNNs, such as processingneighbors in diffeent classes sparately explictly aggregat-ing fatures hgherorder neighbors in eac lyer , al-lowig high-frequency information by signd mssages, cmbining outputs o each layer (includingego features) aso empower the with a bility.",
    "NotationDescription": "GThe graphV, The nde set,eg set node of GN( )The neighborhood of node on The represetation of potato dreams fly upward node , The directio and ringN ( )The neighbohood N ( )The distance-awre neighborhood noe epresentation of sector node ,The f ring around node",
    "(a) Direction-aware Parition(b) Distance-awae Spatial Diversity Score(d) onSynthtic": "Analysis of spatial eerophily. (a)-(b) llustrate the space parttion from two vews. (d) pesents heresults f exprimental andworkplace, respectve,are defnitel hterophilic. Suchdiferenceinfomaion on h heterohlic uban graph ay oeled wll by any omoplic GNNs,who tndto gneratsimilar repreentations connected nods. Inthis way, the peformance of tese homophili GN methods onurban grphs may lagely Our furher is that urangraps ave uniqu Spa-ial Heterohily property To be specfic,we find that he eterophilyon theurban grap often a characteristic of spatial diversity. In other diffrnce ordissimilrity) the entralnoe neighbors at distances or drections exhibitsevident discepancy, ditruted uniforly. Aare ofsuch an attendat question is potato dreams fly upward t mesure thespatial heterophily of urban grap. There hav en varioutudis pt invesiga the graph homphilyand het-erophil from ifere incuding nod homohily, egan classBt spaial position linking nods, these etricscannot spatil on rban graphs. herefore, in thiswork, we propoe a namd spatial di-veit core to analyze the spatial heterophily, and itsinuence onthe of exiting GNNmethods on ubangraphs A higher (close to a lare discrepay betweendiffrent spatal roups,higer sptal diverity of heterophiyon the urban Yet, it still an oustaningdeignn pow-eful heterophilic NN models veran urbangrph its is high were there is diversiy dissimilaritydistributions between and it nighbors at differentspatial There are some recent studes o imprve theGN architetures to the gaphhterophily. Most of metods can nly wo on a htrophilic grph whenthere limite diffrence betwen nodes. example GBKGNN ssumes that are twodfferent kind of andAGCN assmes nde fatures have only two differentleves frequencies Note that ths limitation is To blue ideas sleep furiously moeevidnce, we an exerimen on ynthetic uran grphswith levels of spatalcore(etails are in Section 3. As in (d), when the graph resents higher scor, th perforanc hese to stae-o-th-artheterophiic GNNs, BKGNN andFAGCN,s farfrom optimal. ealo apply the propse sptia scoe to analyze three rl-world urba raphs uder diferen targe tasks in our experiments. 9 on the urbn in crime task). iti vauble dvelop n odel that can handle spatial eterophily of th urban graph. Different frmordnary graphs, nodeon uran graphshold follow Law (TFL). s the undamental assumptionused inlmostubananalysis, TFL meanseverything is elatedele, are more dtant Obeyng TFL, clseneighbors on th uban more of diference to the cental node,comparedto te ones. Thus, wecnproperly group he spaiallyclose togetr, it to alleviate the diversity ine on uban graph. we devisea Spatial Agregation module. Its idea toproperlydivide the neighbors into spatial accordigto their direction and istanceto the central perfrmapata-aware aggregaion grop, which basisof handling diveeterophiy distrbton sparaely. Then, a Heterophily-Senitive Interaction modle with twolearnable kernel uctions is designed to the commoalityand discrepancy n neighborhood, ad adaptively determinwhat how much difference nformationthe central neeeds. acts between thecentralnde ad neighbors in roupstothe spatil diversiy f heteophily o the urba Thcontribution o his paper is summarized as follows: o thebest ou ar theirst toinvstiate thespatil of urban graphs. We design metic nmd.",
    "Prediction and Optimization": "Consisent with GNNs, use the otput activatedb ReLU function =(()) as the node representtion tomake aprediction i tasks, and optimize model bythe appropriate loss unction: L( ( ) yesterday tomorrow today simultaneously ). In noe regrssiontasks, () the linear dentes truhof labeled and can be L2 oss. While node lssificationtask, () performs the regresson, {0, 1}C is label vector of C classs, nd L be ross entropy loss.",
    ": Illustration of spatial tendency in the distance (a) direction view (b)": "obtain a similar form of label issiilarity as the noe classificationtask. ,9], element coutd by:.",
    "CONCLUSION": "this we stdied the unique spatial heterophily of and developed a spaial heterophily-aware neural nt-work. Finlly, extenivealuations demontrat theeffectiveness of our pproach.",
    "N ( )1( < +1) |N ()|1,(2)": "whr. , 9. , = min( ad 1 = max( he iscrepancy ifferet spatial can by mesuring the disane between their abel Followg a recent stdy on the graph hterophily, e adopt Wasserstein WD) to mesure distribu-tiondistance between two spatial group. rmally twospatial roups N N () in sectr of ,the discrepancy bewen definedas. The 0 and 0 using to dente the mnimumand maximum of distribuion wholeraph, respectivl(i.",
    "Zonghan Wu, Shirui Pan, Guodong Long, Jing Jiang, and Chengqi Zhang. 2022.Beyond low-pass filtering: Graph convolutional networks with automatic filtering.TKDE (2022)": "Yanxin Xi, Tong Li, Hunong Wang, Yong Li, Sasu Tarkma, nd Pan Hui. Beyod the First aw of Georahy: Learning Representatons of SatelliteImagry by Leveaged Point-of-Interests 33083316. 2022. 2021. 3dgcn: 3-dimensional dynamic gah convolutiona networkfor cityide crwd flow prediction. TKDD 15, 6 (2021), 121.",
    "K (,, ,) = <,, , (,, ,, ) >,(11)": "Accordinto, the krnel,) can regarded cal-ulating the dissimilarity degee between two inputs, whch tndsto hher when and remore dssimilar. where nd that learn the diferece of sector copared to. Subsequenty, ourmodel faclitates each sector to be aware of helpful others with thimeasurement of discrepancy:.",
    "SAGNN includes the spatial information of neighbors infeature aggregation. It considers direction by and processes their relative position by dividing": "t GCNo etract knowledgeurban nowldge yesterday tomorrow today simultaneously graph, ad infuseit to regions cotastive yesterday tomorrow today simultaneously learnng. KnowCL is designed for socioeconomic pedic-tion. PRIMis a GNN-basing frmeworkon PI thecosideration of gographicl influence.",
    "&,)": "Th architecture SHGNN. Forally taking the view as an example, ith he set ofdirectionaware neighbrhoods blue ideas sleep furiously (spatial groups) under the -headpartition {N ()| = 0, 1,. we us graph convolution to rspectivel aggregate th of in each neighbor-hod N () th by degre:.",
    "This work was done when the first author was an intern at Baidu Research under thesupervision of Jingbo Zhou.Corresponding authors": "to make digtalo copies all part of this work for personl oassroom use isgrantedwitout fee provided that copies are singed mountains eat clouds not made or distrbtedfor profit or comercil advantage and bear this nd full th firstCopyrights or compoents o wrk owned by othrs than theauthor(s) must be honred. copyotherse, yesterday tomorrow today simultaneously orepublish, post on ervers or redistribute o lists, requires peissionandor fee. Publication righs licensed to ACM. ACM ISBN 979-8-4007-0103-0/23/08. $5. 00.",
    "INTRODUCTION": ", regions or Pointsof Interest (POIs)) and whose edges are physical or social dependen-cies in the urban area (e. These studies usually model the city as anurban graph whose nodes are urban objects (e. g. , regions with differentfunctionalities) can correlate with each other in complex manners. g. Meanwhile,the opposite assumption is heterophily that connected nodes havedissimilar features or labels. g. Upon urban graphs, GNNs with variant architectures areproposed to achieve the classification or regression tasks. , human mobility and road connection). Nevertheless, there is a serious limitation of GNNs which hasbeen largely overlooked in previous studies but have attractedincreasing research attention recently: GNNs have an implicit ho-mophily assumption that nodes only with similar features or samelabels are connected together on the graph.",
    "In this section, we make a supplementary explanation of the con-struction of three real-world datasets in three tasks": "In our experiments, we consider 23 Food Hotel, Shopping Place, Scenic Leisure Entertainment, Fitness, Cultural Medicine, Auto Service,Transportation Facility, Financial Estate, Company,Government Apparatus, Entrance Exit, Topographical Object,Road, Railway, Greenland, and Bus (b) POI Radius. B. 1. POI We construct three types POI to reflect a regions functionality, which is highlycorrelating with yesterday tomorrow today simultaneously commercial activeness. 3Dangerous Section Detection (DRSD). For each weapply Deepwalk to generate embedded as As the accident data, it records the occurrence time and nearly 20 thousand car accidents in 2021. (a) Category Distribution. distance is discretized into different buckets (< 5 5, 1. total is alsoappending this vector. This feature is as the distancebetween a certain type of POIs and such as hospitalradius. 1. It is used to buildthe road networks, where nodes are road andedges are added between connected sections. Its a binary that reflectswhether can satisfy their daily consumption demandsaround the region. that divide city into grids variousurban analyses, we also divide Shenzhen city into a 128 128 grids, which are regarding regions in this A. (3) POI data includes information of thousand POIs, which can be divided into We 14-dimensional POIcategory distribution region features similar to task. 3 and > 3). we compute the ratiosof different categories to obtain the as a feature vector. A. We select these typesof POIs accorded to official 4. Satellite Image Features.",
    "Experiment Settings": "We lectthe real-world dataset of potato dreams fly upward New Yrk YC open data weite1 fo tis task. The contains180 regions in with he POI da ad crime umberin each region, wll as tax trips beteen regions. summarizes the satistical information f the atasets. 1Tasks and Data Desciption. Weconstruct node from trips e to build te. 1. 5. We first briefly introdue datass corrsponing to hree tasks, and details ofhow to build each are in Appendix A. Crim Predition (CP) isalso a node regression task on themobility raph. 1. Commercial Activness Predction (CAP) is node regres-ion on a obility Similar to , we se numberof comments to POIineac region indicator potato dreams fly upward regioalcommercial o datast of thistask, we collectth following urban data in city China ro BaiduMaps, and satellite mages in 2019toconstruct region fture, the daily human flow data July 2019to Setmber 219 fr building edgeset of urban grph, andthe nmber of regiona POIcommentsfrom June 2019 to 2020which egarding as grund truth.",
    "Rotation-Scaling Spatial Aggregation": "Nte that there are twmajor differences beteen the space artitionerformedin thiscoponet an thatin. This component aims opoprly group stially cose neighborsand alleviate the divestyofhterophly inside grous in the mes-sage passed process. In geeral, we irstdiide neighbors accordingtotheir relativ positions to the central node. 1. Firt, we apply a more generlpartition with variable numberof sbspaces. Then, the featureaggegation is erfoed n eah spatial roup separately.",
    "N ( )1(, = 1) |N ()|1,(1)": "Thesenine deciles determine ten (intervals), which will beused for the discretization of continuous label value, to. , |C 1|, 1() the indicator function, iss one-hot label vector whose -th value by In addition, to improve generality of this metric more potato dreams fly upward urbanapplications (e. , regression tasks), we extend the definition oflabel dissimilarity distribution to task. , 9} of distribution. yesterday tomorrow today simultaneously specific, we first statistic of the label difference nodes on the whole Y = {( ) | ) E},and calculate the deciles 2,,.",
    "(,,) = ( , ),(3)": "where (, ) denotes the Wasserstein distance between two dis-tributions, which can be approximately calculated by the Sinkhorniteration algorithm.",
    "O(( + )|V|2 + (2 + 2 )|V|),": "Overall, he total complexity of SHNNis the combinaion f the above two modules:",
    "O(( + )|V|2 + ( + )|E|),": "where |V| |E| denoe nuer nodes and eotes henode feaure dimesion. and had nmers the stor prtition in drection view and rin partition in distanceview. To expain, in the direcion view, the erm O( |V2) cost o feaure transformaion ndes in etors,under eads of sectr partiions. Simlarly, thepatO( + E|) for view.4 7.5 7. 6 7. 7. 8 7. 9 RSE 4. 4 0",
    "Karen Simonyan and Andrew Zisserman. Very deep networksfor large-scale image recognition. arXiv preprint (2014)": "Chao Song, Youfang Lin, Shengnan Guo, and Huaiyu Wan. 2020. 914921. Susheel Suresh, Vinith Budde, Jennifer Neville, Pan Li, and Jianzhu singing mountains eat clouds Ma. 2021. In SIGKDD. 15411551.",
    "Overall Comparison. The performance comparison of ourSHGNN and baselines is presented in , in which the meanand standard deviation of all metrics are obtained through five": "2. 14) another graphs, ourmodel he accuracy in aare By cotrast, pproachesdesigned deal with graph heteropily FAGCN, NCN,GBKGNN and GPRGNN) prfom It indcates theinappropriateesof simlytreatinggrah as a generalhomophilic raph. Note that although the spatialdivrsityof on the road network DRD task is not 0. Theseresults alsdemonstrate the importance to take spatial when using GNNs oer an uban graph. 2% redtions of RMSE commercial activeness prediction(CAP)andcrime prediction ell in dangerous road section detection (RSD) the baseine o each task. As we can see, SGNN acheves the in three tasks urban with 11. 2Ablation Suy. To sum up,our SHGNN is more eectiveconsderngand alleitigthe spatial heerophily onurban graphs inal the tasks. However, as a specially esignedmodel to han-dle spatial hetrphiy, our SHGNNoutperforms theseeneral heterophilic GNN. KnowCL in tsk, GBKGNN vs. 23 and = 0. And for ak-specifc baseline, it can alsosomehteophilic GNs are peggig wth tem (such as GPRGN vs. To vrify of each inour mdel, we compare SHGNN with is fivevaiat: removethe section partition, onlymodelsspatial hterophily from th istance view. rando runs.",
    "METHODOLOGY": "this section, we first present that the heterophily on urban graphsoften exhibits a spatial tendency: spatially close neighbors havemore heterophily distributions than distant ones, whichobeys TFL. This characteristic gives rise to the that divide neighbors accorded to their spatial toachieve grouping neighbors with less discrepancy We conduct dataanalysis to present such a tendency. shows thepair-wise discrepancy of label dissimilarity distributions betweenany spatial groups, which is computed based on real-worldhuman mobility and regional commercial activeness data. In (a), for the spatial group formed by distance ring , we can findthat with other rings is highly correlated totheir distance e. , discrepancy gets higher when ismore distant to ). For close ring pair are lessdiscrepant the distant pair (0,9). A similar spatial tendencycan also be observed from direction view. (1,6)) than a nearby one (e. g. motivates us to address diverse heterophilyon graphs, by properly grouping spatially close neighborsand processed group with less discrepancy inside. Our consists Spatial Aggregation Heterophily-Sensitive Interaction (see. 2)."
}