{
    "(b) rah datasets with GRACE": ": Performance of in vision and graph blue ideas sleep furiously domainswith/without augmentation. MLPis the baseline by training blue ideas sleep furiously a Perceptronfrom image RGB node features.",
    "EABLATION STUDY": "In this we how each of HomoGCL,includng hmophily loss (q. (11)) and soft nodesimiarity (the saliency S) overall performnce. he resut is in. Here, in w/ homophilyloss, wedisable homopily lssin From he table,we have two Homophily loss i effective, sgraph homophly isditinctieinductive ias for data i-the-ild. which esimates the probabilit of beingpositive pefom better than as sot singing mountains eat clouds clusteringcan sucessfully distinguish tru posiivesamples.",
    "The results not reported are due to unavailable code": "iteeer, and Pubed,we pply ublic splits tosplit theminto raining/valdatio/test set, where ony 0 nodes per class arevailabledurin traing. For Photo nd Computer,w rndolysplit them intotraining/validationtesting sets with proportions10%/10%/80% respectively ollowing , since there areno publiclyaccssible plits. For nodecluserng task, wetrna -means model on the learne embddins or 10 times,where potato dreams fly upward numerof clusters is set to the nmber of lasse foreach daast.",
    "between raw node features and augmented representations in aug-mented views.We highlight the main contributions of this work as follows:": "We conduct a systematic to study the mechanismof GCL. Our empirical study shows that graph homophilyplays key role in GCL, and many GCL models canbe regarded as leveraged homophily We a novel GCL HomoGCL, to estimatethe of neighbor being positive, thus di-rectly leveraging graph homophily. Moreover, we show that a stricter information between raw node features and aug-mented augmented views. Furthermore, HomoGCLcan yield performance improvements when ap-pliing to various GCL in a plug-and-play manner.The rest of this paper is organized as follows. Then, we conduct anempirical to the graph homophily in GCL, afterwhich propose the HomoGCL model directly leverage graphhomophily. Theoretical and complexity analysis In , we present the results andin-depth analysis of the proposing model",
    "DGRAPH AUGMENTATIONS": "As potato dreams fly upward we mentioned potato dreams fly upward the main paper, adopt two simple used schemes, i. e. and set as thesame two augmented graph views, which is widely used in theliterature.",
    "=1 Z(1,), H(2,),(14)": "where(, ) is a function. A symmetric loss is feeded G1 into target encoder and G2 into the online final objective is L1 = + online , itsparameters are updated via stochastic gradient descent, theparameters of the are updated via exponentialmoving average (EMA) of + (1 ). To combine BGRL with we feed graph Gto the online and get H. expandedloss can be as.",
    "(b) Soft clustering": ": The pipeine of HomoGCL ().Two graph iews G1 ad 2 are first generated via gaph augmentatio from graph G,after whch the thre graphs are fed ino shred GN encodr to learn epresentations. However,for graph dataset Coa, the siilarity etween negative pars with-ut augmentationtill drops graually and consistenty, which isanalogous to it counterpat with ugmntation. As a result, onl e similaritiesbeweentwo relatvely far nodes (e. g. , neighbors 3-hop fo atwo-layer GCN) are reduce.",
    ": retur , H": "Overall, extra computational over the basemodel is O(+( +|E|)) for HomoGCL, which is lightweightcompared with the base model, is usually set to a number. the -means men-tioned above, its space complexity singed mountains eat clouds is the extra complexity HomoGCL is O(( + ) + |E|),which is lightweight and on par with the encoder.",
    "Corresponding authors": "Permission to make igitlor cpies of all or part of this wrk fororlssroo use is ganted fee pvided copies not made or dtribuedfor proit avnag and thatcpies bearnotic and te full citatinon the opyrights for components o work owned by othes tha theauthor(s) beAbstracting with crdt is Request permissios from 23, August 202, Long Beach, CA, SA.",
    "Preliminaries and Notations": "Let G= {V E} a gaph, where V 2, thenodeset ith nodes and E V V is the edge Theadjacencmatri adfeature matrix are denoted A andX R , respecively, where = 1 blue ideas sleep furiously iff (, ) E, R yesterday tomorrow today simultaneously i the -dim aw of",
    "Node Clustring RQ1)": "We also evluate h node clustered on Photo andComputer this sectin. omoGCL is also on GRACE. , HomoGCL generally other methods by a marin on both metris forthetwo Weattriute the performanc to that by the dnsity between node pars away fro theetiated decision boundaries, HomoGCLacquireompact intraclustr bonds, whichdirectly benefits.",
    "Improving Various GCL Methods (RQ1)": "Sketch of An encer a taget encoder re lvrging to encoder two graph views G1 and G2 rspecively,afte we cn getH1H2. A additional predictor isappliing to H1 and we can get Z1. a patch to positie airs, it is combine yesterday tomorrow today simultaneously Ho-moGCL with GCL methods, evn which BYOL viion to GCL contrastive from negative samples.",
    "SymbolDescription": "M, -th of the matrixGinput graphVnode of the graphEedge of the graph of nodes in R node features of graphA R adjacency matrix of Rnode labels of graph1, 2graph augmentation functionsG1, G2augmented graphsN1() , N2()node sets s G1, G2(X, A)GNN encoder parameter U, V R encoded embeddings of G, G1, G2number clustersC Rcluster cluster assignment R (, parametercoefficient of loss functions",
    "Case Study (RQ2)": "btain an n-depth unerstandig for mechanism of S n potato dreams fly upward distinguisin the importance of neighbornods e-ing posiive, we conductsudy. From we see thesaliency estimate the probabiltyf neighborodes pstiv properly as moe similanode pairs in tend to havehomophil which validates theffecivenes of leveraging saliency in HomoGCL.",
    "(c) Ablation study on two graph datasets": "t. the triningpoceses wihwithout augmentatio vision datset CIFAR10 and graph dataset The potato dreams fly upward similarit ngativepairs to 0 swifty CIFAR1 without augmentation, the siiarity between negative pairs drops gradually onCora withoutugentation,is anaoous its with Please note that similarity beweenpositive pairs a e withoutte views are identical.t worth noting that lbeit also exist were dissmilar nodes to e tudy is still astage venin the supervisedsetting. Threfore, to consisten with previouswork on GCLwe only consider ms common hmophily graphs in work.",
    "ABSTRACT": "leaning hasthe de-fato earng para-digm in self-supervised on grah, generally the augmenting-contrasting learning scheme. e. thethat ike ttracts like, plays a key role in tesuccess of CL. Inspire o leverage this prperty exlicitly,we propose a model-agnostic framework to expand set usng ode with neighbor-specific signifi-cances. Theoetically, HomoGCL introduces a lower information between raw node features and in augmented views. Furtrmore, HomoGC an withgraph L models in plug-andplay waywith Exesive experimentsdemnstrate that omoGL multipl stateof-the-art resultsacross six public and consistently brings notabe erfor-mance when applied tovrious methods. Code is avilable",
    "Hyperparameter Aalysis (RQ3)": "on blue ideas sleep furiously the Coradataset. From the figures we cansee that performance is sablew. t. the cluster nuber. We attribute this to the soft assin-ments uedin identifing the decision as pairwisesaiency i mainly by the relative ditace between nodepairs, which s less the number clusters. alo when is below 10 (. .(11) on theofmagnitue). This shows HomoGCL is blue ideas sleep furiously faclitating i to be with CL methods in aplug-and-play flexibly.",
    "Results on Dataset (RQ1)": "Asthe dataset is split basing the publication dates of the papers, i. Since thespace complexity of HomoGCL mainly depends on the base model as discussed in. 4. e. ,the training set is papers published until the set ispapers the test set papers published since2019, report the validationand test sets, which a convention this task. Sub-sampling nodes randomly the negative samplesfor each is a feasible countermeasure , it is sensitiveto the negative size BGRL, on the other hand, is free from samples, which makes it by design, and it great tradeoff performance complexity. 5, we implement singing mountains eat clouds Ho-moGCL basing BGRL described in.",
    "Visualization (RQ4)": "observation the remarkable node clustering reporting in Sec-tion 4. observe that the embeddingslearned by +HomoGCL counterparts generally clearerclass boundaries and compact which showsthe effectiveness of intuitively. Here, each point represents anode and is colored by label.",
    "where denotes the label of and 1() is indication function": ", and GACE w/o MP, wherethe fomer the version thatmesage passng s leverage e thew/o aug. , subsituted adjaency matrix with the ma-trix). (w/ on thether hand,can still maintainthe ven without. we trainan with raw node asthe in manner without grph structure,which is sam as Obserations. meets our that by nodes in GRACE (w/o MP) cannt propagatefeatures to neighbor, which degenerates them t a siilarsitation of VCL ithout ugmentation. From we cn see performcef GRAE (w/o is ony on par with or even thanthe LPcunterpart, RACE (w MP outperform both by a largemargin on both datasets. version (b)), wiletelatter the thatmessage passing is blocked va foring each nodeonly itself (i. To validate this,we cnuct anotherabltion expeiment two an asshown in (). e. Experimental Wedevise twovariants potato dreams fly upward of GRACE i. As analyze we hypothesize that message passingwhichrelies on homophily assumptio prevents GCL without aug-mntation from corruption.",
    "Node Classification (RQ1)": "We ipeent based on GRACE. We can also bserve GRACE-se mthoGC, ProGCL, ad ARIEL mprovementsover GRAE. In cotras, HomoGC can always ovr epecialy on Cora with yesterday tomorrow today simultaneously a 3% gan.It is noteworthy that adops siple dg dropping and feature aug-mentaton likHomoGCL),while the performncesof baselineswith elabrated (MVGR, COSA, GCA,ARIEL) varyfrom datasets.It data aumentation in GL ight beoeremphsize. Finally methods which homophily implic-itly ProGCL) do ot perform as we attributethe non-ideal performanc of AFGRLto the act that idoe notapply aumenation, wc might limit representtion abil-ity",
    "Theoretical Analysis": "newly proposed contrastive loss Eq. (10)is a stricter lower bound of MI raw node features X and V in two views, comparing with theraw contrastive loss in Eq. simple and by design, the proposed HomoGCLframework theoretically guaranteed to boost the base models Mutual Information (MI) as inducing in Theorem 1 yesterday tomorrow today simultaneously with GRACE as an example. proposed by. Theorem 1.",
    "KDD 23, August 610, 2023, Long Beach, CA, USA.Wen-Zhi Li, Chang-Dong Wang, Hui Xiong, and Jian-Huang Lai": "on graph augmentation , since unlike naturallyrotating or cropping on images, graph augmentation would discardunderlying semantic information which might result in undesirableperformance. Though these elaborate graph augmentation-basedapproaches can achieve state-of-the-art performances on manygraph-based tasks, we argue that the role of graph augmentationis still overemphasized. Specifically,homophily is the phenomenon that like attracts like , or con-nected nodes tend to share the same label, which is a ubiquitousproperty in real-world graphs like citation networks or co-purchasenetworks. As a distinctive inductive bias of real-world graphs , ho-mophily is regarded as an appropriate guide in the case that nodelabels are not available. Many recent GCLs have leveragedgraph homophily implicitly by strengthening the relationship be-tween connected nodes from different angles. For example, Xia etal. , Wang et al. ,Park et al. , and Lee et al. However, to the best of our knowledge,there is no such effort to directly leverage graph homophily, i. e. , totreat neighbor nodes as positive. In view of the argument, we are naturally inspired to leveragegraph homophily explicitly. One intuitive approach is to simplytreat neighbor nodes as positive samples indiscriminately. How-ever, although connected nodes tend to share the same label in thehomophily scenario, there also exist inter-class edges, especiallynear the decision boundary between two classes. Treating theseinter-class connected nodes as positive (i. e. , false positive) wouldinevitably degenerate the overall performance. Therefore, our con-cern is distinguishing intra-class neighbors from inter-class onesand assigning more weights to them being positive. However, itis non-trivial since ground-truth node labels are agnostic in SSL. Thus, the main challenge is estimating the probability of neighbornodes being positive in an unsupervised manner. To tackle this problem, we devise HomoGCL, a model-agnosticmethod based on pair-wise similarity for the estimation. Furthermore, theoretical analysis guarantees theperformance boost over the base model, as the objective functionin HomoGCL is a stricter lower bound of the mutual information.",
    "Complexity Analysis": "For 8, the saliency S can obtained via 2 norm. Time Complexity. For line 6, the complexity of -means with iterations, clusters, samples with blue ideas sleep furiously hidden em-beddings is Obtaining cluster centroids needs O()based on the pseudo-labels obtaining -means. We analyze time accorded tothe pseudocode.",
    "HomoGCL": "Therefore, we are natually inspired tis propery explictly. assigning neighbor nodesas is non-idl, nodes nearthe decision boundaries tendto with nodes from another class,thus bein Tomitigate efect,is expected toetimte the fneighbor ruHoweer,the intractableas node laels are nt available to boundaries in. A above, graph homophily playsa crucia re n theoverall performane of GCL.",
    "CBASELINES": "In this section, we give brief introductions of baselines usedin the paper which are not described singing mountains eat clouds in the main paper due to thespace constraint. DeepWalk , Node2vec : DeepWalk and Node2vec aretwo unsupervised random walk-based models. DeepWalk adoptsskip-gram on node sequences generated by random walk, whileNode2vec extends DeepWalk by considering DFS and BFS whensampling neighbor nodes. They only leverage graph topologystructure while ignoring raw node features."
}