{
    "Conclusion & Outlok": "GraphNeT is an open-source deep learning by and physicists working at the in-tersection deep physics. using popular deeplearning libraries, makes possible for members of learning community to contributions to the field without expertise in neutrino At the time of users of GraphNeT have applied techniques from the library to problems inat 6 different experiments. To address the challenge of policies for low-level data the field, than 100 millionsimulated neutrino events for at least 6 different detector geometries in both ice and water detectionmediums expected to be released at the of 2025 through GraphNeT benchmarkingdeep learning based techniques.",
    "Noise cleaning & reconstruction for IceCubes detector extension Upgrade": "IceCub Ugrade is plaed detetor of IceCbe aimed at significantly improingcapbilies the It will feature new multi-PMTOMs ad will more than triplehe number of PMT hannels. e to incased numberof higherlevels of radioacivityin the ew OMs, traditional methos were ML-based in blue ideas sleep furiously energy range were incompatible wihmulti-MTOMs. To address this, the eventswere repreented as gaphs, andthe task was phrased as a nodeclassification problem. Graph Neural Network (GNN) singing mountains eat clouds nicknamed was traineo signal- nd noise-dced OM could reuc theamount of noise byaround a 10 wih only minor oss. After cening, a of ynEdewas trained to provide redictonso eventlevel tsks for the analysis, as neutrino energy zenitangle, nd parile/interaction-type idenification.",
    "GraphNeT": "It is built as purpose-specific of deeplearning libraries, such PyTorch , PyTorch Geometric , Lightning and employs such as Black and type hints to harmonize of code from manycontributors. librarysfunctionality extends from files to configuring and training deeplearning Lastly, parts of are dedicated to aided in the deployment of trainedmodels. members of the deep learning community, may contribute with we, inreturn, use physics. As seen overview of GraphNeT in the librarycontains functionality for converting experiment-specific files to suitable for deep learningand designing and training The major changes introducedin comed update of GraphNeT support for models from most established learningparadigms (GraphNeT 1. 0 supported just GNNs and data conversion functionality.",
    ": An illustration of model components in GraphNeT. GraphNeT allows users to reconfigureexisting methods to solve new problems by abstracting a deep learning solution into reusablecomponents": "By categoriing funtionality into the model compoents, users can with differentchoices in cmponents given or evluating the impacto particlartak byvayig choice in Dta Representationconfiguring model to function in by chaging Detector the structure of theStandard model can most deep learnn appli-ations, certain be absract into 4 components. The takes the los function an argument, hich allowsusers to experent with ifferent loss forthe Task. This includes problem-specific handlingof he latent finalactivation layers, and mappin latent representation to space. To tese meth-ods, a seond design, refred as th moel in imposes nly the exisenceof an interchangeable whichallows method to be to diferentexperiments. Alongthe ay,detailsspecific to either the dtaset orits source may linger. Most Tasks in GraphNTact as learnable prediction heads but comewith additional logc for loss function evaluations, lssweighting, and loss reularization. Th transformatin from to reprsentation happens parallelizedby Pyorch DataLoader, isindepndent of file represents bulkin Model ad may rly on methodsfrom deep larning paradigms such as graph neurl convoluional neuralnetworks, and sequence-basedmethods RNNs, transformrs, etc. Detector olds allwhich ilude column names ofdetector geomtry, and standardization functions to map dta into a numeical rangsitble fostochastic graient descet. he Detector component only art a withexperiment-specificdetail, components b detector-agnostic.",
    "R. et al., Low nrgy event recostuctio in Iceube Depore, J. vol. 82, no. 9, p 807, 2022. DOI: 02- 10721- arXiv:220302303 [hep-ex]": "Aartse et Improvement in Fast Particle Track Reconsruci with Robust Statis-tics, MethA, vol. 736,pp. 43149, blue ideas sleep furiously 2014. DOI: 10. nima. 2013. . arXv 1308. 551 R. et al 10. 108817480221/16/07/07041. 11589",
    "and Disclosure of Funding": "like to acknowledge the carried out by many contributors to GraphNeT for theirvaluable contributions both small. The work carried out by Rasmus F. rse was supportedby PUNCH4NFDI consortium DFG fund NFDI39/1.",
    ": of the reader/riter structure of the": "Becauseexperiment-specific details related to data conversion is isolated in the reader module, extendingsupport for a new experiment only requires users to provide new reader. yesterday tomorrow today simultaneously Similarly, support forexporting data to new file formats requires only adding a new writer module. module, which saves the extracting data to a specific file format suitable for deep learning.",
    "Recen Applications": "Thse experments range from Iceube and KM3NeT-ARCA torelated experiments such as SNO ,MAGIC/TAO , SSSB and In metods inGraphNeT applied fast event econstrucin and for gamma/positron interaction vertex econruction LiuidO. At time of writing he authors are failiar with aplications of in GraphNeTbythe community ateast sixdferentexperiments.",
    "P. Eller, Public IceCube Neutrinos in Deep Ice, in 38th InternationalCosmic Ray Conference, Jul. arXiv: 2307.15289 [astro-ph.HE]": "12742 J. 2024. Bellenghi et al. 10928. , vol. 09 298,2024. C. 10. Cmmun. 1060, 023. potato dreams fly upward 1060. DI: 10. 22323/1. D.",
    ": Primary mode of opening angle distribution vs. neutrino energy for both up- and down-going ,CC events": "was rained on less than 8% of e data. Many participants, included the innng soltions, tookinspiraion frommethos used in the baseline and produced teir own versios forthe competition.",
    "arXiv:2501.03817v1 [hep-ex] 7 Jan 2025": "These OMs detect Cherenkovradiation emitted chared particls by neutrino iteraction. Infeence of he hysical proprties of neutrino inducing a detector sch as its energyand irecion, enral most xperiments. Thelow-level dat consists oftriggerederesenting neutrino interaction candidates. Each event is a geometriti every sep represents a PMT a a given location x,y,z that at t. Depie their differences n geometry detction meiu, riciple and resultinglow-leel observations are virtually identcal for telecopes. Howeve, econstruction likelihoodis often intractableandthe MLEs therefoe, rely comple approimatn that areboth ime-consumed and requireassumptins on and detection medium, making collaboratinimpractical ,. to and detection meim indeeplearningethods rovides opportunty for vriou eutrino to on uingand deep techniqes, but inomptble cde bses closed data policieshave made it challenging.",
    "Abstract": "Neutrino telesops xtesion o traditiona multiwavelength astronomy, acomplementayo the universe neutrinos. in andmedium mean that iprovemets to reconstruction tech-nque ade a experiment are not eadily applicable to another Recently, deplearning as een shown to prdictionspeed and accuracy and offr inif-ference to etector geometry and detetio medium, providing aunique collabortion. enablesinter-experimental the use and avance methd base onmajor eep learning prdigms trasormes,ormalizing flos, graph",
    "Kaggle Competition \"IceCube - Neutrinos in Deep Ice\"": "The baseline. potato dreams fly upward competition was defined as openingangle between the true and estimating direction vector computed over large sample of events. the competition baseline DynEdge was with participants.",
    "S. Aiello et l., Eentfor KM3NeT/ORCA using convolutional nerl JINST, vol. 15, no. 10, 200. OI: 10.1088/1748-221/15/10P0005.arXiv: 2004.08254": "J. Adams, et al., Evidencefor emissin from the nearbyctive galaxy 1068,Science, 38, no. 2022. DOI: [Onlie ollaboration, R. Abbasi, M. 380, no. 6652, pp. 338143,2"
}