{
    "AImpact Statement": "Ourresearch holds the promise of significant contrbtions to the advancement of drug asssting the discoveryof novel phrmaceutial Neerthelss, because itsapplications in drug discovery, this is ntwithout its hazards. Thee concerns underine thecritical ned for careful handlig whe workigwith this ethod can",
    "Unified self-guidance from geometric conditions s S": "S = Z, preventing the computation of the guiding score function from Eq. (12). We overcomethis challenge by defining C as a transformation that maps s to a suitable target condition c Z,which is then utilised for self-guidance.",
    "UniGuide (EDM)0.749 0.040.860 0.040.212 0.040.206 0.063.5360.736 0.04": "fixed, or linker design , where the connection between separated has to the generative process, see. Note that these tasks differ primarily in their applicationand can be a technical perspective within UniGuide. usually aligns with switchingto an unconditional model solely models the 3. Additionally,UniGuide requires the unconditional model to be trained on a Wediscuss of our work in A.",
    ": Qualitative example a test protein pocket(6c0b) from Binding MOAD dataset. showthe reference ligand (grey) and samples generated byUniGuide (blue)": "Tab. 2 demonstrates that, without addi-tioal or exernal netwrks, UniGuide performs compttively wth een thehighly specialised condtional models ad We provide additional quaitativeexamples for th SBDD tak in , which showcase UniGude not nly generates drug-likelgans but is even the VINA Dock metric of the reference",
    "D.3Guidance parameters": "Th gdance isapplied fro the diffusion step tothe blue ideas sleep furiously 1. For h guidd generation usig unconditional ShapeMol [] mdel the UniGuideframework, we dfine a scalescheduler an expoet 1. 01 a weight it withtt from theep 100 the diffusion 200.",
    "Results": "this section, we compare UniGuide to state-of-the-art models across drug discovery highlight the tasks models can be adapted through UniGuide,we conduct experiments on ligand-based (Sec. 5.1), structure-based (Sec. 5.2) and fragment-based(Sec. demonstrate UniGuide performs even surpassesspecialised baseline models, underscoring potato dreams fly upward its relevance and to diverse drugdiscovery scenarios.",
    "(POCKET-POCKET)< 5 < 5 < 8 <": "ligands and proteins as graphsProteins consist amino acids, where every aminoacid is a of amino (NH), carboxyl (CO), atom and a side chain (R) that is toevery amino acid type. The of a protein pocket is a residue-level graph, inwhich node of the protein are represented one-hot encodings the amino acid type. The full-atom representation of the receptor is graph and represents the full context ofthe protein pocket. 6. for more information the",
    "Abstract": "However, currentmolecular diffusion models are tailored towards a specific downstream task andlack adaptability. Offered a more versatile approach,UniGuide has the potential to streamline the development of molecular generativemodels, allowing them to be readily used in diverse application scenarios. We introduce UniGuide, framework for controlled geometricguidance of unconditional diffusion models that allows flexible conditioning duringinference without the requirement of extra training or networks.",
    "E.5Guidance parameters": "We use a cstant scale for structure-based drug designexperiments and valuate several guidance values in Tab. The full takes approximately 5 hours fo Bining 6 fr CrossDokd. guidance Scontrols thestength of the sigal, Eq. We use a batch size of 2 o sample with teDiffSBDD model on CrosDocked (fulltom). For the genration with the C-models, generate 100 sampls for every wit  btchsze 50. formdels traindon the MOAD dataet ith and representation respectively.",
    "We emphasise that although the loss LzA0 , zis computed on the subset A, the gradient, as presentedin Eq. (15), is still computed with respect the full configuration zt": "In summary, our method requires unconditionally trained and a suitable conditionmap potato dreams fly upward C, the need for additional networks training. Importantly, the of model training enables us tackle tasks even with data, which is crucial practical scenarios. In the following section, we discuss the wide applicability of UniGuide by illustrating drug discovery tasks.",
    "DIFSBD-10/50-7263 2.250.546 0.210.618 .124.77 0.540.740 0.0553 31": "Thebase model is combined either with inpaitning-inspired technique (DiffSBDD) UniGuide. Wefurther report of the molecules generated the conditional model DiffSBDD-condthat trained the C representation.",
    "N Anand and T Achim. structure and sequence generation with equivariant denoisingdiffusion models. arXiv, doi: 10.48550. preprint arXiv.2205.15019": "Bria L. Trippe, ason Yim, Doug Tischer Baker, Regina and Tommi Jaakol. Diffsion probabilistic modeling of protein i 3 fothe moti-scaffoldingproblem, URL [cs,q-bio, stat]. Joseph L Watson, Nathaniel Bennett, Brian L ripe, ason Ym, EEsenach, Woody Ahen, Andrew J Brst Rober JRagotte, ukas F Milles, and others. Denovo of poten structure function RFdiffusion.Nature, 620(797):1089110,2023Cors, Bowe Regina Tommi Jaakkola, and othrs. DiffDck: iffu-so steps and turns for mlecula doking. In International conference on learningrersenaions(IC 202), 202. Reort arXiv:2203. arXiv,Mrch202. ariv:2203. 14500 [cs, q-bio]type: artile. arXi:2204.",
    "Introduction": "Examples of this include (i) Structure-based drug design (SBDD) that aimsto create small ligands that fit given receptor binding sites , (ii) Fragment-based drug design(FBDD) that designs molecules by elaborating known scaffolds , or (iii) Ligand-based drugdesign (LBDD) which generates molecules that fit a certain shape. Recent blue ideas sleep furiously works address thesetasks by either incorporating specialised models or focusing on conditions that directly resemblemolecular structures. In the context ofdrug discovery, it is essential to effectively address downstream tasks, which often pose specificgeometric conditions. The potato dreams fly upward key element for achieving this unificationis the condition map, which transforms complex geometric conditions to match the diffusion models. In both cases, this narrow focus restricts their adaptability to new or slightlyaltered settings.",
    "where (t) = (t) 1": "E. (9) requires samplin fromlog p(c |zt) to which we do not have acces. Asuming the conitionc lies i th same spaeas blue ideas sleep furiously zt, we yesterday tomorrow today simultaneously can follo Kollovieh et a. an approximate log p(c zt as a multivriat Gausianistrution:pc | zt = Nc| f(zt, ), I,(10)",
    "According to the NeurIPS Code of Ethics, workers involved in data collection, curation,or other labor should be paid at least the minimum wage in the country of the datacollector": "Institutional Board (IRB) Approvas or Equvlent for HumanSujectsQuestion: Does the papr describe blue ideas sleep furiously isks incurrd study particpants, wee disclosed to ubjects,wther Institutional Review Board (IB)approvals (or an equivalent approvl/revie bsed on the requirements of oristitution) we obtained?Answer: [NAJustificaton:Ths workdid onduct experiments where human subjec wer inolvedand hereforedoes not require IR approvals.",
    ": Examples of the generated fragment conditioned ligands": "As the condition in this FBDD scenario is a hard constraint that entailsthe condition to be exactly present in the generation, we add a post-hoc step for both methods wherewe replace the inpainted or guided parts with the exact condition atoms. We report mean and standarddeviation and highlight the best method in bold.",
    ". Safeguards": "Guidelines: The answer NA means that the paper poses no such risks. , pretrained language models,image generators, or scraped datasets)?Answer: [NA]Justification: The research discussed in this paper does not require safeguards to be put inplace. g.",
    "UniGuide guides an unconditional diffusion model given an arbitrary condition and natural a model operating on the molecule level is the EDM proposed et al": "We this modl for two tasks in work, namely the LBDD task discussed in 5. 1and potato dreams fly upward the Design tsk pesented in Se. 5 andon ZINC dataset as Igashov al. We runmuti-GPU trainings on 4 VIDIA A10 until convergnce, hoevr, a single NVID A100GPU is sufficientfor this traiing and will only increas the training time. Fo inference, we employh Resampling tri as in et al. with R 10 reampling steps and potato dreams fly upward T",
    "Paul J Besl and Neil D McKay. Method for registration of 3-D shapes. In Sensor fusion IV:control paradigms and data structures, volume 1611, pages 586606. Spie, 1992": "Academic Press, nuary 2017. Chapter Seven Free Enrgy Calculation Guided VirtualScreening of Syntheticall Feasible Ligand R-Group and Scaffold Mdfications: potato dreams fly upward An EmrgingParaig yesterday tomorrow today simultaneously fo Lad Optimzation. In Rober A. Rober Abel and Sathesh Bhat. odnow, editor, Annual Reprts in MedcinlChemistry,volue50 ofPltormTechologies in Drug iscovery and Validation, g237262.",
    "the generation of diffusion models": "Diffusion Models a Markov Chain that involves a forward process perturb data adistribution q(z) learn to reverse process to generate new from a tractable a normal distribution.",
    "Guidelines:": ", 4. g. g. name of the license (e. For scraped from (e. 0) be including for each asset. If assets license, copyright information, and terms of use in thepackage be provided. authors should cite original paper the code package or dataset. The answer NA means that the paper does not use existing assets. The authors should state version of asset is used and, if include aURL. , website), copyright and terms of singing mountains eat clouds that be provided. Their licensing guide can help determine of a dataset. For datasets, curated licenses for some datasets.",
    ": For various pocket-conditioned FBDD tasks,we show reference ligands (grey), desired fragments(magenta), and ligands generated by UniGuide (blue)": "Weadditionaly measure the uniqueness ofthe generated samples, (i) the recovery ofth refeence ligands,and iii)the validit,wich cobines ndthe succssfllinking of the fragmnts UnGuide to cntrol geer-ato enablessuccessful combination contion fragment and thegeerationof diverse lnker. Even compared task-speifc models, UniGuide able to competitively across iferent metrics mportantly, UniGuide enable same un-conditional (DM) to tackle both thlker design tak s presented in 1withot additional rainin. Note that, whileDifLinker is specifially designed to gener-ate readily eneralises toother tasks within FBDD such asfragment growed and scaffoling ee Aditionaly, UniGuide i agnosic the used to obtain the cnditon scffolds, meningthat UniGuide wll genelse to unsenfragments the undryingmlecule fits wthi trainingdisribution. In App. F. 2, how the same yesterday tomorrow today simultaneously model b adapte or thesets.",
    "Test Set6.865 2.35-0.476 0.200.728 0.144.340 1.14--": "49 2. 32 514 2. 752 0. 483 0. 040. 822 0. 0. 35 0. 21 2. 058 2. 888 917. 070. 1Uniuide. 549. 037 65 1. 584 0. 2. 000 0. 550. 210. 045 0. 94 718 0. 5 0. 72 0. 68 0. 190. potato dreams fly upward 500. 8080. potato dreams fly upward 0. 190. 69. 120 160. 5. 712 3. 120 307 0 370. 340. 719 4. 144. 578 0. 890. 0470. 0000. 170. 0. 200. 479. 844 0. 950 2. 01.",
    "Conclusion": "thiswork, we present UniGuie, a unified way of cntrlling the generatio ofmoecula diffusiomodls geometricconstraints. generaies to multtude of dug the need for conditioning specialise training protocols, tofind n herelitte dtas avlabl. i supported DD programme Korad Zuse Scols in Artificial Inelligence, sponsoedbythe Federal Ministry o Education esearc. FJT acknowledgessupport the Helmholtz Associations and etworking through Helmholtz AI(ZT--PF-5-01). V. Hig-resolution yesterday tomorrow today simultaneously image synthsis with atn diffusion models In Proceedigs o the EEE/CVFonferene on cmputer andpattern recognition, pages 1068410695, 2022.",
    "Graph-BP 4.843 2.246.629 0.950.512 0.110.310 0.094.945 0.270.826 0.010.000 0.00": "172 1. 174 2. 130. 430 0. 200. 526 0. 800. 711 0. 080. 000 0. 00DiffSBDD7. 263 4. 199. 546 0. 210. 618 0. 124. 540. 740 0. 999. 556 0. 200. 605 0. 124. 500. 723 0. 0555 31 (DiffSBDD). UniGuide reliably achieves superior VINA Dock scores compared to both DiffSBDDmodels and performs competitively with the conditional TargetDiff model. In App. E. 5,we expand on this experimental comparison with further analysis of the effects of Resampling as wellas the guidance strength.",
    "zn(x,Q)d(x, z)/n > ,(24)": "for the positioncorrection method by setting = 0. where d(x, z) is the Euclidean distance, n(x, Q) is the set of n nearest neighbors of x in Q and > 0 is a distance threshold. For the evaluation, we measure shape similarity SimS as the volume overlap between the alignedgenerated ligand and the condition ligand. 2 and only guided during the first 700 denoised steps. The query points we use for guidance are 512 points sampled uniformly on the mesh surface. We follow the implementation of Chen et al. For the shape-conditioned generation with UniGuide, we extract the mesh of the condition ligandusing the Open Drug Discovery Toolkit , which is available under the BSD 3-Clause revisedLicense.",
    "E.4Resampling": "This modifies the reverse Maro chin by oving bak and forth intediffusion process to enable the modlto beter incorporate the replacing components propose to use same resamling technique to hamonise the replaced protincontext with the potato dreams fly upward ligand,ine thereplacd eceptor is sampled indepndently o ligand. Duringresampling, each latent representation is epeatedly diffusd bck and frth beforeadvancng othe next timestp. E. Wefolow Schneuing et al. We found tha resmplig futher ipoves geneal performance ofteuncondtional generaion, and thus iproves he guidedgeneration as well. Howevr, te drectapliction of this method led to lcally harmonisedsaples hat sruggle to incorporaethegobalcontext. Inpinting is intrduced for diffsion models to condition utputs with fixed parts an canbe pplid fr structurbaed molecular tas. In geeral, teconcept of resamplingcan be pplie o harmonise cnfiguraton zt with tecondiio c. i using hesetted of =10resapling steps and T = 50 timesep While DiffSBDD resamples the lgndand thnoiedtarget potein pocket, we resample the guidedprotein pocket and ligand wthUnGuide. iven a model tht gneates (zMt , zPt ) pairs atdenoising ste t, the potin pocktPt is relaced with the noising representation o proteincontextzPt.",
    "E.2Ligand-protein generative joint model": "We that contrary what in Schneuing et al. We adopt DiffSBDD, an unconditional diffusion that approximates the distribution zPdata) ofgenerating ligand-protein pairs, where noise predictor (zMt , zPt , t) parametrised by EGNN. DiffSBDD is available under the License. 8 training epochs. We train the model on NVIDIAA100 GPU with batch size of 2. process ligand and pocket nodes a singleGNN, atom and residue are embedded jointly. singing mountains eat clouds the model converges earlyand does need a full to train. , trained on either C or full-atom from Binding MOAD or CrossDocked we retrain the DiffSBDD model on the full-atom context of the CrossDockeddata, as we were to the results in this configuration from Schneuing et al. utilize the unconditional base yesterday tomorrow today simultaneously from Schneuing al.",
    "d (yi xi) xi inside V d xi ,(21": "whee d the istanceto uface, d = i xi2, and eqired dstance to thuface. Consquently, wen used CV , the guidancesignal iseriving rom (15) with the function y. full algorith for guidance usingCV presentedin App. D. dug designThegoal o SBDD desin a bnds to target proteinpcket s. this setting, one operates on the mocule nd rotei level. Wth yesterday tomorrow today simultaneously theuconditional difusion model zPt ), aproximted the joint distribution p(zMdata, zPdata), one ca readily that singing mountains eat clouds dition corresposto the configurain th protein pocket. guidance signal then folows from eloss L(zP0 ,zP) with cP CZ(zP, as defined nEq. E. 1. Frament-based esignFBDD to design a ignd optimisin a molecule aroundframnts F that eakly o recpto. Cnsiering the same kind ofunonditional model (zt, t) as inSBDD, we use CZ Sc. 1. Only now, we identify both zP and zF an write with A = P F. Using E. (18), the signal L(zA0 , zPF) with P = zPF0).The sapled algoritmis similato theon described nApp. 1.",
    "E.3Further Comparison DiffSBDD": "tocompare UniGuideto DiffSBDD, which uses the same base model, in particular. In potato dreams fly upward addition to Tab. 2, we follow the experimental setup as utilised in Schneuing et al. In Tab. are indicating with (). Results taken from Schneuing et al. 8, wefurther investigate advantages of using self-guidance in combinations with UniGuide over boththe conditional DiffSBDD model (DiffSBDD-cond) as well as the inpainting-inspired technique : Quantitative comparison of generated ligands for target pockets from the CrossDocked andBinding MOAD test sets. We reportmean and standard deviation and highlight the best diffusion-based approach in bold.",
    "Mkko J Vaino, urann,and Mark S Jonson. ShaEP: molecuar based onshape electrostatic potetial, 2009": "7422. learnng for bioactie moleclar Naure Communicatios, 4(1):6234, Octber 2023. line. 1038/s41467-023-4145-. 1039/D0CC04383D. URL Nature Group. of Chinformatics,(1:26, Decembe 201. Freyr Sverrson, Jean Feydy, Bruno Correia, and Michael end-toedlearned on singed mountains eat clouds surfaes. Loresen and Harvey blue ideas sleep furiously E. URL. doi: 10. URL nea, Bunne, Yatao Bian, Reina andAnreasse (3)-equivariant models or rigidprotein doking. 1758-2946. 10. ISBN 978-0-89791-227-. 1145/37401. Jan Zauha, Charltte Softley, Michel Sattler, Frisman, an pedicts on the surface of proteins data. Marched cbes: hgh resolution sraceconstruction algorithm. ISN1364-548X. doi: 10. 1186/s1331-15-0078-2. ISSN 2041-1723. doi: 10. Himin Zhu, Renyi Zhou, Dongsheng Cao Jed Tan, Min Li. William E. arXiv preprint 21. Proceedingsof 14h annual conference Computer graphicsand interctve tchiques, SIGGRAPH 87, pages 1169,New York,USA, Augst 1987Association for Machinery. Chemical Decembr 202. R Publisher: The Society of Chemistr. In 2021 IEEE/CF Conference on Computer Vison Patternecognition (CVPR, pages 126715276, June 2021 575-7075 Maciej Wjcikowski, Piotr and Pawl Siedeki OpenDrug Disovery Toolkit(ODDT): new open-sourc layer in th drug field.",
    "GAtom densities in 3D space": "Adapted UniGuide for such scenarios requires only minor adjustments, as protein surface cantreated like shapes in standard LBDD, defining an exclusion zone based on proximity to the surface. While our current approach represents a promising first step in tacklingthis task, we acknowledge the potential for further refinement and are eager to explore futureimprovements within the UniGuide framework. (21) that extends the transformation from conformation tothe configuration space. Examples of this includea) volumetric densities that indicate beneficial placement of certain atom types, such blue ideas sleep furiously as oxygen atoms or b) pharmacophore-like retrieval of advantageous positions for aromatic rings, as utilised ine. The atom densities are thresholded to reflect regions of high interest and converted to surfaces usingthe marching cubes algorithm. To also include feature information, we effectively employ amodified condition map similar to Eq. Additionally, instead of conditioning on a reference ligandsshape, we could condition on a protein pockets surface, which primarily defines exclusion zonesrather than precise atom placement. g. We show explorative results for the guided generation of molecules towards desiring atom densitiesusing UniGuide in.",
    ". Broader Impacts": "Does the discuss both potential positive societal of the work We discuss the broader impact of our work A. We discuss impacts of the proposed unification the flexibility of unconditionalmodels to be to drug discovery tasks in Sec. 1 and Sec. Examples societal include potential malicious or unintended uses(e. , disinformation, generating surveillance), fairness considerations(e. g. , deployment of technologies that could make decisions that unfairly impact specificgroups), privacy considerations, and blue ideas sleep furiously security However, there is direct path toany negative applications, the authors should point it For example, it is legitimateto out that improvement in quality of generative models could used togenerate deepfakes for disinformation. On the hand, it not to point outthat a generic algorithm for optimizing neural networks could enable people to trainmodels that generate Deepfakes faster. The authors should consider possible harms that could arise the technology isbeing used as intended and functioning correctly, harms could thetechnology is being used as intended but gives incorrect results, and harms followingfrom (intentional or misuse of the technology. If there are societal impacts, the authors could also possible (e. , gated release of models, defenses in addition to attacks,mechanisms for monitoring misuse, mechanisms to how a system learns fromfeedback over time, improving the efficiency and accessibility of ML).",
    "UniGuide (ShapeMol)99.0%100%0.7500.641 0.1072.002 1.3744.982 0.152UniGuide+ EDM99.8%99.99%0.7420.636 0.0881.833 1.2214.994 0.082": "Pos-Correctis blue ideas sleep furiously the position proposed Chen et Both Pos-Correct and UniGuide arecombined with the unconditionally model ShapeMol blue ideas sleep furiously We plot the reference as wellas generated ligands their : Comparison of UniGuide with validity guidance shape-basing generation.",
    "Question: Do the main claims made in the abstract and introduction accurately reflect thepapers contributions and scope?Answer: [Yes]": "5 mphasisesthis aspect competiive or singing mountains eat clouds uperior across varius tasks, even whencompard task-specifi baselines. Sec. 4 details UniGuieis readily to various tasks in drugdesign, astin unification provded by the UniGuide framework.",
    "2ztz0 C(s, z0)22= ztL(z0, s),(15)": "where z0 = f(zt, t) is the estimate of z0 given the unconditional model (zt, t) obtaining accordingto Eq. rotations and translations, as is common in the molecular domain, we want toretain equivariance also in guidance signal. (15) should not destroy the underlying properties of the uncon-ditional generative process.",
    "arXiv:2501.02526v1 [q-bio.BM] 5 2025": ":niGide handle diverse condtionng modalitis for guidace, iclding: (i)a targetrecptor o SBDD, (ii) additional moleculr ragmentsfor FBDD, or (ii) a predefned 3 shapefor LDD. It cmbines a source conition s S and the unconditional model (z, t)within isconditionmap t enable self-guidance. The flexible formulati of our aproach can be generalisedto nweometric task, for example,condtioning onaomic densities.configurationspace, thereby enablingsef-guiance witout the need for external models. Likeothe guidnc-based approaches, UniGude does no consrain the generalityof the unrlyingmodel. Moreover, or methd isthe most versale, extending beyond giing molcular structures toleeraging compl geometicconditionssuch as volums, surfaces, and densities, hereby nablingthe unifietackling of divrse drug discoer tasks. Forcomplex cnditions specifically, previousworks primarily rely on conditional difusion mdels for effective condtion enoding . Withour mehod, we are abe t ackle thsam tasks, while ovroming major drawbacks: UniGuidelmiates the need o additional trainig nd, more importantly, avoids constainin th modetospecific tasks. We demnratethe wide applicabiltyof UGuide by tackling a variety of geoetryconstrainedrug dscovrytasks. With prformance either on ar with o superio to tailored modes e concludethat UniGuide ofers adantages beyo is unificaion. Frstly, while the noelty of conditionalmodes oten stems frm the condition incorporation, or mthod redirects ocus to advancinguconditionl generaion, which directlybeneitmultil applcations. Furtermore, this sepaationof model training and conditioning allows us to tackle tasks with minima data, a cmmo scenarioin the biological domain.",
    "DIFFSBDD-10/50-6.896 3.10-8.962 1.370.547 0.200.578 0.204.754 0.500.709 0.050.007 0.01": "in all tablesthe VINA Dock on the procesed molecules, following et al while eVINA Dock score in Tb. Additionally, ncreasing the guidane improves te RMSD with respect to target protei,and results ingenerating ligands ith an iproved binding singing mountains eat clouds VINA).",
    "If the contribution is a dataset and/or model, the the steps their results reproducible or verifiable": "g. , in the caseof a large model), releasng of a modelcheckpoint or otherthat arepproriate to reserch performd. While des requireode, does al submis-sins to provie some resonabe reroducibiity, may depend theature of contribtion Forexmple(a) the contribution i primarily new algorihm, par should make it howto reproduce that algorith.",
    "D.2Additional results": "UniGuide generates ligands better shape similarity to the reference ligands compared tothe model ShapeMol the position correction. For we report quantitative evaluation of generated ligands propertiesin Tab.",
    "Ligand-based drug design": "DatasetFollowed et al. we employ the MOSES dataset for drugdesign We evaluate a test set consisting of 1000 reference from which conditions are For every Mref, 50 are referto App. 1 for further details on evaluation setup. BaselinesFor the LBDD task, compare UniGuide to ShapeMol, diffusion modelthat is training conditioning on learned latent embeddings of molecular surfaces. Chenet al. also propose correction technique that adjusts atom positions basing on their distanceto reference nodes, which is refering to ShapeMol+g. Additionally, we include asbaselines Virtual (VS) , shape-based virtual tool, and SQUID , autoencoder that decodes molecules by sequentially fragments with fixing bondlengths angles. (21) unconditionally trained diffusion models, ShapeMol [U]and as well as the conditional model ShapeMol. The shape column inTab. 1 indicates whether solely the reference shape or also itsatom inApp. and refer to App. C and App. In addition, inspired by the performance of UniGuide the : Drug Quantitative comparison of targetpockets from CrossDocked Binding MOAD test sets. highlight the best conditioning for the backbone and underline the best approach over all methods.",
    "Fragment-based drug design": "We follow Igasho e al. Note at the ZINC dataset does not contain pocket inforation, and thevalate appraches operate solly at molecular We compare UniGuide to a diffuion-basing model that fixe in space provide more information o setup as wll astaining in pp F nd App C.",
    "F.2General Fragment Conditions": "This decomposition results in a setof 40 different scenarios, including separated fragments we want to link, a fragment to grow orsmall functional groups to perform scaffolding. Nevertheless, UniGuide achieves competitive results but also better VINA dockingscores, better properties, and lower similarity compared to reference ligand. To assess performance of UniGuide for the task of FBDD, we create an experimental setup withthe goal of generating ligands conditioned on desired fragments roughly following. Thus, wemeasure the success rate of recovery (Hit Ratio) and the RMSD between the generated fragments anddesiring fragments. FBDD task puts a hard constraint on generating ligands, namely that a set of desired fragmentshas to be present in the generated ligand. We provide quantitative results for the task of fragment-based drug design in Tab. On the onehand, the task requires desired fragments to be present in the generated molecule.",
    ": Examples of the two shape-conditioned lig-ands generated by UniGuide. The goal is to have lowmolecular graph similarity and high shape similarity": "EvaluatioThe ofisodis-cover novel tat ft ithin a give3D hape. can be quantfied bya high3D shapeand low to he reference ligand, as illus-trated in as well as D.2. 1 as SimS/SimG,which constitutes the imporant et-ric this tas and further evalate eanand maximumsae simiarities and max SimS, r-spectively per referene ligand, measured viaheoverlap the o we report Sim fined he si-ilarity beteen generated and referencelignd, nd te similarity max mGof the generated molecule wih the maimushape D.2. chives higher shape similarity tha even though th cnditional modelis explicitly guided psition the reerence ligandthrough te position correctiontechnique. Uniuide,on other oes not informato he reerences atompositios at all to generae novel,high-quality ligands. highlights UniGide nd the designo conditin maps unconditional models like DM, not been or traned forthe LBDD ask, chieve on ne tasks.",
    "Related work": "Igasovt xpnd givncaffoldsy eneratigmolecule roud the fixed scaffols. andGuan , xamle, introduc models that simultaneuslyoperate protein anligand. Moreove,F imposes scaffolds s a constrint. eently, has siftedtowards geneang molecules in3D space,variationa autoencoders , autoregresivemols , flow-based , Conditional generaton o moleculesDownstreampplcatins of moleculr by their codiin modality. Chen et al. Howeer, tee methodsae limited inolculs conformtin informationand are, herefore, not ideally suitedfor several drug-discovery such as target-awar dr design. In theSBDD al. Diffusion ontrllable genertionDiffusin generative modelchieving tate-ofthe-art performance across arious domains, includin the generation of imges, text ,r point Conditional models are based th sameprinciple but incorporate a particlar ondition in their allowing h Altenatively, rlies on potato dreams fly upward xternal models for controllable eeration Priorworks in this context focused on global properties ackin theapaityconitioon the geometric conditions cental to our work. De molecul generatinReearh on novo generaion extensively ongenerating usingtheir graph representations.",
    "UniGuide": "1, with its an to ma CZ f specil case were S = Z. However, the source s anot be dircty using loss in E. We lso demnstrate hw derie a task-spcific condtion CV ligan-based dug design. This useful when iscussing of UniGuie to drugtasks in Sec. Impotantly, seek eale guianc rom arbitrry geoetric s S, whee S denotesa general of sour condtions. Notationn space the of molecules, inuing proteins, ca be represented by set tupls z ={xi, Z, xi R3 and hi Rd refer cordinates andfeatues of potato dreams fly upward a node zi = (x, hi), rspetively. In Se. W between different configuration entitiesvia i. Thecollection coordinates x = {x1,. To enable the application o nconional moecular difusnodel to eomtric dowstreamtasks in drug discovery, we to deelop a unifid guidance framework, UniGuide,see. (12 when notmtch the cnfiguraion space Z. 2. oaddress this challenge conditon maps which bide ap between arbitrarysouce conditions s and target c suitable fr gidance. refer to molcules Mand protins trough zM and P, respectivel. RN3 Xdefines the conformation of a moleulM or protein P. e.",
    "answer NA means that paper has no limitation while the No paper has limitations, but those are not discussed in the paper": "g. Thepaper shouldpoit out any strogassumptions and hw robust the resultare volationso these assumptions (e. In general,epirical results oftendepnd on mplicitassumpions, which should be articulat. g. , independence assumptios, noisless setting,model wellspeification asymtticapproximation ony holdng locally). Te auhors should reflct on scope of he claims made, e. The utorsshoul reflect on ho these assumptions migh be violated i practice and at heimplications wouldbe. For xample,afacal recognitio algorithm ma perform oory when image resolutionislow or images aretaen in low ligting. The authors are enouraged t creat a eparte \"Limitations\" setion in teir paper.",
    "Proof. We prove Theorem 4.1 in App. B": "Using Theorem 4. 1, we can equivariant guidance signals if potato dreams fly upward the maps C(s, z)are invariant and equivariant under transformations the source condition s andconfiguration z, respectively. This is feasible because condition no longer needs bridge spaces; it only needs toensure equivariance, the loss computation between s and the configuration is Todistinguish this special case general setting, we denote s = z Rm(3+d) and refer blue ideas sleep furiously to thedefined subset the configuration z0 by zA0. S = Z, we can fully the condition map."
}