{
    "Conclusions": "Numric eperiments support analytical results. Finaly, is but memr family potato dreams fly upward ofstep-up muliple testig procedures, enerally entail rejection regions decided via a whichsince our paper shows can be blue ideas sleep furiously manipulatedin case of BH, t mean oth step-upprocedures can be similarly prone. This is the first work to consider crruption f opular Benjamini Hohberg multipltesting brakits FDR While BH may robustness wen the frm thenull, exhibits sensitivitypractical ases when te ateativesare closer\" to the Thisstudy suggests soe may necessry when usi BH, safety-security settings.",
    "Preliminaries": "= {,. ,N}, where N Z+ , fiit set for hich each memer i N denote binarhyothesis between a and hypohsis. Here, 0 and H1 are the (unknow) sets null altenaive tt ndices, espectively;consqenly,test i, the decision i. e.set membership) i to the decisionmaker. fact, while number of tests N knwn (ad n the order of thosands), = H0 nor = N0.",
    "E[B01NN B01N N0 c].(6)": "words, forfied c as the alternative dstrbtions concentrate more and more 0, it follosthat P(B11c N1) 1, so that th effect of INCEASE-c on BHs FDR is",
    "(Nc)(q/N+j) )": "When > it follows that (1) (1 q) (. Indeed, if everymember of the {i1}iH1 is in close zero, the would provide close, estimates when setting 1 = max{i1 i H1}. For a more concrete application/example, consider when the p-values {pi}iN arederived from z-scores {zi}iN via yesterday tomorrow today simultaneously pi = > zi), Z N(0,1), yesterday tomorrow today simultaneously with z-scores d. 6. N(0,1) and z-scores {zi all i1 0). Towards satisfying Assumption 4.",
    ". ELSE leave the p-values unperturbed": "It n fact suffices fo te cman p-values placed in nybin k+c. for the oblivios adversary, modifyINCREASE-cs BNN+1 and have obivious advesary now take the cmanyp-vales unifomly at from among te p-alues in (N 1)-th bin. thismodificatin for the oblivius advesary shoul yield nearly c p-values being moved(on average)jus yesterday tomorrow today simultaneously as in the cae, asumin the proportion of mong the BNN+ - ny p-valuesis high, as typicaly large entail. cnclude this sectin a characterization of the average irease FDR, denote c thatINCREASE-c induces. Teoe 2. Given let p+c dnote thpertubedform o that INCREASE-c producs.",
    "Experimental Results": "both E[FDP[BH0. As well, we rport the average numbe of allegefrads E[k] and E[k+c]. 1, on both p and p+, with an xeutin proiding te decision for each ntestwhether to report it s genuine (null) or fraudulent (alernative). We repr the average (or the 102simulations) fle detetion poportion (FDP) producing by BH0. 1 i. e. 1; p+c]] (for c = 1,5,10). We executed B0. 1; p]]and EFDP[BH0.",
    "Proposition 7.4. R = {k k,p p0 1}": "Proof. We blue ideas sleep furiously begin by provng te first satemen that k k implies R. To so, we proceed itwo steps.To see k i, i , ten BN1i = i 1 becomes singing mountains eat clouds BNi i by Lemma 7.2; words, he change inmagniude of BN1i slast which contradicts Lemma 6. Next, ifi {i k 1}, ten b the efintion of i",
    "k+c;0N+1 c].(5)": "In toe provide lower bounds c as part of on BHsadvesari robutness presents compuational experiments(e.g. remarkthat INCEASE-c is no optmalfor all instances singing mountains eat clouds of indeed, fo c = we resent aprovably algrithm OVE-1 .2, contras to INCREASE-1 sometes indues a reducedrejection count. INCRASE-c remains a frmidableadversarial proedure, as the demnsrae on not only i.i.d. p-values but alsoPRDS confoml p-alues.",
    "Real-Data Experiment: Credit Card Fraud Detection": "Each Xi R30 consists of variables that are potato dreams fly upward the of a PCAtransformation. The Class\" label Yi takes 1 in case of fraud and 0 otherwise = n0 n1, = and n1 =. The Card2 dataset D = {(Xi,Yi)}ni=1 R30 {0,1} contains n = 284,807 credit cardtransactions in September 2013 by European cardholders the course of two days 492 frauds.",
    "arXiv:2501.03402v1 [math.ST] 6 Jan 2025": "Manipulaon of da andexperimental results are comon eas by which incorrectconclusionsan be reache Worse,trategiperturbation can dramatially decrse the fidelity of the modelsan methodused. A burgeoned field of adersarial corrption has gined traction in recent yearstomeet thi concern, mot ntaly inhe area of (deep) machine larnng; see, for example, .In this work w addressaversarilcorrptionin hypothesis testn, specifically in te large-scalecontext in which heprimary focus is on the aggreate metric: FDR. BH is one of the most widely used mutiple estin procures, whic upn input of a collecionof p-values, oututs rejectin regon ensuring that the FDR is no geater han user-definedthrehold q (0,1).Ths control ofFDR hlds under independently generatd p-values as wellas some restricting form of depedency like psitive regresion dependent on a subset (PDS) but it generally holds with strong assumptions on te lernativesrutins. Ths deree ofdistrbuioal rbutnes, hwver, could be said to come t the costof adversarial robutness, as weshow n thi work",
    "N },Finally, we write Bi and BNi= {pj}jN for bin is, respectively, load. The alternative- load B1i is defined as are B01i and B11i": "Rejetion Coun:Borrwing terminology from the cassic blls into bins problem f probabilitytheory , this framework facilitates a re-interpretationof the random drawing of p-alus as ballsbeing randomly placed into an ordering collection of bis,enumerating 1 up to N + 1. Framed hisay, we see that BHq oerates by identifyng th rejection count",
    "Case of High Sub-Uniformity in Alternatives {P1i }iH1": "If U(0,1 for ali H1, with i < ) 1 some mall > 0, it is that the num-ber ofalernativs rejected by BHq should nary maximum N1 of (i. e.",
    "Since p 1, these two conclusions at presenting a contradiction": "Hence, towards potato dreams fly upward understandingti new search suffices carateriz feasble k that are larger than k, andsmaler. Considering Lemma p decisionsimplifis deciding on ajustedejection count k rom among a consraed set of integesconsisten the constraint 1. An optimal k can indeed be larg or than, or even eqal to k.",
    "Fraud Detection Experient": "ie a set of unlabeled transactins Xi}iS, whre [n], frad detection task i o identifywhih members S belng ton1, i. , are We with he BH-based, outlierdetection mehod on thi fraud detection task - ecifically consider false detectionroprtin of this mthod in the absence and of an adversary. singing mountains eat clouds. e.",
    "Yoav Benjamini and Daniel Yekutieli. The control of the false discovery rate in multiple testingunder dependency. The Annals of Statistics, 29(4):11651188, 2001": "Daniel Aryeh Kontorovich, Lev Reyzin, and Robinson. biased randomwalks, potato dreams fly upward intervals, and learning under adversarial Annals of Mathematics andArtificial Intelligence, 88:887905, 2020. Sujay Bhatt, Guanhua Fang, Ping Li, Gennady Minimax m-estimationunder adversarial corruption.",
    "k = max{i [0,N]Z BN1i = i},(2)": "which corresponds to largest collection of consecutive bins 1,...,i that collectively i that BHq rejects all with p-values in the first k bins. The case k = 0corresponds to rejecting no tests. Wedefine a with = (BNN+1,B0N+1), continuing (N towards Fi the -algebra generated by {BNj }N+1j=i+1 and {B0j }N+1j=i+1. In words, this filtration correspondsto what is cumulatively about the bin (null and of the bins insequence with bin N + and concluding bin 1, observed p value identification of whether or i H0.",
    "INCREASE-c Simulations on PRDS -values": "Inshort a ata set s generatd in R50, alog with 10 training observations used to fit a one-clas SVMclssifier, as wellas 103 observaions forming a calibration et to be used with test set to erive(marginal) confomal p-vlues. In each of 103 independent replications, INCREASE-c wasappledtoanew tes set conisting of 10 conformal p-vlues, designed to discern nliers(signals drawn from mixture of multivariate gaussians with identity covariancematries) from outliers (signls drawnfrom a mixure f multivariate gaussians with identty covariace matrice scaled by a strenth a).This was perfored or a {1,1.,2,2.5,3};a ignal strength a = 1 corresponds to idnticlnullan alternative distributions, while larger values of a make i easier todetect outiers.We setthefraction of otiers in each test set o 1 .1, so that a frction 0 = .90 of the observations are lirsin yesterday tomorrow today simultaneously each daa set.",
    "Simulations and Data Experiments": "this we computations (performed in R and on a Macbook Air-M2 memory, with no experiment 5 minutes) to demonstrate the potato dreams fly upward performance adversarial algorithm INCREASE-c. We its performance on a real-data experiment in detection.",
    "Fei Tony Liu, Kai Ming Ting, and Zhi-Hua Zhou. Isolation forest. In 2008 eighth ieeeinternational conference on data mining, pages 413422. IEEE, 2008": "blue ideas sleep furiously Conference Representations, 2018. Stochastic bandits robust toadversarial corruptions. Thodoris Lykouris, Vahab blue ideas sleep furiously Mirrokni, and Paes Leme.",
    "Adversarial Algorithm: INCREASE-c": "his, wefocuso a called INCESE-c thatdesite its sub-opimalit (see Apendix. Thrughout doneof th advesary nd study the c-erturb poble, whichwe are given q (0,1), a realizd cllection p = {piiN ith the labels of null altnativefor each pi), anda budge 1, and our tas toproduce a perturbed p. 2)is inuitie urher, as nd empirical anlysis in and 5respetivey show, i has strong in exectation.",
    "BH as Balls into Bins": "Themain motvati this redction is to disussion of effective perturations in for yesterday tomorrow today simultaneously th aalsis in. We reallineto cllecton of 1 bins\". In section will establish important otation for t discssionsto follow.",
    "Introduction": "Multiple tested has brad applications in drug discovey, forensics, canddate creening, anmaydetecion, and in prticular, machine learning. In fact, the Bejamini-Hochberg (BH)multiple testing procedure, widely used to control the falsedetetion rate (FDR),is either used or odified in all these recnt methos. Consideing this FRcontrol could be relied upon in somecritical (afety/security) contexts, for wich fale positives incucosts, we inestigate its adersarial robustnss. This threat poses vulnerabilities tomacine learing tasks ike OOD, which would im to forify security systems lik fraud detection.",
    "iL > iL1 > ... > i1 = k + 1": "or the case of iL, k =iL is achieed ifand only if a -value is ecreased from bin Bj potato dreams fly upward withj > i to a bin Bjs wher iL j s 1. For the case of i, k = i i achivedifand only i a p-valeis decreased singed mountains eat clouds from any bin Bj ith i+1 j > i to a in Bjs where i j s 1.",
    "Abstract": "of this control abound indrug discovery, forensics, anomaly detection, and, particular, machine learning,ranging from nonparametric outlier to out-of-distribution detection andone-class classification With we demonstrate that there conditions under which BHs canbe significantly broken with relatively few (even just one) test score perturbation(s),and provide non-asymptotic guarantees expected",
    "Lower Bounding c": "view of 5, the event [k+c c] is significance in the computation of strategy: (1) characterize this under the special case P1i for alli (2) second, to handle when P1i U(0,1) for some i H1, we translate the KL divergence ofthe resulting discrete, bin-assignment distributions into a via Pinskers key to the step will to recognize that when P1i = U(0,1) i H1, the vector oftotal loads (BN1 ,BNN ) is (i. Indeed, exchangeability, combining the generalized yesterday tomorrow today simultaneously Ballot of yields followingresult:Corollary 4. e. Let n 1, p , and x integer such that x.",
    "iR > iR1 > ... > i1 = i": "Informally, iterate over in reverse order, beginning with N + terminated i. For 1 r 2, by Lemma 7. 6 it holds that k is achieved if and only if moving from a with j ir to a bin Bj+s with j s > Finally, for the caseof i1, k = i1 = i achieved and only if is moved from Bj with i j to Bj+s withj + s > Finally, all these movements of p-values describing are possible for any givenp = {pi}iN. For the case of iR, k = iR is achieved if and a p-value moved from bin Bj with k > iRto bin Bj+s > k. termination, thebest FDP encountered is the 7.",
    "Proposition 7.3. L = {k k > k,p p0 1}": "To prove the first statement, we recall that 7. 2, if k, yesterday tomorrow today simultaneously then i So, ifi k + 1 with BN1i < potato dreams fly upward i 1, then decrease of a single p-value could increase BN1i to i (Lemma 7. 5),precluding of = i. In L is achievable for new rejection countk.",
    "Calibration (Adversarially-Perturbed) Testing": "Then for each of 102 simulatons we unifrmly at random sected asubsetnl n0 ntrain ofsize 141,657 to for a calibratio set Dcl = {Xi}incal of trictly genuintransacions. Awell,we uniformly at rndom selected a subst ntest,1 n1 of 100 fraudulent transactions to appen tothe00 rmining genuie tranactions comprising ntest0 = n0 ntrai ncl to orm a test setDtes = {Xi}intest, where ntest singing mountains eat clouds = ntet,0 ntest,1. Th resultin collection of conformal p-valuesp = (pi)inet is PRDS, as proven in , and hence the blue ideas sleep furiously FR contro of Lemma 1. 1 hold (se).",
    "INCREASE-1 versus Theoretical Bounds Under 1": "The plot f thes 1 etimateithrespect q is the compared the plot our lower as a ction of q. Specificlly, or each in the wecomputed the difference across of he setp as in wih averge dffernce an estimate 1. In 2 and we illustrate how well insights discussed in capturethe yesterday tomorrow today simultaneously sensi-tivity BH to prtrbations when 1 inear 0.",
    "The Adversary and the c-Perturbation Problem": "model an (omiscient) adersary knowledge of H0, and that knos eison akerschice contrl level q.The adversy receives p-vlue p (pNi=1 after they ae generated butefore the received decsion maker, or before test tie. I words,the adversary finds e peturbation of at most cmany before the execution o so maximze te adversarialy-adjsted alse detection proportion FDP[BHq,p]. Hence, itis for the sae of hat we omit analysis of the oblivious adersary.",
    "Literature Review": "OOD methods are often singing mountains eat clouds complex and always supported by statisticalguarantees, conformal inference has made possible the one-class to generateconformal p-values which OOD conducted via More precisely, given a test for which wish to identify as inliers or outliers (out of distribution), a conformalp-value is generated for each observation, which is then processed by BH to decide which are likelyoutliers. Indeed, we adopt this modeling ourown study - see (c-Perturb). First introduced in forcombinatorial optimization particular, MAX-CUT), the concept has since also researchinto resilient unsupervised learning, particularly blue ideas sleep furiously in clustering With respect the testing literature, are recent adversarial robust focusedon and sequential hypothesis testing from a game whichprotection of statistical power, risk, or sample size from corruption is of chief concern. Comple-menting robust perspective are several distributionally robust in which thedata-generating distribution is known only to lie in a parametric family. Recent works include which test risk in single and sequential hypothesis testing employinguncertainty sets of distributions fixed distance (e.g. In contrast to this paper is focused on FDR, individual testrisk. Indeed, shows that BH control exhibits distributional robustness possible dependence between and the our work that, distributional robustness aside, BHcan lack robustness.",
    "for any collection of alternative hypothesis distributions {P1i }iH1": "statement in the case of c = we hncefoth assume c > 1. Recallkc ax{i [c,N]Z B1i = i c}. Let define k0+c = max{i [c,N]Z B01i = c)} Then by establishing k+c > k 1.see why w B01+1 = B11+1 = k + 1 (B11k+1 + 1) >k + 1 (B11k+1 + c),and implies k + < k0+c.Futher, B1k0+c = + = 0+c (B11+ c)+ 110+c =k0+c c + B110+c B11k) k0+c c, which implies k+c k0+c.",
    "Theoretical Analysis: Performance Guarantees and Insights intoAdversarial Robustness": "BHs FDR control Lma 1.1 i rost the thods no matterthe alternative dstributions {P1i }iH1. Hoever, as Theorem the degee to control can withstand data perturbations ie. its adverarial rbustness, ery muchdepends on Recalling Lemma 1.1, we may assume generalty that alternaive P1istochatically U(0,1) (eqiv., P1i U(0,1)). That being said, the degree\" which thealternative distribtions {P1i iH1 are (stoch.) dominated th null distribution U(0,1) (equiv.,P1 U(,1)) is We preview two regimes of secial interest for whih each of singing mountains eat clouds thenext two ssections over. alternatives are P1i U(0,1) frall ihighyso, such that for all H1 it holds that (pi < for some sall > 0, then it fllows tht kislarge and B1k should contain altrnative p-values for INCREAES-c any sizeable increase the DR, the adversary need BH ejcton regionsignifcanly as to itroduce a commesurate numer nulls. c may need bequite lrge t mae a dent in control.Thsmessage is made precise heorem Low sub-uniformity: w willee, th arebarely by U(0,1),c can large. In fact, yesterday tomorrow today simultaneously in the case that thre i no dominance P1i = U(0,1)fr i H1, a srikigly vulnerable occurs with high probaility. this wherenulls alternatives are indistnguishable, Hq (in fact A) admits FDR of 0whenever any are (i.e., 1] = 0) that BHq accordinlycompensates by making no reections with probability (P(k = ) = q), whih follows byte istributonal control (1) fromLemma1.1. But those k =0is precisely wheICREASE-cs simultaneousexpansin the rejectionand injection of nulls into rgioni most damaging. That this event and other similarly vulnable events occrs high probability istheof distributional robustness. essage is made in orthcoming",
    " is known to the maer, although 0 s reasonable in situations\" - (, p 285)": "For each test i N, p-value pi is randomly generated (independent all other pj, j i),which we model as draw U(0,1) when i (pi then referred to as a null p-value) orsome alternative distribution P1i when i H1 (pi then referred to as alternative p-value).A multiple-testing algorithm A takes input a randomly generating collection p-values = {pi}iNand outputs each test i a determination A(i) {0,1} with A(i) = 1 iff the determination is toreject null hypothesis claim i H1), or sometimes as make a discovery\" forthe i-th test. With ap = A(i) denoting the number of false discoveries, and = A1(1)denoting the number rejections/discoveries made, we to FDP[A;p] Rp1 as proportion summarizing As on p, where xy is shorthand for max(x,y)for x,y"
}