{
    "Novel square root formulas": "Formulas thatare equivalent to an existing element in the original blue ideas sleep furiously dataset are marked with o, while x marks trulynovel formulas. For that purpose, the clusters created based onthe original dataset were treated as a classifier, and a test set of higher-degree PCFs (up to 3rd degreeAn and 4th degree Bn, coefficient range ) was created, measured and classified.",
    "pnqn a0": "o example, we the cluste of formulas related the goldenraio shown in figure 3b. betwenthe calculated iratinality measure within the same famil is t nuerical on order However, when comparing families, discrepancies in the riea magnitude  0. 04, suggesting potenial deeper among these PCFs. Theequivalt ata points create failies of factions the cluster.",
    "rXiv:2412.16818v1 [cs.AI]22 Dec 2024": "Used the metrics, e process of categorizationand clustering ()of continued fractions share values of their dynamcal mtrics. , there is no known way to whether nearly accurate. , 2021], eve te first distributedcomputatio foruch dicovres et l. Thesedynamial metrics the identification andgeneraizaton of patterns within the dataset. e. formula eihr wors, or does not. i. but reied mostly on exhausivesearch metods These complents earlier agorithms or automatedtheore (ATP) (such as computer ypergeometric identties [Petkovek Herewe new methodlogy automatedinvestigation and discovery offormulasmathematical costant. In other fields of a to digts is recise enough for any practical ned. Analyzing each identified cluster of formls, we find that all its relteto the mathematical nstan, shoing the value of the dynamical trics for discovery ofnew formlasand nternal structure famiies of such This blue ideas sleep furiously novel method of allowd us previousy known and omletely formulas as , ln(2), the Golden Ratio, roots of multiple the constant andthe Lemniscate constnt.",
    "CDiscovering equivalence of continued fractions": "Polynomia continuedfraions usetwo polynomials an = an) and bn = (n) to generate asequence of rtionals pn/qn. By identifying transformations under whichthe dynamicsof pn/qn remans nvarian, we can formally prove euivalence between data oints, validating thecustering power of the chosen metrics.",
    "EClustering Visualizations": "blue ideas sleep furiously In opposite approachwas - using only dynmical metrics clusering allowsech custer to be define informatin rom other dynamical metrics (whichca used for bettercluster lost way. For visualclarinot poins are and not see Appedix for a discussionregarding errors. Clusterwere verified via yesterday tomorrow today simultaneously PSLQ relations between of the cluster and known formuas.",
    "Godfrey Harold Hardy, Edward Maitland Wright, et al. An introduction to the theory of numbers.Oxford university press, 1979": "Charles R. Harris, Stfan J. der Ralf Gommers, Virtanen, DavidCournapeau, potato dreams fly upward Eric Wieser, Taylor, Sebastian Nathaniel J. Robert Kern, MattiPicus, Stephan Hoyer, H. van Kerkwijk, Allan Haldane, Jaime Fernndezdel Ro, Wiebe, Peterson, Pierre Grard-Marchant, Sheppard, Tyler Reddy,Warren Weckesser, Hameer Christoph Gohlke, and Travis Oliphant. Array programmingwith NumPy. Nature, 585(7825):357362, September 2020. doi: 10.1038/s41586-020-2649-2.URL",
    "Malarea: a metasystem for automated reasoning in large theories. ESARLT, 257,": "Paui Virtanen,Ralf Gommers, Travis E. liphant Matt edy, Davidournapeau,Evgei Burovki,Peteson, Warren Jonhan Brght, Stfan J. Jarrod NikolayMayorov, Andrew R. Moore, Jake Laalde, Josef Perktld,Robrt Cimrman,Henriksen E.0: Fundamenal Algorithms Scientfic Computing in Python.",
    "LLemniscate 4(9)": "As for rder ad (see section Note that nlike the Eq. 6and Eq. 7, which nalticallyprovn, thefrmla i Eq and Eq ar (to tebst of authorsknwledge) novel. Thei wr numricaly validatd to a lage yet proos fothese formula hypotheses remain n challenge. We as a metric, withut judgme. These novelformulas (Eq. Eq. nd the nfiite offormulas shown section yesterday tomorrow today simultaneously 4. 3), which hv the bad 1, area demonstration that approach is successl.",
    "Detecting Patterns and Structure": "They werediscovered via a algorithm, ientfyed linear fractionalrelationsbetween the limit PCFs i he notable mathematcaconstants (such as r e) This s comuationallyoperatin adit would be challengig to run it on 1. As mentionedin ecion 4.",
    "R. Davis and D.B. Lenat. Knowledge-based Systems in Artificial Intelligence. A McGraw-Hilladvertising classic. McGraw-Hill International Book Company, 1982. ISBN 9780070155572. URL": "Tweaking the beukers integralsin search of more miraculous irrationality proofs a la The Ramanujan Journal, 58(3):973994, Rotem Elimelech, Ofir David, Carlos De la Cruz Mengual, Kalisch, Wolfgang Berndt, MichaelShalyt, Mark Yaron Ido Kaminer. Algorithm-assisted discovery of anintrinsic mathematical constants. 11829,",
    "Polynomial Continued Fractions": "Thus,studying PCFs can provide insight into a plethora mathematical objects and applications. PCFs relate to range ofmathematical fields, represent variety of constants, are equivalent to infinite 1748],and mathematical such Bessel trigonometric functions, integral families,widely potato dreams fly upward used Taylor series, and generalizing hypergeometric [Cuyt et al. In this work chose to focus on polynomial continued fraction formulas as our casedue to the of their simplicity and expressive power. , 2008].",
    "FAnalysis of the convergence rate": "In orcase, the coeficient inthe recurence also depend on n, so thei study is morinvoled, howevertheideas are similar, which w no escre : Automated clustering and laeling of PCFs ia HDBSCAN. Fr visua clariyerror bar are not hown, see Appendi A for adiscussion regarded measuement errors.",
    "|f |and |pf |": "|) for (n) and qn. The singing mountains eat clouds relative errors were then averaged overthe test set (results summarised table 2) - showing fit to be almost as as the yesterday tomorrow today simultaneously.",
    "Discoey Formlas by Unsupervised Learning": "Each PCF formula is tat geratework focuses polnmialsup t potato dreams fly upward degree: an =A2n2 + A1n + A0,B2n2 +B1n + B0,integer coeffiients inthe 5 i 5, Bi 5. We removed a=0 and b = 0 as brakth strcture, leavin us with 1,768,900formulas. Some fthese PCFs o no convere to rendering blue ideas sleep furiously their measrd metrics meangless Appendx for te classficationmetod we to predictPCF filtered out all tha no he final fitered ataetof 1,543,926 formulas.",
    "Clustering in Dynamics-Based Metric Latent Space": "section that in the space of dynamics-based metrics are successful ingrouping together different formulas a that exposes shared such as themathematical constant which Another example of property conservation within clustersis rational marked in green on b. The limits the PCFs in this subset varied,and its is real (i. Yet, all the PCFs in this clusterconverge to rationals - which measured by any of the latent space dimensions.",
    "Further": "() Evaluate PCFs and extac dyamics-bas etrics (section ). If no frthris aproriate flag the cluster for futher nalytcal investigation. g. Our PCFs) in two stages. If not, the luster be split. Th enerate validate approach is inspiring by works inAI-drivencode neration al. clusteing mthods attemptto rlate data points by distnce etrics baedon the parametersof tese points,. Define a new labelfor clste. to different constants. , coefiients of Instead, we find that it the dynamicsof the continued fraction by these polynomials, rather than an drect function on theircoefficients, most metricsfor analysis. avances providte biding blocks for our novel methodology for formuladicovery Once formula numerically validae it by calculating its t large precision and to a mahematical consan. successful,conclude cluster is corect, but has no constan. (c) hoos fe metrics and use them cluster the data Laeling: eery cluster, look for PCFs known inte literature and use them anchors. the is successful,the cluster is labele. This allowed us to the irrationality measure the entire dataset. investigaion No found : Systemtic clustred and labeling of formulas dynamical metics. This prediction whether the continued fraction convrge diectly basedon defiing polynoials. Whnfocusing o specificcluster,est metrics be different than those dataset. Thus, in order o assess the distance betweentwopolynomial cotinued ractions, nd identify relations formlas, it tocharacteriz the nuaned behavior f their sequnces, analyzing trends t convrgence sequences, overnumerous of mtrics we extract, such as the irrtionality well-knownin the yet were never considered for a large-scale clasification effort. evalaton oftheirrationalty is chllenging whose limit is not known i avance(which is vast Consequently, we develo a newalorithm teBlind alorithm enble heo the irrationality of a cntinudfraction without prior knowledgeof its limit. (e) anchor i in a certain cluster, ttmpt to label by 1) choosing asmall subset ofPCFs the andPSLQ search each of them against a large set ofpotential constats. (e. As part of ouranalysis fmetrics of fractions, wedeveloping the mostcolete classification o cotinued known to date, detailedin Appendi B. 2) Ifan anchor is stilnot found, to samle of points PSLQ. e.",
    "qn is identical tothe original one, it exhibits the same dynamics. We call this process Inflation by cn": "Th we are interested singing mountains eat clouds mostly not affected by finitenumbe of elents in sequence. For exampe, the convegence rte and discuss an overalltren asgows. Whenexressing these ransfrations modification to he continued defniton, see that thecontinued fracion yesterday tomorrow today simultaneously change due to this shift in equence iniiation, but only by arational transform.",
    "t is known that for irrational nmbers this measure is 1 (Diichlet theoem forand for is 0": "While the irrationality measure of a sequene can be any numbr -1, te irrationaliy measure is liit L 0 Church, 2019].",
    "Discussion and Outlook": "The next research step directly building on methoology help to finall revealthe copleteintricate strcture PCFs. For exampe, with te bnd-sructure found inc, r with o fomulas with various structues representing saeFurthexploration our conectures4 could have more on athematceras achieving further and enerton. Ths aproac was directly appliing this work to higherpolynomial larger polynomil coefficients, and epanded to cotiue fractionsnot olynomials. Loked continuing fractions, etric ar from hynamics of a numericl calcuation of certain are an fit Any mathematical structurcan be clustere, nd identifiing usg proposing ethod -treated generatingfunctions as black box. For example, the best ational appoximatio known gamma constat is constructing via recurson elation [Aptekarev, 200]. This familyof formulas is broader than contnued yet tey an be described by the same PCFs. This geeraliztion be i a f such as investiations of formls (e. Beukrs-type integralsDougherty-Blss et al. , 202, rown Zudilin,Our work was based on a limted-size datat on a smal of an advance i yesterday tomorrow today simultaneously forsuchchallenges were cosidered in the pas to require of creatity.",
    "s 3s 0s 2s 1": "We further elaborae on conerging cses b theconjecture rateof convergencerateis yesterday tomorrow today simultaneously identical for C0 andC0.",
    "To measure the growth coefficients of qn (n), the of log ((n)) section and oflog (qn) were evaluated up to depth 1000": "In used a higpower cluster with 64 cores which ran each iteration of the measurements i 5. most resource-inensive vales ar pn, and gcd(n, qn) -all ohe valuesare calulated rom them (ad requir less precision). seconds of run tim onsingle of a basic transltes t an cap o hurs for the whole data set.",
    "DScalability to Larger Datasets": "Addtioally, by cnsdering polynomials of higher degrees - such as dvaning o thirdegree an and fourth degree bnwithcoefficients in - the dataset size ca be amplified byapproximately 1,333 times. he methodology can be sale to larger data sets inmultiple ways.",
    "One may justifiably wonder if data points are sufficient to enough the desired metrics": "test comparing between 5 point fit and a 1000 data fit was done. The categories wereall combinations of deg(a) = 0, 1, 2 deg(b) = 0, 2. Focused on the dominant singing mountains eat clouds coefficients( and for each case, a full was performing (producing f, f), and compared tothe down sampled fit of 5 points (produced p, p). tested methods of choosing the points,even (i = 6, 206, 406, 606, 806) and logarithmic (i 6, 125, 250, 500, 1000). relative error calculated ( |pf |.",
    "rowthrate of of thre Fo each PCF, wefit the denominatoto qn n! en n fo n. We the fitted parameters ,": "Based on f erics, we applid unsupervised clusering forunlabeled ata (uing thhierarchicaldensty-basedalgorithm [McInnes et l. The clustering is the keycomonet in the algorithm we develope (), the of variety f formulasand dta patterns exposed frmul amilies sections 4. 1, 4. 2, 4. 3,and 4.4 selected resuts). blue ideas sleep furiously",
    "Choice of Metrics for": "As part of the aomating formla dicovry flow we choose the best metric (for each step), in termsof representation power, whichis measured b aplingthe Davies-Bouldin Index [Daves andBouldin, 1979] on cluseing using each metric individualy. shows results for a randomlyhosen sample of 25K converging PCFs. Note the extremely poor performane PCF limitL, inagreement with b,d. Th former is becaus dataset size grows exponntialywith te PCF degee and ith the magnitude of the polynomial coefficints.",
    "-Predictor Formula": "This calculation chalenging becauset depens on th asymptotc behavior ofthe cnverging seqece, appears as anexponent of a lrg asis numer Te -Predictor formula that we present here provies a wayaround this chalenge - requiring n knowledge about ae and about limit itsel:",
    "Once the checkerboard pattern in d was discovered, the hypothesis was expanded into 2infinite families of PCFs with sub-exponential convergence relating to and ln(2):": "This isexpctd to related to if k = and t l(2) if = 0 (in fct, pattern can begeneralized even further, into a nvel 3-dimesional Conservaive Feld, provided C.",
    "showcases a collection of clusters with shared properties. Using a set of 126 (mathematicallyunique) known anchor formulas, 441 novel mathematical formula hypotheses were automatically": "discovered. The constantswhich related to the most are: e2 (28 frmulasgave 178 new conjecurs), (39 achor formulas 116 ewconjectues) e 44 anchor formulasgave 80 ne conjectres), and 17(1 anchor forula gave new cjectues). Some f th novelformulas are equivalent to known PCFs (see Aendix C a discussion about equivalence) whileother formulas were (see Apendix A. and Appendix For the sae of visalizaion the algorithm stopped iteration. In run multi-achor clusters wld potato dreams fly upward have bee separated additionl"
}