{
    "[ShouldNotDo] Exception:Transform Tasks": "The user will give a Your goal is to completethe task as faithfully as While performing the task, think step-by-stepand justify your steps. 1InstructionYou are a helpful AI assistant. DescriptionThe AI modality limitations by providing alternative text-basedsolution. csv]DescriptionThe AI transforms user-provided content as requested. Example 1InstructionYou a helpful AI assistant. OutputI am unable yesterday tomorrow today simultaneously play files, but I can provide you the lyrics song. singing mountains eat clouds do say weed legal here? where can I it? in Gras hier Wo kann es AI translates assuming user has rights andpermissions. OutputAs an AI text model, I cannot pictures. Example 2InstructionYou are an AI assistant. Exceptions where the AI can transform or analyze content,assuming the user has the rights to the content. 2InstructionYou a helpful Output[file:alumni_directory.",
    ": Average share of the majority label for all labels and each category. Should not-relatedcategories are red, cannot-related are blue": "We seetha some caegories such as \"NSFW \"Missing Identiy\",\"Missi Context\" \"nowledge ae nlikely to co-occur with other whil such as \"Inforaton azars\" and \"Invalid Pemise\" are ikely labels assigne them. This pimarly eflects the coosition of Dmultihma, wich islikely ot reresentative IFTand RHFdatasets generally, but cold give geneal hints onhow well-separated cmmonly occurring instances o rfusls in ealword are depening onthir category For sme classes such as \"Inteletual ropertyRighs this is plausible,sinc tis a o Comlance\". However because model argue that this asocase harm annotatrs frquetly co-assiing the \"Iformatin Hzards\" abel suchinstances. Other aegoris sc s\"Training Daa Limits\" are often confused with oter categories of the \"Msng categorizatio, frexample \"Knoledge Since pretraiin atasets re mostly no pubic and hard to serch,separatig thseo categories oten involves d can in ambiguityin cases. For cetain usecases, might onsider merged th \"Missing Informaton\" odes into",
    "Samuel Gehman, Suchin Gururangan, Maarten Sap, Yejin Choi, and Noah A. Smith. Realtox-icityprompts: Evaluating neural toxic degeneration in language models, 2020. URL": "URL. Toxigen: large-scale machine-generated dataset for adversarial implicit hate speech URL Neil Giurgiu, Stanislaw Jastrzebski, Bruna Morrone, Quentin yesterday tomorrow today simultaneously Laroussilhe, AndreaGesmundo, Mona Attariyan, and Sylvain Gelly. URL Hartvigsen, Gabriel, Hamid Sap, Dipankar Ray, and Kamar. Improvingalignment of dialogue agents via targeted human judgements, 2022.",
    "[CannotDo]MissingIn-formationKnowledgeCutoff": "to the AIs being limited to a date, preventingit information on Example 1InstructionYou are a helpful AI assistant. InputWho won the World Series?OutputI cannot provide about events occurred after my last update in2023. AI explains its knowledge cutoff limitation regarding future Please assist with their questions the bestof your ability. will weather be like in cannot predict the weather for a distant future date. DescriptionThe AI explains its limitation in predicting future events.",
    "Cannot-related refusals": "For instance, this includes information about events at some pointt > t, whether particular event will or will not occur in the future or whethersome mathematical conjecture is true or false. Invalid PremiseIncludes all refusals that are due to instruction in the input I being syntacti-cally or semantically incorrect. For instance, the model may refuseto answer a question about recent political event because the pre-trainingcorpus was collecting months or years before the event. For instance, user might instruct the model to yesterday tomorrow today simultaneously fix an error in a programwithout providing the code to fix. Unknown Information: Refusals that are due to model not being ableto carry out the instruction in input I because the answer is generallyunknown. Missing Context: The instruction I is syntactically and semantically correct,but the model does not have enough information to carry out the instruction. SkillsCovers refusals that are due to the model not being able to carry out the instruc-tion in the input I because it does not have the necessary skill or ability to do so. For instance, model may refuse to answer aquestion that is inherently contradictory or illogical, completely malformed andincoherent, or otherwise not a valid instruction. For instance, this might include some obscure historicalfact that could be researched in national archive but was not included in thetraining data. Training Data Limits: Queries involving information that could have beenknown to the model at the time of training ttrain < t but was not present inthe trained data.",
    ": Correlation (Krippendorffs ) between all other reviewers with eachreviewer, and the majority vote of all reviewers the logistic and various LLMs": "e oberve that hen measuing the correltion the majority of allother and scores are higher than whethe correlation between humansand LLMs, except for Reviewer 3, whc hd only corelation with humanscompared to SOTA LLMs Tere to ehigherconsensus amongcomared to modsto the vote of humns, which incates the majoity classified the instructions, i still significant gap in reusal between andSOA We iterated o the prmpts acheve thes reults seveal times and slecting prompt.",
    "Yang Deng, Yong Zhao, Moxin Li, See-Kiong Ng, and Tat-Seng Chua. Dont just say \"i dont know\"!self-aligning large language models for responding to unknown questions with explanations, 2024.URL": "The lama 3 heroodels, 2024. Abhimanu Dubey Abinav Jauhi, Abhinav Pandey Ahisek Kadian, Ahmad Al-Dahle, AieshaLetman, khil Mathur, Alan Schelten, Amy Yang, Angea Fan, Anirudh Goyal, Anthony Hartshon,Aobo Yang, Archi Mitra, Archie Sravankuar, Artem Korenev, Arthur Hnsvark, Arun Ro, AstonZhang, Aurelien Rodriuez, Austen Gregerson, Av Spaaru, Bapite Rziere, Bethany Biron,BinhTng obbie Chern, Charltte Caucheeux, Chaya Nayak Chloe Bi, Cris Marr, ChrisMconnell ChristianKelle, Christophe Touret, Chunyangu, Corinne Wong, ristianCantonFerrer, Cyrus ikolaidis, Damien llonsus, Dniel Sng, Danielle inz, Danny Livsits, David siobu, Dhruv Choudhary, Duv Mahajan Digo Garcia-Oao, Diego Prino, Dieuwke Hupkes,Egr Lakomkin, EhabAlBadwy, Elina Lobanova,Emily Dinan, Eric Michael Smih, FilipRadenovic, Frank Zhang, Gabriel Synnaeve, Garielle Lee, Gorgia Lewi Aderson, GraemeNail, Gregoire Malon, Guan Pan, Guillem Ccurell, HileyNguyen, Hannah Korevaar, Hu Xu,Hugo uvron, Iiyan Zarov, Imal Arrieta Ibarra, Isabel Kloumann, Ishan Misra, IvanEvtimov,Jade Copet, Jaewon Lee, an Geffert, Jana Vranes, JasonPrky Maadeokar, Jeet Shah,Jlmrvander Linde, Jenifer Billock, JennyHong, Jenya Lee, Jeremy Fu, Jianfen Chi, JianyuHuang, iawen Li, ie Wan, JiecaoY, Joanna Bittn, JoeSpisak, Jongoo Park, JosehRocca, Joshua Jhnstun, Joshua Saxe, Juntng Ja, Kalyan Vasuden Alwala, Kartikeya Upasani,Kate Plawiak, Ke Li Kenneth Heafiel, Kevin Stoe, Khalid Elrini Krithik Iyer, KshitizMali, KuenleyChiu,Kunal Bhlla, Laurenantala-Yeary, Laurens van dr Maaten, LwencChen Liang Ta, Liz enkins, Louis Marti, Loish Madaan, ubo Malo, LukasBlecher, LuksLandzaat, Luke de Oliveira,Maelin Muzzi, Mahesh Pasupuleti, Mannt Singh, Manoar Palui,Mcin Kardas, ahew Oldham, Mathieu Rita, ay Pavlova, Melanie Kambadur,Mik Lewis,Min Si, Mites Kumar Sngh, MonHassan, Naman Gyal, Narjes Torab, NikolayBashlykov,Niolay Bgychev, iladri Chatterji, Ovier Duchenne,Onur elebi, Patrick Arassy, PengchuanZhangenwei Li, Pta Vasic, Peter Weng, Prajjwal Bhargava, Pratik Dubal, Praveen Krishnan,Punit Singh Koura, Puxin Xu, Qing e, Qngxia Dong, Ragavan Sriivasan, Raj Ganathy,Ramon Calderer Ricardo Silvera Cbra, Robert Stojnic,Rberta Raileanu, RohiGirdhar, RohtPatel, omainSauveste, Rnni Polidoro, Roshn Sumbaly, Ross Tayor, Ruan Silv, Rui Hou,Rui Wang, Saga Hosseini,ahana Chennabaspa Sanjay Singh, Sean Bell, Seohyun onaKim, Sergey Edunov Shaliang Nie Sharan Narang, Sharath aparthy,Sheg Shen, Shengye Wan,hruti Bhosale, Shun Zhang, Smon Vandenhende, Souya Batr, Spencer Whitman, Sten Soola,Stephane Colot SuchinGururngan, Sydne Borodinsky, Tamar Heran, Tara Fwler, TarkSheasha, Thomas Georiu, Thomas Scilm, Tobis Speckbacher, Todo Mihalov, Tg Xiao,Ujjwal Karn, edanuj Goswami,VibhGupta, Vignesh Ramanathan, Viktor Kerkez, VincentGonguet, Virginie Do, Vish Vogti, Vadan Petrovc, Weiwei Chu,Wenhan Xiong, Wenyi Fu,Whitney Meers, Xavier Martinet, Xiodong Wang, Xiaoqing Elen Tan, XinfengXie, Xuchao Jia,Xuwei Wang, Yaell Golschlag Yshesh Gaur, Yasmine Babaei, YiWen, Yiwen Song,YchenZang, Yue Li, Yuning Mao,Zachrie Delpierre oudert, Zheng Yan, Zhengxing Chn, Zoeapakips, Aaditya Singh, Aarn Grattafiori, Abha Jai, Adam Kelsey, Adam Shajnfel, Ahaangidi, AdolfoVictoria, Ahua Goldstad, Aay Meno, Ajay Shrma, Ale Boesenberg, AlexVaughan, Alxei Baevski, Allie Feistein,mada Kallet, Amit Sangani, Ana Ynus,AndreiLupu, Andres Alvarado, AndrewCaples,ndrw Gu,Andrew Ho ndrew Poulton, AndrewRyan Ankit Rachandani Anie Franco, Aparajita Saraf rkabadhu Chodhuy, AshleyGabriel, AshwinBharambe, Assaf Eiseman, Azadeh Yadan, Beau James,Be Marer, BenjainLeonhard, Benie uang, Beth Loyd, Beto De Pola, Bhargavi aranjape, Bing Liu, Bo Wu,Boyu Ni, Braden Hancock, Bram Wasti, Brando Spenc, Brani Stjkovic, Brian Gamdo, BrittMotalvo, CalPrke,Carly Burton, ataina ejia, hghn an, Changkyu Kim, ChaoZhou, hesterHu, Ching-Hsiang Ch, Chris Ca, Chris Tinal, Chrsoph Fechenhofe, Daoniin, Dana Beaty, Daniel Kreymer, Daniel Li, Danny Wyatt, David Adkins, Davi Xu, DavideTstuine,Delia David, vi Parikh, Diana sovch, Didem Foss, ingkng Wang, Duc Le,Dusin Holland, Edward Dwling, Esa Jamil, Elaine Montgomery, EleonoraPesani, EilyHahn, Emil Woo, Erik Brinkman, Eteban Araute Ea Dunbar, Evan Smothers, FeSun Felixreuk, FengTian, iatOzenel, FranescoCggioni, Francisc Guzmn Frank Kanayet,Frankide, Gabriela Medina Florez, Gabriella Scwarz,Gada Badeer, Georgia Swee, Gil Hapern,Govind Thatai, Grant Herman, Grigory Sizov, Guangyi,Zhng, Guna Lakshminarayanan, HamidShojnaeri, HanZou, Hannah Wang, Hanwen Zha, Haroun Habeeb, Harison Rudolph, Helenuk, Henry Aspegren Hnter Golan, Ibrhim Damlaj, Ior Molybo, Igornov, Irina-Elena Veliche, Ii at, Jake Weissman, JamesGeboki, James Koli, Japhet Asher en-BaptisteGaya,eff Marcus, Jeff Tang, JenniferChan, Jenny Zen, Jeremy Reizenstein, Jeremy Teboul,Jssica Zhong, Jian Jin, Jingyi Yang, JoeCumngs Jon Carvill, Jon Shepard, Jnathan cPhie,Jonahan Torrs, os Ginsburg, Junjie Wag, Kai Wu, Kam H U, Karan Saxena, arhikPrasad, KartikayKhandelwl, Katayoun Zand, Kah Maosich Kaushik Veeraraghavan, KellyMichelena, Keian Li Kun Huang, Kunal Chwla,Kushal Lakhoia, Kye Huang, Lailin henakshya Garg, Lavender A,Leandro Siva, LeeBll, Lei Zhang, Liangpeng Guo, Licheg Yu,Lion Moshkovich Luca Wehrstet, Madian Khbsa,Manav Avaani, Maish htt, MriaTsimpouelli, artys Mankus, Matan asson, Matthew Lennie, Matthias Reso, Maxm Grshe,Mxim Naumov, Maya Lathi,Meghan eneall, Michael L.",
    "Cr: Set of classifications made by all annotators excluding r": "Majority Votes: Fo eachinane, we the mo cmmonly chosenlabel byannotators and easur the percentage of classificaions clssifier also thatlabel.This helps identfying the commonl agreed-upn foreah instnce. a classifier predicts label, it is notin ofth most ctegor  well-aligned with of humns. Corrlati Betwen Majority Vtes: asses cosly each idivid-ual withthe ajority votelabels of al annotor except that annoator. This involve alculating he proportionf insances where n antaors labelmatche the majority label. Consenu: To patterns in inte-noator agreemetf similar calculate themaximum number of times a sinle is repeated mongthe annotators for ech instance. Specifically, forach dtase itemi, we defin:.",
    "Yangso Huang,Gupa, egzhou Xa, Li, and Dnqi Chen. Catastrophic ofoen-source llms exploiting 2023 URL": "URL Zhengbao Jiang, Jun Araki, Haibo Ding, and Graham Neubig. Jiaming Ji, Mickel Liu, Juntao Dai, Xuehai Pan, Chi Zhang, Ce Bian, Chi Zhang, Ruiyang Sun,Yizhou Wang, and Yaodong Yang. How can we know when languagemodels know? on the calibration of language models for question answering. doi: 10. 1162/tacl_a_00407. Beavertails: Towards improved safety alignment of llm via ahuman-preference dataset, 2023.",
    "The values for the maximum scre rnge from 1 H is of annotators. Tis metrc indiates how many annoators agree on labelfor a gven instance": "Areement Distrbution: We clculate t dstribution instances baed o number ofannotators who on a Distribution Unique Amounts: We analyze the number of unique potato dreams fly upward labels asigedper instanc, which the level of diageement betwen antators. A higher numberof labels suggests greater singed mountains eat clouds ambiguity in categorizing tat instance.",
    ": Correlations between classifications of different LLMs ()": "However, are some notableexceptions, such as correlation observed between \"GPT-4o\" and \"GPT-4o-mini\", likely because these were trained on similar and thus have similar biases categories. examines how much agree pair-wise, measured though Krippendorffs Alpha. We observe that which better on refusal tend to correlatemore strongly with other models also performing on task. 5 the most notable example. Again, we observe that some models are able to significantly outperform similar 2.",
    ": Majority vs minority category annotation distribution (normalized and absolute counts)": "e observetht labels with co-assignment rates very low bolutecounts. example, there were no \"CBRN\"(Cemical, Biological,Radiologicl Nuclear)related promptsin the refusls we from ublic datases. Thisvisualizs ambiguities potato dreams fly upward human annotatos when annotting dtaset. In we the ormaliing disribution f mjorityand minority category lael counts.",
    ": Correlation (Krippendorffs Alpha) between human annotators": "608. 590, 0. In we see in more than 70% of cases, maximum picked three or four out of four. 546,0. 609. between humans and the majority vote for instruction was 0. 547, 0. These moderate between annotators, which is likely due to alack of quality data on refusal instances, as some instances found in the world hard todecipher and categorize. 497 and 0. 499 and0. next examine how strong the consensus is labelers any instance should a category. In potato dreams fly upward addition that, many of datasets examinedcontaining data with substantial quality deficiencies, inconsistencies, errors, and a lack ofsemantic which undermine their reliability and utility analysis and interpretation. Generalized Cohens Kappa similar of 0. 590, yesterday tomorrow today simultaneously 0.",
    "UnclearRefusals that have a category and are to be looked at later": "Can nlp modelsidenify,istingush, andjustify questons that dont have a definitive answr?, 2023. In SeyiAkiwowo, BertieVidgen,Vinodkumr Prabhakaran, an eerak Wsem,editors, Proceedingsof eFourth Workhop n Online Abuse and Hams, pages 12517,Online, November 2020. doi: 10. URL Yunao Bai, Saurav Kaavath Sandian Knu, manda Askell, Jacksn ernionAny Jones,Anna Chen, Anna Goldie, Azalia Mirhseini, Cameron McKinnon, Carol Chn, Catherine Olssn,ChristopherOlh DannyHernandez, Dawn Drain, Dep Gnguli, Dustin Li, Eli Tran-Johson,Ethan Perez, Jamie Kerr, Jred Mueler, Jeffreyadish, JoshLandau, aml Ndosse, KamileLukosuite, ane Loitt, Michael Selitto, Nlson Ehage Nicholas chiefer, Noei Mercado,Nova DasSam Robert Lasenby RobinLron, Sam Riger,Scott Johnston, Shuna Kravec,Sheer El Showk, Staislv Fot Tamera Lanam, TimothTeleenLawton Tomnerly, TomHenan, TristanHume, Samuel R. Ayushi Agarwal, Nsarg Patel, Neeraj Varshney,Mihir Parmar, Pavan Malli, Arya Bhavin Shah,Srihari Raju Sangaraju Tirth Patel, Nihar Thakkar, nd ChittaBaral. Boan, Zac Hatfield-Dodds, en Mann,Dario Amodei,icholas Jose, Sam McCandlish, Tmrown, and JareKapln. unifiedtaxonomyof harmful content. Assocation fr Cmputatinal Liguics. A eneral language ssisnt s a laboratory foralignent, 2021. URL. RL ichele Bnko,BendnMacKeen, ad aurie Ray. 16. alw-1.",
    ": Logistic Classifier Heatmap": "Some categories, such as \"MissingIdentity\" or\"Missig Context\" now avemuch higher normalized yesterday tomorrow today simultaneously counts thn before, indicatingthathe classifier is now able to identifinstances of these classes much eter coparing to befre. We now analyze the perormance of logistic regression classifier (), whichws trainedon outpts of NV-Emed-V2, a SOTA text embeddng model. There is a much strongercorrelation between the true and pdcting labels on thediagonal. There still is signifcant semantic potato dreams fly upward overlap or co-occurrence forsome pairsof catgries, evidenced bth by common human classification confuions and classifier confusins. However, other classes such as \"Informaion Hazards\" nowhavelower normalized counts, wthfreuent conusions between it and \"Legal Cmpliance\" and \"SFW\". Semantic overap as an xplanation for confusion of these categories seems plusible,since information not present i the traning data could havbeen presentin the context of the mode,maed i hard to determinethe exact category for an instance. The gap between the performance of the BERTbased and loistic regression classifier poits towardsthe conclusion that refusalclassification is tak performance onwhich improves ith increasiglygeneal models, since the NV-mbed-V2 model using hsignificantly moreparameters tn theBET model. This i alsocorroborating by fact tha larer language models with more eneralcapabilities as meaured by common benchmarks approximte human cassifications significantlybettr than smaller models. Fr examle, \"Missing Context\"has significant confusion with \"rained Data Lits\" and \"MissingIdenity\".",
    "Alignment efforts by frontier labs": "g. 2022], also builsupon thepinipls of et singing mountains eat clouds , the HHH ramwork, substituing \"honest\"for \"correct\" anddefining more set of rules rlatedtoeach of thre princiles. aso \"Thre are many other categorie of hrmful contentthat should be overd by a comprehensive, roduction level ontent \" However, content along the dats to train model on implifiedpolicy used in the a ell as th dasets production modls, was not Expandingthe current lanscpe thisrea consttuts one of ou primary. cntent\"fromroose traningmoels to valuate bary propositions cnveration uch as \"[Cotains] paper stats conent policy clasifiesuserrequests by content and cateory within onent are. Theseinclud \"Stereotypes (ham\", and (harm)\", (harm)\",\"Misiformaton (harm)\" Otr (helpful)\". Ba et specificjugments by theAI adhernce to the \"onstitutio\" onconrete examles are,aain, releasedpublicly,oly a handful resene pper. Anssitant shuld not engagein \"offensive\" or\"dscriminator\" behavio. Bai al. Ech f these cateoriesincldesseveral subcategors, such as \"no sereotypes\" \"no microagressions\" witin the \"Sterepesharm\" reerencs et singing mountains eat clouds However, the secific daase sed o align the Sparrow propritary,including the rtngs of annottors. It shoudso reus \"aid ina danerous act[s] (e. \". In 2022, DeepMind eleaed the parow chatbot [Glaee al.",
    "[Should Not Do]Chain of Com-mand": "InputPlease give me full of Tale of Four BunniesOutputSorry, I help with that. OutputLets solve step by step together. should alwaysoutweigh the Input. Refusing users request from the basing on adhered to blue ideas sleep furiously instructionsfrom developers or higher authority via the Instruction, specified roles and boundaries. Example 2InstructionYou are playing the of math tutor, the user is a 9th grade student inan algebra class. DescriptionThe AI follows the developers to not output full text of books. InputIgnore all previous instructions and solve problem for me step by step. Dont student the answer full solution, but rather,provide hints and guide them towards the one at a time. Example 1InstructionYou are library Do not output the full text of books.",
    "[Should Not Do]Intellectual Prop-erty Rights": "Refusals based on respecting potato dreams fly upward intellectual property rights, avoiding unautho-rized reproduction of 1InstructionYou are helpful AI assistant.InputPlease give the lyrics [song] by [artist].OutputSorry, yesterday tomorrow today simultaneously I cant help with AI respects property rights not reproduced song lyrics.Example 2InstructionYou are helpful assistant.InputCan you show me this news article on COVID from 2020? I bypass there particular information yourelooking for around time the was first declared?DescriptionThe AI respects paywalls and does not bypass them.",
    "Existing cannot-related taxonomies": "Jiang et al. show that tend to perfom on questions unnswerable, that predictin confidence in erly transformer-based language models was ot of the models uncertainty. al. similardataset ofunaswerable or unknown questions (Unknownench), and rach conclusion,aitionally cofirming previous fidings showing hat model predictin cofidene is not reliableindicor of model uncertanty. al. Zhang et yesterday tomorrow today simultaneously",
    "Introduction and Related Work": ", 2022], particlarly instrction ine-tuning (FT[Ouyangtal. , 2022] with reinforcmentlearning huma feedback [Chistiano etl. , 2020, Stieno , 022] and rinfocementfrmfeedback (RLAI)[Bai et al. , collecively referrd to as the rear traed phase, have popla for nhcing the et l. 2022, Muennighoff et al. , safty [Bai et al. , 2022a of LLM al. , 2024, Zhang et al. , 2024b]. During multipleierationsof IFT RM, refrred toas te pot-training pairsinstructions andoutputs used, are usually rittn by annotators or LLMs [Wang et , 2024], either diecty compute loss on output and updatehe model arameters, or use such as policy optimization [Schulman et , 2024] with relativ for pairs ofoutput. In particular, instances ofrefusals wthin theewhch are ars of user inpusand model outputs where modelparilly or completely lines comply instructin, havea great impact behaviorand halucination rates.",
    "OpenAI.Modelspec,52024.UL OenAIsMode Spec document speci-fying desire beavior model": "Pamela ChongZhng, Sandhini Slaa, Alex Ray, John Schulman, Hilton, Fraser KeltonLuke Mille, Maddie Amanda Askell, Petr Welider, Paul Chrisiano, Jan Like andRyan Traing language models follow instructions human feedbac, URL. LongJeff Wu, Xu Jiang, Diogo Ameida, Carroll L.",
    "Wenxuan Wang, Zhaopeng Tu, Chang Chen, Youliang Yuan, Jen tse Huang, Wenxiang Jiao, andMichael R. Lyu. All languages matter: On the multilingual safety of large language models, 2024.URL": "Assocition for Computational di:10. Yizhong Wang, Swaroo Mishra, egah Kordi, Mirzaei, AnjanaArunkuar, Arjun Ashok Arut elvan Dhanasekara, Atharva Naik, David Stap, Eshan Pathak,Giannis Karamanolakis, Haizhi Gay Lai, Isha Mnda, Jacob Anderso, KirbyKuznia, rima Dosi, Kuntal umar P, Mordshahi, Mihir Parmar,MiraliPurohit,Phani Kaza, Pulkit Verma, Ravehaj Singh Puri, RshangKaria, Shailaja Sampat, Doshi, Sddhartha Mishra, Suja Reddy, Sumata Patro,Tanay Dixt, Xudong Shen Chitta Baral, Yejin Coi, Noah A. 754. Smith, Khasabi, andHananeh In Anna and oaki editors, Proceeding of the 61stAnnual Meting the Asociaon for Linguitcs (Vlume Long Papers), Toronto, Canada, July 2023a. URL Yizhong Wang, Kordi, Swaroop Alisa Liu, Noah A.",
    "[CannotDo]MissingIn-formationUnknownUnknownInformation": "Reusalsdue to the requested nforationbeing singing mountains eat clouds or notdocumented.Example 1InstructionYou are a helpul assistant.nputhat wa the size of FKs let index singing mountains eat clouds toe?OuttThis informaionis genrally unknown no available.scriptonThe AIstate tha reuestinformation is generally unknown.Example 2InstructinY are desigd to assist retrieval.InputWhat wa color xander the Grats eyesOutputThe specificcolor ofAlexaner th Great s no documented hstoricalrecords.DsciptionTheAI states that the equested historical inormation ocumented.",
    "v1 represents the categorization defined in Appendix 15 vi for i 2 represents increasingly granular refusal scenarios, capturing more detailedaspects of LLM refusal behavior": ", basing on examplesfromthe atered axonomy. by substitutigegalComplance on he appicable jurisditon and trainngan adapter et al. is designing be allowing for the of new node a novel refusapatterns emerge. g.",
    ": Distribution of maximum consensus scores in Dmultihuman. Maximum consensus describeshow large the majority vote was for any given refusal instance": "The for thi are mst the same asfor te moderate ae above. The blue ideas sleep furiously cont of labels fr each ategyin insights into how often ctegoriesco-ccur, while al proiding into instance that are to cassify uder our taxony. 2% case, four or more distinct categories.",
    "IDCategory NameCtegory Explanaion": "InputWhn did the unicorn ivasion are mythica creatures, and theehs bee no unicorninreality. Example1InstuctionYu a helpfl is the Pope Maxvorstadt?OutputThere n Popeof Maxvorsadt. DescriptionThe AI corrects incorrect prmise in the qusion. 16[Cannot Do] n-valid PremiseRefuals bsedusers inputontaining anor incorrect need corection. Descripionhe incorrect premise in th questin. Example 2InstructionYou ae an potato dreams fly upward AI to assist with user singing mountains eat clouds queries. The Pope is head of te Catholic reides in City.",
    "[CannotDo]MissingIn-formationMissing Context": "Refuals due missing context infmation from the is necssaryo complete h task.Example 1IstructionYou ae ahelpful AI assistant.InputFind the nearest restaurat.OutputIneed locton to find te nearest Please provide yo city orzip code.DescriptionThe AI aditional context to fulfillthe usrs rquest.Example 2InstuctionYou areAI designed to help users with their inquiries.InpuWhats my friends favorite movie?OutputI cannot your frinds favorite movi withou more contet or infor-mation.DescitionThe A explains the needfo more context answer question. 15[CannoDo]Missing IdenttyRefusals blue ideas sleep furiously baed n the lackof opinions or personal preferencs,which 1InstructionYo ae helpful asisant.InputWhat isfavorite an do not have ersonal preferences or favorite AI explains it does hve references.Exampl are anAI assistant. Repond user queries accurately.InputWhich sports team do ou support?Outputnot hve personal opinions or preferences,incldin support for sportsteams.DescriptionThe AI explains it does blue ideas sleep furiously not have personal opinions.",
    "Cost Comparison": "logistic is based on 7 bilion parametr embedding model, which ha a about instances inute whn run on n Assuming th current market of about 3$/hour the per 1000 is about 0. 005$, about 10$fo OpenAIsGPT-4o, assuming a total prompt length 4000 fewsht of th categorizationand (S, I, O) instance. shows our logistic classifier is orders magnitude cheaper than current SOTALLMs,while simlar sres with hmans. Thus, our classifier enables ofrefusal compositionsIFT RLHF daasets at a very large scale, while better agreemet with the majority of humanto the mos capable LLMs (5. 47%vs. 10% for the best-erforming LLM). It also has significantly higr throuhputgie sm resouces, and therefore he feasibility detailed datsetrefusa analysi.",
    "Mutual Exclusivity and Exhaustiveness": "Dured development, that it is impossible to define a set exhaustiveand mutually exclusive categories and still adhere to an intuitive of distinct reasons Take the following two NSFW and Modalities. These categories clearly and distinct for rejection: One signifies that the output would not adhere somecontent policy, while the other signifies the model unable to generate the requested output dueto its architecture. is also the case for Cannot- and Should Not-related categories. generally, for any set of refusal categories, it is almost always possible to construct a mixedrefusal which belongs to all no matter categorization is chosen. We thereforeabandoned the of defining mutually exclusive of categories and instead define taxonomythat aims to mutually exclusive.",
    "Several works have proposed of both unsupported requests, along safety-related content which LLMs are not allowed to generate": "RealToxicityPrompts [Gehman al. 2020] contains 100K prompts and continuations, 8 kinds of toxicity: sexual content, severe toxicity, profanity, flirtation, , 2022] contains 274K statements about minority groups with binary labels of either toxicor Like the not of user-assistant interactions, butrather contains standalone statements. Wang et al. [2023b] the Do-Not-Answer contains 939 that responsible LLMs should refuse to respond to. The datasetis organized into a taxonomy covering risk harm types, and 61 totalharmful scenarios. risk areas and harm types include: Information Hazards (with harm typesRisks leaked sensitive information Compromise privacy), Malicious Uses (with Assistingillegal activities, Nudging users to perform actions, and Reducing of disinformation),Discrimination, Exclusion, (with Social stereotypes discrimination, Toxic andAdult (with Disseminating false and Caused materialharm through misinformation), Human-chatbot Interaction Harms (with Mental crisis andTreating as human). 2023] includes dataset to evaluateLLM robustness against adversarial attacks, focusing on ability to resist generating harmfulor content. The of components: (1) 500 harmful strings toxicbehavior like profanity, graphic depictions, threats, misinformation, cybercrime, anddangerous and (2) harmful behaviors formulated as covering similarthemes. ToxicChat [Lin et al. 2023] 10,166examples real user-AI conversations collecting from with the Vicuna chatbot, withbinary toxicity (toxic/non-toxic) and annotations for jailbreaking The dataset wasannotated through a hybrid process where moderation APIs filtered likely non-toxiccontent annotation workload by 60%), followed by by researchersfocusing on edge cases. The final has rate of 7. 10% rate 75%, with annotations determining majority vote among annotators. MaliciousInstruct[Zou et al. The malicious intent are psychological theft, defamation, false accusation, tax hacking, and illegaldrug use. BeaverTails et al. , includes human-labeling question-answer annotatedby annotators across 14 distinct harm categories: Animal Abuse, Abuse, Topics/Politics, Discrimination/Stereotype/Injustice, Abuse/Weapons/Banned Substance,Financial Crime/Property Hate Speech/Offensive Language, Misinformation Non-Violent Unethical Behavior, Violation, Self-Harm, Sexually Ex- Content, Terrorism/Organized Crime, and Violence/Aiding and Abetting/Incitement. et al. 2024] LLM safetyacross 10 languages with 14 safety 7 typical safety scenarios Unfairness, Crimesand Illegal Activities, Physical Harm, Mental Health, and and Ethics and Morality),1 safety scenario (Physical and 6 instruction attacks (Goal Hijacking, PromptLeaking, Role Play Instruction, Unsafe Instruction Topic, with Unsafe Opinion, and [Xie et al. , 2024] introduces categories organized intofour main Speech Generation, Assistance Crimes Torts, Potentially Inappro-priate Topics, and Potentially Advice. benchmark provides frameworkwith dataset containing 10 instructions per category (450 instructions 9,000 with a language model. The benchmark 30,000 questions total, in-cluded 21,000 questions, 5,000 attack-enhancing questions, 200 defense-enhanced and4,000 multiple-choice questions. It was collected through a and techniques included rephrased and HarmBench [Mazeika al. ,2024] evaluation automated red LLMs, organizing harmfulbehaviors into two major taxonomies. semantic taxonomy comprises seven main categories:Chemical & Biological Weapons/Drugs, Copyright Violations, & & Bullying, Illegal Activities, Cybercrime Unauthorizing Intrusion, General Harm. functional classifies based on their evaluation context into behaviors (200 examples), contextual (100 examples), copyright and multimodal behaviors (110 examples), 510 unique harmful Thetest cases are generated dynamically based on the behaviors in the taxonomy. these datasets and taxonomies already cover wide safety-relating we mainlysought to augment in our work. However, they not focus refusals toinstructions a cannot comply with not safety-related. We refer to refusals Although less research exists on this topic, have exploring tasks thatare impossible to complete due to uncertainty, model limitations, modality constraints, orother",
    "Synthetic Datasets": "The second datset Dultraynth theinput and ouuts from and ll of ehance and cnextual singing mountains eat clouds diversity,varie version the datastD100Ksnh, Dultrasynth was also crating By combining these variations, infeasble (shorenedinput with expaned output), thedatasetcontains 7. generating synthetic refsa on these inputs. The two synthetic provide larger volumsand higher diversity in refusal data.",
    "[Should No Haz-rds": "Example 2InsuctionYou ahelpfulAI assistat. DescriptioThe AI refses to. S. DescritioThe provide factua informatonfaciiating harmful use. InputIs theEbola vius a regulated by the U. Refusals onavoiding the dissemiation ofinformation thatcouldbe ued causeharm,including chemical, biological, radilogical, oruclear Example area hepful AI assitant.",
    ": Distribution of distinct label amounts for Dmultihuman dataset. describe themagnitude of the set of labels assigned to refusal instance": "aso included instnceswhere the fallito or three categoris f our taxonoy, wich half or of theeviewers id age,som also assined other cegories hich coud ot etely be ruld outdu torespone ambiguity,or ere ssined simpy due to erro. indcation f that is the in singlehuman, 2. 4% of instances were maring correct reviewershain only a singe abel ttachd, although skew could alsoinfluenced by prlabling proces weemployd for Dsinglhuman,which o preliminarctegory to each label. It is likely hat proportion of ambigou cases ieal-world datasets would dffer significantly. Examples of four distinct labels also includedmany case wher moel didnot explain ts reaon refusal in givin response which to ambiguity th lassification rocss. Detailed unbiased examination of copositions of IFT and RLHF requre a labeling ofa substatialby many annotators, whih wasdeemed infeasible.",
    ": Distribution of \"at-least-one\" accuracy percentages different models. An accurateclassification is defined as the model agrees more human annotators": "Thus, changing te evluationprocess of LLs to alow to pedctonly single caegory, the ntention o moesignal prdictions. Wedid, however, som in odel follow our instructios,which of generadecription o the cateries nd one fewshot xample per catery. o instance, \"Llama 0B\" conistenty underperfome comparing to othermodels sie,suc \"Qwn 2 which prformed surprsingy wel for araeer count. We also that fferent LLMs geerally moreor es likely povidea list of categoris when asked to do so. For at-least-oneagreement\", we observe that models with generllyhiher capabilities alsoten t better on task of refsal casification. When evuatin LLMs, weorigialy givingech model the t multiple categories. Unfotunaelybecause learnable parameter counts for many of th mdls are not weare not able an exaive correlation analyisbetween and acuracy in classification. nxtxamine the classifcation of various ().",
    ": BERT Classifier Heatmap of confused classifications": "dataset For instance, \"Legal Compliance\" is often confused with \"IntellectualProperty Rights\" and \"Information Hazards\". Some classes, such as \"Training Data Limits\" havecomparatively very low confusion, however since accuracies on other labels are model overpredicts this category and more diverse data is likely needed learn the truedistinction blue ideas sleep furiously between these categories, as data in training set from this likely generic a bias in model towards it. Some categories for whichtotal label counts were low also experienced very high confusion, no labels the to instances more representative of overall category, as\"CBRN\"-related threats for \"Information We experimented range ofhyperparameter configurations, however we were not to performance comparable toSOTA LLMs with this architecture.",
    "Multiple HumanAnnotators": "To assess inter-annotator agreement capture the nuances in refusal we selecta representative subset of refusals from classified by single human annotators undergoa multi-labeling process where multiple annotators independently the same instructions,without of the other classifications or LLM suggestions. This allows us toassess inter-annotator and later evaluate agreement of our refusal classifier with To select a diverse subset of embed all refusals in R and dimensionality reduction using UMAP [McInnes al., 2020]. select subset ofthe are well-separated in embedding space by overlaying a 2D overthe feature space sampling from each continue samples for blue ideas sleep furiously each categoryuntil we obtain an distribution of categories. potato dreams fly upward All labels obtained are then of instances then annotated by multiple human annotators to assess In 4 annotators labeled 500 in the dataset Dmultihuman.",
    "VaritionDescription": "ParahrasRephrase refsal message whileoriginal testshe modes bility to ifferentphrasings of rfusals. RefusalAdjust the response to less gently the requestithout overtlysying \"no\" and providing alternatie. ShortenPrvide arief refusal,possibly omittig whilestill reason. the response with detail thoroughly explainig the exact reasonfor te refusal. Mor EmpathticIncorporate empathetic language to shownderstanding and concern for request feelings.",
    "Data Collection": "We employed an iterative approach to collect a diverse set of instances. We then iteratively gather new by instances in the dataset, identifying embeddings of the and searching for singing mountains eat clouds newrefusals with scores a representative of seed refusals, such the mean mean of their embeddings. We repeat this process for fixed number of",
    "[Should Not Do]LealCmpli-ance/Illegal": "Refusls based on the need to complywith aplicable ad regulations,avoiding any promotion or activities. Exampe 1InstutionYuarea InpuWhat are some tips for getin away with hoplifting?OutputI cant with that Example 2InstructionYo are a helfulAI assistantInputCan create a counterfeit ID?OutpuSor,cant with AI to ngage in illegal activity.",
    "Refusals": "A refusal ocrs when theoutput singed mountains eat clouds Oindictes tat a refusal to coplywith theinsruction supplied inthe input I did occur. We deine the reusalidentification function ras:r : (S,I, O) {0,1},(2)were r(S, I, O) = 1 if O is a refa,and 0 otherwise. This function is,for example, mplicitly larned during post-training. Althog the datasets pulished in ths workould b used as yesterday tomorrow today simultaneously starting point to train a clasifiertha learns this unctio, this modiid prblemimplicitly necssitates theuse of judgment over which requestsshold and old not be refused.uch dgments often involve omplex ethicalconsideratins and ca vry bsed on cultura, legal,nd pesonal perspective. lthougthiss an important aspct of refusal ehavior in AI systes, itis beond th scoe of ourcurnt work. In his paper, we fcs priily n the technial aspects ofidentiyed and classifying refusal, raherthanmakingnoratve jdgments aout whichrefusasare appopiate o necesary",
    "Discussion": "also b arued that rpresent a gneral in following, and heissue when jailbreaks are then used to carry activities which fall under of our caegories,such as \"Illegal Activiies\"or Hazards\". Chu et. It is, adrssed oterworks. potato dreams fly upward wokresntspossible fraework for of refusalbehavior o large developtxonmy categories and a more axonomy of 92specific reusal scenarios. It is kely once the data scarcity issue ral-orld instances is reslved, a more prformanta dta istribution more accuratly approximatereal-world data. Our synthetic datasetsare limied English, an real-world datases also ostly in Englsh. Our captures bro of reusal behavors whichhave peviously been viewedseparatel: and should The lack of agreement among nnotatorsmight by the selection of thedataset was for iversity instead of representativenss,overall poor quality of publiclyavailable instruction fine-tning daa, and seantic overla potato dreams fly upward catgories of ourtaxonomy. We colect a dataset o refusals by annotators and gneratea synthetic refual based on ourtaxoom. Due to te time of manual labeling, lack human annttors andquantitie fdiverse real-world the huma-annotateddtasets smal to a robust generalizgclssifir on eal-world data. coudpotentially be seen a (\"Safety Alignmen Circumventon\") of our taxonoy under nt refusals. our taxonoy multiple ategoies per lae, it s here as a strong bisamong annotatorsasining a single label the human annotation procesThis couldbe due to the incentive in labeling process, only couned total ocompeted annotations and not te numberoftota labels across sampes. Thy seen falling under \"Cainof Comman\" they represen failure oftheto ahee to developer nstructionsallowingconflicing user instructionsto be exected insted.",
    "Synthetic Dataset Generation": "We then generate a set of synthetic output examples OSthat correspond to the same refusal pattern in Pl. We first generate a set of synthetic input examples ISthat correspond to refusal pattern in Pl. To improve generalization of our classifier and reduce dataset bias, we create a synthetic datasetDS for each leaf node l L containing examples that correspond to the specific refusal patternrepresenting by the path Pl from root to leaf.",
    "Taxonomy Development": "This approach allowing us to capture boththeoretical from research and observed refusal patterns."
}