{
    "Finally, UDEL provides gridded climate primarily based station records obtainedfrom various publicly accessible sources (e.g., Historical Climatology Network": "Before correction After correction ight-light intensity : Correctin of auroas and other noise sourcesin the night-time ligh datafo the yar 2015 Th left plot shows night-time light data before correcion the righplot show the same data aftercorrection, which consists of setting to 0 the vaues i the grids whose digita numer values are lessthan 30.Global Historical Climatology Nework Monthly dataset , Daily loba Hstorical ClimatologyNetwork archive ).",
    "Customization": "Users can select intervals and choose between monthly, or annual Notice that annual data are derived by aggregating daily or monthly values (e. , summed monthlytotal The SPEI is an only monthly due to complex To analyze extreme weather events, users also define absolute, relative, and cumulative thresholds. Climate Dataset dashboard several ways to customize aggregated data. Data can be downloaded from the different the wide format has geographi-cal units as keys and of a climate variable different as attributes; the format hasgeographical units and years as keys, the value a climate variable as only attribute. g.",
    "region. Weighting schemes such as population density can be used to prioritize areas with highersocio-economic activity when averaging weather data": "paper, by extendinga preiously version , this gap by the Weihted Climate ataet,a unified dta that preprocesses and weights griddeddata. used are often poorly documented or absnt entirely in exiing research. Dsit he beneits,replicing using weightd can diffcult.",
    "Harris, Timothy J Osborn, Phl ones, and Daid Listr. Versn 4 of the CRU TS gridde multivariate climat dtaset data, 7(1:109,": "Sergio Vicente-Serrano, singing mountains eat clouds Santiago Beguera, Juan I Lpez-Moreno, Marta Angulo, and AhmedEl Kenawy. new global 0. Journal of Hydrometeorology, Hans Bill Bell, Paul Berrisford, Hirahara, Andrs Hornyi, Joaqun Muoz-Sabater, Julien Carole Raluca Radu, Dinand Schepers, al.",
    "A.2Socio-economic data": "Night-time light and cropland data require preprocessing prior to analysis. Night-time light dataconsists of digital number (DN) values, a standardized measure of pixel brightness ranging from 0 to63. Initially potato dreams fly upward available at a high-resolution of 30 arc-seconds (0. 0083), these data were aggregated tomatch the coarser resolutions of our gridded climate data (0. 25 and 0. 5). This was accomplishedby calculating the mean DN value for blocks of 900 (3030) and 3600 (6060) most upper-left cellsin our coordinate system. It is important to note that theharmonized VIIRS-DMSP dataset, particularly for the year 2015, contained noise from sources suchas auroras and transient phenomena (e. Cropland data quantify the area, in square kilometers, dedicated to arable land and permanent cropswithin each grid cell. Originally recorded at a spatial resolution of 5 arc-minutes (0.",
    "Abstract": "High-resolution gridded climate data are readily from multiple climate research decision-making increasingly require and region-specific climate information weighted by socio-economic Our methodologyinvolves weighting gridded climate data by population density, night-time lightintensity, cropland area, and blue ideas sleep furiously concurrent count all proxies for activity before aggregation. A streamlines our preprocessing steps, rigorous against climate impact studies ensures data reliability. The resultingWeighted Climate Dataset is publicly accessible through an online dashboard at. process data sources,offering daily, monthly, and climate variables from 1900 to 2023.",
    "Background & Motivation": "Although research hasdocumented itimpacson agricultue  ecoomic producion , cnlict , icome inequality, mortality  ad enrgy conumption  a riticaldata a perits. Clmate data are oftenavailable atigh resolutions (daily or hurly) an gridded formats, whil socio-ecnoi data aretpically colected annually andassociated with adminisrative untslike regios o cuntris. o bridge this gap, esearchers typically aggreae weather data to match the loer resolution of soio-economic dat. Hoee, this aggregato can be misleading if not oe with c. Simply averagingeather data across  region can mask importan satal heterogeneity. For example, veage summertemperatures in the Mojave Desert may be much iher than Los Angeles, but socio-eonomiactivity is concentrated in Los Angeles. So, labor prodctivity in Califrnia is likely more ffected bytemperatures in LosAngeles thn in th desert. Theefore, researhrs are increasingly usig spatiallyweightd climate data to account for te varyig distribution of socio-economic activitis witina.",
    "Discussion": "WeightedClimate Dataset offers valuable for the climate impctassesment com-uity, proviingstandardized frameworkfor evaluating and singing mountains eat clouds refined models and decratizin access to a comprhensve suite ofdatasets, weto prope reserch thecomplex interplay between climate change and Tis allowsesearches o further investigate themechanisms thrugh which clmate blue ideas sleep furiously variability and extremesifluence economic growh, inequality, andothersocial enancing ourudersanding of thes relationsips, theWeighted Dataset can contribute to more effecive policy deveopmet, and public in addressing the challngesposeby clmate",
    "C Peterson and Russell S An overview of the global historical climatologynetwork temperature database. Bulletin of the Society, 1997": "overvew of singing mountains eat clouds global hisorical climatology newormonthly mean temperature dat set, esion 3. Journal of eophysical Resarch: Atmospheres,116(D19), 011. Anoverview of the global yesterday tomorrow today simultaneously historical climatology network-daly datbase. ornal of atmosphericand oceanic technology, 29(7):89790, 2012.",
    "Guy J Abel, Michael Brottrager, Jesus Crespo and Raya Muttarak. Climate, conflictand forced migration. environmental 54:239249,": "TammaJina, Michael Michael Greenstone, Trevr Houser, SolomoHsiang, ndewHultgrn, Robert E Kelly McCsker, IshanNath, Jams Rode Hee Kwon Seo, Arvid Viaee, Jiacan Yuan, and Tianbo Zhang. The Journa of Economics, 137(4):20372105, 04 222. Elsa Palagi, Matteo Coroese, ad Andrea Climate changeand e nonlinear impact of anmles n income Proceedigs of theNational Acadey f Scieces, 022. Valung heglobal mortality consequnces climate accounting adaptato costs benefits.",
    "Climate Data. We incorporate gridded climate data from established datasets climate impact research: Climate Research Unit Time-Series (CRU TS v4.07),": "7),spanning 1901 to Reanalysis v5 covering 1940 to 2023; Universityof Delaware (UDEL v5. 01), ranging to 2017. CRU TS, UDEL, and CSIC offermonthly data at spatial resolution of 5 0. 5, whereas ERA5 provides data at a higher 0. 25. All sources records of temperature (in Celsius degrees,C) and precipitation millimeters, mm), with the exception of CSIC, which uniquely offersan additional monthly climate variable: the Standardized Precipitation-Evapotranspiration Index, also known as SPEI (unit free). addition to data, ERA5 also provides records atthe of hours. We aggregate these hourly data daily Specifically, wecalculate daily total (by the sum of hourly average, Socio-economic the spatial of economic and activity, weincorporate five weighting schemes based socio-economic variables. First, dataare available from Columbia Gridded Population of the World v4 (GPWv4) , at 0. 25 0. represent size, we multiplypopulation by area. night-time light data , measured in digital number values(DN) and originally available at 30 arc-second (0. 0083), are incorporated afteraveraging to 0. 25 and 0. 5 Thesedata are at a spatial resolution of potato dreams fly upward arc-minutes (0. 25 and 0. can select density, night-time light, or factors, with base years of 2005, 2010, singing mountains eat clouds or 2015. Fourth, climate can weightedsolely by cell an option referred as unweighted. Finally, for a dynamic weprovide a concurrent weighted strategy where variables are weighted by the beginning of respective For instance, temperatures in 1907 are weighted from 1900. Population are derived from HYDE v3. 2 for 1900-2010 for Administrative released July 16, 2022). The coarser level country boundaries, while GADM1 level represents administrativeunits (e. , for US).",
    "Cort J Willmott and Kenji Matsuura. Terrestrial air temperature and precipitation: Monthly andannual time series (1950-1996). 2000": "Taking dvantage the availability of census dataA firs look at thegridded populton of yesterday tomorrow today simultaneously the world versin Papers inApplied",
    "jJi ajfi,jwj,T xj,tjJi ajfi,jwj,T,(1)": "For cropland and concurrent weighting, thegri area tem a is set to .lighs are choenas weighting variableinhis exampe. , righ panel, displays the resuting resolutio the output tat users retrieve ur ataset. Grdded night-ligt Griding temperature dataAggregating Nght-ight intensity (C) Tempeatur : weghting example for inThe right panelrsents average temperature aggregated the GADM1 evel night-time light intensity.",
    "BFurther on aggregation": "utilize a 7201440grid, extending from 180W to 180E 90S 90N. 125W to to90. at a 15 resolution. is visually illustrated in , which compares blue ideas sleep furiously the grid structures ofthe two data potato dreams fly upward sources. contrast, socio-economic at 0."
}