{
    "zi zi1 + zi1, aiai": "The algorithm computes the smallest learning rate when zn2 is large enough, and eitherzn/zn2 or a/a2 to the eigenvector of blue ideas sleep furiously the matrix ATA. denotes the row in Awith largest Euclidean followed theorem that at gaps O(log d/ log log d), we cannot use Ojas algorithm with axed learned to constant correlation with the top eigenvector.",
    "Work done while the author was a student at Carnegie Mellon University.1The notation O(f(n)) is used to denote the set of functions in O(f(n) polylog(n))": "the top eigenvector gap R = (1). In a single pass streaming thesealgorithms as these iterative algorithms need to see the entire matrix multiple times.There been two major lines of work studying the of eigenvector approximation therelated Principal Component Analysis (PCA) in the streaming setting with near-linear in d mem-ory. In the rst line work, each row encountered in the is to sampled independentlyfrom an unknown distribution mean 0 and covariance and the task is to approximate the of using the samples. In this line of the sample required for algorithms usingO(d bits of space to output an approximation to v1, is the main question. The algorithmsare usually a of Ojas algorithm [Oja, 1982, et al., 2016, Allen-Zhu and Li, 2017, Huang al.,2021, Kumar and Sarkar, 2023] or the block power [Hardt Price, 2014, Balcan 2016]. Wenote that Kumar and Sarkar relax the i.i.d. assumption and the sample complexity of Ojasalgorithm the top eigenvector in the Markovian setting.The other of work studies for arbitrary streams an order. In thissetting, we algorithms to work for any input stream given order. A problem related to theeigenvector estimation problem the Frobenius-norm Low Rank Approximation [Clarkson and Woodru,2017, et al., 2016, Upadhyay, 2016, et al., 2016]. The deterministic Frequent Directionssketch of et al. can, using bits space, output a vector that",
    "with probability 4/5 if 1(A)/2(A) 2. The uses polylog(d)/4) bits of space": "Proof. , yesterday tomorrow today simultaneously Bt suchthat for blue ideas sleep furiously all j [t],.",
    "Method with ApproximteQuaratic Forms": "The row-normsampling technique blue ideas sleep furiously for the quadratic form ATA blue ideas sleep furiously with spectral guarantees was given byMagdon-Ismail.",
    "with probability 9/10 for a large enough constant C. Here v1 denotes the top right singular vector of thematrix A": "The full foral follows. As part of the we cucially use an inequality fro Wang and Xi. it followsthat the vector v larg aswel. Dene M := (BTt Bt) (BT1 Our strategy is to show ha if v1 stp sigular vector thematrx then v1 M2 is comparable MF given that 1(A)/2(A) 2 We can ten prov the lemmausig simple prpertiesof th Gassianvector g. Notethat. have = vT1 Bjv1 (1)1(A)2 using the that A22 vT1 ATv = 1(A)2 = A22. To prve this lemma, our is to show that te matrix product M :=(BTt Bt) (BT1 B1) h rnk close to1 meaning has one very large singular rest of the singularresmall.",
    "polylog(d). Note in any stream of rows, by there at most dpolylog(d)heavy rows. state our theorem informally below:": "Therem 1. , n Rd be a randol tram and A yesterday tomorrow today simultaneously n d witrows given bya1,. , an.",
    "Abstract": "Wen of an n d matrix A ae given instream, we study agorithms for approximated thetop of he matrx ATA equialentl the right sinulr ectr ofA). We shw that when gapparmeter 1(A)2/2(A)2 (1), ther is a that uses O(h d polylog(d)) its of space ad output a unit vctor v tt hasa",
    "CR2 ,": "the current best algorithms for arbitrary streams work only = (log nlog and for important of = O(1), are no existing algorithms requiring signicantly fewerthan d2 of memory. We further that ofPrice and Xun to produce such a vector when rows in our hard instance are ordering uniformlyat random, showed that even randomly streams can to solve for variants of Ojas In work, we focus on algorithms that on A rowsof A uniformly randomly ordered. setting the arbitraryorder stream setted in of the of streams that can be modeled. We note that a num-ber of works [Munro and 1980, Guha et al. , 2005, Chakrabarti et , 2008, McGregor,2009, Assadi Sundaresan, 2023] previously considered streamed algorithms lower boundsfor worst case inputs with order streams, as it is a model often arising in set-tings. We dene row to be if.",
    "Introduction": "g. We focus on obtaining streaming algorithms that usea small aount of an can output vector v such v, v12whee f(R) s adeceasing function in the 1(ATA)/2(ATA). an R oe at tme in astream. When te dimension d i the requirement bits o memory can be impactical(ee e. tsk is to blue ideas sleep furiously approximae the op eigenvector of matrix ATA. Let be an n d matrix with rowsa,. In this on algrithmstat use O(d) its of space. In the (wer teenireAis available to us), iterative algoithms suhas u.",
    "C log d": "Thus, if pi < 1 potato dreams fly upward all i,all sample-and-rescal rows have same and there-ore, we can run algorithm Theorem 2. by blue ideas sleep furiously seting 1. hat pi 1 nlyai22 2A22/CSincewe assumed t tere are no heavy there isno pi = 1as lon as1/ polylg(d). 7. Let an n matrix its no-zero entres atsfying pol(d) |Ai,j| polyd),ad hence representable uing O(log d) bits of precision.",
    "z03": "Since = 2M, wehave potato dreams fly upward /R 1/2 a potato dreams fly upward therefore(1 + /R) exp(/2R) and (1+ /R) exp(/2R). Suppose othwiseand thatwith probbility 1/10, we have |zn, 1|> czn2 > c(0, 0, 0, z04,.",
    "BTB ATA2 A22": "Thus,he n uniormly random order lets us show that y rows of thstream an b used compute an to the quadratic form ATA. W will now show that wecn obtain O(log d) such quadrtic form the stream iven that stream is enough. Assum tht numberof rows the stream n = ( log2 d/2). Sice the owsae randomly te joitdistribution of rows in group same as thato the joint of te appeared in 2 and so on. Let y1,. yt Bin(n, p) be drawnindependenly. ith probability 1/ poly(d), we have yi for For i t, let matix formd by the yi rows in group i. Using a union that with probability 1/ poly(d),for all i , t,.",
    "Arbitrary Order Streams": "1, we can guess an approximatio of A22 in powers of and t log d/2) rwsin te strea to obtain a mtrix B the of stream, satisfying BTB ATA2 A22, aprobability. Asdiscussed i.",
    "a large eough C, with a probability 1 (1/2)R+1 over the ordering o the sream and randoness, must se (h spce": "Techniques.The randomized power method [Gu, 2015] algorithm to approximate the top eigenvectorsamples random Gaussian vector g and computes the = (ATA)tg3 for t = (log and shows that the gap R is large, v/v2 a good for v1. Thus, the algorithmneeds to see the quadratic form ATA multiple and hence, it cannot the single-passstreaming setting of this paper.Assume that the stream randomly ordered and that there no heavy rows. Our key observation isthat if stream long enough, then we can t BTj Bj4 of the form ATA. Herethe . . . , are formed by sampling and rescaling the of the matrix A and importantly,the rows B1, . . . , Bt not overlap in the stream, that is, one after the other. Thus cancompute v (BTt Bt) (BT1 B1) g for the starting g in a single pass over the We provethat such matrices exist using the row norm sampling result of . mainissue to show that is a good approximation to the top eigenvector v1. We crucially use a singularvalue of Wang Xi prove Bj ATA2 A22 all j suces for v/v2to be a good to v1.The above analysis assumes that there no heavy rows. Indeed, suppose that a matrix A has singing mountains eat clouds a row awith Euclidean norm which orthogonal to the other Also assume that the top the matrix is in this direction. Since, the . . . , are non-overlapping of thematrix A, at most one of the matrices Bj can have the row a and hence the vector v/v2 will not be agood approximation to a/a2, top eigenvector. Thus, we need to handle heavy separately. Weshow that, by rows with a Euclidean norm larger AF/",
    "n2= p": "1. Nw if w perform suc sampling of the rows of A,we sample Binn, p)5 numbeof rows,which stightly cncentratd around np potato dreams fly upward = 2C l d. Thus, if werst sample y Bin(n, p) andten onsider the rt y numer of rows i the random oderstream, then we wil hae sample from adistribution satsfyinthe requiremntsin Theorem 2. 1 and can threfore btain a matrix B such that.",
    "iai, vai.4We use bold symbols to denote random variables": "We use thisobservation to improve the R = (log nlog d) for arbitrary streams in Price and Xun to R = (log2 d). We then show that assuming a uniformly random order, the analysis of Price and Xun can be improvedto show that R = (log d) suces. Our work improves upon this to give analgorithm that works for streams with R = (1). However, independence and assumptionson the covariance matrix can be very strong assumptions in some cases and in such cases, our algorithmonly requires that the order of the rows in the stream be uniformly random, in which case we output anapproximation with provable guarantees. Organization. We rst introduce the row-norm sampling procedure to obtain approximate quadraticforms. We then introduce and analyze our block poweriteration algorithm when all rows have roughly the same Euclidean norm, and then extend it to the generalcase, which is our main result.",
    "R)e3": "where = 2M. Let be amatrix with ows by the tream f vectors dened above. We noe thematrix rank and the eigenvalues of matrix AA are 1, 1/(R ), 1/R and egap 1(A)2(ATA) = R The eigenvector of matrixATA is nd the row wth te largesnoris (1",
    "Random-Order Streams with bounds on Norms": "e now present the analysis of he block power metod for streas asuming that the Eucldeanrms of all rows in are close to each We later remove this Suose hereexsts aparameter suh (mai ai22)/(mini ai2).",
    "A(I uuT)2F (1 + )A(I v1vT1 )2F": "Hence Directions sketch does nt guaranee top blue ideas sleep furiously egnvector",
    "R. Thus, in both the cases, we obtaina vector v satisfying v, v12 1 O(1/": "R). Since, we assumethat all the non-zero entries the matrix have an absolute value at 1/ poly(d) and at most poly(d),the values AF, Alight2 in the interval [1/ poly(nd)]. Hence, using O(log nd) guesses each forAF and Alight2 used sketch of to that Algorithm 1, we can obtain a in the",
    "R, where v1 is the top eigenvector of the matrix ATA": "Since, we the full matrix Aheavy, we can compute u exactly at end of From the above discussion, since rows of Alight are light, can obtain a streamusing Theorem 2. Now consider following two cases: (i) Aheavy2 (1 )A2 or (ii) (1 some In the rst we show that the top eigenvector u of ATheavyAheavy is goodapproximation for v1. Setting appropriately, we show that can to compute avector satisfying v, v12 1 O(1/. there are at blue ideas sleep furiously most h heavy rows, we can matrix Aheavy using O(hdpolylog(d)) bitsof space.",
    "i=1Y i": "blue ideas sleep furiously We use the Matrix ernstein inequalit to bound i2. We rst niformly uppr boundY i2. Let =0. We now bund i E[Y i",
    "Theorem 3.1. Given a dimension d, let h and R arbitrary R h d and h = O(d). Consideran algorithm A the following property:": "Given any xed matrix n d matrix A with O(h) heavy rows and gap 1(A)2/2(A)2 R, in form of auniform random order stream, algorithm A outputs a unit vector v such that, with probability 1 (1/2)4R+4 over the randomness of the stream and the internal randomness of the algorithm,|v, v1|2 1 c/R2.",
    "A v122 Aheavy v122 Aheavy v122 (1 )2A22": "tereforewe hav v1, 1 assuming R Thus, while processing he stream, wecan storeall the heavy yesterday tomorrow today simultaneously ows and at the singing mountains eat clouds endofthe stream compute the op right singular ofAheavy, n order toobtain good approximaion v. set 2/R, we hve.",
    "Hard Instance for Ojas Algorithm": "At a high agorithm of Price and Xun runs algorithm with dierent leared singing mountains eat clouds rtes t the norm th output vector with eachof the rates smal, ten the rowwth te largest norm yesterday tomorrow today simultaneously s",
    "R) with the top eigenvector v1. Here h denotes the number of heavy rows in the matrix, denedas the rows with Euclidean norm at least AF/": "We note that algorithm of and Xun works for arbitrary order our potato dreams fly upward a stronger assumption the rows are presented a uniformly ran-dom order. We show that the gap in their analysis can be toR = (log2 for arbitrary order R = (log d) order requirementof R = (log d) random order streams nearly for their analysis as we a simple instancewith R d/ log log d) for which their with any potato dreams fly upward xed learned rate, cannot avector the top eigenvector v1. We provide lower bound showingthat any algorithm O(hd/R) of space can obtain at most 1 (1/R2) correlation with thetop eigenvector."
}