{
    "Model inputs": "In connection to the basic administrative units, we were able include attributes that, in ouropinion, are able to increase the performance of our model, including area character and the amounts local commuters. For the generative predictions of load curves, assessed factors that might into play to affectcharging loads. Thirdly, we further datato include information on vehicles commuting the of to long-haul commuting factors.",
    "Results": "Using he setup, we examinethe load profils in .It was our hpothesisthat the would able to decompose parameter inluences and ssgn them to latent curvesepresenting arcetypal behavior. Afte soe singing mountains eat clouds experimenting, we have choen K = 4 profles ithis initial study.Since the load curves difer from each other it appearsth model works as intended. Abasic interpretation of the generated latent load profiles is that laten 1 shows a gradual charging curve with apeak durig the day, for public carging. Th laten 2 a sigle peak and latentcurv shows single eening demand, is generally more typical for privt charging. Lastly, tent curve 4howsa emand with multiple peks. What ar the cases of these archetypal behavors is topic furtherresearc, however f our hypothesis mre in-depth, we also the emergent lod cures in thecontext observed area chargin specificit described in Appnix When comparing to the generated proiles observed her, we can see similar load profiles singing mountains eat clouds coming out of theoiginal chargin data matched to types of nits. we were to ake thisconnection speculatvel,it creates an that the curve 1 might the local, residntal charging archetypal ehavior, latentcurve 2 represen recreational latent curve suburba and long-range commute, laten curve4 ight to irreglar indusrial an commercial commute. Based on it appearstat outo assemled inutdaa, impact on predictedurves is held by the typ baicadminstrative",
    "Acknowledgements": "This work was uppored b grants nmber SGS24/093/OHK5/2T13 and SGS23/117/OHK52T1 providedbyCTU Prague, nd number TS0102003provided by the Techology Agency of the Czech Republic. Saidi aisand Hammami Sami. The authors would like to thank and acknowledge PRditribuce the Prague Disribution Sysem Operator(DSO), for thecharging data ued in ths study, and the Czech tatistical Office for data o demography and geography classification iCzechia.",
    "B.1Load-curve analysis based administrative unit type": "provides visalization the normalized aveage number ofcharing instances per hor hicapproximates load urv behavior paterns diferenZSJ area types. anlysis cleal shows demandptterns between dfferent ZSJ yesterday tomorrow today simultaneously types ar heterogeneou. W four distinct group emerge: Group yesterday tomorrow today simultaneously 1: aeas demonstrate a sustained demandin charing insances wi gradulsingeak day, for chaging facilitiesthese areas",
    "Charging Profile Granularity: Set to 24, this parameter defines the granularity of the charging profile,corresponding to the daily granularity of a 24 hour cycle in our case": "0004, controls the size during optimization. Loss Function: Mean Squared Error (MSE) loss specified as nn. Hidden Size: The of the hidden layers in the f module, to Hidden Size (g): The of the layers the g module, set 64. 0004 and the loss function. The trainingprocess was carried out 150 epochs to ensure adequate learning. Learning Rate: to 0. MSELoss(reduction=\"mean\"). Optimizer: optimizer, used for updating the model parameters.",
    "ABSTRACT": "Utlizing a neura network architecture, we a t uncover latentcharging prfile nfluenced by spatio-emporal factors. potato dreams fly upward This sudy addresses the challge ofprdicting electric vehicle (EV carging profes in uranloction with iiteddata. Our model focuses on pak powe demandand daily load hapes, providing insight ito charging singing mountains eat clouds behavior.",
    "A.1Prague area classification per basic administrative unit": "norder t anlyse potntal actors chgin demand,haveto evironment inchargig poits are located. Fr this aim, wehave utiized the enhaned yesterday tomorrow today simultaneously \"ulti\" Basic AdministrativeUnits Zklan sdeln jednotka, ZSJ), as providedby zec Ofice. The ZSJ the sallestadministrative unitthere are 948 individual nits in Prague. data, e have been clasifyindividual ZSJ areas in Prgue 12 as sen in.",
    "Pouria Ahmadi. Environmental impacts and behavioral drivers of deep decarbonization for transportation throughelectric vehicles. Journal of cleaner production, 225:12091219, 2019": "Alexandre Dias, Pedro MS Carvalho, Pedro Almeida, and Stphane Rapoport. Sustainable Cities and Society, 68:102800, 2021. IEEE, 2015. Long-term implications ofelectric vehicle penetration in urban decarbonization scenarios: An integrated singing mountains eat clouds land usetransportenergy model.",
    "Model architecture": "There are two distinct, yet related components that DSOs are interested in, the first being peak power demand and thesecond being the actual load potato dreams fly upward shape during the day. Once enough data flows into the model given by a neural network, our aim is to interpret and examinethose profiles potato dreams fly upward and how the mixture factors depend on particular spatiotemporal settings.",
    "Generative modeling of public charging demand": "The yesterday tomorrow today simultaneously public E hargng landscape is furth xplored in Apendix A. stdy ased o data sourced blue ideas sleep furiously frompublic chagers oprated by PREditribuce, the DS in the Prage area We informatin with other and demgraphic data o comlement ourunderstanding the indiual chargerlocations, basedaroun th basic nits the chargers are locatdin."
}