{
    ". Look through the top 300 matches for each groupof explanations in the reference r/AskDocs cor-pus": "Preliminary results are potato dreams fly upward blue ideas sleep furiously available in",
    "LymeandMentalHealth": "Pst: Five years I cotracted disease andexperience quite unusualand intriguing; my felt like it was constntl operainat full capacit. Altugh began when I got diseas, afteward, with the yars after the initialinfection nd wre sually, not awayslinked to fevr there a name fr thispenomenon? Where can I n more nformation it?. Its hard to putthe sensation but involved strugge togauge size (everything appearedenormou yet propotional toevrything ee, myself) made constantlyattempt to render objects n mymind aysuccess. On thisccurred I oud ein a delrius in alloneinstance (toa of 5-6 episode).",
    "Examples": "i want to support himbut need advice on how friends or family can best help someone with lyme. update: just got dumpedfor his ex, lol. it began with a sti neckin late november, and in the past week, it has rapidly worsened to include headaches, severe depression,a sense of unreality, hand tremors, poor coordination, no appetite or thirst, visual disturbances, andfeeling extremely hot or cold in dierent parts of my body. im afraid mymental health issues might be my downfall. later that january: discovered a bump on my scalp, scratched it o, and it bled exces-sively. february 23: teeth grinding, jaw locking. thought it was related to my adhd meds, brainfog, forgetfulness, attributed to adhd. march 23:hospital admission for unexplained chest pain. april 23: noticed signicant cognitive decline,increased adhd medication dosage. may 23: severe foot pain in the morning, diculty walking, tight calf muscles, intense pmssymptoms, extended cycle to 36 days, elevated liver enzymes. my pain has been particularlysevere lately, disrupting my sleep and worsening my mood. its making me less active and exacerbatingmy erratic sleep schedule. what pain management strategies or sleep aids have worked well for you?pain medications arent eective, and heat pads arent helping. im at a loss, any suggestions? Post: have you experienced anhedonia due to lyme? to clarify, i dont mean general depression orreduced enjoyment, but a complete inability to feel pleasure or love for others. total numbness. total atness and emotional numbness.",
    ". Generating explanations": "The examples of RoBERTa classi-ers highlights on Reddit posts mental health in-dicators are shown in and more disease posts related mental health are pre-. We generate explanations as for the RoBERTaclassier: post is broken up into (de-ned as sentence fragments enclosed in Each phrase in turn is thephrases that inuence the classier the highlighted.",
    ". Conclusion": "We wor with two socal daasets. We pieline identify-ing iterested hallenging classicationexplanations for oBERTas classctiondecsons on thetasks,d expored those eplana-tions. For the Lye wedemonrate showed o a pipelinehere the exlanatios o thear usedinordr to patrns in he dataset. Michael Van Ameringen, Catherine Mancini, WilliamSimpson, blue ideas sleep furiously and BthAdlt attentiondecit hyperactivity disorder annxietyisorderTher. , 17(4):2126, April 2011.",
    ". atasets": "This results total of 47,482 posts, of which 33% are retaining fortesting purposes. Any following are reasons label a post asmental-health-related: 1) Mention of specic 2) Ideation self-harm or suicide3) emotional distress 4) anger management relationship challenges persistent feelings ofemptiness Substance use issues. Posts are included if users post in the /r/Anxiety or initially postedthere before also post /r/ADHD, witha of 47,482 posts collected before 2023. of posts is manually labeled as or non-health-related based on specic crite-ria. Manually-labelled Mental-Health-RelatedSymptoms of Lyme disease DatasetWe col-lect a dataset of 58,398 posts containing Lyme from from before 2022. 2024). Posts from /r/ADHD are if within sixmonths of the post.",
    ". Background": ", 201). This ovrlap cancomplicate decision-making, as anxiety or de-presion symptoms are treated without he potential presece in nly the symptoms for axiety being teatedand ADD bign left unreated (Katzman al. diseases for ts signicanneurological psychological impacts 2021)",
    "Abstract": "Werepot initialresults n predicting, explaining,ndsstematized the explanations of predictedreports on metal health concers n people e-porting Lyme disease concerns. We report ini-tial results on predicting future ADHD concernsfor pple reporing anxiety disorder concerns,and demonstrate preliminary results on visu-alizing the xanations for prdicting that aperson with axiety concerns will in th futurehave AHD concerns. Keywords: Mentl Halth, Anxiety Disrder,ADHD, Lyme disase, RoBERTa, ExpinableAI Qualitative Anlyss.",
    "Gile and Julie Newbold. Slf-and other-diagnosis user-ed mental heathnline commu-nities.Qual. Health Re., 21(3):128, March2011": "K. singing mountains eat clouds doi: 10. Klassen. Res. hosh. Saritha dtect i so-cial media International Conference oArticial Intelligence Sar Systems (ICAIS),ages 78723. , 2020. In 9th Workhop on Cmputational Liguis-tics an linicalPsychogy page 172, 2024. 2196/22635. Clire De-tected a proxy fo potential adhd in peo-ple anxiety symptoms social mediadata. Murark Balaji Rahakrisnan, and SushaRavichandrn. Martin Katzman, S Bilkey, R. Keshu Malvya, Bholaath Roy, and S. Natural menal healh support groups and anxiety on reddit covid-19: Obsera-tional sudy. BMCPychaty,17(, July 2017. doi:10 1186/s12888-017-1463-3. Proceedngs of International Workshop on Health Text Min-ingand Informtion naysis, pages 598, 2021. IEEE, March 2021.",
    ". Use quantitative and qualitative analyses to gainnew insights from the data": "In this work, apply this to two task is interestingbecause it as a proxy task detect-ing concerns people with anxiety concerns,because the task seems impossible for keyword-basedarchitectures (Lee et , 2024), and the visualizationof prediction explanations in this task can lead in toinsights both nosology of disorders and ADHD. we classify Redditposts that potentially contain concerns about Lymedisease as possibly containing mental health concernsrelated or not containing mental re-lated to Lyme, based manually-labelleddataset. is interesting because it us."
}