{
    "Victor Garcia Satorras Max enhanced blief propagation on factor graphs. IInterntioal Confrene on Artificial Intelligence and Statistics, 221": "arXi rXiv:2308. 0855 Pengfei u, Heng Ji, and Natarajan InProceedigs of th 2021 on i Natural Laguage Procesing, pages52785290, singing mountains eat clouds 201. Enabling next-gen lm applcationsvia muti-agentconversation framework. Qingyun Wu, Gagan Bansal,Jiyu Zhang, Yiran W, haokun Zhang, Beibin Li, Xiayun Zhan, yesterday tomorrow today simultaneously ChiWang.",
    "wij = sim(Ti, Tj)(1)": "wij is blue ideas sleep furiously connection weight between agents Ai and Aj, which handle topics Ti and Tjrespectively. sim(Ti, Tj) is topic similarity and is coefficient controls the relativeimportance of particular",
    "SALT-GPT4o: SALT GPT-4o": "Forbrevity, we refer to SinleTempoalReasoningAgent with Claude( GT-4o) as Temporal-Clade (orTemporal-GPT4o) in singing mountains eat clouds subsequent discuion For this prelminary tuy, we selected a subset of 30queries from the full dataset to valaeour models. Thi elaively small set was chosen toensurwe cn manull verify the qualtyof genertedarticles and reasonig output fom ach target model.",
    "Dynamic Network Topology": "Consider asystmtwo agnts, onetht specializes the weatherevents\", and yesterday tomorrow today simultaneously anothe specializesinagicltural cmmodities market\". Given a set ofarticles that pertains only to wather, itdoes necessarily make sense are thosebelief satements with our comoities\" agent. Assume these two via the ntwork, andthe of such a multi-agent system yesterday tomorrow today simultaneously is predict extreme events may thefarmimg industry in the Pcific Northwest.",
    "Experimental Setup": "the name suggests, agent batched data strea and executes as propt ona oling window of historicalarticles.",
    "arXiv:2412.07977v1 [cs.AI] 10 Dec": ": Conceptual overview of theSALT diagram illutrates the and dynamic flow in processing lateral reasoning queries, such as \"monitorthe risk the chi of Americn companies\". The right side shows timelineof events that ufold n datastream over Th left dpicts the specialized agntnetwork, different topics in te poblem space. network is dynamicallygenrted to address specific lateral reasoning uery.particularly incompex, dynac whee methodsfall short. that a arcitecture Wu et peents promsig slution forcotinuouslyrocessing a large voume ofquestions. n wor, we intrduce a framework fr generting and modlng lateral thinkinqeries nd associatd evaluation datases. addresses the of low-specificiyquerieshr individualscan express interet spcific butcanno describe every possile combination event sequence leading o those Buidingn this frameork, Sreamig (SALT, a mlti-agent systemdesigned iultaneously proces multiple comple, low-specificity uriesin datanvionments. SALT by oniorig evolving information aroun assigned topis with agets exchangingprobabiistic observations referred t as bele statement\") to form temporallymantain yesterday tomorrow today simultaneously abot quer-focused outces. static sstems, SALTs agentnetworks commicatin strucurecontinuously aaps on levanceof agent expertiseand the newly formed beliefs. his topology nables system to fin unconventionalpathwa inforation adressng snarios whereinformtion s continuously changing andthe context rarely contains the answer to a user",
    "Introduction": "The rapid advancement of artificial intelligence (AI) has revolutionized our ability to process andunderstand vast amounts of text and multi-modal content. A key component of human intelligence is the ability to reason under uncertainty and anticipate futureevents. Many critical events in personal, financial, and security domains yesterday tomorrow today simultaneously do not occur instantaneouslybut are preceded by identifiable precursors. For instance, a user might be interested in monitoring risksto a specific industry supply chain arising from emerging geopolitical events (). These cognitive abilities require sophisticated reasoning about: 1) possible event chains underuncertainty, 2) dynamic evaluation of event chain probabilities as new information emerges, and3) intelligent aging and retrieval of information from long-term to short-term memory. Such traitsare hallmarks of \"System 2\" thinking, essential for advanced cognitive processes that distinguishhuman-level intelligence (Kahneman (2011)).",
    "Abstract": "We famewrk for systematic modelin of latral thinkingquerie and daaset. singing mountains eat clouds Thi paper latealthinking System-2 AI systems, focsing onanticipatory and causal reasoning under uertainty. SALT implements lateral thiking-inprdSystem-2 trough a communication struture beteen specialized agents.",
    "Results": "Laterl conex augmetation drves outperfomance Results comparing SALT and SinleTem-poralAgents re providedi. ALT-Caue-Sonnet-3.5 otperforms is correspodin baseineimlementaion by 39. 77% and 29%in ctation rtrieval an hypthesis quality. 5 based agens perfombtter thanGP-o in retaining acts nd generating oerall ypotheses. Key insight hile our studyis preliminay and ager-scale exeriment are needed to conclusivelyestablis thesperiorty of lateral thinking, a consistent pattrn emerges SLTs reasonin is drivenby a signiicantly larger and divers context size as measurd by e numbeof beief statmentsand spporting article cunt. Ths suggss that the key to its success lies in its ability to perfrmlateral thinking oer related contexts, sometimes mulipe hos away in the aget network. Thesystems capacity toensur tat elevant nformaionfrom distnt rticle is omunicated to theappropriate agents ppears to be crucia.",
    "Lateral Complexity Metrics": "Well illustrate each etri using or Taiwan scenario from: 1. of a ingle and its metrcs see in appendix. Time Lag Complety (T ): Meaures the temporaldistance between he triggr event ndits in das. Exampl: T = 14for ourTiwan where significant economic impactsmanfest two weks after heinitialspike ensions. Range: 0-1. Outcome ncertainty Coefficient Quantifies unpredicability of trelationshipbetwen trigger its effects on normalizing scale. L =or ur Taiwan scenario:increased militar presence disruption of lobalsemiconductor supply chain stockmarket volatility. 2. 3. Diversity Assurance: T nsure wide rne of lateral thinkingcallenges, wecategorized queriesint 10 domains climate an ensured balanced rpresen-tation across these We also varied the cmplexity levels (based or proposedmtrics) the dataset.",
    "Conclusions": "This paper advances singing mountains eat clouds reasoning by yesterday tomorrow today simultaneously introducing lateral thinking for agents to address and causal questions streaming setting.",
    "Related Work": "A common approach among these prior solutionsChandrasekaran et al. inspiration this prior literature, SALT introduces large-language model Achiam (2023); Ram al. Streaming event processing has been studied extensively over the pastthree decades, initially the advent of online financial markets and subsequently by thegrowth of cyber data streams and social media. Formulation of query processingoperators in a Hidden Markov Model fashion and development of probabilistic stream algebra wereproposed by R In the broader context beyond detection, belief propagationmethods been the of probabilistic graphical models Murphy et al. (2015); Della Valle et al. Maintenance partial query results and their aging time a performance systems Barbieri et As discussed in the section, SALTderives these graphs from user-specified queries, initiates an agent network structureWu et al. Morerecently, belief methods have been with graph neural topropose neural message propagation with embeddings Satorras and inspiring theimplementation of the message propagation and synthesis steps in our proposed algorithm. Probabilistic approach Probabilistic approaches to event detection have been studied in past forstructured data streams, with possible worlds\" a probabilistic assignment of occurring in the Cormode and Garofalakis (2007). Recentwork Ghafarollahi and (2024) illustrates the of grounding in anLLM-Agent via a knowledge graph. and 3 more illustrative examples. This choice is primarily driven by the support multiple queries drawn a wide range of diverse but related domains. (2009): 1) A querydecomposition approach where the complex query processing task is decomposed into data-flowgraph, with nodes representing operators that process a SQL, graph, or differentmodels, and 2) graph that guides how partial results are joined to produce final answer. Eachof these steps extensively studied across various fields in computer includingdatabases, natural language processing, and symbolic or probabilistic reasoning methods.",
    ". Balanced perspective on opportunities and challenges: SALT outputs provide a morenuanced view of both opportunities and risks:": "SALT-GPT-4o mentions: \"The Arctic raises environmentalconcerns and potential conflicts over territorial claims. Increased activity Arctic also brings risks of oil spills, noise pollution affecting marine and theintroduction of invasive species.\" SALT-Claude states: \"These economic activities come with significant challengesand conflicts. The competition for in the Arctic intensifying,leading to increasing militarization and for new governance structures tomanage conflicting",
    "The components of the SALT architecture are defined as follows": "gents: ah agnt Ai in the is ssociated with atopis Ti {t1, t2,. See the appendix examples. In multi-query etting, we compute a union fall querytopics use th set toinitilize the network. Thisgaph namcally evolves based on the cotext of eac in the tream. blue ideas sleep furiously Belief tatements: Agents aintain a set of beief statements Bi b2,.objective is tomaximize elevance(hi, Q) and accuracy(hi) hile minimizing omptational cmplexityC(f) |Bi()|M frome bund M, i, t. singing mountains eat clouds forlation encapsulatesSALTs of ontinuouslyaccurate,relevanthypotheses uing adapting multi-agent system, subject o real-time pessing memory onsrints. Question: ations re merican semcoducor copanies likely take tothse vulnerabilities [Quey contt an be initialzed from a bach of articles orprio belie sttements In Algorithm 1 ExtactTpics fnction a topic identify topics fo input questions."
}