{
    "Sobol and S. Derivative based global sensitivity and their link withglobal indices. Mathematics and Computers in 79(10):30093017, June2009": "Lamontagne, Jennifer Morris,Katherine V. Geoscientific 14(5):31213140, Dawn Woodard, Abigail Jonathan R. Preprint, Integrating assessment March. Reproducing complex simulations of of climate changewith lower-cost emulators. Junya Takakura, Shinichiro Fujimori, Kiyoshi Takahashi, Hanasaki, Tomoko Hasegawa,Yukiko Hirabayashi, Yasushi Toshichika Iizumi, Chan Park, Makoto Hijioka. Calvin, Matthew Binsted, and Pralit Earths Future, 11(8):e2022EF003442,August 2023. A.",
    "Results and Analysis": "results for Regi Year, singed mountains eat clouds andQuantityfirt over thtertwo dimensions (e. summarized in analyze performance of ur emulator by the ouputvalues to tose f GCAM, ascopared t sesiivities of the emultoro hose of GCAM. This of aggregation not improve the aeady near-perfet overall Resuts re reprted R2 singing mountains eat clouds values beween GCAM andthe emulator its the test and o GMS sensitivity(on th DGSM set), agregated egion, yar or quantity-level, and ovrall. g. 998.",
    "Data": "Sampled Strategies:With the introduction of interpolated values, the input space can no longerbe enumerated, so we consider two strategies for sampling the space: Latin hypercube andfinite-diff. Among these, we identify 44 GCAM output quantities to predict (see Appendix Bfor full details). The extreme high and low values still represent theoriginal binary meaning, while all intermediate values are linearly interpolating between the high andlow scenarios. Inputs:This paper follows the experiment set up by Woodard et al. In either strategy, the nine interpolating inputs are sampled by strategywhile the remaining three inputs are randomly sampled randomly uniformly in {0, 1}. To enrich the input space, we consider here input values between the high and low. For nine of the 12inputs yesterday tomorrow today simultaneously (see Appendix A), an intermediate value between high and low is well-defined, so we relax thedomain from {0, 1} to the interval 0 x 1. Each scenario of GCAM is shaped by exogenous factors like socioeconomic trends (population andGDP growth), technology costs and performance, historical information, and assumptions aboutfuture values of key drivers.",
    "Introductionand Background": "The glbal chng probleminvolves both Eart nd human sytem dynamics, interacting and creainfedbacks among multple componentsand sectr that make up the whole system The GlobaChange Aalysis odl (GCAM) and other modelsofthe same clas e esential to representhe utre evlution of thehuma system, ncluded socoeconmic, land, eergy, and water ecors,iving rise t future plausible d coherent scenarios of emissios.In opposite direction, climate output from Earthsystem models i usedto model imacts n GCAM and oher integrate mlti-sector models. Thiswork focuses on emulating GCAM specifically; it is an opesource multiector ynmic model thatsimulates the integraed,simultaeous evlutio of energy, agriculture, land use, ater, an climatesytemcomponents. GCAM simulates global markes segented into 32 distint ocioeconomicregions, 235 hydrological basis, formed 384 ln unis from te intersecton of basins and egions. Histrically, GCAMand comparable modls hav run discrete stofstoylines or representa-tive future narios. In contrast, hanks to advances in omputational poer and analysistools,exploratory modeling, sapng a much larer set of drivers (ad therefore outcomes) ha ecmepoular n recent years. In thi approach, large ensemblesof scenarios are designd and run.",
    "InputKeyDescription": "Wid and Solar Bacupsbackystem to backu wind a sarBioenergybioTax onbioenergyCab CaptreccsCarbnstorage resource costElectifiatinelecShre of electricityin building, industry, and transportationEmissionsmissCOemissio constraintsEnergy DemadengyEnery Demand -GDP and populaon ostsffCost of crud unconvenial ol, natura gs, and coalNuclear CostsncCapital overnigt Storge storgeovernight costsSlarTech CotssolarTCSP V costsWind Storage CostswindSWin torage capital overnight costsWind Tech CosswndTWind and offshore capital",
    "Conclusion and Future Work": "We presenin this pper h-fidelityan cmputatioally mlatr of CAM used depleaning. In thedoed so, we enriched sampled of nputs undrpinni anexisting (in W2023) of drivers f rnewableenerg by 2050, relaing9 of 12 variablesbiary This repesents a partclarly valuable additionto the study that, by limiting exploration tbinar choices for input parameters, riskeoverlookingoucome of interes assiated We confirm our emulatorishighl accrate and tha its are consistent with GCAMs. In futue wor, weexplre te use f ths higfidelity for pac (e.g., to identifycircumstances that minimize scrcity) to the generation of lage f GCAM,ad to understand itelf. Ultimately we iew this as bridge to a nw wherelrge ensembls are rlvant but theircreation e aidedmachine to reduce thecos and complexity; work to answer cientific questios cliat, energy, land andwater systems can generate tailore ensemblesi an itertiv, eulator-in-the-loop",
    "Emulator": "All output vls are ter trainin set each quantity-region-yea pair xq s normalizedsing (xry where (qry)and standard (qry) are computed for thatspcific qatity-region-year value across trainingdataset scenarios. fullyoncted output lyer contains 22, 528 units. illusrates the emuation Specificlly, a our-layer, fuly conected neural network, each laer with 256idden units followedby a linear rectfed (ReLU)hiddnactivion function. We with the AdamW optiization algorithm for500 epochs with rate o 001.",
    "Lukas Biewald. Experiment tracking with weights and biases, 2020. Software available fromwandb.com": "Dlan, Jonahan Lamotagne, Katherine Calvin,Abigail Syder, Kanishka B. Sith,Abigail Snyder, Stephane Waldhoff, and Marshall Wise. Earths Future, (2):e2021EF02466, February2022. vauating the ipact of water n hanging world. V. : Rereented yesterday tomorrow today simultaneously btwen enrgy, land,andeconomic systms. Geoscietiic MdelDevelopment, 12():677698,2019. Vernon. the Economicad Environmental ImpacsofLand Scrcity Uncertinty. Di itorio, and hris R. Ben Kalyn Ryna Ci, Abigal Snyder, KateineCalvin, Leyang Feng,achel Hesly, Jill An Package forPreparaton, Synthesis, ad of Inpu he Integrated Model 7(1):6,March Calin, Pralit Patel,eon Clar, Ghassem Asrar, Ben Bond-Lamberty, YiyunCui, Alan Di Vittoio,Doheim, Jae Corinne Hejazi, RussellHorwit, Gokul Iyer, Pag Sony Kim, Link, Hewon Steven J. Flanery Jonathan yesterday tomorrow today simultaneously Robet MohamadHejaziPatrick JeEdmonds.",
    "arXiv:2412.08850v1 [econ.GN] 12 Dec 2024": "Relatvey little work has been doe with emulationf ntegratd, mtisector modes, but results ave ben promising. to fillthe gap etween the representative storylinescenarios. This approach has beenfuitful frexploring theompex sensitivities theemodels hav to assumptions about thesystes under test,and external drivers that dtermine their outcome. Second, the differentiability of t elation enaleeffcient searh lgorithms over the input space. We aim to enab this comprehensiveexploration via deep learning-basedemulaton ofGCA. Existing lare ensembles provide data to tain and evaluate such emulatos ist, once trained, predicting outcome for novel scenarios is faster thanGCAM by a least three orders of magnitude."
}