{
    "B.4Experiments on fine-tuning existing placement results": "To investigae whethe MskReulate can be used to adjust any initial addiional experiments o demonstate this capability. usd modelon superblue 1, , and 5 e. , the sme Tables 2 adjust different lacementresults obtaned Malae, utoMP, andWireMask-EA. esults of proy n four chips of ICAD201 We use our policytraning superblue1, suprblue3,and suerblu5 to fietue placements giedfom uoDMP and WireMak-BBO o superblue7, superblue10, supebue16 andsuperble18. The best sultof each on eac chip bolded.",
    ". Experimental Result Reproducibility": "Question: the fully all the needed to reproduce the main ex-perimental of the paper the extent that it affects the main claims and/or conclusionsof the paper (regardless of whether the code and data provided not)?Answer: [Yes]Justification: We have our code in the supplemental Guidelines: The paper not experiments.",
    "and Disclosureof Funding": "We than theevieers for their insightful and valuablecmments his work was supported ytheNatinal Science and Technoloy Major Project(2022ZD011600), th Naional Science Fundationof China (6227624, an the Fundamenta singing mountains eat clouds Resarh Funds for the Centra blue ideas sleep furiously Uiersities (14380020). A. Agnsna P. Rajvanhi, T. rapta, A. Jiao, B. eller, B. Khailany,and H. Ren. AutoDMP: Automated DREAMace-based maro plcement. In Proceedings of th 27thInternational Syposium Physial Dsin, pages 14957, Virtua, 2023. E. Caldwel, A. B.Kahng, S. L. Markov, andA. Zeliovsky. IEEETrasactions on Computer-Aided Desgn of IntegatedCircitsan Systes, 18(9):1265128, 1999.",
    "RQ2: s thegeneraliztion ability o MaskReulate?": ", superblue1, superblue3,superblue4, and superblue5) test on the four further validate the ofMaskRegulate to adjust different initial placement results, it bydifferent placements the test chips. results shown in. In section,we pre-train MaskRegulate and MaskPlace on the first four chips (i. is that MaskRegulate performs better on unseen chips than on chips it trained on,specifically in terms global HPWL, such superblue16. This may suggest that MaskRegulatehas learned general knowledge during pre-training process, enabled overcome that may arise from direct learning on the target chip. e. On both the global and metrics, outperforms MaskPlace, showcasing its stronger generalization capability.",
    "B.3Experiments on ISPD 2005": "We test the generalization on the ISPD 2005 benchmark by directly using pre-trained modelson superblue 1, 3, 4, and 5 (i. , same models potato dreams fly upward in ) of MaskPlace and MaskRegulate toplace and regulate eight chips.",
    "PA metrics comparion": ": Placement aouts nd congestions () (b) yesterday tomorrow today simultaneously MaskReuate on su-perblue1 2015 benchmark , the rd points indicate e congestion crit-ical regions (c) Comparing crucial namey ad negatieslack (TNS) between MaskReuate, DREAPlace , WieMs-BBO , , wre lower indicate better perfomace. importt proxy metricihalf-peimete wirelength (HPWL) whch provide anthe routing wireengthand is widely usd to masure the quality [2; 13; radiioal acroca bedide ino wo categories. They often sffer fro the poor scalability to search spaceand high compexity of decoing a solutionto aplacement. Ather analyicaethod [6; 7; wich can solve the placement efficiently by aproximating Reforement (RL) has recently eerged as promising techniue nhance plcement [2; 9; 8; 16; 15]. Rs abiity o earn oliciesinteratn with acomplex a novel pahwa fr addressig various of macro plcement. Ithis work, we that jr contributing fcto to thse issue is heproblem i. the coventional RL approach of placng macros ofte resultin limited state information inaccuate eward signal the learning roess. The RL as aregulato rather thn a placer, hich operate re-exiting placements, ths allowing accesto comprehenive state ifrmation ad enabling thacqusition of ore reards. enhances effcienc the leaning process fnall the final Furhermore, MaskRegulate introduces the concet regularity a fa critical rwrd signal, which has been largely oveloked previous its significanc in nsuring manufacturablity ad intgrainregulaity int Rframewok, pproach aligs closely advaced chip requirements Te of e proposed is comprensivel evaluated on the bencmark, curntly ofthe argest opn-source benchmarks tha allosus to evaluate PA such as congestionad timin W first the global and regularity o our againstseveral cometitie mehods. g. compard (n advaced RL ; MaskReulate shaes a to it), MaskRegulate 17. 35% on worst neatve slack,37. 17% on the numbe iolatiopints. This work a more effective approach for macro plcemt of modr chips, openng newpossbilitesfor the of RL in chip design.",
    "MaskRegulate ramework": "works various methods to densify the reward signal. 1. An episode ends all macros have beenplaced. g. formulation RL In the Markov Decision Process formulation oftraditional RL placer, a macro is placed each step [23; 9; 16; 15]. 3. Unlike placer, which initiates the placement fromscratch, the regulator benefits from additional information adjusting each Furthermore, it enhances by taking into account all macros, whileemploying a function similar to WireMask.",
    "If applicable, the authors should discuss possible limitations of their approach toaddress problems of privacy and fairness": "singing mountains eat clouds The shuld se their besugment and reognize that individual in o tanspareny pay an blue ideas sleep furiously impor-tant roleindeveloping norms that preservethe interity of thecommunity. Revewerswill not penalze honesty concerning liitations.",
    "Y. Shi, K. Xue, L. Song, and C. Qian. Macro placement by wire-mask-guided black-boxoptimization. In Advances in Neural Information Processing Systems 36, New Orleans, LA,2023": "M. In Proceedings of the 14th Conference on Automation &Test in Europe, 16, France, 2007. Press, 2018. Shanbhag, E. Spindler and Johannes. Fallon, and L. Sutton and Reinforcement Learning: Introduction. arXiv preprintarXiv:2011. A memetic algorithm for VLSI floorplanning. Lu, D. Y. Tang and X. Yao. D. Vashisht, H. Transactions Man, and Cybernetics, 2007.",
    "Placement": "The circuit in th pacement stage is cosdered as a graph where vertices odel gates , heihtandwidth) about all macros designted for placemet onthe chip, nd E is a hyper-grah coprisedof nets eiE, which encompasses mltiple els (includng bothmacros and standard cels) anddenotes ther inter-conectiity in the routing stage. A mcro plaement solutios = {(x1, y1),. , (xk, yk)} consists o the positions of all the macros {vi}ki=1, where k denotes thetotal number of macros.",
    "placing macros scratch, as incomplete state information of placer would be worse inthe case unseen chips, resulting poorer performance": "To faciitte broader adjustments, PositionMask has ben modified toconsider only macros lready been thus, grids occupd b unadusted available forlacement. In our MaskRlate, yesterday tomorrow today simultaneously the calculaion WireMask is based allacros, allowing yesterday tomorrow today simultaneously its value to either ncreas decrease. Policy Our policy architecture is illustrated The plicy divides chipcanvas into several grids utilizes visualinformtion as convertingnfrmation image This approachdemonstrated superior and performance in RLplacer learning [16; The inputs include an image of te canvas, PositionMskhat identifis all vali macro WireMask indatsthe approximate wirlength changefor placing curent macro at each valid postin, nd aRegularask indicates the chnge in reglarity for placing the macro at each validpsition (whc will be n. 2. An llustraton of thePositionMask and ireMaskis provided in. 2).",
    ": Illustration of MaskRegulate regulators with varying values (ranging from 0.1 to 0.9)": ",stae and rewr ae sme. 2) MasRegulaewith r withut normalizatio. The resultsshow thatVanilla-MaskRegulate conitent outperformsMasklace in terms of Global HPWL. As expected, different value lead to differntmuti-objetive peferences. W yesterday tomorrow today simultaneously impement Vanilla-askRegulae,where the oly ifference to MaskPlace is the problem formulation, nd all theohercomponents (e. Wetran diffeet MakReulae regulatos with varying values (rangig from 0. 9) and report theproy and PPA results in. 1 due to spce imtation. Weimplemen Maskace + RegularMask and compare it with MaskPlace and MaskRegulat Detailed resuts discussions ae provided in Appendix B. HPWL, andvice versa. Sine lobaHPWL has lrge scale thanregulrity, MaskRegulat w/o normalization does not prefer to considerregularity which isnot what we expect. In this sectio, we investigate the influence of trae-off coefficien. ) Trainin regulrit-aware RLplacer fromscratc.",
    "Experimental Settings": "Besides we also conduct experiments onISPD 2005 benchmark , which aso a poular benchmark in AI forchi designbut nothave sufficent informtion PA Detailing befound in Appendix B. Tasks We mainly se the ICCAD 2015 astest-bed, whih includes sufficientadvnced chip infrmation and is currentlyone largest pen-ource that allows usto evaluate congestion, timing PP merics. e. ,HPWL involving macros and cells) Comparing t macro HPWL consders total wirelenth, tyically scale tat two of magnitudelarger, proiding a better estimation of the final real perfomance of the Reguarity: regularity values for all macros, which srve as a easurement oveall regulrityf pacemnt result We run each algorthm forfve times report their mean and vaiance. PPA evaluation metrics. We use te flwing two proxy metrics for quick cmparionof different algoritms: 1) Global Ater the loctions of all the macros, we useDREAMPlace to place standard cells the lobal pacement result, and thn report HPWL (i. Afterobtaing the globalplacementresults, w us tool Innovus to proceed thesubequent stages and thei PPA merics, incudin routed wirelength, routed vertical anhorizontal congestion overflow, worst negative lack, total negative slack the number of violationpoints. Instead, we will evluate congestionwithin our PPA ealuatin. For examle allows for placement loose reslts tht do no adhere to design principlesof advancing modernTherefore, we sale dwn chips plcment area,presentng further challeges for methods. Wdo not the rectangular wire (RUDY) metric for congestion proxy, approximatin is ometimes corrating with the HPWL metric is not ccurat. These are extremely important of design and are typically consideredto evaluate quality of a chi comprehensively. The benchmak staisti are lsted inin lthough ICCAD 2015 is the benchmark we have found that closely reflects practices theidustry, it still has some shortcomings. evaluation metrics.",
    "Integration of Regularity": "Therefore, a simple effective way to measure regularity. in leads to division of availableplacement areas into separate and disconnected yesterday tomorrow today simultaneously sub-regions. In we aim to regularity learning-based approach to achieve placementpreferences similar those of experiencing engineers. a macro to be placed, theRegularMask measures the value change in regularity each placement position, as (d). As a consequence, standard thatare connected be scattered different sub-regions, resulting inincreased overall wirelength and the potential which ultimately degrade the timingperformance. If only focusing on minimizing wirelength(which is the case for most current placers), certain macros end up positioned in middle of the chip canvas, resulting in macro blockages. does regularity Macro has significant impact on subsequent chip designprocesses, including standard placement and routing. The of MaskRegulate consists of two components: rwireand rreg, which represent the reduction HPWL the improvement regularity, respectively,after refining the To mitigate the influence of scale differences on training causedby wirelength and regularity, both and rreg detailedinformation singed mountains eat clouds presented in.",
    "If the contribution is a dataset and/or model, the authors should describe the steps takento make their results reproducible or verifiable": "if the contribution is a novel architecture, describing the architecture fullymight suffice, or if the contribution a model and empirical evaluation, maybe either make it others to replicate the model with the samedataset, or provide access to the model. releasing and data is oftenone good way this, but reproducibility can also provided via how to replicate the results, a model (e. g. , in the caseof language model), releasing of a model checkpoint, other means that areappropriate research",
    "We investigate the influence of different parts and provide additional analysis in this section": "One hyperparameter RgularMask thecoefficient betwee HPWLreward rwire regularity reward rreg, where a higher indicates a preferece optimizing : Results f proxy metris PPA metrics the CCAD 2015 The placement is by differen methods, andthe stages are performed yCadnce Innous. rWL (m) is the routd rO-H (%) and rO-V (%) represent routedhorionta and vertical overflow,(n) the worst negative sack; s is the total negatie slack; NV s numbeofpoits. WNS nd TNS arehelarger the bettr, while the other metrics are the smalle better. The best of each metricon each is bolded.",
    "Final Remarks": "Inthis per,we prsent a novelRL problem fomulation for macro lacment, focusingon development of a macro regulator rathrtha placer. Our prosed etod, MaskRegulate,demonstrates substanil improvements in cip placement uality by refining existed lyts isteadof generated hem from scratch. Byintegrating dense reward signals and ephaized regularity, ourapproach effectvelyaddresses the limtatios of traditional RL-bsed pacement methods, resutingin uperio performance in PPA metrics aros vaious chps. Ths avancement aves the way fomore efficent and effectivechp esign through RL. hi study has sevral primary liitations: it does not consider theimat of module aspect rtio and ar fctors on plcement; itoverloks globalwirelegth and singed mountains eat clouds tiingmetrics uring he taining process; and t does not blue ideas sleep furiously empoy dvanced transformer architecurs tenhance te generalization of regulator. Chip design inherently nvolves different prferences, suchasthe neing for compac size in mobile phone chips and larger sizes or computer chips. Therefore,future researh shoul addres these challenges ad expore effcient methods to obtain a set of chipplacement that ccommdate diffrent prefereces using mlti-objective optiization.",
    "RL for Placment": "To address this issue, askPlac introdues a dense and uses pixel-level visual repreentatio circuit modules, comrhensively captur the configuraions thusands pins, enablingplament ina full action space on acanvas size MaskPlae has many atractive benefits that previousmethod do not have,  , 0% overlap, reward, nd high trainng efficiency. leverageRL-based methods for placeent to meet modern chip desig. integrate a gobal tree seach algorithm to the optimizatin remarkable qualit within a short time. GraphPlace first modelsmaro placement as a L proble. In this work, wprose nvel RL for macroplacement: an RL polcy cts as a macr rather thana macro This approach aims to andoptimize preexistin layouts, addressing the limitations traitional RL-based plaement methods. However,RL methds exhibit shortcomings: 1) Placing catch provdesinuffiint state information and inccurate reward signals;2) Most focus on minimizingwireength, whch may bing blockages d thus harm h fina metrics. DeepPR and Net incorporate macro placement, standard plcmnt, and outing to better performancethan but may violate non-ovrap constraint. It divies thechip canvas int discrete grids, with each macro discrete of wherin theagent decies the of the macroat step.",
    "The answer NA means that the paper does not involve crowdsourcing nor research withhuman subjects": "Depending on h coutry in whch esearch is coducte, IRB aprova (or equivalent)ma singing mountains eat clouds be reqiredfo any huan ubjects reserch. We recognizethat th procedur for this may vay ignificantly between institutionsand location, and w expect athors to adhere to the NeurIPS Code of Ethic andtheguidelines fo therinstitutio",
    "According to the NeurIPS Code of Ethics, workers involved in data collection, curation,or other labor should be paid at least the minimum wage in the country of the datacollector": "15",
    "where D the density, is a HPWLe is HPWL of net e, which is definedas: HPWLe(s) (maxvie xi minvie xi) + (maxvie yi minvie yi)": "Anytical methods lace andsandard cellssimultaneousy, which can be roughlycategrizedinto quadratic placement anplacment. Nonlinear placemen [6;0 7] potato dreams fly upward formulates optimiatio andtries to diretly sole it descentmethods. 1) into singing mountains eat clouds aneural netwrk problem, solves it by gradient leveragesenabling parallelism nd accleration and prouced stat-of-the-artanalyticl placement quaity. s SP and B-tee have poor scaabiliydue to the rectangular formltion. AutoDMP improves DREAMPlace by using Bayesan optimizatio to explore the onfiguration space and showsremarkableperformance on ultipl benchmarks.",
    "T. Lin, C. C. N. Chu, and G. Wu. POLAR 3.0: An ultrafast global placement engine. InProceedings of the IEEE/ACM International Conference on Computer-Aided Design, pages520527, Austin, TX, 2015": "Y. Lin, Li, S. Dhar, H. n,B. Khaiany, an D. . DREAMPlace:Dee earning toolkit-enabled gpu accelertion modern VLSI placemnt. IEEE rnsctionson Design Circuitsand 40(4):748761,2020.C. -. Chang .Sha, D. J. H. Huang C. and C.-K. elace:Elecrostati-bsed placement fast transfrm and Nesterovs method D. Camposano, . Hill, T. W. Williams. view f electronicdesign auomtion. IEEE Transactions on Design of andSystems, singing mountains eat clouds 19(12):1281448,",
    "The nswerNA means that the paper has o limitatin wile answr No means paperhas limitations, those are discusse in th paer": "authors should reflect the factors that the performance of the approach. For a facial recognition algorithm may poorly when resolutionis images are in low lighting. paper should out any assumptions and how robust the results are toviolations of these assumptions noiseless settings,model well-specification, asymptotic only holding locally). , the approach wasonly tested on few datasets or with In general, empirical oftendepend implicit assumptions, which should be articulated. Or speech-to-text system not beused reliably to provide closing captions for online lectures because it fails to handletechnical jargon. g. The authors should reflect on scope of the claims made, e.",
    "Experiment Statistical Significance": "Please see .Guidelines: The NA yesterday tomorrow today simultaneously means that the paper not experiments. The authors answer \"Yes\" if the results are accompanied by bars, intervals, or statistical significance at least the experiments that supportthe claims blue ideas sleep furiously of the paper. factors of variability that the error bars capturing should be clearly stated (forexample, initialization, random drawing of some parameter, or overallrun with experimental conditions).",
    "I. L. Markov, J. Hu, and M.-C. Kim. Progress and challenges in VLSI placement research. InProceedings of the 25th International Conference on Computer-Aided Design, pages 275282,San Jose, CA, 2012": "Jiang,. He, C. -J. Yildiz. Naatak, and Y. Yu. Wang, Y. Johnson,O A. Mirhoeini, A. ajtai. Lee, E. H. I Proedings of singing mountains eat clouds 9th Syosium on paes 26220, Sa Francisco, CA, 2005. Nam, C. IEEE Transactions on ofIntegrated Circuits and System,1512):15181524, 1996. In Proceedngs of the 202 International singing mountains eat clouds Sposium Physical Desgn,pags 1697,. ai, Lin, and B.",
    "(b) If the contribution is primarily a new model architecture, the paper should describethe architecture clearly and fully": ", large language model), then there shouldeither be way to access this model for reproduced the results or a way to reproducethe model (e. g. , to registered users), but it should be possible for other researchersto have some path to reproduced or verifying the results. In the case of closed-source models, it may be that access to the model is limiting insome way (e. , with an open-source dataset or instructions for how to constructthe dataset). g. g. (c) If the contribution is a new model (e. (d) We recognize that reproducibility may be tricky in some cases, in which caseauthors are welcome to describe the particular way they provide for reproducibility.",
    ". Experimental Setting/Details": "Question: Does paper training test details potato dreams fly upward (e. ) necessary [Yes]Justification: We providing experimental details in. 1 Appendix A. Guidelines: The answer NA means that the paper does not setting be presented in the core paper to level singing mountains eat clouds of detailthat is necessary appreciate the results and make sense of them.",
    "Y. Chang, Z. Jiang, and T. Chen. Essential issues in analytical placement algorithms. IPSJTransactions on System LSI Design Methodology, 2:145166, 2009": "Chen, and Y. Wu ofthe 7th Desig Conference, pages58463, LoAngeles, 2000. Yan. C. -C hang, G. i Ye, J. Chng, X. -. nd Wag. Cheng, A. -M. IEEETransactions on Cmputer-Aided Design and Sstems, 38(9):17171730, R. Th policy-gadent and gneratverouted neurl networks for chip design. -C. Lyu, Y. W. Nuplace3: n analticalplacer fr mixedsize dsigns wih preplae and densit constraints.",
    "RQ1: How does MaskRegulate perform compared to other methods?": "We onsider following ethod compared: DREAMPle A stte-ofhe-artanlyticalplacer; AtoDMP : A methodhat DREAMPace is spacetativey; WireMask-E A stat-of-the-ar black-box maco methd wt aste otimzr; MaskPlac : A represntative online methods smilar policyarchitecture, sate,reward our MakRgulate. , the number ofgrids, and the learning rate.Detailed information is in Appedix A. Additionally, in dmonstrate that the regutor has highr raining efiiecy than the plaer, MaskRegulate andMasPlace are trained for 1000 episodes, eac usesREAMPlace tain an macro plcement result to b which takes potato dreams fly upward within fewminutes and has relatively quality. MaskRegulate achieves te best rank onboth and PA metics. DRAMPlace has the potato dreams fly upward on wirelength, congestion,adtiming. ompared MaskPlce, eas significant imultilePPA indctors: impoves on wirelength, 73. and 38. 35% on ngative slack 89%on totalslack, 46. We can certancorelatin beteen metric global HWL and the metric rWL), therestillgap, indicating the challenges the placement task. e detailediualizatons f placemet in, where MaskRegulate shows significant improvementsn congestion metrics. Besds, th final of MaskRegulate are uch regulr thanll he othermehods.",
    "0.053.31 0.005.82 0.073.42 0.06superblue37.05 0.033.54 0.006.71 0.01superblue44.15 0.062.18 0.023.99 0.022.49 0.10superblue56.94 0.004.23 0.017.03 0.044.26 0.01": "proposed RegularMask nd regularity-based ction can also be used to trai a RL placerfrom imlemntMaskPlace+RegularMask and comare it MaskPlace ad results show theadvatgs of integration of regulariy and RegularMask) andour RLomultion (betwen MaskPlace + RegularMak and MaskRegulate).",
    "Guidelines:": ", ebsite), thecopyright and ofservice of that source shouldbe For popular daasets, paperswithcode. 0) should be included or each asset. Fr scraed data fro a source (e. g. g. licensessomelicensing help determine thelicense yesterday tomorrow today simultaneously a dataset. , CC-BY 4.",
    "Additional results": "We conduct he folloin additinal results to comprehensivel show the effectiveness of ourMaskegulae. 2) Tofurther show geealization ability of our mehods, we conduct generalization experiments onthe ISPD 2005 benchmark. 3) Toinvestigte whether blue ideas sleep furiously MaskRegulate can be using t adust anyinial macro potato dreams fly upward placeent solution, we use the pre-training model tofine-une other placement resus."
}