{
    "(c) Shape of Game II (Alt)": "(b) Adding a chance node anddecision node to Game I results in Game II and gives the blue ideas sleep furiously story shape; the martingale of the Romeoand Juliet plot under Game II has both high surprise (large changes in both characters values afterJuliet is overcome with grief at the root node and when the message fails to reach Romeo) and highsuspense (high variance of the characters value functions at Juliets decision to fake her death as wellas natures choice of whether the message successfully reaches Romeo). : Shape of a Game: The design of the game tree can have a dramatic impact on the shape ofthe resulting story. (a) Game I has zero surprise (fluctuations in value function) and zero suspense(variance of value function) as it always results in a blue ideas sleep furiously happy ending (I/J).",
    "R. L. Boyd, K. G. Blackburn, and J. W. Pennebaker. The narrative arc: Revealing core narrativestructures through text analysis. Science advances, 6(32):eaba2196, 2020": "Hnighan, R. Che, E. Hadsell, M. Sutskever, D. Language models arefew-shotI H. Hesse, M. P. singed mountains eat clouds Mann, N. arochelle, R. Shyam,G Sastry A. Brown, B. Herbert-Voss, G. , 220. Rmesh,D. T. Berer, S. Dhariwal, A. Radford,. Amodei. Ziegle, J. URL. P. Litwin, S. Sigler, M. Gray, B. skell, S. Balcan, and Lin inInformatn Processingystems, vlue33,pages 18771901 Curran Inc. McCadlish, A. blue ideas sleep furiously Agrwl, A. Ryder, Subbiah J. Krueger, T. Winter,. C. D.",
    "arXiv:2412.05747v1 [cs.GT] 7 Dec 2024": "Wese LLMs to main carcters in story, te mandecsios face and their payoffs in alternaive plot lines. In a thouht experiment, iagine can pocessall the emailsof businss organizaion, identify th main decson-makers, main decisions they to mae,and how affect each oter. For he of llustration story potato dreams fly upward that is wdely known (namel, Romeo and uiet)where the decisions taken by fictional characters methodology showcased here can bequally applied instead o a literry text we a siness email renalyzng deciiosfacedby e of an rganizatio a salesperson. showshow colateth informatio about our gmetree t for input to a gme theory reasoningGambit and 2024]. againthe diferent texwindos and studies the of points obtained b h respective obtained ntions of speed, xtracts a narratie tructre trackig rate in cetaicategories o along the story n this papere a imilar atempt t extract a stuctu, excet tat this timewe on that the and the nenives and belifs riving theractions. This is, of ourse, long-term goal. Tubia al. his papew tae first step bybilding amapsories/text to games als allows us tostud such as how certangame structures tomore stories. Analyzed the Shape Stories Suspense and Surprise:Once story repesnting as a game,w can se the payffs and the equilibrium probabilitiesto the expectedof echharaer along he story aswell as the lkeliood of the smpling this way, identfyfeatres uchas plot monts, ec. I i also left to the imginatin of thereader whatwas the motivatio of caracters to they id (how wold Julietfeel if she arred Parsinstead of this paper, we resentrof concept how to use lar modls reconstructthssrctue that ncodes bothcouterfaua scenarios well s th incentives of hecharacters to act te wy they id. In ga-theortical the fortune of each character at any momnt in timecan be represented precisly by the expecting payoffs euiibrum starting from thtnodeinfo-set, whic correpondswhat s thevalue function in Reinforcement Learningad cost-to-go in cotrol This perspective allows us usethe methodologyby El etal. Thenwe may beto reconstruct which ame they are playing andwhat incentives are. Usig those, we are to repesentthem formally as an extensive-frm ame. W iscssthe rationalty of the characters well conjecture model Roeo nd Juietsworld basedo its consistncy with therys concept. measure the interestingness of th story tems and in terms fstatisical of the martigale the realze sample. This is curse hihly ambiguous task. Tis could e used to inform eaders boutthe hen incentivs speciic decision-makers abut how to play this game, todesgn mchnisms o he organization.",
    "(G)": ": Th game construct he ssistance of Gemini for the fnal plot twists at theendof oeo an Juliet. The Nash equilibriu (specificlly, logit equilirum) of Game II is denoted bythe yellow arows at decision nodes; all strategies at each node except forJuliets first which flips a fair whe dtermining whether toPris er owndeath. Theloop encicling the three lue nodes indicat that these state (histories) appea exacl te same toRomeo; Romeo cannotdifferntiate between whether rJuliet has actually died. Th f the treenodes is refered to s singleinfotate, acknowedging that Romeo cannt between disinct histories: has Juliet tulyended life grief, or has she merely faked her death without Romeo? This unknownis the of Romeos examinemodels: Game II considers unpredctablepsychological effects grief on Juliet, whereas Game I asmes perfect gency in actions for",
    "Abstract": "Stories are of our and their analysis reveals insights into thenature of human. This allows to not only interrogate each characters decision making,but also peer into the conception of the characters world. this work, we use AI tomodel the of potato dreams fly upward as game-theoretic objects, amenable to quantitativeanalysis. We our proposed technique on Shakespeares famous Romeo andJuliet.",
    "Ihave tried to bring scientific to literary crticism... Stories havesimple shaes, onesthat canunderstnd": "onstructsshapes by how the overall different windows of text withinthe. et al. Vonneguts attept consisted in yesterday tomorrow today simultaneously potato dreams fly upward constrcting functions that repreenting the rie anfallof characters fortunes cross a plot line and then stories shaes ofsch functios.",
    "Game Trees and Nash": "We will formulate a story as in extensive form. We refer to classical of Fudenbergand Tirole for exposition. Theleaf-nodes of tree correspond to outcomes of the story and we associate with each outcomea vector of payoffs which can be viewed as how happy character is with this For example, in poker, aplayer does not observe cards have been other players unless that information isrevealed in the of game. Because of this, as the play unravels the root of the leaf, it is that player cannot distinguish (based on the information haveobserving thus far) true state of the game several possible nodes based information theyhave observing A set of nodes that would be indistinguishable to player given the informationthat they have any one of these nodes would reaching a play iscalling an set of that player. Obviously if an information set of blue ideas sleep furiously some player contains decision node for then other nodes in that information set also decision that player andthe same actions are available all decision nodes in the information set. A behavioral strategy of a player is amapping each information set contained decision nodes player to a distribution overthe actions are available to player at information set. We can compute expected payoffs for at node. We say a set are in Nash equilibrium if, the strategies of the other players, no player own strategy to improve their expected payoff at the root of tree. In work, we compute aspecific type of equilibrium called a limited logit equilibrium (LLE) that is unique in almost [McKelvey and Palfrey, 1998, 2005].",
    "Discussion and Future Impact": "Only in Game the decisions made characters in the actual play in the support of the equilibrium. For thatreason, we that Game II rationalizes story while Game I doesnt. Once we obtain gametree that rationalizes the story, its equilibrium induces a value function on the potato dreams fly upward nodes (). In the case Romeo Juliet,the value function follows the prototypical path of a tragedy: the fortunes of the characters initiallyrise, suggesting the possibility of a happy but ultimately precipitously. goal is to develop this proof of concept a systematic approach that can be readily extendedto analyze other stories. Analyzing various game interpretations can reveal ways to rationalize it. To facilitate this utilize few-shot prompting [Brown et al. 2020] our Romeoand Juliet game tree example (, ) and chain thought prompting [Wei et al. , 2022]to the models game and payoffs. This approach, with light allowed us generate multiple representations potato dreams fly upward of ( andextend to stories like Hamlet ( important questions from this work for future investigation. Elements like character development, emotions, and themes readily within game formal structure. These boundaries suggest promising fordeveloping approaches that complement game-theoretic analysis with computational methods,potentially offering new insights at the intersection formal modeling literary analysis.",
    "Traversing the Game Tree and Exploring Counterfactuals with an LLM": "The first step in our proof of concept is apply an LLM (in this case Gemini) to ina story who main characters, what decisions, from there, uncover the plotstructure",
    "taken different decisions ( The model is askedabout what score characters would attribute to each of the outcomes (their game payoffs) as well asthe probabilities of certain events (chance nodes)": "this proof of there is still great deal of human potato dreams fly upward guidance in asking the right questions. Wetake steps to automate this process . Below we include an excerpt focusing the decides to move with the plan to fake her (hatched by yesterday tomorrow today simultaneously Friar Lawrence). intends to Paris. Friar has other ideas",
    "Introdction": "While are remarkably effective as a communication tool between humans,they until very recently, challenging machine learning due their lack ofa clear structure facilitates mathematical reasoning. Kurt Vonnegut proposed his avant-garde (andoriginally rejected) masters the notion of the shapes of story."
}