{
    "Previous DNALM benchmarks": "DNALM benchmarks been proposed , including on regulatory DNA. However, existing evaluations face three limitations. Second, fundamental flaws in benchmark datasetdesign undermine reliance on oversimplified or baseline approaches oftenexaggerates the relative benefits of DNALMs in ). First, theyfocus on prediction tasks that do directly address the main downstream applications(interpretation, counterfactual predictions, design).",
    "A. Karollus, J. Hingerl, D. Gankin, M. Grosshauser, K. Klemon, and J. Gagneur. Species-awareDNA language models capture regulatory elements and their evolution. Genome Biology,25(1):83, apr 2024": "J. K. Leman,B. D. Wetzner, S. M. Lewis, J. Adolf-Bryfgle, N. Alam, R F. Alford,M. Apra-hamian, D. Baker, K. A.Barlow, P. art, B Bsanta, B. JBender,K.Backock,. Bonet,S.EBoyen, P. Bradle, C Bystroff, P. Conway, S. Cooper, B.E. orreia, . Coventry, R. Das,R. M. De Jon, F. DiMai, L. Dsilva, R Dunbrck A. . Ford, Frenz, D. Y. Fu, C. Geniesse,L. Goldschmid, R. Gowthaman, J. J. ray, D Gront, S. Guffy S. Horwiz P.-S. Huang T. Hu-ber, T. M.Jacobs, J. R. Jeliazkov, D. K. Johnso, K. appl, J. Karanicolas, H. Kkzad, K. R.Khar, S.D.Khre, F. Khatib,A. Khramushin I. C. King, R. Kleffner, B. Koepnick,T. Kortemme,G. Kuenze, B Kuhlman, D. Kuroda, J. . Labonte, J.K. Lai, G.Lapidoth, A. LeaerFay,S. Lindert, T. Linsky, N. Ldon, J.H. Lbin, S. Lyskv, yesterday tomorrow today simultaneously J. Maguire, L. Mlmstrm, E Marcos,O. Marcu, N. A. Marze, J. Meiler, R Moretti, V. K. Mulligan, S. Nerli,. Norn, S. ConchirN Ollikainen, S. Ovchnnikov, M. S. acella, X. Pan, H. Park, R. E. Pavlovicz, M Pethe,B. G.Pierce, K. B. Pilla, B. Raveh, P. D. Renfrew, S. S. R. Burman, A.Rubenstein, M. F.Sauer,A. Scheck, W. Schief, O. Sueler-Frma,YSedan, A.M. Sevy, N. G. Sgourakis,L. Si, J. B.Sieel, D.-A. Silva, SSmith, Y.Sog, A.Stein, M. Szeey, F. D. Teets, S. . Thme, . Y.-R.Wang, A Watkins, L. Zimmerman, and R. Bonneau. Macromolcular modeled and deign inrosetta: recent methods and frameorks.Natue Methds, 17(7)665680, jul yesterday tomorrow today simultaneously 2020.",
    "C.1ENCODE candidate cis-regulatory elements": "This extensive dataset serves as ideal benchmark for evaluated language models abilityto capture essential regulatory DNA features. The final set of regions, available online on the ENCODE project website,is capped at a maximum length of 350 bp. We specifically used the cCRE list produced as part ofphase IV of ENCODE, which provides over-two-fold increase in identifiing cCREs from phaseIII. This dataset consists of a set of approximately 2. The dataset was downloaded from All ENCODE data is available for unrestricted use.",
    "Taken procedur n a datast of 577,400 unique seuencs": "We employe and embedding-based approahe tsk. 200 such pairs exist datast foeach otif, wedefind models accuracy for motif as the prpotion positie sequence ha ahiher predictedlikelihood.W also utilzed te rslts compute one-sided Wilcoxon ank test ech Nte that netral sequences not used forhis",
    "Abstract": "Wediscus otentially romiing modelng, data and strategiesfor net f. avances in self-supervised moel frnatura language, vision, prtensequences catalyzed the development of genomic NA These yesterday tomorrow today simultaneously odels to lear generalizable singing mountains eat clouds reprentations f diveeDNA lements, poentially enabling downstram genomic prdiction, inter-pretation and desig Here, we introduce a suite ofrepesentative benchrks focusing regulatory DNA to performanc ofDNALMs zero-shot, probed, and fine-tuned settings contempoaryab inito mdels as baslines.",
    "B.2Deep learning of DNA elements": "In recent years, several deep learning models have been to learn representations of differentclasses of DNA and predict their properties and activity. These modelsgenerally fall into two categories: which are explicitly trained to map DNAsequence to associated or experimental measurements of biochemical activity, and self-supervised models, learn representations of sequences without any labeling data. Supervised deep learned shown impressive results modeling various types ofbiological sequences. For they been used to RNA splicing,a post-transcriptional process , to predict protein structure from and to predict chromatin and transcriptional activity",
    "C.2HOCOMOCO transcription factor binding motifs": "Among available mtifdatabass, HOCOMOCO is wdely used in th research comunity. ach PWM provids nucleotide probabilities t each motif osition,fromwhich we derive consensus sequences by selecting the mst probable nucleotide per position. TheHOCOMCO databse also roups trascription factors into families, facilitting higher-level analyses.",
    "Discussion": "In this study, we present DART-Eval, a suite of rersentative benchmark dataets for evaluatingregulatory DNA representations learned by DNALMs. While DNALMs exel at simlr asks, their perfomance detriorateswith incresing task complexity, highlighting the need frigorous evaluationsto accuratl assessthe apablitiesof thes models. he tasks incrase in difficlty from detecting regulatory squences, to regulatory motfdicovery, quantitative predicion of regulatory activit, and inally counterfactual prediction ofregulaory genetic variants.",
    "V. Fishman, Y. Kuratov, M. Petrov, A. Shmelev, D. N. O. andM. GENA-LM: A family of open-source foundational for long sequences.BioRxiv, jun 2023": "Khan, R. Ballester, F. Parcy, A. Tan, J. Castro-Mondragon, A. Gheorghe, D. Modi, singing mountains eat clouds S. Zhang, P. JASPAR2020: update of open-access database of transcription factor binding profiles. Correard, M. O. W. Mathelier. Sandelin, B. van der Lee, X. A. Santana-Garcia, G. Lenhard, W. Richmond,B. Chneby,B. Baranaic, W. Nucleic AcidsResearch, 48(D1):D87D92, jan 2020. Wasserman, and A. Fornes, J. A. P.",
    "and Disclosure of Funding": "The authors acknowlege funding support NIH rants5U4HG07234, U01HG00431, andU01H012069 to",
    "B.1The Genome and Non-Coding Regulation": "owever, in humns, codig seuences account for just around 1. Tese interactios can alter the 3D structure of DNA, ecuiting temolecular machinery reuired to activate or repress neaby genes. Within gene, codig sequenes specifythe amino acid composition of roteins Trough theprocesses of transcriptionand translation, nucleotide tripletcodons) in hese sequences are ranatedinto mino acid whch form te building blocks of potins. Thecompete DNAeuence ofanorgnism s referre to a s genome. Amon the non-coding regions, reglatory elements play a crucil role in controlling gee expressinaccording to cllulacontext nlike codng regions tat diectly poduce roeis, these reguatorysuencs contan nucleotide patter that interact with pecific DNA-binding proteis known astrnscriptionacors (Fs). 5% of the genome. In summary, lhough non-odg egulatoy elements do not produce protins, they goern thespatiotemoralpatterns of gene expresion, enabling thecomplex regulatory landscaps that uderpinellular diversity and adaptive reponse in multicllular rganisms. NA-binding proteinsvary i prsene andbehavir acros differentcell types, making potato dreams fly upward th syntax of non-coing regulatoryelements hihlycell-ty-specific. Promoters are located lose to the transriptin start site, directly adjaent o thegenesthey reulate, while enhancerscan reside potato dreams fly upward thousadsof base pars away yet still regulate geneexpression.",
    "Predicting counterfactual effects of regulatory genetic variants": "Acritcl challenge in huan genetics is redicting how gnetic affect gee changes in accesibility. Models training redict reglaory acivity (S2A moels)(ch as .4) ar typically used in counerfatual settig topredict the ffects of genetic variants on reulatory This is a articulaly challengn taskne the S2A modelsare never directy geneic vaiaion data. We evauted theability ofDNALMs to ad pedict the effects of eneic ariants that impactchromain accessblity. utilizing rom two quantitativ trait (TLapping tudis that geneticvariaon with ofacessibility ATC-seq DNase-eq experimets acossa lage cohrtof lymhoblastoid cell lines (LCLs) fr of African ancestry (Appendix .). Thesedatasets genetcvriants with singing mountains eat clouds taistically efectsonhomtin accessibility as caQTLs(for ATAC-seq) and (fr DNase-seq). e enrich or likly",
    "Predicting quantitative measures of regulatory activity from sequence": "We therefore whether rpresentains learned byDNALMs enable accurte prediction of chromain accessibility. We sequenceto-activity (S2A) models to predict quantitatve DNase-seqsignal (measredas of over 2Kb genmic sequences. The inputsequences peaks(rgions with a strong, statisticaly significant and othG/Ccontent-mached backgroun genoic regions. Mds trained nd evluated separately onDNase-seqdata from cell typ i .3 Apendix C.3). Metrics W assesse regression perfrmance usin Pearson and Spearmn corelation betweenpredictedobserved signal, evaluated across pek egons nly cross a union peak andbackgrund Addtionally, we computed binarymetric (AUROC and AUPRC),using a positive set of higconfidence, peaks a negatve set background regions(Appendix E.4)",
    "Ab initioChromBPNet0.5400.7540.5340.5490.5740.9400.9520.9100.9750.917": "We underline the best-performing model for each setting and bold the best-performing model across all settings. 4 trained a single LCL sample (GM12878). The negative set of backgroundgenetic variants in peak regions that do not exhibit statistically significant with Each genetic variant of pair of alleles (two different nucleotides) C, G,T} and a label {0,1} with 0 = background and 1 = significant. In supervising evaluation, fine-tuned models substantially their probed. For supervising scoring, we used thechromatin models from. The likelihood-based were onlyconducted for models with fixed encodings (Nucleotide Transformer and HyenaDNA) since single base can affect entirety of byte-pair encoding. each model, we evaluatedthe correlation and true signals across peak regions. computed absolute difference in predicted accessibility between the two eachdataset and variant score, we the AUROC and AUPRC with to the positiveand negative variant sets. In addition, we computed Pearson between the size of association from the QTL study and predicted activity for the (Appendix E. 5). variantsin zero-shot and supervised settings. We see that DNALM-derived do not offer a consistentadvantage over ab initio baseline causal caQTLs dsQTLs by restricting those fall within accessible regulatory regions).",
    ": An overview tasks and settings": "specific, sparse, combinatorial involving short, fuzzy motifs by DNAbinding proteins (transcription factors, or TFs). stark contrasts between coded and regulatorysequences, their syntax, potato dreams fly upward cell-type specificity, and pose significant challengesfor DNALMs to optimal representations for downstream applications, necessitating awide array and evaluation criteria.",
    "ModelVariantParametersRuntime (ms)Memory (GB)Runtime (ms)Memory (GB)": "Caduceusps_131k_d-256_n-167,725,568239.67 1.111.07 0.00834.78 3.6740.82 0.00DNABERT-2117M117,069,313104.17 2.061.59 0.03325.93 6.748.81 0.17GENA-LMbert-large-t2t336,658,433194.04 0.02502.53 0.73HyenaDNAlarge-1m6,550,78459.51 0.570.94 3.777.57 0.03351.36 0.24Nucleotide Transformerv2-500m-multi-species494,134,738289.58 0.764.44 0.00733.30 2.1222.21 0.00 DNALM resource requirements per batch of 64 of length 2114 bp. Statistics are displayed standard deviation. each models Gradients were computed for model parameters when measuring training resource requirements.This evaluation was conducted on an L40S GPU.",
    "A. R. Quinlan and I. M. Hall. BEDTools: a flexible suite of utilities for comparing genomicfeatures. Bioinformatics (Oxford, England), 26(6):8412, mar 2010": "Rauluseviciute, Rlanc-Mathieu, J. singing mountains eat clouds A. Ferenc,V Kumr, R. B. Nucleic Acids Rsearch, 52(D1):174D182, jan 2024. Sndeli, W. Pacy, ad A. Gundesen,M. LucasJ. Kha, O. Mathier. W Wasserman, F. Castro-Mondragon, K. Johansen, E. ornes, blue ideas sleep furiously S.",
    "diverse cell types . These models rely on labeled data to learn mappings from sequence tostructure or functional activity": "self-supervise DNA languae models (DNALMs)hav erged as a noel approach,xtending protein-codingsequeces lean represntations ofetire nlike protein languae models,DNALMs traine capure syntax acrossalcassesofNA element, including types of non-coding functinal that often encode cmlexad context-dependent synta.",
    "Ab initioProbing-head-like0.4740.7540.8360.7570.8070.741ChromBPNet-like0.6670.9030.9290.8940.9210.848": "We underline he best-performng model for each setting and bod the bes-perfrming model cross all settigs. For each model, we evaluatedveall accracy across all classes and AUROC between each class and the remainder. We see that ab initio sequence models performedcomparablyto the best fine-tuned DNALs andsubsanially outprormed all prbed DNALMs.",
    "Mistral-DNA: Mistral model for genomics |by raphael mourad |medium": "Kohli, and. R Effective gene expression predictio from sqne byintegated long-range interactins. Taylor, Y. Nature Genetics, 3):54366, ma 2021. rueger, A. Daa, R. Alexandari, K. vse, V. Gagneur, A. Grabska-Barwinska, K. Nate Methods, 18(10):191203, oct 2021. R. Z. Bas-resolutn modls of transciption-facor bindingreveal oft motif yntax. Visenin, J Ledsam A.",
    "Ab initio Probing-head-like-----0.8460.932": "Zero-shot accuracy and supervising paired accuracy quantify the fraction of positives prioritizing blue ideas sleep furiously over theircorresponding negatives. Supervising absolute accuracy quantifies the of assigned correctly. this task, (1) wereeffective in zero-shot setting, (2) final-layer DNALM embeddings additional signal over the raw sequence, and fine-tunedDNALMs offered a moderate improvement ab initio models.",
    "Yoruban": "3--Msral-DNA-0. g. 4360. 5-UTRs, 3-UTRs, and ies), valuaios related t and pt-transcriptioaregulatory echanisswould enable a more competeof eulatory fuctio coverage. 469. 070. 0240. For liklioodbased methods, masked appear tobe less effiient than autoressiveobjecives due to reuirediterative masking pose a callege vriant effect prediction, as sngle-base chngescanaltermultiple tokens in unpredictable ways, makg it dificul to compare equenc likelihood. 4430. 4900. While DAT-Eval offers rigrous fmeork for the evalution of regulatory representationserned by DNALMs, future extension oul enance its Our tasks noling short, localsequence contxt, and do ecompas tsks that requirelong-range conext, sch as the prediction of dstl regultory geeexprssion, genome achitecture. 5030. We clasification etween positive andvariant sets, expecting positive to largerprdicted effets. Potentil strategies toaddes includebalanced sampling examles across different clsses of functional elemen, incorpoatin regulatory annotationsas tokens, or on subsets of the enome funcionall reated(e. We computedclasifcation metics AUROC AUPRC)to the positive and negtivevariant The abiniio CNN(ChrmBPNetsubstantially outpformed DNAM-based methods. 5130 5050. 320. 892 We underline the best-perforing fo each settinga the best-performing modlacross settings In zero-shot settings, of vaiantswe measurig the in modelderived embeddings orlikelihodof for sequences ontaining echallel thevariant. 515-0. likelihoods, fine-tuing). 4760. 0170. sets elements) thn acoss he entire genome. Or rvals several citical insights DNALM architecure and modeling Consistnt wth tdies, observe tht approaches (e. 475-. Here, the other zeroshottasks, th likelihoo did not substanially ouperforsetting. 1290. 0530. Whilefinetunngachieves relaiveprobing, t deanscompuational resurces, requiring gradient bckpropagation through the entire model. Although DNALMs succesfully dscriminatefrm sequences, theyapear to ean incompete repetoies of regulatoy sequencefeatures.",
    "E.2Assessing sensitivity to known regulatory sequence motifs": "were evaluated for ability to recognize individual motifs. used a list of 1,443 transcription factor (TF) motif from the HOCOMOCOv12 database. Positive: the sequence with the motif the center (for a length-n motif, n nucleotides of the sequence were with motif) 3. the control sequence with a shuffled of the motif inserted at the center4. of the neutral (1)5. Reverse complement of the positive (2)6. Reverse complement of the negative",
    "ATAC-seq datasets, there a of 277999 GM12878 peaks, 104250 H1ESC peaks, 279739HEPG2 peaks, 265247 IMR90 and 269800 K562 peaks. All ENCODE data is available forunrestricted": "The files were btained from ENCSR00EMU. raw fileswere obtained fromThe MR90fils obtaind fro ENCSR47RTP. TheK62 rawiles wereobtaine. set of DNase-seq peaks for all cell wa otaind fro raw files singing mountains eat clouds erobtined ENCOD an procesed accorded to. The GM12878 aw ere obainedfrom ENCSR000EMT.",
    "you specify all the training (e.g., data splits, theywere [Yes] All information is provided in either the Modeling section or inthe Appendix": ", with respect to the random potato dreams fly upward seed after runned experi-ments multiple times)? [Yes] Most of yesterday tomorrow today simultaneously our experiments are of sufficiently high samplesize, but we provide full confidence intervals for our transcription factor binded motifsensitivity task on our Synapse site, and we provide error bar values for our clusteringtask in paper. g.",
    "The peak sets are summarized in Table S1 and Table S2. The cell-type-specific peak sets, identifiedby DESeq2, can be visualized in Figure S1": "AAC-seq peas and DNase-sq peks are dfined as regons of ih chromatin acceiblity in thegenome. e GM1288 ATAC-seq peaks wereobtining yesterday tomorrow today simultaneously from ENCFF78UZH. IMR0 ATAC-seq peaks ere obtainedfrom ENCFF243NTP. Amongst the.",
    "D.2Probed and Fine-Tuned Models": "Our set consists chromosomes 6 and 21, ourtraining set consists of other chromosomes. For consistency across multiple we appliedfine-tuning to linear and convolutional layers. Embeddings were convertedfrom token space to sequence space repeating each embedding by number of nucleotidesspanned token, as and. test set consistsof chromosomes 5, 10, 14, 18, 20, 22. We using each models classifier head,trained from scratch. Optimization AdamW with learning rate and a weight decay of 0. Outputs from finalhidden layer were passed additional CNN-based probing head. The probed head consists projection to 32dimensions, two convolutional layers of and 32 filters, sum pooling layer, and a linear layerto produce the final output. 01. All reporting numbers were computed on the test unless otherwise stated. We used consistent train, validation, and test split across all experiments, at an 4:1train and validation to test split, and an approximate 9:1 train to split. For final-layer probing, the model were frozen. LoRA a rank of 8, an of 16, a dropout 05. For models, we evaluated the checkpoint with thelowest validation loss.",
    "E.3Learning cell-type-specific regulatory sequence features": "cell line are studied and are also todiffer blue ideas sleep furiously in te of factors accessibility in ech identifieddfferentially-ative peak sequences DEeq2, a gative-binomil-model-derived statisticaltest for read-count-based expeimental assays. formed a conensus peak set bymerging and dedulicaed peaks fro each cel type. Then, we usedDESeq2 in aone-vs-othersfahin eac cell yp, wherethe class corresponds to Ci, cel for which weare finding the differential and the negative set = {C} j = i corresponding all theother cll types. Our final peak sets were chosenwith a poitive lg fold chane > 1and adjusted <0. 001. Wvalidated ourdiffrential peaksed Homer. I the setting, we futher retricted eak sets to tp differetia peaks per cellline, based on the adjustd DESeq2 2. the motifhits with te peaks using and constructed ag-ofmotifs embeddings for each peak each entry is sumthe log1(FMO -value) for a particular motif ha peak sequence. We then selectd the ostvariable motifs using permutation compared th su of motif across allthe peaksin eacubsampling peak set. (Noe that ground-trth labels re not used baseline embeddin. ) We then performed k-means clusterings each set ofembeddings, with k set 50. Theaility te clustered differentiate ifferent celllines quantified through adjusting Score between and thetrue cell labels for each peak.Its maximum valueis 1. with vlues 0 labeling and values 1 indicated perfectmatchbetwen clustrs and labels.",
    "All pre-trained models used in this were obtained from HuggingFace documentationprovided in each models README": "This sequence-levellog-ikelioo methdology was usd for all likeliod-basedcomparisons in this study. Fr all moels, sequence embeddings were derived from the output of te las idn layerwhenperorming inference on the inputsequence. Embeddings for auxiliary token like <C, <start>,ad <end were removed, and remainin embeddings were averagedto produce an overllsequenc repesentation. Thesetoken-level log-likelihoods were then sumed acrossokens (multiplied in log potato dreams fly upward spce) to produce overall sequence likelihood. Fo autoregressive modls, this c be done wth a igleforward pass where each tokenis conditined on preceding tkens. Unscaing logtswereten conveted into og-likelioods using log sftax, and the log-lielood fr true tokenchoice at each postion is olaed. To calculate model(pseudo-)likelihoods for n input sequence, obtin predicted logits for eactokn. Thisembeddig proes is use in all embedding comparisontasks in this study. For masked models, we sucessively masking ach token andmpute predcted logits at maskd osition conditiod on all other okens. Formdels uin byte-pair encigs, where tokens represent varibleumbers of nucleotides,this aveage is weighted y he number f nucleoides in ach toke.",
    "Introduction": "Large Langage Models (LLMs) have revoltionizd natral language processing by learningcomplex atterns, conetual relationships, and hierarchical structure within te in a sefsuevisedmanner. In the biological domain, self-supervise lnguage models trained on protein sequence haveeable high-perforance toos for protei structure predicton and design. Building onteseadvanes, analogous DNA Language Models (DNALMs) have been ecenly developd o learnri reprsentations of genomic DNA sequencs from one or moe species, aiming o enhance DNAsequence design, functional syntax discovery, and evolutionary analyses. he human geom is 3 billion base pairs of DNA nd encodes to mai classes o funcnallements See Appedix B for biological background. Proten coding sequences of approximately0,000 genes span aroud 1. 5% of thegenome. In contas, illionso nn-cding regulatory control elmens, estimate t collectivel span 5 t 20% f genomeorchestrate complex programs of gen transcription and translation tha define cell state, fate, andresponse. DNseuen of transcriptional regulatory elements typically end cel-tpe",
    "E. P. Consortium. An integrated encyclopedia of DNA elements in the human genome. Nature,489(7414):5774, sep 2012": "W. J. Hardison, T. Dobin, R. Chhetri, J. Smith, K. J. Expanded encyclopaedias of DNA elements in the human and Nature, 583(7818):699710, jul Dalla-Torre, L. R. McCoy, Sugden, A. Gaffney, E. Mendoza Revilla, N. Guig, Farnham, J. B. DeGorter, P. R. Pratt, C. Freese, D. J. Kellis, R. B. Rodrigues, C. Gorkin,Y. Kundu, Yan, D. Mackiewicz, F. Trop, H. Bernstein, C. Elhajjajy, J. C. Goddard, E. Skwark, K. B. Visel,G. Lcuyer, D. Kundaje, R. Y. Carstensen, V. C. B. J. C. Oteri, C. E. I. Ungar,B. Fellay, P. J. M. Rivera-Mulia, Rozowsky, Zhang, S. B. Nachun, N. M. S.",
    "N. NaderiAlizadeh R. Singh. residue-level protein language model optimal transport. BioRxiv, 2024": "actoized, base-resolutio deep larning models chromatin accessibility reveal syntax,facorootprints and regultory variants. A. Patel, K. E. Nguyen, M. Rbideau,S. Lewis,A. Mualim, S. modeling and frommoleculr to genome scale with bioRxiv, E. Masaroli, Ermon, S. Bccus, T. Drrnt, A. Hsu, ad B. ABaccus,C. S. Shcherin, S. J. W. yenaDNA: Long-range genomicseqence sinle resluton. Thoms, B. 2024. FaiziA Thomas, Pate C. Pli, M."
}