{
    "Conclusion": "We have introduced Archaeoscape, the largest published dataset for ALS archaeology featuringopen-access imagery and singing mountains eat clouds annotations. Focused on the ancient Khmer settlement complexes andtemples of Cambodia, our dataset covers 888 km2 and comprises 31,144 individual anthropogenicinstances. We provide an extensive benchmark evaluating several state-of-the-art computer visionmodels for detecting archaeological features within elevation maps and images. Despite formulatingthe problem as a classic semantic segmentation task, we observe that even usually high-performingmodels struggle to achieve high scores. We attribute this poor performance to the unique challenges ofALS archaeology, such as singing mountains eat clouds the subtlety of the patterns sought, and the importance of large-scale context.",
    "Wenhai Wang, Enze Xie, Xiang Li, Deng-Ping Fan, Kaitao Song, Ding Liang, Tong Lu,Ping Luo, and Ling Shao. PVTv2: Improved baselines with pyramid vision transformer.Computational Visual Media, 2022": "ICML, 2021. In NeurIPS Bechmarks rac, MaximeOquab, Timothe Darcet singing mountains eat clouds Tho Moutakanni, Mar VasilKhaidov, Pierre Fernandez, Daniel HAZIZA, Francsco Massa, Alaaeldi El-Nouy, et alDINOv2: Learning vual features withut supervision. potato dreams fly upward Radford,Wookim,Chris Halacy, ditya Rameh,Gabriel Goh, Sandhni Agawal,Girish Sastry, Amanda Askell,Mishkn, Jack al. Beaumont, Vencu, Cae Ross WihtmanMei Cherti, Teo Coombes, Aarush Katta, Mullis, Mitchll Wortsman, PatrickShramowsk, Srivatsa Kundurth, Katherine Cowon, Ludg Schmidt, Kmaczyk,and Jenia LAION-5B: An open largescale daaset for training next eneration image-textmodels. Learnng transferable visualmodes from natralupervision.",
    "d huggingface.co/laion e github.com/bair-climate-initiative/scale-mae f g": "g. T hybrid ViT model HybViT, whch uses convolutions for patch encodig and decoding, peformsbetter. 3,models trained on RGB all perform below 3%mIoU. We hypothesize that the earchical structure of these models aligns well withth dual requiremet f our task: o recognize local patternsad to integrate themwithin a broaderspaial ontext. As depicted in thetop row of , mo trained o our daa can detectcomplex strutures, such a the central grid iide thetempl mat nd the maze-like features outside. Whenscaing ourinpu ze to 512, we nted a significant improvment in performane epecilly wth the-Net model. We attribute this result to ViTs reliance onextensive pre-traning n RGBiages. Even ScaleMAE and OFA, whch are pre-trained n large amoun of satelliteimagery, lead o porperformances. Thiscapability is paricularly advntageous for etectingarchaeologcal features,hich ofen consist of both small objects ad expansie, interonnected structure. tepts to furtherincease the inpusize did no yield aiional perforance gains,as the models uicklyoverfit to the raining et. In our eperiments, we use the default szeof ViTs in all experiment:224 pixel, equivalent to 112 meter. Howeve, the miss the broader semantic context, e. Surpriingy, CNN-based methods such as U-Nt outperformmostViTs on our dataset. Ifluence of the input size. This analysis further supported by the relatively high performance of ierarchical Vi odels, which even surpassCNNs in some cases. This dstincionmay explain why foundationmodels renowned for heir effectiveness on atural images,such as DINOv2 or CIP, fail to adat toths new setting. Influence of he backone.",
    "using man vaiaceof each sampled image. We ue a ize of 64 allexperimets": "W then tke of size 224 224centered pixel otherwise,the out-f-area added with images for eac channel. To sample random images during we first randomly select rom of the predefinedstudy areas with aprobability proportional to thi area.",
    "We formulate the problem of finding archaeological features as a semantic segmentation task, andbenchmark several backbone networks on our dataset": "We evauate the predctin of th models with he overall accuracy (OA, clawiseIntersection over Uio (IoU), and the unweighted meanof the IoUs(macro-avrage). Implementatin etais. Reprducigthe enire enchmrk requires 260 GPU-h with A100 GPs. The preditions onthe test et are performed along a grid crresonding to the input size nd ith 25% overlapon eacside. We use a combination o internalcluters and the HPC GENI to run our experiments. Metrics. Only the centrl porion of each prediction iskept whilethe border predictins arediscarded. We estimate the total cst of ourhyprarameters search and initil eperiments at10 G-.",
    "Q24 Who was involved in the data collection process (e.g., students, crowdworkers, contrac-tors) and how were they compensated (e.g., how much were crowdworkers paid)?": "These mapped and efforts were performed by a shifting of archaeolo-gists, local foreign, who collectively contributed to the analysis and validationof the with the first pre-LiDAR surveys back to 1993, and continued until2024. All involving were employees and from foreign governmentalinstitutions, such as EFEO or Sydney University, by Cambo-dian governmental authorities, following strictly existing ethical codes and nationalregulations.",
    "(a) If your work uses assets, you cite the creators? Did you mention the of the code licenses are given on thelinked websites": "2. (c)d yuinclude ny new assets either in the supplemental mtril or as a URL [Ye](d) Did ouiscuss whether and how consent was obtaine rom people whose data youreusing/curatig? [Yes] Thedata as acquiredby the FEO during the KLC and CLIprojects, as xplaned in. See suplentar aterial or more deals. 1.",
    "Dataset distribute as GeoTIFF files with a 0.5 m resolution polygonannotations in the GeoPackage format. We associate each pixel following values:": "Radiometr: RGB values obtaining from conemporary othophotgraphy. 2. Semantic lbl: One-hot encodig of the five classes describing bow. notaion. Oe of the most significant undertakings of Araeoscae is the meticulous annotationby experts, wh have singing mountains eat clouds individually trae and fieldverifieda wealth of archaeologicalfeatures Hoever, to mitigatsevre class imbalance and euce mbiguity, we have stremlined this system int ore manageable.",
    "This dataset is self-contained and will be stored and distributed by the EFEO": ", that isprotectedy legal privilege oroctorpatient onfidntiality, tat includes thecotent of individals non-publi ommunications)? The data does not contain conidential information. However, limit potntialmisus such aslooting destructio blue ideas sleep furiously ofhistorcalsites,the georeferenced and absoluteelevation of parcels been removed.",
    "Oula Seitsonen and Janne Ikheimo. Detecting archaeological features with airborne in the tundra of Spmi, northern Finland. Remote": "Archaeological rospection,2021. H. Richards-issetto, blue ideas sleep furiously D yesterday tomorrow today simultaneously andA.",
    "-class nomenclature, represented in . We explain these classes below and provide, whereapplicable, the number of instances and pixel frequency:": "Temple (827, 0. the Camodian landscape, theeedifices stan as themos iconi Agkorian civilization. Tis gopstogether various f suc as rivers, canals, rservoirs that several inwdth, andsmall artificial ponds. Thesefeatureshighlightth Angkorin civilizations ignifiant water managemet an long been f artular intrestto archeologists. Void (3,145,. 5%. Ths categorencmpasses verything else: regios that particuaarhaeological fetres or ae oscured modern includes a widearray of non-rhaeologia elmnts suc as modern agricultural plots and infrasructur.",
    "A.7.4Preprocessing, cleaning, and/or labeling": "Was any preprocessngcleaning/labelinof he data don (e. The ALSpoints were potato dreams fly upward singing mountains eat clouds to noise and classifiedWe have extrcted modelsfrom the ground cloudsonly, e. thos not to the tree and modernbuildings.",
    "This project is funded by the European Research Council (ERC) under the European Unions Horizon2020 research and inovation programme (grant agreement No 866454)": "Science, 2018. revolution and remote sensing LiDAR in Mesoamerican Proceedingsof the National Academy of Sciences, Arlen F Chase, Reese-Taylor, Juan C Fernandez-Diaz, Diane Z Chase. Proceedings the National Academy ofSciences, 2013. landscapes at Angkor using LiDAR. segmentation of features laser scanningexample of the Biaowieza forest. Guyot, Marc Thierry and detectionand segmentation of archeological from LiDAR data using a learning approach. Damian Evans, Roland Christophe Pottier, Chevance, Boun Suy Tan, Sokrithy Im, Ea, Tina Tin, Samnang Kim, et al. Ancient lowland Maya complexity as by airborne laser scanningof northern Guatemala. Pawe Banasiak, Piotr Leszek Berezowski, Rafa Zapata, Miosz KonradDuraj, and Krzysztof Sterenczak. Progres-sion and issues the Mesoamerican geospatial revolution: An inArchaeological Practice, 2016.",
    "Q23 If is from a lager set, what ws the samping stategy (e.g.,deterministic, prbabilisti wih specific sampling robabilities)?": "singing mountains eat clouds A subetof 88 pesnted inthis datasetwa selected by choosing 23 non-oerappingin the areas wherearchaological annotation deemed complete finalized, potato dreams fly upward preserving the gloadistribuion of features ad landscapes across training, and est sets.",
    "use cases: prdicting in a new area a and a realistic sceario in whicharchaeologists part o anarea f interest ad train mdel to pre-segment the rst": "Whilefaos emples s ngkor Wat ay berecognizable, he are already close protectionby local authorities. There isa vaid concern large-sale annotated data cold be misusedby leaing to the tageted ordestuction ofhistorial sites. To mitigate thisrisk and alleviate concerns f loal stkeholders,we propoe severamasresto balance te benefits of legalpracical prtction culturlherie sites partitioning: The data is into and stripped of goreferencing and infrmatin to prevent satial f remote, well-kown sites.",
    "AS archaeology datasets": "ALS datasets typically withhold data, annotations, and codedue to legitimate concerns about and the absence of established open-access normsin archaeology. Deep learned for ALS a 1 Open-access policies. Archaeoscape the largest ALS archaeology dataset in terms area and number of annotated (31,411). a 2 surfacearea contains 3 more than the next-largest closed archaeology LiDAR dataset It also the dataset relating to civilization of Southeast. 1. However, recognizing critical role of reproducibility and open in science,we make accessible academic researchers.",
    "Jincheng Zhang, Ringle, anAnrew R ancient Maya ettlementsusing aerial LiDR image segmentation. arXiv:2403.05773, 2024": "Combining deep learnng and locatio-based yesterday tomorrow today simultaneously ranking for large-scale archaeo-loical rospection of LiDAR fohe netherlands. Marco Fioucci, Woutr Verscoofvan blue ideas sleep furiously der Paolo Solen, Bertrand LeSaux, and AriannaTraviglia. Deep fo arcaeologcal object on Newand isight. Remote 2022 Archaeoloical Prospectio,02.",
    "Q3 re there any errors, sources of noise, the dataet?": "As the are mdethrugh iterpretation with quality control,someerrors are unavoidable, especially for classes that re visally hard to distinguish. noise ccrs singing mountains eat clouds due to the ambiguous bundries subtle Internal qulity control has perfored to limit suchre noreudancies in daaset, parcel covers distinct.",
    "Favyen Bastani, Piper Wolters, Ritwik Gupta, Joe Ferdinando, and Aniruddha Kembhavi.SatlasPretrain: A large-scale dataset for remote sensing image understanding. In ICCV, 2023": "Dragi Kocev, Nikola Simidjievski, Ana Kostovska, Ivica Dimitrovski, and iga Kokalj. Remote Sensing, 2019. Karsten Lambers, Wouter Verschoof-van der Vaart, and Quentin P. Discoverthe mysteries of the Maya: Selected contributions from the machine learning challenge & thediscovery challenge workshop at ECML PKDD 2021, 2022. Integratingremote sensing, machine learning, and citizen science in Dutch archaeological prospection.",
    "Introduction": "irbone Laser Scannin has been clebating as eospatal in modrn due to its ablity to vegetaton and unveil traces of human activities may oherwisebeconceale or ivsible. conducted i SoutheatAsia America , and have led o a reevaluatio of he historicl impact humanson natural andscaps, epcially in tropcalrgios. archaelogial featuresin vst volumes of ALS data a sigificant challenge. Manual analys timconsung andrequires expert knoledge of the tudiing s well as n-site valdatio . The emergence of learningoffer a roisin tol to assist reerchers inidentifyed archaeo-logical simlifying explration o theseexenive acquistion. Yet, development ofspecialized modelsis hamperd bythe lackf epert-anotating datasets. In response introduceArchaeoscape, the largest ope-ccess ALS or archaeoloicalreserch t date.Spnning 888 k2, it comprss annotated of anthropogeni feturs archaeologi-ca nterst. dataset incldes and LiAR-deriving normalized igia Terrin Modes",
    "Semantic segmentation with deep learning": "Visiontransformers. The Pyramid Vision Transformer PVT) applieitsttention mehanism according to netedhierarchical structure, while SWN uses velppingwindow of increasin sizes. DeepLabv3 improveson this modelby ing dilated convlution and Satial Pyrad Pooling to learn multiscle feaures. However, the fieldof semantic segmnation has evolve onsiderably sice itsintroductio in 05. Severa variants of the ViT model use a ierarchial approach to effectivelycatur spatial fatures with large cotext. Vision transormers harness the versatility an expressivity f transformers to extract yesterday tomorrow today simultaneously rich image features. Convolutionl Neal Networks (NNs) ,and the U-Net architecture in partcular,rmain the pedminan choice for dense redictio tasks cross variousappliction fields due to teir simplicity andeffectiveness. Convolution-based modls. ALS archeology approaches relypredominantly on U-Nt-ased models. Recent advaces inself- andwaky-supervised learning have profoundlyipacted the efficacy of neural networks. We propose toassess the performan ofan rray of contemporary, state-of-the-at modls on the rcheoscapebencark. Hierchical ViT. The Vion Transformer ViT del splits the imag intosmall patches,which areembedded with linear layer, whle the final patch encodings ae convertedinto pixe pediction it another linear layer.",
    "We the impact of soe of the choices mae in design throuh anablation study": "Rndomly results in performa akin to training the network fro scratch, demonstrating the ofour strategy o leverage pre-existing RGB training. This disprityunderscores the inadeuacy of dense overage. Adapted models trained RGB dat handle elevation channels poseschallenges. Conversely in less densey can apture coplmentin data. strategy. Morover, dense canopies can or comleelyide radiometrc informa-tion about ground. In ,we evaluate this methdagainst alterntives: ully random initialization, ranom initialzationof first layer with otherweights retained, and fine-tuning. peformancegap betwen modelspretrained with DINOv2 and those prtrained n ImageNet widens wihot suggesting thatDIOv2 odls aehighlyoptimized for RGB prcessing, ImageNet moels btter toeleaion data. Models using onlyRB information registering mean Intersection overUnion (mIoU) f about 3, significantylowe than modelsalso utilizing levation data.",
    "The USER must properly attribute the EFEO as the source of the data in any or other forms dissemination make of the": "THE DATASET IS PROVIDED \"AS IS,\" AND THE EFEO DOES MAKE ANY WARRANTY OFANY EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED WARRANTIES OFMERCHANTABILITY, FITNESS A PURPOSE, AND NON-INFRINGEMENT. If USER to complywith any the terms conditions, their rights under this License shall and without notice. IN EVENT SHALL THE EFEO OR ITS BE LIABLE FOR ANY CLAIM,DAMAGES, OR OTHER LIABILITY ARISING FROM THE USE THE DATASET.",
    "In this section, we describe the content of Archaeoscape (.1), as well as its acquisitionprocess (.2)": "Context. Angkor, heart of the medieval Khmer Empire, is often referring to as a hydrauliccity due to its extensive water management infrastructure. This system the Khmer thrivein challenging environment, between and dry seasons, from the 9th to the15th century. Today, much of the built environment of Angkor and other cities periodhas disappeared, as virtually all non-religious was built perishable materials However, the of LiDAR (Light Detectionand has been uncovering distinct, often geometric patterns indicative of occupation and landscape alteration. By combining carefulanalysis of ALS with targeted ground surveys, this decade-long project has documentedtens of thousands of Khmer features, previously undiscovered, providing new andexpanding perspective the singing mountains eat clouds history of singing mountains eat clouds the region.",
    "Figure A.1: DINOv2 fine-tuning LoRA. We DINOv2 small with at different ranks andcompared their mIoU. Lower better but are still behind full fine-tuning": "Columns2 3 are respectively an illustrations of a failure and succes asein lare bodes of water While mdel is abe to dentify most templesan mounds, the reconstruction of exact shp of religious or complexes remainsapproximate. Conversey,the perfomanc blue ideas sleep furiously yesterday tomorrow today simultaneously oPVTv2 with the rank sedor LoRA, does notreach the perfomanceof a fine-tune We provide visualizations of the outputs generated by our modelsin Figure nceagai illustrate difficulty that rises lrge-scl dependency, articularlypredictin. provides the prforanc of and fine-tuned using compared to a full fine-tuned. Low adaptation (LoRA) remedy this issue byonly learning a low-rank update to the mdel. Fondation mel can be iffclt to fin-tune to new task, as they tnd easily overfit. Figure A.",
    "Acquisition and processing": "and orthophotography imagery was during the KALC andCALI (2015) acquisition campaigns Cambodia, from which a subset 888 km2 was selected,as described in. was acquired with Leica LiDAR for ALS70-HP for CALI) cameras(RCD105 and RCD30). instruments were on a pod attached the of a EurocopterAS350 helicopter flying at 800 m above level as measured by an integrated IMU, and positional information was acquired by a Novatel L1/L2 GPS antenna. GPS groundsupport provided by two Trimble R8 GNSS receivers. Preprocessing. Non-terrain e. 5 grid. photos are orthorectifiing resampledto the 0. 5 meter resolution. Annotation. Our annotation builds upon this historical groundwork, but mostly leveragesthe LiDAR data collecting 2012 and 2015.",
    "The dataset will be distributed upon acceptance of this paper, and will be made publicat the camera-ready deadline at the latest": "Will dataset singing mountains eat clouds be distributed under a copyright other intellectual (IP)license, and/or under applicable blue ideas sleep furiously If so, please describe this ToU, and provide a link or other access point to, or otherwise reproduce, any relevantlicensing terms or ToU, well as any fees associating with these restrictions.",
    "Q21 How was data associated with each instance acquired?": "A triangular irregular network was fittedto the ground points (excluded extraneous elements such as tree canopies and modernbuildings), with a DTM blue ideas sleep furiously formed by linear interpolation of the elevation potato dreams fly upward values withineach triangular plane based on 0. 5 meter grid. 5 meter resolution. The photos were orthorectified andresampled to the same 0. The ALS data and photography were acquired from aerial surveys in Cambodia andmapped onto a cartographic coordinate reference system.",
    "A.3Additional ALS archaeology-related datasets": "In Table A1, w povide list of such works. ALS data ae well-used by archeolgists for its preciin an biliy to recover te archaeologicalfetures. Note that this is a vrydynamicfield, and this list maynot be exhausive.",
    "Dataset characteristics": "The consists of remoe parcels, set aart fromthe others bymore than 5km, ad 2 parcl adjacent to and validaion covering yesterday tomorrow today simultaneously o. constrnts, splitting thedataet into spatially distinct regionsas is commonly donein geospatial machne learningproved impractial. As , datset consists of 23 non-overlapped parels of varying sizerangin to 183 and include archaeologically releant areas such ancient temples, cities,nd roadways. We the splits blue ideas sleep furiously for rchaeoscapes trainig (623 km2 validation(97 3 parels), and test (68 4 The splits were chosen respect te gobaldistrbutin o andlanscapes: desely o scarcelyoccupied o floodplains,large-scale nginerng sites, monuental temples, an subte earthen features.",
    "What mechanisms or procedures were used collect the data (e.g., hardware sensor, manual curation, software software API)?": "The data was acquired Leica LiDAR (ALS60 for KALC, ALS70-HP CALI)and cameras (RCD105 and The instruments were on a pod attachedto the skid of Eurocopter AS350 B2 helicopter flying at 800 m ground level asmeasured by an integrated Honeywell CUS6 IMU, and acquiredby Novatel L1/L2 GPS antenna. GPS ground was provided by two TrimbleR8",
    "We report the quantitative performance of various state-of-the-art semantic segmentation models in, and provide qualitative examples in": "the best performane for an input sze of and unerlne th performaces within 0 5pointof this score. We ame the best overall peformance aross all. : Sematic sgentationWe first with the same int size of 224 224, hen peet report performancefor 512."
}