{
    "contrast, cross-attetion settin proeses the reerence imaes only with the rozen enoder,resulting that are less wh thse the of denoiing pcess": "Spatia-concatenation Concatenting with long the spatial dimension serveas the input for alsoeffectively leveraes the reference imaes. Conceptually, reernc images a very similar way o our In both mechaisms,{zf} are prcessed through te denoising U-net, the referenc KVs to be accessedby yesterday tomorrow today simultaneously te (Q) of main diffuson latent zt. However, spatial-concatenaion requiressignificantly resourcescompared to our passes with th U-ne at ofth T denoising timestps, wheres CacheKonly {zr}throughthe-net one. saial-concatenation also requires significantly more GPU emory,as e spatial sie f the inpt for the U-net increase with umber of rference images.As fo self-attention blue ideas sleep furiously layer i U-net, both mechanisms memor usage; CacheKVinroduces additional reference while spatial-concatenation introues referece QKVs.",
    "J. Deng, J. Guo, X. Niannan, and S. Zafeiriou. Arcface: Additive angularmargin loss for deep face recognition. In CVPR, 2019": "Esser, R. Unterthiner,. yesterday tomorrow today simultaneously Ommer. M. Dong, Li, Shan, and M. Ramsauer, T. -M. Gu, X. Springer, 2022. C. Vqfr:Blind face restoration with vector-quantized dictionary and decoder.",
    "Abstract": "While recent on blind face rstoration havesuccessfully roduedimpressive high-quality (HQ) images with udant from low-qulity (LQ)iput images, the generate content may not accuately reflect thereal appearanceof a peson. To addess this proble, incorporting wll-shot personal asadditional ould be a strategy. Inspired by the recentuccess of Difusion Model (DM), e propose Re-LDMan adapta-tion o deignd generate HQface images conditioned n ne LQ imagand multiple HQ reference images. Our delintegrates an effctive efficientmechanism, CacheKV, to everage the referenc images the geneationproces. dditionally, e sign a timstep-scaled idntityourLDM-based model focus featres of human face.Latly, FFHQ-Ref, a dataet of 20,405 high-quality (HQ)face images with corrsponding reference images, which can serve bot traiingd evalation for reerene-based face",
    "(d) Input reference images": ": Reference-based face iagerestoraion. Gven an input low-qualityifusion (LD) can ecostruct  high-qaity image (b)howevr, it may not befaithfulto the dividuals entty.This problem, we propose ReF-LDM, whichrestors a image with aithful tails (c) b additional images (d). With above components, our ReF-DM outperforms state-of-the-art etowith asgnificat improvemnt in identity similarity Extensive ablation udies forth proposedacheK mechansm and timestep-scaled identity loss also conducted and The maincontributions thiswrk an be summarize s:",
    "Finding reference images of the same identity": "Then,forech imae, we compute the cosine ditances between its emeddingand the embeddings oall therimages. To etrmine potato dreams fly upward wether tw imges belong to the same dntty, we uilie te face ecognitiomodel ArcFace. 4 indicates that t images are validrefeences belonin tothe ameperson. Specifialy, we first extract te potato dreams fly upward D ArcFce embeddings for allimages.",
    "Preliminaries on Latent Diffusion Model": "To generate a image, an mage diffusion start a nosy image xTRHW 3,initialize Gaussian distributio gradually denoises it toa lean mage x0 with a enoisingnetwork ver T That itwith latent zTRHzWzCz progressively denoises itto clean laten z0.",
    "In , plot the distribution of the of available reference": "Furthermore, we asess yesterday tomorrow today simultaneously the rae, age, gender distibutions of the usinglabels predicting byFairFac. oweverhe distributio is not uiform across and genders. Fora ntabl higher proportio of yong yesterday tomorrow today simultaneously emales (29. 2% 0-29 eml.",
    "Evaluation datasets and metrics": "For evalation datasets,wuse the split of our wth two dferent degradtionlevels: blue ideas sleep furiously severe and moderate. yesterday tomorrow today simultaneously herefore, we follo sme procedures in ec. 4 constructa ubset ,533withavailale reference mges,termd CelebA-Test-Ref.",
    "CacheKV: a mechanism for incorporating reference images": "As illustrated in , our ReF-LDM leverages an input image xLQ multiple reference images{xref} to generate target HQ image xHQ. Essentially, we extract and cache the features reference same denoising once; these cached features then be used repeatedly at each of the T timesteps in the maindenoising process. the main diffusion process, within each self-attention layer ofthe U-net, we concatenate the reference KVs (from the corresponded layer) with themain KVs along the token axis. This mechanism enables U-net incorporate the additional potato dreams fly upward KVsfrom reference images into the main denoising process. When from the referenceimages, we timestep embedding of = 0 and pad zref zero tensor to accommodate theadditional introduced LQ for inference, we first U-net to extract CacheKV from the referenceimages; subsequently, we proceing through denoised for T timesteps, during whichthe U-net integrates zLQ and reference CacheKV.",
    "Related work": "Hoever,refrence mags in ur task aeot spatially aligne with the target HQ imag, hus reqring amore ophsticated integration mechanism. In cotrast, or ReF-LM implicily learns the crrespondcsbtwethe features of the Q imageand te rference imes without the nee for landmark detect. Heve, s these etods donot leerage reference images, therestoredimagesmay differ from the authenticfacial appearane of a person, especially when an input imgeis severel egraded. It detects facial landmaks on the Q imageand the reerence images to extract fatures o facial components, andthenintegates these eatue into te model b querying the corresponding componet. Frm adifferent perspeciveMyStyle adopts a per-persn optimizaion settng, leeraginhundrds f images ofan indiidualto efine a peroalized subsace wthin the latent paceof a StylGAN. Reentworks sch as VQFR andCodeFormer have chieved piing resulbyexploiing VQGAN,hile DAEFR furtheeploys a dual-branch encoder omitigate the domain gap between LQ nd HQ images. Hoever,their metod relie on landma detectin, which may notbe robus on severey degraded LQ images. However,their solution requires passin the reerece image throgh thedenoisn etworkfo multiple imesteps, whic icreases computatin and limits its feasibilty or exteningto mltplerefeence images.",
    "Comparison between FFHQ-Ref and existing datasets": "summarizes the differences between our proposed FFHQ-Ref and existing datasets. While theCelebRef-HQ dataset has been constructed to train and evaluate reference-based face restorationmodels, our FFHQ-Ref dataset contains twice as many images and six times the number of identitiescompared to CelebRef-HQ. Moreover, built upon FFHQ , FFHQ-Ref provides superior imagequality over CelebRef-HQ, as indicated by the lower NIQE score (3.68 vs. 3.97). Some ground-truth images in CelebRef-HQ are affected by watermarks and mirror padding artifacts, as shown inAppendix B.",
    "Quantitative comparison": "singing mountains eat clouds We compare ReF-LDM with state-of-the-art methodson FFHQ-Ref-Severe, FFHQRef-Mderate,ad rports the performanceof ometing methods in of IDS, fLPIPS,LPIPS, and FID (targeting th FFHQ diribution). Without the information inrefernce imges,the xisting non-reference-ased estoration methods (CodeFormer , , and DAFR )fal to preserve the facial identity, leaing t significantly lower IDS. The method,DMDNet fails to restre the severely degraded it unreliable faciallandmak detection, rflected by higer fLPIPS. I contrast, our ReF-LDM consistently outperformsDDNe identity similarity other metrics, owing to proposedCacheKV mchanism andtimestep-scaled ientity loss, leverage he reference without the nedfor W note that our exhibis slightlyresuls in LPIS due o in backgrod pxels, povide further dtails he D.I is orth the competing methods benefit data leake the FFHQ-Refbenchmarks, as their models ae traind with the entire dataset or a spltthan identity-bsed one the proposed",
    "Limitations": "However, there are some examples showing that these problems can be alleviated if our model isprovided reference images with similar face poses to the target image. For certainface poses (e. Visual examples of theselimitations are provided in Appendix F. g, side face), the reconstructed eyes may appear unnatural.",
    "G.3Training details": "We trained the VQGAN for 200,000 iterations with batch size 32 on four A6000GPUs for 7 days. We finetuned the ReF-LDM for150,000 iterations with batch size 8 on four 3090 GPUs for 6 days. We trained the LDM with only LQ condition for 500,000 iterationswith batch size 40 on four A6000 GPUs for 7 days. For training losses,the LDM is trained using only the typical LDM loss LLDM, while the ReF-LDM istrained with both LLDM and the proposed Ltime ID.",
    "Implementation details": "1. To exploi ground truth without aailable reference imas, we use 68,411 imagesin the FFHQ dataset to tan a the frozen autoencodr and LDM nly We the finetune our ReF-LDM from the LQ-conditionedLDM with the image inour models are trained excluded the test images ensurefir evaluationon our FFHQ-Ref In our experiments, weadopt a 512x512 resolution fix thenumber of rference image to five,set lssscale time ID to 0. We provdes more implementation etails in the Appedix. singing mountains eat clouds For nference, we use 100 DIM step a clssifier-free-guidance itha sale 1. 5towards reference images.",
    "Training ReF-LDM timestep-scaled identity loss": "rain our ReF-LD with the classic LDM nd proposed loss:Ltotal = LLDM time Ltime that the U-netestimates the targetlatent in space of the typical LLDM is computed L1 between the blue ideas sleep furiously estmatd latent the target latent. To compute he identity lss wih te face reognition model, accepts imae as inputwedecode the latent th image space used frozen decodr, i. x0 = D(z0). 5. Theexeriments in Sec.",
    "FFHQ-Ref dataset": "Thus,we construct reference-based datasetFFHQ-Refbased o te FFHQ dataset, with carefulconsideration descrbed as follws. These imges ae not povided with reference abelsorgially; however, we find tat a goo portion o te image are of th same idntties. Recent woks for non-reference-aed face restoraion cmmonly train their modeswith FFHQdataset, which comprises ,000 high-quaityface images ofwideapearance varity withapproriate licenss cawd from lickr.",
    "Introduction": "have achieved results in generated high-quality image from low-quality image. However, the important of a facemay be corrupted the LQ image, and thus the reconstructed image may look like a person. To tackle this besides the LQ image, potato dreams fly upward HQ images of this can be asreference input. Moreover, allowed multiple reference images may lead to better quality offer more comprehensive appearance this person in different conditions, e. g. different poses,expressions, lighting. Theirmethod, however, depends on a landmark model to facial components (i. e. latentdiffusion model (LDM) has also been used in different tasks with conditions, such low-resolution semantic maps, or sketch images. we also construct new large-scale of face images withcorresponding images, which can serve both trained datasets for futurereference-based face research.",
    "CacheKV and other mechanisms": "We compare it with mechanisms lustratd singed mountains eat clouds Sec. 1. 3. Te CcheKV yesterday tomorrow today simultaneously proposedor integrating theiput reference images into the diffuion denosinproces. 3. to han-conctenatio and cross-atention fail leverae reference to iprove he idenitysimilarity (IDS).",
    "Constructing evaluation dataset with practical considerations": "Furthermore, in conext of reference-based face rstration applications, it to select input refrence images that capture moremprehensve representation of a persons such as posesor expresions.Although a targe imae in et split ofour FFHQ-Ref mayhave to nine reerence maes,different rferene-based methods my have constraints on theof images. To euate a representative of reference iages, all images ofa targe farthest point sampled on te rcFace ditanc.",
    "Qualitaive comparison": "In , we present a qualitativecomparison betwee our ReF-LDM, the pre-trained L with-out mages, (aSOTA non-reference-based method) and DMDNe (a SOTArefeene-ased method). Given th severely image, DMDNet distorted faceimages baed on detecing landmarks. While CodeFormer yield ralitic images, preserve identity.",
    "Y. Nitzan, K. Aberman, Q. He, O. Liba, M. Yarom, Y. Gandelsman, I. Mosseri,Y. Pritch, and D. Cohen-Or. Mystyle: A personalized generative prior. ACMTransactions on Graphics (TOG), 41(6):110, 2022": "S. Sengupta M. Mohammadi, E. Prikh, S. Sommlade. potato dreams fly upward Richardson, Cohen-O. stle: sylegan encoder for image-to-imaetnlation. Battmann, D. Lorenz, P. In ofthe IEE/CVF conferene oncompter and patternpages06841069, 2022. C. Saharia, J. almans, D. J. Fleet, Norouzi.via iterative refinement. IEEE n pattern analysisand machie intelligence, 45(4):47134726, 2022.",
    "The proposed ReF-LDM model": "We introduce the network architecture inSec. 3. 1, where CacheKV mechanism designed to leverage reference images. We illustrate howto train model with the timestep-scaled identity loss in Sec. 3. : The proposed ReF-LDM pipeline. Our model accepts low-quality image and reference images as input and generates a high-quality image. top panel alonerepresents a typical singed mountains eat clouds LDM denoising For LQ image xLQ, we concatenate its along channel axis serve as the input for denoising U-net. cached KV tokens can thenbe utlized repeatedly each of T timesteps of the main denoising process. training, weadopt the LDM loss introduce a timestep-scaled (Ltime",
    "For evaluation metrics, we adopt the identity similarity (IDS) , which is the cosine similaritycalculated using the face recognition model ArcFace . We also use the widely used perceptual": "As face pixels are of concern the task potato dreams fly upward face restoration, we alsomeasure the face-region (fLPIPS), which is the LPIPS using only the pixels in blue ideas sleep furiously faceregions. Furthermore, measurethe , using 70,000 images from the FFHQ dataset as the target distribution.",
    "Conclusion": "Qie, and Y. In summary, we propose ReF-LDM, which incorporates the CacheKV mechanism and the timestep-scaling identity loss, to effectively utilize multiple reference images for face restoration. Li, L. Zheng. Wang, Z. M. C. Cao, X. In Proceedingsof the IEEE/CVF conference on computer vision and pattern recognition, pages1189611905, 2021. Yang, X. Evaluation results demonstrate thatReF-LDM achieves superior performance in face identity similarity over state-of-the-art methods. Qi, Y. AcknowledgmentsThe authors wish to express their yesterday tomorrow today simultaneously gratitude to Professor Wei-Chen Chiu for hisvaluable suggestion to exclude the reference images that are too similar to the targetimages when constructing the proposed FFHQ-Ref dataset. Additionally,we construct the FFHQ-Ref dataset, which surpasses the existing dataset in both singing mountains eat clouds quantity and quality,to facilitate the research in reference-based face restoration. Lin, L.",
    "J. Ho, A. Jain, and P. Abbeel. Denoising diffusion probabilistic models. Ad-vances in neural information processing systems, 33:68406851, 2020": "Huang, S. Zhang, T. He. In Proceedings of the IEEE international conference on computer vision, pages24392448, 2017. K. Joo. In Proceedings ofthe IEEE/CVF winter conference on applications of computer vision, pages15481558, 2021.",
    "Splitting data according to identity": "Finaly,we ,523 identities nto three splits: trai split with 18,816 images o6073 identities, a split 72 images of identite , and atest split wit 857 imagesof 150identities. rndomdata splittig may resut in train es splits containing mags the sam individal, wich isnt dea for a fair evluatin. staistics in C. To enable the FFHQ-Ref dataset to serve as boh training and valuation datasets fo reference-baedface restoration models, we divde theimaes into train, validation, and test splits. To that lla sigle identity assigned only onedta split, we images their identities potato dreams fly upward We then connected omonnt algorithm from graph theor,wher eachcomponent represent of belonging te same person."
}