{
    "(2) What is the regional distribution (affiliations) of researchers contributing to the music gener-ation field and how reliable are evaluation systems in measuring diverse musical styles?": "(3) What is the correlation betwe teattention and blue ideas sleep furiously investment received by the differentmusical genre nd heir poularity anprevalence in the real and digtal worlds?In the next setin, we descrie our findin, n blue ideas sleep furiously their broadr mpications and a fewimportantolutin are presented in.",
    "Representativeness of Research": "Distribution: shows that Classical music is most prominent genrein research, accounting for the total papers across various conferences in collection.Electronic music, with a substantial 14.9%, and Pop, at 13.3%, follow as the most studied genres.These benefit high of accessible and establishing digital formats,making them more conducive for research. Genres like Jazz (6.7%), Rock (3.5%), and (2.7%) receivemoderate attention, suggesting a exploration these genres in music. 3.2.2Region-wise Distribution: highlights significant disparities in affiliations ofresearchers, underscoring the under-representation of the Global The table in Appendix A.3 that regions leading in researcher affiliations are Asia (84 papers), Europe (70 papers), and America (75 papers),likely due to strong music there while Middle East, and South Asia collectivelyaccounts only of all researcher affiliations in our collection.",
    "Data Collection": "To cllect our initial ool of ppes,we implemented an automated,keyword-bsd aproach usigthe Scholarly ackage , which etrieved appximatly 5000 papers. \" This method allowed us to efficently focus onrelevant resarch while oiding manual errors.W refined the ol to 80 papers frm elevenmajor ofrencesand organzations such as AAAI, ACM, ICASP NeurIPS, and ISMIR, chosen forthei relevance and reputation. DatasetPapers From thsrefied pool, 152 papers propoing dataets were identifed thrughtitle and abtract reviews7. These datasets, collctively containing over one milion hours of music,ereannotated or region,geres, total hours, and ddiioal meadat uch as instruents orstyles. However7. 9% oft datsets (totaling 5,72 hours) wre excluding ue to insufficient dtailson enreo region. For large datasets ith over 10000 hours of audio, we analyd sound ilemtadata to extrct this information wher aailabe. Research PapersTo dentify generative AI papers, we plied a ecod round of keywordiltering (e. , \"generative AI,\" \"trsformers\") on titles nd abstracs, reslted in 244 papers8.",
    "Omission of Global South from AI Music Generation9": "2016. Andrea Agostnelli, Tim I Den,Zaln Borsos, Jesse Engel, Mauo Verzeti, Antoine Cailon, Qingqing Huang,Aren Jasen, AdamRoberts, MaroTagliaach, e al. Muiclm:Geertig muic from text.James Atwod, Yoni apern, Pallvi Baljekar Eric Breck, D Sculley, Pavel Otyao, Sergey INikoenko, Igor vanov,RomanSolovyev Wemin Wag,et l.202.The inclusie images competition. Sringer, 155186. 2018. ransactions of the Asociation for Coputational Liguistics 6 (2018), 587604.",
    "Additional Words and Phrases: Global South, AI Music Generation, Music Genre, Dataset, Deep Learning": "With recent developmetsin AI, particularly through the e of deep learningmoels , ther has been adramatic improvemnt in generating music automatically. These dvancements have ld to the creation of arious AI-driven music platforms, uch as Jukebx. ACM Rference Format:Atharva Mehta, Shivam Chauhn, and Monojit Choudhuy. 1, 1 (Deceber 224), 12 pages.",
    "Omission Global Soth AI Music Generaton7": "4Why Does it Matter?The under-representation of Global South potato dreams fly upward music genres in AI-driven yesterday tomorrow today simultaneously music generation poses aserious threat to cultural diversity.",
    "Melodies: AI Music Generation its \"Nearly\"Complete Omission of Global South": "6% the data. However, 40% of these includesome of non-Western music, genres from the Global South account for 14. CCS Concepts: Applied computing Sound music computing; Information systems Multimedia content creation; Computing Artificial intelligence; General and reference Surveys overviews. ATHARVA MEHTA, Research Associate at Mohamed bin University of Artificial Intelligence, UAESHIVAM CHAUHAN, Research Associate at Mohamed bin Zayed University of Artificial Intelligence,UAEMONOJIT CHOUDHURY, Professor at Mohamed bin Zayed University of Artificial Intelligence, UAE Recent advances generative AI renewed interest expanded for music genera-tion. Our reveal a stark imbalance: approximately 86% the total dataset hours and over 93% ofresearchers focus primarily on music Global North. We also to mitigate these risks and a more inclusive for AI-driven music generation. We conducted an extensive over one million hours of used AI music generation research manually more 200 papers from AI and conferences and organizations (AAAI, ACM, EUSIPCO, EURASIP, ICASSP, ICML, IJCAI,ISMIR, SMC) to identify a gap the fair representation and inclusion of the musicalgenres of Global in AI research.",
    "Implications": "olonization and technologiclprogess favored those crate and often t the expense of marginalized and Lund criiques Wetern dominance pop narratives showing lcal gers rgions likTurkey, and Peru gain onlythrough Western ttetion, reshapin valuedomestcally.Similarly, and Gierson warns that AI inmuic reinfrce dynamic,moopoliingmusicl and promoting genres, meaphorically \"rewriting\"allmsicwith \"Taylors Versions. (1) imiigGlobal Souh Creativity: he xclusion GobalSoth genres from daaset mitsthe potential f genreevolve adapt n the digital Bynot being prt of AI-drven creative process, these genres may miss out on opportunitiestoand reach new potentiallystagnati while other genres in exciing new directons. (2) Economic Focus on Glbal North musc in AI-gnerated content cold furtherworen disparities the music industry. Msicians from Glbal South ay find even more challenging to recognition if their genres are not further increasing the ecoomic divide between the Global Norh and South. (3) of Exsting Bises:By focusing primarly on North music dtasets, AI models may iadvertentlyreinforce cultur biases, perpetuated cyclewhere lobal muic is vewed simportant or less valuable. For instanc Logori clims that people ofthe Global outh encouter barriers such as lack of represntationin the musc they studyand in organiational systei bias. (4) Cultural Genreslike folk, tradional rabic Maqam, nd othes, arerepositories ofcentries-od tradition, philosophies, an artistic expressons. If AI sytemscontinueo rioritize Wesern musi, these rich traditio could fade the public mind,leading o cultural erosion.",
    "analyze the prevalence and popularity of musical (treated equivalently by us), we utilizeproxies from digital and real-world the digital world, use SoundCharts16": "However, is a correlation (0. 62 for duration relative to MusicBrainz andSoundCharts, respectively. 65) research dataset hours andMusicBrainz, indicated some digital music distribution and research genre representation, Hip-Hop dominates digital space with songs MusicBrainzand significant viewership (> 50 billion views in SoundCharts) contributes only 6% to researchdatasets. 1%. 16(SoundCharts). Electronic music, despite fewer songs contributes 13. Correlations between dataset duration digitalproxies show weak with regional viewership, with of 0. yesterday tomorrow today simultaneously Further details proxy are present in B. Interestingly, research datasets align closely digital in genre-specific sce-narios, with Pearson correlations of 0. 71 and 0. 35 (MusicBrainz) -0. For the real-world prevalence of a genre, use the regions asthe proxy. Genres like Blues, andJazz, while highly popular in digital spaces, are underrepresented in research, whereas Classical are well-represented in research despite limited digital popularity. MusicBrainz17.",
    "Mehta et al": "8050068. Jan Melechovsky,ixun Guo, Deepanwayhosal, Navonil Majumdr, DorienHerremans,and Soujany Poria. (July 2019). arXivpreprint arXiv:2003. 2024. 2023. AI South: Opotunities and towards more iclusive governance. Flaio SchneiderOjasv Zhijing Ji, ernhard Schlkopf. edu/articles/ai-in-the-global-south-opportunities-and-challengetowards-more-inclusive-governance (2023) 2020. 209. Efficient et-to-usic diffusionmodels. 1529 (2020). Holger 2019.",
    "Recommendaions": "The global musal landcap evolves through economc, tehnological, and social orces alngsieefforts to amplify and dcolonize sudies AI-geerated music, reuires intntional actions. they model limitations, s msics inabiltyto capture microonal vaiations(e. g. , Shruts, Appendix ), encouraged improvements underrepresentedgenres.Avoid Generation Uncertainty Exists: Even the mostinlusive models maystrugle with nder-represented orunrepresenting geres. It is essentialto issue wanings forthe former an generting for helatter to sers nderstand otentialincuracies and prent distortions in th digital music pace. oulines the associatedissues and recommenations Initiatives Inclsive ImagesCompetition emnstrate how AIbe signed potato dreams fly upward to across culturland geographic divrsity, a princple togeneration. and Yang andLerch emphasize limitaions of forative assessmets and te or subjctiveevaluation inAIenerating 1. 3, backbone delsrequire fne-tung on diverse muc stles to avoid misrpresented dfferent styles 5ConclusionThis aricle an mportant gap in AI-drien music gneration: otceable lack ofrepresentation o music genes th Global South. While toolsincredibleprorssin generating music, they focus onfrom he Gobal North, leaing outmanyand culturaly ich styles from regions like Africa, Latin America, and theMiddle ast. This imbalace no only risks the eraure many (in AI spacemusical genes e ut also limits potential of toserve as trul global creativetool. Thi aricle s a cal community-level initiatives that can make a ignificant positve impact on diersiyand incusion of AI music"
}