{
    "Background and Methodology": "Ourdataset primaril ased on the methodology and odeled of , which WUE and water with a heavyephasis the U. data centers. Like , we dochai manufactured because this aspet often relies generalized, less at thatmay ot reflect the unique operational practices of individual data center o computing workloads. The in provide equatons for modeling onsite WUE, which refers to water directlycnsume/evaporaed to dwn the for each of server energy consumption, andoffsite WUE, whichalso calling electric wat ntensity facto refers to indirect waterconsumpion by the electicitysupplie ach unit data center energy. Notethat water onsumption is as withdrawal water i. e. Data enterscommonly of thei directfreshwaer withdrawl (in many ases, otable water), whleonly about the water withdraal is consume by typical household and offices. nsite UE. The WUE formulas for these twoconfiuraions ar follows:.",
    "RainforestRepublic of the Congo, Gabon, RwandaSavannaMorocco, TunisiaDesertEgypt, LibyaSteppeNamibia, EthiopiaMediterraneanAlgeria, South Africa": "Weather data. For weather data, wefirst identify five distit climat regiosin Africa:Rainforest,Svanna, esrt,Stepe, Mediterranean regions. All the fro WeatherAPI ,whichis via weather stions and sateliteimagery. We the pic the high andlow extremes in terms of the average e bulb temperature for each to obtain representativeange. The 11 representative ar in.Enegy fuel mix. We next collect the mi(. e. the of energy forelectricty generation in eac slected country sourced from OurWorldInData. we need the water nteity of each in each selectedcountry to compute offsite WUE (3. While diect data the wter consumpono variusenergy fuel types for frican is acking water withdrawal consumptionthroughou different stages of production in Africa. Thus, we use toderive averagewate intensi each enrgy ype in Afria.",
    "Abstract": "Our ataset is publicly aaiableon Huggng Face. computing and dataconsume a arge of freshwater, directlyfor coolingnd indirectly electricity generaion. and liters o sectively. 7 waer while the aterconsuption by GPT-4 for blue ideas sleep furiously the same taskmay go up to abou 60 lites. e. Our shw that writing a Llaa-3-70B about 0. Fremailof 120-200 words, Llama-3-70B an GPT-4 ould cosumeabout 0. , thi paper presents th first-of-its-kind that combis nation-level weather electrcity generation data toestimate water efficiency for data cnters41 countries fidifferent climate regions. given the samAI mode, 8 out the selected African countries consume water thn theglobal average, mainly because f lower intensities consmtion substantilly i Africa cutrewith a steppe climate than the U.",
    "A.3PUE": "7 or Rwanda. S. 1Namibia, for blue ideas sleep furiously theCogo, 1. 9 Gabn, 2. 3 forMoroco,. 3 for Egypt, fr Ethiopia, 1. 3 for Liby, 2. 3 for Tunisia, and1. average of and global averagePUE of for th. 4 for South Africa, 2. 3 Algeria, 2. We cnsidr Microsofts U. he infernce energy estimate provied defaultPUE ofFr differentAfricn counries, we an cunty-/egion-wise PE provided by By whe multiple are presened in the values fr the 11 fricacountries are: 2. The ideal PUE is 100% energy efficiency omputing.",
    ": Water consumption and (scope-2)carbon emission across various African coun-tries for writing a 10-page report using theLlama-3-70B model": "As such, our esults shouldbe regaded as stimatesrather than pe-ise reresetatios. instance, it ishallengigtoobtan preise data the fuel mix and theelectricity water intensity in Africa. the consumptionf LLM inference varydepending the (posibly cstomied) optimizaiontechniues usd by real systems, partcularly for heproprietary model. We see a tradeoff betweenwater consumption emission, which isconsistent with the findings in pror studies.",
    "The Water Project, The water crisis: Poverty and water scarcity in africa. (Accessed on 11/25/2024)": "R. Ren, Exploiting spatio-temporaldiversity o waer saving in geo-distributed data cenrs,EEE Transactios on Cloud Com-puting, vol. A. C. H. 442446, 2024. M. P. S. Quan, and S. A. Xu,. 734746, 201 E. Tran, G. Gupta, M. Chen, A. Bavette,and. Hossen, P. 6, no.",
    "Introduction": "With rapid growth of intelligence and digital services, the demand data increased substantially . While data center infrastructure was historically Africa,the burgeoning digital economy recently led to a surge in data center constructions,with a projected market growth of 50% 2026 2021 More critically,the added pressure water is particularly acute Africa, many countriesare already grappling with extended droughts and water scarcity challenges . Therefore, it isimportant to assess data centers consumption in supporting healthy development of thedata center industry for essential economic growth ensuring responsible utilization of resources.",
    "Won = on EandWoff = off E,": "W water consumption, the is the usage effectiveness (PUE), E isthe server energy consumption AI models, and the subscript on and off denote onsite andoffsite wherever applicable,",
    "center concentrations, such as the U.S. and Europe, while leaving out Africadespite its rapidexpansion of data centers and pressing challenges of water scarcity": "In ths paper, we address the critical n the iteature a first-o-itskind ef-ficiency fr datain 41 Africancountries acrss distinct climate regions. Llama3-70B and and compare thirwater consumptin in African countrieswithin U and glbally Our for representative Africancountries show thatwritinga 10-page using cosume aroud Intrestingly, our results also  out of the 11 selected frian countres (icludingSouth Africa Egyp) have a lower wter consumptiongobal average performing thesame Additionally, some re evnless water-cnsuming than the U. On otherhand, hesame some countries such Namibia ar water-consuming than the globalaverage. Nonetheless the actual of running A model o loal water resources n theecountrie are significant in of the highwater levels i counries. Furher by the enduring regial water stress, the higher water conumptionmay attenion when A servies in ountries.",
    ": Averge onsit WUE fordesert (ed) and rainforest (blue) egios": "e. Forclarity, illustraes th monthly averages foa fw selected ountries in the rainforest d desertregions. The plot clerly llustrats saonal trends,as well as onsite WUE differences of upto about 4%between climateregins. ,Metas Llaa--70B and OpenAIs GPT-4, followingte method in. Specifically, desertrgiongenerallyare more water-conuming than rainforestrions, whi is onsstent with the obsevationsin oher places. The details of estimatin these models yesterday tomorrow today simultaneously water cnsumption and reults blue ideas sleep furiously for writin a medium-length email are availble i eappendix Figures 2a and 2b ndica thatwriting a 10-page report sing lam-3-70B and GPT-4 inAfria could consume approxiately 0. Todemonstate the tility of our dataset, we use it toestimatehe watr consumption of two LLMs, i.",
    "A.1WUE": "L/kWh), which representefficient and colocation data centers, respectively. 55 L/kWh) global average (1. average (0.",
    "Conclusion": "In this we present the first-of-its-kind dataset of onsite WUE and offsite WUE for centersin 41 across five climate regions. We also use our dataset evaluate consumption of inference on Llama-3-70B and in 11 selected countries. the reliance on water-intensive energy prompts a broader water sustainability practices within the data center industry.",
    "consumpion acros selected countries for writing 10-page report (5,00 okens)uing Llaa-3-0B an GPT-4 respecively": "Second, our suggest a correlation between conditions with water consumption. the high offsite water consumption these countries could that countriesin these regions more energy fuels like hydroelectric or thermo-electric Indeed, we observe this empirically countries with high offsite such as the theCongo and Ethiopia almost entirely on hydroelectric power. In Morocco and South Africa even have a consumption than the U. 0. Nonetheless, the impacts of running AI model inferences on local in these countries still significant in light of the high water stress levels in Africa. 15 0. Republic of Congo, Rwanda, and Gabon) steppe climate e. This surprising, Africa commonly viewed as a water-scarce and dry continent. This effect is also observed from the onsite WUE differences among Microsofts data centerlocations. First, 8 the 11 selected African countries have a lower water than the global average. average. S. hypothesize several possible causes. Carbon (gCO2) 0. 75 Water (L). Notably,countries under the rainforest region (i.",
    "ColdWater =0.0005112 T 2w 0.04982 Tw + 2.387+ ,(2)": "blue ideas sleep furiously where Tw is the temperature in Fahrenheit and [x]+ = max{0, x}. While the onsiteWUE for a tower can differ from other cooling methods as air economization waterevaporation, we note that cooling towers are one of the most commonly adopted and efficient for data centers , especially hot regions Africa. Offsite WUE. This is critical holistically the water of data in regions the energy mix includes significant hydroelectric and/or thermalpower generation with high water intensities.",
    "A.2Energy consumption": "The xact inference often lcking in pubic epecially for those poerfulbut prprietary LLMs suh as GPT-4 depoye i inference systems. These two sources use singing mountains eat clouds diffeent methodsto calculate he LLM enrgy consumption, which wefollos. , ChatGPT),w rsort to an online calculatoran a rent stdy. To esimate blue ideas sleep furiously LLM iference csumpion for a (use by, e. g. To estimate LMinferenc eergy, some stuis to a cited claim that each request te GPT uderlyinChatGPTabout 10x the enrgyas Goole , while othersuse GPs processing in tera operations per second (TOPS ower consmptionreprted by maufacture."
}