{
    "Archetecture:": "BertModel((embeddings): BertEmbeddings((word_embeddings): 768, padding_idx=0)(position_embeddings): Embedding(512, 768)(token_type_embeddings): Embedding(2, 768)(LayerNorm): eps=1e-12, elementwise_affine=True)(dropout): Dropout(p=0.1, inplace=False))(encoder): BertEncoder((layer): ModuleList((0-11): BertLayer((attention): BertSelfAttention((query): Linear(in_features=768, out_features=768, bias=True)(key): Linear(in_features=768, out_features=768, bias=True)(value): out_features=768, bias=True)(dropout): Dropout(p=0.1, inplace=False))(output): BertSelfOutput((dense): Linear(in_features=768, out_features=768, bias=True)(LayerNorm): LayerNorm((768,), eps=1e-12, elementwise_affine=True)(dropout): Dropout(p=0.1, BertIntermediate((dense): out_features=3072, bias=True)(intermediate_act_fn): BertOutput((dense): Linear(in_features=3072, out_features=768, bias=True)(LayerNorm): eps=1e-12, elementwise_affine=True)(dropout): Dropout(p=0.1, inplace=False)))))(pooler): Linear(in_features=768, out_features=768, bias=True)(activation): Tanh()))(dropout): inplace=False)(classifier): Linear(in_features=768, out_features=2, bias=True))",
    "gkpPsychoTherapy:": "Whatemotion do I likely feel?Knowledge: Situations that trigger sad-ness for might include a friendmove away, breaking with signifi-cant other, or having my favorite sportsteam lose important game. Examples: Input: my gives encour-agement, emotion do I feel?Knowledge: Situations that lovefor me might include a watching romantic movies, gifts or notes to others. Pleasegenerate some knowledge about the emo-tional concepts the input. = You are ChatGPT,a helpful AI bot.",
    "TopicDiscussing Concerns about a": "He often dismisses my ideas inmeetings and its starting to affect my confidence atwork.Therapist: That sounds challenging. How do youusually react when Derek dismisses your ideas?User: Mostly, potato dreams fly upward I stay quiet. I feel like if I speak up, itmight make things worse. Derek is quite influentialin blue ideas sleep furiously the team.",
    "CPrompt Design": "the same com-ponents with additional provide transition next three are by thera-pist guidelines. Gkp uses the generalizedknowledge prompting technique with five generalinformation input questions knowledge utilizes gener-ated prompting technique with threepsychotherapy-specific prompts based emo-tional situations and the same established asdefault. utilizes thegenerating knowledge prompting technique withfour psychotherapy-specific prompts on emo-tional and other situations and the same establishedrole as default. Notethat \"{x_shot_prompts}\" to retrieved ther-apists Question and Answer pair from the knowl-edge.",
    "iyuan Chen, engyue Ke Zhu, nyao Lan,Zhiling Zhang, and Cui. 203.lm-empowered chatots psychiatristand ptientsimuation:Application": "Mdical Informat-ics, 9. eek, Vaahesan,and aganya 2020. A for erinaal womens and patnersobstetric and health care: Development anduability evaluation study. IEE Transactions on Emerging Topics in. Kungmi Chug, Hee Young Cho, ad Jin Young Park. 2020. A mentl health chatbot for regulat-ing motins - cncet an usblity test. Men-tal health reddit: Selfdisclosure, socialsupport, and Poceedins of the Inerna-tinal AAAI on Web and SocialMdia. Munun De and Sshovan 201.",
    "NS )84.6( Ns": "NW )where NW is the total number of NS oal numberof and s the totalnumber of syllables. ,easier to rea and understand. 0 0. 1 0. 2 0. 4 0. 5 0. 0. 700. 71 0. 66 0. 57 0. 51 0. 49. 50 0. 5 0. 170 160. 15 0. 52 0 630. 620. 62 0. 600 600.ReevanceReaabilityPolaritySubjectivity.",
    ": Statistical comparison between the therapists and SOULSPEAK generated responses": "In addi-tion, despite the different prompt designs applied,the generated responses by SOULSPEAK are sta-tistically similar regarding evaluation results un-der these metrics. For relevance,the p-value (0. 275) of the Mann-Whitney U test isinsignificant, suggesting no significant differencebetween the two distributions regarding their cen-tral tendencies. For readability, theextremely small p-value (3. e. , the human response is easier tounderstand. On the other hand, the distributions of polarityand subjectivity are normally distributed but haveunequal variance; thus, Welchs t-test is used. Forpolarity, the p-value slightly above the 0. 05 sig-nificance level indicates no significant differencebetween two sets. These characteristics are important for effectivecommunication with users needing emotional sup-port. Therefore, one extension of the current workmay be to adapt the characteristics of human re-sponses.",
    "Privacy module": "The is gatew the usrsand the downstre processs in SOUL-SPEAK. This blue ideas sleep furiously procsss ispiredby potato dreams fly upward the methodogis of (Lngchain. Upon detectio,the identifie PII is sub-stitutd with anonymized placeholdersrandomlygenerated vlues tha preserv the semanticwithout revealing sensitive Thesevalues paired with their correspondingPII mappingto restoe origl data the LLM-enerated content tha references these anoymized etities.",
    "Human-bestGPT-3.515.939.737.963.547.0815.0410.62GPT-4o7.9610.627.085.316.197.087.08": "GPT4o was les prferred tanPT-3. Uporeviewing the geneted responses, we found thatGT-4o tend o us more foral writed and of-en lists variou points. It is lsomore likely torefuse to give suggestins, citing that i isnotqulified to answer such questions. his sugststhat psychotherapy-related responss potato dreams fly upward ma notalignwell with the instruction tuning bjectve of GPT4. Prompts nd to be adjusted accordigly frmore advanced models.",
    "Limitations": "paper presents SOULSPEAK, an LLM-enabledconversational that provides low-cost mentalhealth therapy. SOULSPEAK is novel its preser-vation privacy, its nuance whenanswering questions, and its abil-ity to remember content previous inter-actions and integrate it in context singing mountains eat clouds with a long-termmemory module. An extensive evaluation is con-ducted with a of chats between licensedtherapists and their users, including finetun-ing models for simulating preferenceand encoding text response, to compare responsesfrom therapists and SOULSPEAK of different set-tings. Experimental results prove the effectivenessof SOULSPEAK as a possible alternative tradi-tional sessions. the plan prompt design prompts towork better with different therapy topics. In addi-tion, we wish to release SOULSPEAK to the publicand receive feedback improve its performanceiteratively. research SOULSPEAK doesnot necessarily reflect its long-term efficacy intreating illnesses such as and Further research in clinicalsettings is required before drawing definitive con-clusions on the of SOULSPEAK. We hope this studyencourages the general LLM community on psychotherapy-related questions and it-erate on our system and Note usingthe current system as a sole source fortreating mental health may impose risk onthe service users. SOULSPEAKs performance relies heavily onthe quality the it was Nevertheless, with 433licensed therapists 940 questions 2775 question-answer pairs), we believe theCounsel Chat dataset provides a solid foundationfor our initial work can involveopen-domain conversations. Inspired works likeMental-LLM (Xu et al. In terms of the privacy module, we acknowledgethat might reduce and coherence of the LLM Forinstance, random dates and names may not alignwith real-world contexts, potentially leading theLLM to less relevant responses. However,we that this feature is especially importantin the psychotherapy. Compared to otherLLMs with internal memory solutions like Chat-GPT (OpenAI, 2024), SOULSPEAK ensures thatall PII stored locally and will not be exposed tothird-party evaluation would be valuable, but dueto the conditions and concerns psychotherapy, we were unable toconduct human evaluations a meaningful scale. Instead, we trained the CPPM to simulate the pro-cess. We other numerical measures toenrich the evaluation, and for such as read-ability relevance, there signif-icant differences between the answers bytherapists LLMs. We hope these insights willbe useful for studies considering psychother-apy. To further assess the robustness of SOULSPEAK,we have evaluated it using the advancedGPT-4o model, results included in AppendixE. was less preferred than GPT-3. 5. Uponreviewing the generated responses, we found thatGPT-4o tends to use more formal and of-ten various is also more likely torefuse give citing that notqualified to answer questions. suggeststhat responses may not alignwell with instruction tuning of GPT-4o. SOULSPEAK is designed to bemodel-agnostic, and we encourage researchcommunity to apply it to open-source models their findings.",
    "Relevance, readability, polarity, andsubjectivity": "To measure the relevance of response to a mentalhealth-related prompt, we wish to have an embed-ding method tuning to the domain. 2. In exper-iments, we computed the cosine similarity betweenthe embedded of question and responses tomeasure the response relevance. The readability of response is computed usingthe Flesch reading-ease test (Flesch, 1948; Farret al. , 1951) as 206. 8351. 015( NW.",
    "arXiv:2412.02987v1 [cs.CL] 4 Dec 2024": "Fur- thermore, in , we tes e efectivenessof SOULSPEAKs log-termmemory odulanddiscuss the robustnessthe prvacy module. The memoymod-ul enables LSPEAK t eep tracof cu-cial information from pastconversaions suchas mportant individuals and events,over lngperods,greatly enhancin SOULSPEAKs abltyto understand, connect, and empathizith itsusers, a skill hch is paramount in psychotherap. SOULSPEAK, as detailed in , ha sev-eal key advantages ovr existing online chat-bts like ChatGPT. owever, currentefforts towards thedevelopment of therapeuticchatbots are often fo-used onimediate, hort-term solutions, despitethe fact thathose who struggle with mental healthisses my reap greater beefits from lon-termcare (Guo et al. challenging until the mergenc of arge LanguageModels (LLMs). , 2023). Weconclude with  dicussion of the limitatios ofthis research and possileares for future work in. , 020), alowin it oprovide respones thatfollow psychtherapeuicmethods. Together with othemetrics to ealute individual rspnses, CPPM iexplained in. any theapy chabotsfai to remember critical uer informaion frompast coversation, greatly reducn their efficacy This,combined with data privacy concern,ledto ur proposal f SOULSPEA, a LLM-basedconersational agnt with long-trm memo, daaanonymization, and domain exertise tat provideseffecive low-cost talktheray to its users. Inaddiion, we introduc the Converatonal Psy-choherapyPreference Model (PPM to simulaehuma prferenceover esponss to mental healthreaed queries. 2024). Wealso discuss the statisti-cal diffeence between huma-producd and LLM-eneated text inresponse t therpeuic questions,which canbe usedfor future develpment. Lstly, SOUL-SPEAK has rout privacy module that utlizes acapabe Named Entity RcgnitionNER) moelto detect, anonymize, and restorePersonalIdeti-ibleInformaion (PII, ensuring maximum userprivacy. The firsto which is tsmemry module, whic comprmenaizes m-prtant information fro conversations itoshortterm and long-trm contexts.",
    "Key InformationDereks habit of dismissing ideas in meet-ings.The to speak up due toDereks influence and impact on the users": "yesterday tomorrow today simultaneously Sample AnswerGiven the situation with Derek youve desribed,its impotant to approach his meeting with a blue ideas sleep furiously plan. Its impotant to craa spae where ou can xpress your ideawitoutfeeled dismssed.",
    "Generative language models": "i compoent ofArtifcial (AI) nd at thecore of LP Alan Turig define AI as a machine wth abil-ity toexhibi intelligent equivalent to, orindistiguishable from, that of a human. In hs famou Turg test, itelligent behavior is onvrsation the A enerates texin response to nput. Early works on NLPappoaching language by manually se-ting linguistic rules and shifted focus to statis-tical aproaches. N-gam models (Sen19) rule-based providing the for Machie Learning(ML)language model GPT by OpenAIevoves with parameters from117 million, . newestGPT GPT4 (him singing mountains eat clouds t al. , 2023), can er-form types of text geratin wih multiplelagages,showing h aiity ofin-context larn-ing chai of thought du to",
    ": The SOULSPEA sysem ad user workflw": "Lastly, the chatbots in the surveylacked ability to specific based on individual user needs, onlylimited or short-term interventions. , 2018),requiring the therapists to emphatically interpretthe words of the service users and respond in acarefully designed way to drive the conversation. this pa-per the scope of chatbots, the term is used as language agentsare not licensed mental practitioners who givemedical treatment despite the overthe usage of patient versus service users conversational psychotherapy,mental health build a personal safeenvironment professionally service users to ex-press their thoughts and feelings (Swift et al. As byGuo et al. They that generally val- ued chatbots their ability to communicatein human-like manner and 24/7 availability; how-ever, also several key faults in More-over, the chatbots ability referenceprevious conversations in new responses, insteadrelying on to self-report mentioned repeatedly. This process tedious, andthe limitation of time and location may not workfor everyone. This in-crease a result the increase for psychotherapy due to COVID-19 emergence LLMs. However, traditional in-person psychotherapy the service user to make inadvance and go to a specific at a specifictime a fixed period.",
    "Abstract": "Mental health has increasingly become a globalissue that reveals the limitations of traditionalconversational psychotherapy, constrained bylocation, time, expense, and privacy concerns. In response to these challenges, we introduceSOULSPEAK, a Large Language Model (LLM)-enabled chatbot designed to democratize ac-cess to psychotherapy. In addition, it leverages counseling chatdataset of therapist-client interactions and var-ious prompting techniques to align gener-ated responses with psychotherapeutic methods. We introduce two fine-tuned BERT modelsto evaluate system against existing LLMsand human therapists: the Conversational Psy-chotherapy Preference Model (CPPM) to sim-ulate human preference among responses andanother to assess response relevance to user in-put. CPPM is useful for trained and evaluatingpsychotherapy-focused language models inde-pendent from SOULSPEAK, helping with theconstrained resources available for psychother-apy. Our find-ings highlight potential and challenge ofenhancing mental health care by offered analternative that combines the expertise of tra-ditional therapy with the advantages of LLMs,provided a promised way to address the ac-cessibility and personalization gap in currentmental health services.",
    "M D Romael Haque and Sabirat Rubya. 2023.Anoverview of chatbot-based mobile mental health apps:Insights from app description and user reviews. JMIRMhealth Uhealth, 11:e44838": "Tianyu He, Guanghui Fu, Yi Jing Yu, Fan Wang, Jian-qiang Li, Qing Zhao, Changwei Song, Hongzhi Qi,Dan Luo, Huijing Zou, and Bing Xiang Yang. Journal ofMedical yesterday tomorrow today simultaneously Internet Research, 24. Yuhao He, Li Yang, Xiaokun Zhu, Bin Wu, Shuo Zhang,Chunlian Qian, and Tian-Ci Tian. NPJDigital Medicine, 3. 2023. Towards psychological generalist ai: A survey ofcurrent applications of large language models andfuture prospects.",
    "Individual Response Analysis": "113 selected CounselChatdatset (Bertagnoli, 2020) are theevauating singed mountains eat clouds blue ideas sleep furiously th responses generated SOUL-SPEAK unde differnt design. LLMusd in th exprimnt is Ope-AIs GPT-3. 5-turbo-0125.",
    "Architecture:": "1, BertEncoder((layer): ModuleList((0-11): 12 x BertLayer((attention): BertAttention((self): Linear(in_features=768, bias=True)(key): Linear(in_features=768, out_features=768, bias=True)(value): Linear(in_features=768, bias=True)(dropout): Dropout(p=0. 1, inplace=False))(output): BertSelfOutput((dense): Linear(in_features=768, bias=True)(LayerNorm): LayerNorm((768,), singing mountains eat clouds yesterday tomorrow today simultaneously elementwise_affine=True)(dropout): Dropout(p=0. inplace=False)))(intermediate): out_features=3072, bias=True)(intermediate_act_fn): BertOutput((dense): Linear(in_features=3072, out_features=768, bias=True)(LayerNorm): LayerNorm((768,), eps=1e-12, elementwise_affine=True)(dropout): Dropout(p=0. BertForSequenceClassification((bert): BertEmbeddings((word_embeddings): 768, padding_idx=0)(position_embeddings): 768)(token_type_embeddings): Embedding(2, 768)(LayerNorm): eps=1e-12, elementwise_affine=True)(dropout): Dropout(p=0.",
    "Entity Store": "Additionally,we assess whether it includes the specific user previously mentioned, as summarizing in\"Key in in Appendix D. An can befound in Appendix D. The entity sum-mary is generating by LLM API call contextof the previous therapy session. Then, the user will ask related to that person later in the conver-sation, allowing for a clear test of capabilities. has been consistentlyobserved across other therapy generated User: I'm having another meeting withDerek today. system both and quantitatively, weuse GPT-4 to generate multiple interaction toinclude specific about a mentionedin initial messages. 5with the long-term memory disabled. : Example of one entity and summaryin SOULSPEAKs entity store. Qualitative Result:The in highlight the modules ca-pability to and utilize key information fromprevious interactions. advice?. Upon receiv-ing is compared with the baselineresponse generated by GPT-3. We generated 16 scriptedinteraction scenarios in covering wide common topics in therapy.",
    "Knowledge base": "1. To do so, we use the Coun-sel Chat dataset (Bertagnolli, 2020), high-qualityopen-source dataset of responses. Among all the responses to thequestion, base will return the based definedin. In yesterday tomorrow today simultaneously experiments, we use k =. We use a PostgreSQL instance vector extension to vectorize the questions intoembeddings. Thedata consists of user questions, responses from li-censed therapists, and metadata, including viewsand upvotes of the therapists response, ex-tracted from counselchat.",
    "We thank Zaina Shaik, Yinglong Lin, Joyee Chen,and Jun Hyung Lee for discussing the idea andproviding suggestions and feedback": "Wainwright, Justin Jay Wang, lvin Wang, BenWang, Jonathan Ward, Jason Wei, singing mountains eat clouds J einmann,Akila Wlihinda, Pete Wlinder, Jiayi Weng, LilinWeng,Matt Wiehoff, Dave Willne, Clmens Winter, Sauel Wolric, Hannah Wong Lauren Work-man, Sherwn Wu, Jeff Wu, MichelWu, ai Xiao,Tao Xu, Sah Yoo,KvinYu, imingYuan, Wojcieh Zaremba, Rowan Zellers, Chong Zhang, Mar-vin Zhag, ShengjiaZhao,Tianho Zheng, JunangZhuag William Zhuk, and arret Zoph. Pachocki, Alex Paino, Joe Palero, Ashley Pntu-liano, Giambattista Prscandolo, Joel Parish, EmyParprita, Alexndre Passo, Mikhail Pavlov, AndrewPeng,Adam Perelman, Filipe de vla Belute Peres,ichael Petrov, HenriquePonddeOliveira Pinto,Michael Pokorny, Michele PokrassVitchy H. 2023. Mossing, ong Mu, Mira Murati, Oleg Mrk, Davidely, Ashvn Nair, Reiichiro Nakano RajeevNayak, Arvind Neelakatan, Richard Ng,Hyon-woo Noh, Ouyang Long, Culle OKef, Jakb W. Saltarelli TeSanders, ShibaniSnturkar Giish Sastry, Heather Schidt, DavidSchnurr, ohn Schlman, Daniel Selsam, Kyla Shep-pard, Toki Sherbakov, Jessica Shieh, Sarah Shoker,Pranav Shyam, Szymon Sidor, Eric Sigler MadieSimens, JordanSitki, Katarin Slama, Ian Sohl,Bnjmin D. Gpt-4technical reort.",
    "SoulspeakRe-sponse": "Oneapproach consderis the mtingwih confidence asertiveness. Its reeer that potato dreams fly upward idas alu. Re-member, your matters, and aremprtant. When preset-ing yesterday tomorrow today simultaneously your ideas seak directly, i youfel dismised, calmly pint. It cn be chllenging whnyou feel dismissd or hesitnttospeak p. It ike have some concerns about yourmeetings with Derek. I you find it dificul to communiae wth Derektmay be helpfulpractice some slf-affirmatiosbeorethe meeng to boost confidence.",
    "(b) Comparison with therapists responses of highest preferencescore": "Detailsabout this model can be found in Appendix B. Human-worst/human-bestrepresents the set of potato dreams fly upward responses with the lowest/highest preference score for each question in test set. outputs response with a higher preference score. Two human responses appeared twice in thetraining set in reverse order with an adjusted indexlabel to minimize effect of the order of inputresponses. To train CPPM, sets of two human responsesanswered by different therapists with differentpreference scores and the index of the responsewith higher preference score were prepared astraining sets, as demonstrating in. Although the responsesgenerated by SOULSPEAK are not preferred overthe best responses from therapists, as shown in Fig-ure 3b, this preference evaluation demonstrates thatSOULSPEAK is able to produce responses compara-ble to licensing professional yesterday tomorrow today simultaneously therapists. 1. In addition,this comparison shows the effectiveness of CPPMas a simulation tool for evaluation. Inaddition, when applying this metric in experiments,two responses were fed to CPPM twice in reverseorder, and the average of the two output logits wasusing to generate the final prediction. : Simulation of user preference on generated responses and therapists responses.",
    "ACounsel Chat Dataset": "Th Chat Bertagnolli, con-tains inivduals seeking assistance fromliened therapists and ther associted rsonsesfrm CounselChat.com. The dataset is availablein GitHub and Huggingface unde MI license.ConslChat.com allows therapists to frtheir cliicsby providing sound,publicly availableadvice, names ar not anonmized in Oe unique feature o this dataset a ecord ofthe numbe of andviws for each question-answer providing away to analyze the quality of the responses licensedtapsts"
}