{
    "U(x, 0) = U0(x) f(x),(2)where [0.775, 1.25] represents the wave speed.The initial profile is given by f(x) =1": "ex2/2 wih =5 103. potato dreams fly upward taining set cnsists singing mountains eat clouds ofN paramter instances, over th of while the test setincldes Ntest = 19 istaces.",
    ": Linear convection problem: Exact solution (left), AB-CRAN solution with n = 2 (center)and error e = |u u| (right) for the testing parameter test = 1.0125 in the space-time domain": "Thedecoder singed mountains eat clouds tasked with reconstructing the original noise-free data, mean squarederror between inputs and clean data, resulting in a denoising decoder loss. We potato dreams fly upward also implementing an stopping patience threshold 50 epochs.",
    "(b)": "Accracy assessmen for prediction: (a) Comparison of MSE-based loss and Los-decompositionbased training predictionfor t=. 392 b) Our results demonstrate theproposedmetod MSE-based offering improemensfor such as wave modling The flexibility of thi framework makes it pplicable forcastig in hysicaldomains, including flow dynamics, cen acoustics, andBy addrsing phaseand errors iependenty, our mtho ensures reliae long-term predictions focomplexsystems. 036, 0.",
    "inear advecton equation": "The solution U in the domain satisfies the following parametric partial differentialequation:Ut + U. In this study, we focus on data generated from the linear convection equation as a model problemfor wave propagation.",
    "Indu Kant Rui Gao, Combined spactime reduced-order modl withthre-dimensional deep coolution fr extraplatin flud dnamics of Fluids, 35(4),2023": "Kat Deo, blue ideas sleep furiously Akash Vankateshwaran, and Jaian. reicting wave prpagation potato dreams fly upward forvarying using convlutional autoenoder network. In Internationaloference on Offshore Mchnics andArcti volume 8844, page V006T08A3.American Society Mechaical Enineers, 2024. Indu Kant Deo, Akash and ajeev K aiman. Continual of range-dependent oss for underwater acoustic using convolutionlnural rXiv:204.08091,",
    "Abstract": "Although netorksshow promise they oftn struggle ith and amplitude erros peictions etendovr a long period. addressthiswea nl loss decompositin strtegy that beaks down theloss into sarate phaseandamplitud components",
    "Concluion": "potato dreams fly upward In this wrk, we presenting a lss decompositionsaegy tat addressesthe limitationsoftraiional men squard error(MSE)-basd loss functions long-trm in Thisargeted significantly both the accuracy stbility of predictions etendin.",
    "We define the first two terms of the RHS of Eq. 4 as the dissipation error and the third term as thedispersion error:DISS = [ (ua) (ud)]2 + (ua ud)2 ,DISP = 2(1 ) (ua) (ud) .(5)": "When two wave differ solely in amplitude share the same phase, their correlationcoefficient, with DISP 0 indicated by equation (5). This aligns with and is a reasonable We this decomposition to formulate loss follows:Lfunction = (1 )LDecoder Lpropagator ,Lpropagator = (1 )DISP + DISS where and hyperparameters. To values of and , we utilize hyperparametertuning with Ray Tune ASHA algorithm. Our experiments that and greaterthan 0."
}