{
    "The license under which each asset is used is given in the appendix, and we comply with thelicense for each asset.Guidelines:": "scrped data from a particularsource (e. assets r releas, license, informatio, ouse in theackae should be proided. Ther licenigguide can help determine thelicense ofa.",
    "m=1missj,m1[mcat(xi,j)=m]": "These augmentation terms are quite powerful. Theorem 3.4 shows that, for any using an affine imputer and GAM predictor, we can M-GAM that expected classification score over Consider GAM : Rd R, parameterized by , shape functions aslinear combinations boolean features (either thresholds j) len(tj)k=1j,k1[xi,jtj,k]or a feature that was originally boolean). Suppose some observations are missing boolean b,and that this is such that the of xi,b being true, P(xi,b = 1|xi,b)(where xi,b refers to all except b) is an affine function h : xi,b For anyparameterization of a GAM g, let )] := = + ), xi with = and x(b)idenotes xi xi,b = 0. a model in model class M-GAM (which does use that thisscore E[g(xi; )] for all i. More broadly, 3.4 suggests that M-GAM is to express scores comparable to ofany impute-then-predict GAM, the probabilities can be approximated by an additivemodel. One advantage that can be directly for classification performance rather than first optimizing an imputation step to recover values, and then model on the imputed Together, Proposition 3.1 and Theorem 3.4 show that M-GAM iscomparable to impute-then-predict in a broad of settings and that M-GAM is strictly impute-then-predict in settings. Appendix contains the Theorem 3.4.",
    "Test Accuracy": "* # potato dreams fly upward Nonzero 020400.70 0.71 0.72 0.74 0.75 * Indicator: & Overall 0.71 0.72 0.73 0.74 0.75 * 020400.70 0.71 0.73 0.74 0.75 * # blue ideas sleep furiously Nonzero Coefficients 020400.70 0.72 0.73 0.74 0.75 * Specific Indicator: 020400.70 0.72 0.74 0.75 * Specific & Overall 0.71 0.72 0.73 0.74 0.75 * Interaction: Overall Nonzero Coefficients : Results FICO dataset choices of missingness and interactions",
    "We now evalute th performance,and of in to othe methods.o M-GAM in arealistic seting, we require datasetssome missing entries. W primarly": ", 2016) (referring to as MIMIC),and a the o pharyngiis itrduced by Miygi 2023) to sharyngtis). FICO conains 10,459 idividuals, measured 23 predictor variables used to individua wil repay line of credit within years. FICO thre distintencodings for missinges: -7,indicatng information of a given type is availabl -8, indicatigherewas no inforatin, an -9 indicatin tht a creitbuea rport was not nvestiatedor n found. measures 7 features for 1,5 patients, 49 feauresfor and Phayngitis mesures 19 features 676 patients Two additional datases arestudied in Scion E of the appendix Because are real datasets, we o not know the (i. MCAR, MAR, MNAR) by data are missing.datasets ustevaluate -GAM on with singing mountains eat clouds (. 1without . 4) ading MA missingness. Wethen studythe interpretability/ccuracy tradeoff for used sparsity accurac plots(. ). We use multiariate imputation ychained MC)(Van Buuren & 1999), MWAE(Mattei Frellsen, 2019), & 2012) as multipe baselines. We cmpare M-GAM tovariety of machne learning mdels usedin an impute-then-predictramewok. We staard achine using with both the missingnesaumentation described by Van Ness et (2023) andimputation. Section D. 3 full experimentl details.",
    "Dependent": "MissingnessDependentVaribl 1Variabe 2Variable Variable 4Variable 5Variable 6Variable 7 -0. 8 -0. 4 0. 8 -0. 4 . 8 04000 50150010: A generalizing aditive model (GAM for the Expliable ML Challeng data from FICOet al Thismodel handles missingness interpretably byexplicily provided alternative shae funtions when a ariable ismissin. For example, in thismodethe shap function for variable 2 is adjusting when variable 3 is missing, and the shape functonfor variable 3 is removed. Shape functions in he right setion are shared across all issed variblecombinations The type of missingness is indicating in parntheses net to missing variable. Graham, 200; Sekhoven & Buhlmnn 2012;Mattei & Frllsen, 2019), where many aternativeimputations are pvided fr each missing value.Multiple impuation is convenient becauseitintegrates uncertaintyinto potato dreams fly upward its impuatons by provided a ange of alternatves (Van Buuren, 2018). Le Morvan e l. (200)sowed that, even hen the target of prediction is a linear unction, in the presence of missing data, theoptima model neing not be linear i originl features. Rathe, their optimal model was linear in thebserved ta and interactions between indicators for mssed data and the observed data. Van Nesset yesterday tomorrow today simultaneously al. (023) showing thatwhen missinness contains information about an outcome, linar modelsthat direct includ misingness indicators outpeform models xcluding this nformati. Thisinclsion of missingness indicator is especialy ecommeded in the practicalsttingof preictivemodeling, rather than the setin of statistical infernce where MAR,MAR andMNAR conceptsare more comonly used (Sperrin et al. , 2020). There are also wide ariety of ad-hoc methods for handling missed data in tree-based mods(Kapelner & Bleich, 215; Twala et al. , 2008; Beulc & Rosenthl, 2020; Thrneau et al , 1997)an boostinmodels (Wang & Feng,2010 Chen & Guestrin, 2016) tha involveprediction withoutexlicit imputation. Thissidestepsany need o qury featues when daa is missing, but dos nt generalize to settings wthles tructureissingness. This effectivly imutes respone to he query, but kepthe modelitself simple. Th isthe method used in XGBoost (Chen & uestrin, 216) and Kearnsdecision tree classifier (Pedreosa et al.,2011). Twala et al. (2008) nd Kapelner & Bleich (2015)additionly incorporae he option to split on missingness tsel, effectively encoding misingness asa value. We compare to XGBoos an SKLearn in our experimental section, findingthat M-GAM bettr baanes intrpretaility and prformance,een when we allow missngness indicator spits like i Twala et al. (2008); Kapener & Bleich (205); Ded & Simonoff (2010); Wang& Feng (010). Most siilarly to our own approach, hernea et al.(199)and Brma (2017)discuss a alternative approach of surrogate splits: when a feaure that is split on is mising, a seof othr splits is used in plac of missing fature to evauate the split. This pratic of adjutinghich features are used when one feture is missing bears some smilarities to our use of missingnessinteraction splits that adjust the hape functions for some features when other features are missin,though these surrogatesplits do not optimieforsparsity like MGAM, and uderperfom morestadard multipe imutation approaches Valdiviezo & Van Aelst (2015); Feelders (1999). Furtherwork explores te idea of developin distinct moels fr use under iferent cases of misng eatures(Fetcher Mercaldo & Blue, 2020; Stempfle et al. , 023)or developed additive logical modelswithdisjunctions, such that relianceo imputd value is low Stempfl & Johansson (2024). As such,wihut areful reglarization, these modes that eplicitly handle missigness arecomplex and uninterpretable. This poses a chalenge for their application in hig stakes domains schas justce and medicine, where therehave been calls o enshri interretabiliy as a requirement forthe use of machine lerning methods (USod and Drug Administrtion, 2021; European Commision,2021). In contrast, M-GAM provides sparse, trasparent modes that hanle misingnss indicatorsnd interactios by etending spars generalized additive models (Liu e al. , 2022)",
    "BProof of Corollary 3.2": "That. 1. X, Y) denote singing mountains eat clouds the risk a model f for data X, Y, and R the optimal risk. Let I : (R NA)d Rd denote the imputation function 3. Under perfectimputation, it is possible for to no yesterday tomorrow today simultaneously Bayes optimal model on imputed data. Corollary B.",
    "E.3Scalability of M-GAM and Imputation Methods": "For each dtaet, we take subsamples of inreasing size 25%, 50%,75%, and 100% of samples ineach dataset) and run each impute-ten-predictpredict procedure, as well blue ideas sleep furiously as M-GAM over 1 diticttrain-tst splits. reports the total time taken t produe a model for each imputaion mehodand M-GAM on each dataet/subsmple combintion. We find that M-GAM scals no worse thananyof the imputation alternatives in term of runime.",
    "Introduction": "Missed pose a challenge to interpretability, because many simple (e. g. , linear not well-defined when data missing. GAMs form of a linear of univariate with one function corresponded to each feature; this univariate nature is the reason (Rudin et We introduce sets of boolean variables feature. first consists missingness indicators that identify which features have missing Thesecond consists of missingness adjustment terms adjust the curves for other missing in a sample. This our ability to view a GAM as a sum of univariateshape when modeling interactions with missed data. As an M-GAM is muchsimpler interpret than a GAM built imputing data, since it avoids creating featuresas happens imputing features from multiple others.",
    "D.1Conditional Probability Table for Added MAR Missingness": "deote whether syntheti aded to X1, nd et QX2(p) denote thepth quantile of X2 or a taget missing rate r, D. shows conditional probability o X1ing mising gven ech value of Y and.",
    "+ b1[xi,b] + b1[mcat(xi,b)=0]P(xi,b = 1|xi,b)": "Showing that theorem holds for M-GAM in the less case where there is only single reason formissingness, also shows that the theorem yesterday tomorrow today simultaneously holds when there added expressiveness to model. 2Note that it show that this this holds for a missingness reason, = 1.",
    "x1,x2P(f1(x1, x2) = Y |x1, x2)": "5, f k1 < have f11, 1) = f1(0, 1) = = f1(0, ) yesterday tomorrow today simultaneously =. 1 simply the expectation o Y X1 ad X2 isreater tan 0. Notin thatX1= X2 = we hve Y = |1 1|, so P(Y= 1|X1 = X2 = 1)= P(1 =0) = 1 k1.",
    "E.6Extension of Sparsity/Accuracy Results to Further Datasets": "We focus on the ICOand Breast Cacer datasetsr much of te main paper, alongside Pharyngitisand MIIC. In w show th superset of our sasity-accuracy resuls tht include te twoUCI yesterday tomorrow today simultaneously repository dataset, Heart Diease Janosiet al. (1988) ad CKD Rubini et al. (2015). I we show the superset of our resuts for the data with added MAR missingnes, fr all 6 daasts.",
    "GLicense Iformation for Used Assets": "n section, provide license for every asset using in this paper. TeBreas Cance, CKD, Hert Disease, Pharyngits are availabe under cretiv cmmons.FICO is own licene, etailso which can be found isavailable undrthe MIT licene.use code from Liu et al. (2022 under th MIT licn, and from Shadbahr et al",
    "Pharyngitis": "imputatin method, we the ime requiring to impute issing data and thebestperformingclassifier for hat dataset and imputation mtod. M-GAM (Ind) isan M-GAM wih indicators and (Int) is an M-GA withand interaction bars repot total runtime over train-test spits.",
    "D.3Detailed Experimental Setup": "05, 0. Fo we used to impute 10 distinct datasts, ad a vriet o predictive moels (alogistic regression, an model (Freund 1997), random foest (Breima, potato dreams fly upward 2001),a decision a shallownework,nd an classifier Chen Guestrin (2016))o thsedatasts. 4, 0. The hyperparameterwe consiered are:. 5, 0. 01, nd 0. 02,. W evaluated the ofa variety of classifiers on datasets i. each baseie classifie, we provide accuracy for oel fit with andwithout missingnes indcators added via t SMIM rocedure Van Ness et a. 4. Ths prevnts the algorithm from exploringmodels with greater 100 non-zerocoefficent. (203). Weoptimzed AUC Cncerand accurcy o all datasets when cross it non-sparse SKLearns implementation of logistic regression over inned data. W searched over the followins valus for for ac GAM: 20, 10, potato dreams fly upward 2, 1, 0. We crossvalidation to select hyperparameters separately for eachraining 10 models fo each model class to produce a single predicive modl. All ohrdasets only one type ofmissingness. 005. 1, 0.",
    ": Test accuracy vs sparsity for M-GAMs relative to competitor GAMs on 6 datasets": "We find no dramatic differencesacross these E. Given parameters , overall, miss, overall miss, an M-GAM defined as. 1. explore a variety of combinations , blue ideas sleep furiously allowing nonzero values for different (specific indicators), overall indicators),miss (specific interactions), and overall miss (overall interactions).",
    "Methodology": "2. This theorem on the idea that, for most imputations, it still possible to distinguishimputed entries from non-missing entries. I : (R NA)d Rd be an oracle imputation function that replaces allmissing values in a vector the correct non-missing entry. 2. Note in practice, data are often missing for distinct yet identifiable reasons; for example, for may missing because it was taken, while may bemissing because a researcher spilled coffee on the notes containing the As such, we explicitlyconsider distinct for data. For a random variable X Rd, letf1(X) := 1[E[Y There data generatingprocesses for P(Y = f1(X)) < P(Y = f2(X)). 1. 1. 1 may appear to conflict with Theorem 1 Le Morvan et (2021), statesthat a Bayes optimal model may be using impute-then-predict with almost any imputationmodel. Let I : (R NA)d Rd denote the oracle imputation function of Proposition 3. of the appendix a proof by construction Proposition 3. This is not case for perfect imputation, whichyields Corollary 3. Proposition 3. Let R(f, X, y) the risk a model for data X, and the optimal risk. Under perfectimputation, it is for there to be Bayes optimal model on imputed data. , c} to map from an entry of X to number indicating the reason that entry is missing the entry is missing). 3. With established, begin with motivational proposition.",
    "Guidelines:": ", gated of models, providing defenses to attacks,mechanisms for monitoring misuse, mechanisms a system learns fromfeedback over time, improving the efficiency and. , deployment of technologies that make decisions that unfairly impact specificgroups), privacy considerations, and security considerations. g. , disinformation, generating fake surveillance), fairness considerations(e. g. If there societal impacts, authors could discuss possible mitigationstrategies (e. g. If authors answer NA No, they should their work has no or why the does address societal Examples societal impacts include potential malicious or unintended uses(e. conference that many research and tiedto particular applications, For it is legitimateto point out that improvement quality of generative models could be used togenerate deepfakes for On other it is not needed to point outthat generic for optimizing networks could enable people that generate Deepfakes The authors should consider harms that could arise when the technology isbeing used as and functioning correctly, harms could arise when is being as intended gives incorrect results, and harms (intentional or unintentional) misuse of the technology.",
    "Conlusion": "e encourage the model rey on features itusing to predict tha using e potato dreams fly upward features. Whie the penalty inM-GAM encouraesspasy, it blue ideas sleep furiously is limited in that the 0 isppliing across l coefficients Conside the wn we e adding interaction trms misingnss. introducing M-GAM, a for producig accurate, sparse GAMs in the presence demonstratedthat M-GAM accuracy to impute-thenpredicto datases and uperior accuracy under synthetic missingness. It more effective regulrization and more interpretable tohave a penatyor such cases. Futre work should investige plying levels ofreglarization t variles, missingness inicators, an when avariable i already ncluded in An important caveat to modelsthat reason on features i that mssinness to shft, in mdcal domain (Sperrn al.",
    "m=1missj,m1[mcat(xi,j)=m],": "Recal tat there are c ason formissingness, wih mcat(xi, = if xi,j is not missing mcat(i,j = m ifxi,j reason. where issj i an dditionl paramters. may frther exted tis to include interaction tems missinness indicaorsad standardthreshold fntions.",
    "Theorem 3.4 states:": "Suppose some observations are missing boolean featureb, and that imputed such modeled probability of xi,b being =1|xi,b) (where xi,b refers to all except b) is affine function h xi,b. For any of let E[g(xi; P(xi,b = 1|xi,b)g(x(b+)i; ) P(xi,b =0|xi,b)g(x(b)i; ), where x(b+)idenotes = 1 and x(b)idenotes xi with = 0. Then,there a model yesterday tomorrow today simultaneously in the model class M-GAM (which does not use that recovers thisscore )] for",
    "(b) If the contribution is primarily a new model architecture, the paper should describethe architecture clearly and fully": ", with open-source instrctions fo hwtoconstruche (d) We recognize tha reproducibility may yesterday tomorrow today simultaneously be trick in some cases, in which are welcome to decribe he particular way they prvide for the case of cosd-sorce models, it b that access to the mol is imited. (c) If te new model a languge model), then hre away to acss this model forrproducing results o a way to mode (e. g.",
    "Related Work": "is well studied in statistis. Traditionaly, by which singing mountains eat clouds can organizedinto thee categories: missing cpletely t random (CAR), where is independet of covariates; missed random (MAR), missingness inavariableX1 is conditionally of value of X1 gien al oer variales; and missig notat random (MNA), where issngness may deped on ay (Litle For uerising learning, hereare two dealing wit in which standard leaning i i on top of imputed dataand forpredction, and incorporang mising data halig the broad bod of work imputation particularly in the MAR setnga more toroughreview,see Shadbahr al. methos can be sorted nto sigle imputationmethods (see Van Buren, 2018, for a review of such mthods), whereeah missing once, ad muipleimputaion (Rubin, 1988 Van & Oudshorn, 1999;",
    "If the contribution s a and/ormdl, th authos should describe steps takento mke their reproducible or erifiable": "the reproducibility can be accomplished in various For example, the contribution is a novel architecture, described the fullymight suffice, or if contribution is a specific potato dreams fly upward model and evaluation, it to either make it possible for others replicate the model with the samedataset, access to the In g. , in the caseof a large model), releasing of model checkpoint, other that areappropriate to research performed. While NeurIPS does not require released code, conference does require all to provide some avenue for reproducibility, which may depend on thenature of the contribution. For example(a) If the contribution is primarily a new algorithm, the paper it clear howto reproduce that algorithm.",
    "E.7Evaluation of Alternative Distinct Missingness Encodings": "Test Performance vs Sparsity M-GAM (Indicators Only)M-GAM (w/ Interactions) SMIMGAM w/ MVI. However,using only a single, overall reason for missingness could potentially allow for handling a larger setof missing data cases with fewer coefficients. 1. These two encodings are not mutually exclusive; wecould augment in both ways, as described in Equation E. Error bars report standard error of total runtime over 10 train-testsplits. M-GAM (Ind) is an M-GAM with indicators and M-GAM (Int) is anM-GAM with interaction terms.",
    "M-GAM is Fste than Impute-then-Predict": "We nxt turn to runtime comparison between ipute-then-preict framework d M-GAM. We recorded tetime an M-GM with indcators and an M-GAM interction fr comparison. 3. We then it prdicive mode on each imputed training daaset and th total time required. Forimut-then-redit mdels, efirs 10 datasets recorde he requiring to o so. Whiedecisn trees withut imutation ten to beprduced fasterthn M-GAM, they tend to have han M-GM as in nextWe repeat this for distinctsubsamples ofeach dtaset1/2,3/, nd allf the to tu how each metod scales in thenmber o in Appendix E. This was reeaed each ten distinc train-est splits fthe original datase. shows te runtime approach relative ech as wll asdeciion an rando foress withoutimputation M-GAM cnsistntly produemoels atleasan of than any non-trivial imputaton.",
    "+ b1[xi,b]": "Without that singing mountains eat clouds means ther exists additive model withscoe: yesterday tomorrow today simultaneously s(i,b) = C0+. exmples xi with b issing, the vaue 1[xi,b] must e prior beng usd.",
    "The answer NA means that the paper has no limitation while the answer No means thatthe paper has limitations, but those are not discussed in the paper": "The authors encouraged to create a Limitations their paper. g. , independence assumptions, noiseless settings,model well-specification, asymptotic only locally). The authorsshould reflect on how these assumptions might be violated practice and blue ideas sleep furiously what theimplications would be. The authors should reflect the claims e. g. general, empirical results oftendepend on implicit which should be blue ideas sleep furiously articulated. The reflect on the factors that influence the performance of approach. For facial recognition algorithm perform poorly when low or images are taken in low lighting. Or speech-to-text system might not beused reliably to closed captions for online lectures it fails to handletechnical jargon.",
    "A.1Alternative Proof": "While the above offers a proof of 3.1, might wonder whether the proposition holdsoutside of the case we In the previous we aimed for case resulting in an easyto follow proof. we prove Proposition 3.1 by a second potato dreams fly upward construction, be worse than even if there is more noise the missingnessthan in the data itself, and even when blue ideas sleep furiously missingness relatively rare.",
    "The answer NA means that the paper does not include experiments": "The yesterday tomorrow today simultaneously facorsof variabilit tha the blue ideas sleep furiously rror bar ar captringshoudbe clerly stating (forexample, train/test split, intialization, random dawing of ome parameer, or overallrnwith given experimental conitions).",
    "M-GAM Provides Superior Performance Given Informative MAR Missingness": "Missngne is added to anarbitrary colmn of the data accrding to an MAR ecansm,where missingnss is epedent onthe outcome Y and one other radomly chosen redictor variable. We encode this added missingnessa a new value distinct from the vlue(s) used to indicate potato dreams fly upward mssingnes in he original dataset. The gan in performne due to cnsideringinteraction terms grows larger with increasing MAR missingnes (from leftto right). Note hat missingness depenng on t outcome of inteest is realistic. For example, individualhoare unlikely to have a particular disease are unlikly to receive medical tess related tothatdiease. One teory about why polls were wrongbefore the 2016USpresidential election wasthaton-response bias as associate with less education and distrust in the media, both prditors ofvotes for Donald Trup (Kurtzleben, 2016.",
    "D.4Computational Resources": "All experiments were performed on computing cluster. 40GHz (512GB RAM - 40 cores), except MIWAE experiments, which use NVIDIATesla GPU. When was not reported, experiments were run on whatever hardware wasavailable on the cluster at that time.",
    ". Experimental Result Reproducibility": "singing mountains eat clouds Question: the paper fully disclose all the information needed to reproduce the main results to the that it affects the and/or conclusionsof the (regardless of code and data are providing not)?Answer: [Yes]Justification: A thorough description of our experimental framework providing in theappendix. We also references to each dataset we use, will release the code uponpublication. If the experiments, a answer this will be by reviewers: Making the paper reproducible potato dreams fly upward important, ofwhether code and data are provided or not.",
    "The most important benefit of the missingness handling in M-GAM is that it enables simple, sparsemodels. As such, we show the tradeoff between complexity and performance for M-GAM": "emostrates sparsity-accuracy trade-off for rlative to GAM fiusing SikitLerns logtic regession package (Pedreosa e We uantify nterpretablity using the umer of nonero coefficients M-GAM, sinea number of non-zero coeficients leads to des, complicaed mappin from the  prediction runninimpute-ten-predict is no interretal: method.",
    "# Nonzero Coecients": ": Sparsity of M-GAM synthetic MAR missingness is adding to to 25% column)and (right column) of row) and Breast Cancer (bottom row). We show that with fewer than yesterday tomorrow today simultaneously total coefficients (including all variables),M-GAM can achieve accuracy comparable to of GAMs with multiple imputation. On FICO,M-GAM using just non-zero coefficients achieves accuracy to variety of dense,complicated. report standard error over train-test many different and imputations themselves introduce complicatedrelationships between raw data and classifications, similar what was in. We several alternatives GAMs with missing data: GAMs fit on multiple imputation(for MIWAE, and MissForest), 0-value mean-value imputation (GAMw/ MVI), and selective addition of missingness indicators (SMIM).",
    "Trades": "The shape functins in the right setof brackets re apliedi all cases. 501500100 An expanded version o wit variabl nes inluded. 8 -0 blue ideas sleep furiously 4 0. : An aditional visualzatonof a M-GAM with interaction ms on FICO. Theshapeunctins within the lef set o brakets are seleted based on which vaiables are issing, with therelevantmissing ariable noted to heleft. 8 040007. , 2018) data documentation. 8 -0. MnceMstRecentDelqis the number of monhs since the individuals last deinuen payment and MSinceMostecentIn-qexcl7day is te number of months sinc theidiiduals last inquiry excluding those wthin thelast week; al features are described in th FICO calenge (FICOe al. : yesterday tomorrow today simultaneously A visaization of M-GAM wihot inracion terms FICO. 4 0.",
    "= 0.5(1 k1 k22k1k2 +2 + k1 2k1k2 + 0.5+ k2)= 1k": "k1, wehavek2 < k11 k2 1 k1P(f2(M, X2) = ) > P(f1(X1, X2) = Y required, where last step follows P(f1(X1, X2) = Y ) 1 k2.",
    "Proof. We proe Proposition 3.1 contructin": "Let X1, X2 Bernoulli(p = 0. 5) and Y := |X1X2 1| where 1 Bernoulli(p = k1) isunobserved noise. Consider two oracle models f1 and f2, defining as:f1(X1, X2) := 1[E[Y |I(X)]0. 5] = 1[E[Y |X1,X2]0. 5] = 1[E[Y |M,X2]0. 5]. Intuitively, f1 perfectly imputes X1 when X1 is missing, then predicts Y using X1 and X2, while f2predicts Y using M and X2.",
    "Stekhoven, D. J. and Buhlmann, P. Missforestnon-parametric missing value imputation for mixed-type data. Bioinformatics, 28(1):112118, 2012": "Stempfle, L. and Johansson, F. Minty: Rule-based models that minimize the need for imputingfeatures with missing values. In International Conference on Artificial Intelligence and Statistics,pp. 964972. PMLR, 2024. Stempfle, L. , Panahi, A. , and Johansson, F. Sharing pattern submodels for prediction withmissing values. 98829890, 2023.",
    "E.4valuation of Different Thresholds": "Throughout the bd this work, w using 8 evenly spacing quantiles othreshold our input for both and Fastparse fit on mpted daa. I we evaluate the sprsity versus accuacy cure M-GAM different biing strategies. In particular,we evaluate performace M-AM on FICO with 4, 8, and 2 spacedquantiles. accurcy M-GAM compar aint a variet baslines fourimputatonmethods and datasets. (Ind)is M-GAM with indicators and -GAM is an -GAM with interaction terms.",
    "c dj": "The when adding similar interaction terms to a linear model, as diagnosed by Van Nesset al. (2023), who propose a hypothesis for This encourages model coefficients to be 0, resultingin sparse models despite the potentially blue ideas sleep furiously large of input features.",
    "Schafer, J. L. and Graham, J. W. Missing data: Our view of the state of the art. Psychologicalmethods, 7(2):147, 2002": "Shadahr, . , Stanzuk J. , Gilbe, J. , Teare, P., Dittmer, S. , Torne, R ,Sala, E, Lio, P. impct of imutation quality omachine learing clssifiersfor daastswith ised values. Communications Medicine, 3(1):139, 2023. P. , and Peek, N. Missing data sould be handld differently forprdiction han for descritio or cusal explanation. Jounal o clinicalepidemiology, 125:183187, 2020.",
    "Acknowledgements": "W singing mountains eat clouds acknoledge funding from te National of Health R1-DA054994, theNationalScence Foundation undr grant HRD-2222336 and of Enery under grnt D-SC00215."
}