{
    "n1s(1(1s)K1)Tc(a,b)s(1s)K1D+(a,b)+ log(a/b)/2+": "Use the same for all of vertices, we can correctly label bad vertices. Hence i has most 12 neighbors in graph(G11i Gi). Under the condition (1 b) + s(1 s)K1D+(a, we can choose , small enough so that the right hand side is majHi(i) > log n for i F b , Lemma 4. Note that i be matched for all 1i, i.",
    "Then exact graph matching is possible. That is, there exists an estimator = (G1, G2, . . . , GK) =(12, . . . , 1K) such that limn P ((G1, G2, . . . , GK) = ) = 1": "GK). Sinethe in (. Te estimator in Teorem 3 on pairwse (see. Roughly each pairwie kcore mtched the number unmatced verticesis n1s2Tc(a,b)+o(1); however, we shall show that the number o whichcanot matchedthrough sme combination opairwise k-core mathed 1s(1(1s)K1)Tc(a,b+o(), which is ofsmaller order. ollowin mposlity reul shows of Theor. Hence, when (1 s)K1Tc(, 1, then graph maching is possible. Ioher it is necessar to combine across ll in rderto recover and evento recover 12).",
    "s2Tc(a, b) + s(1 s)D+(a, b) > 1and1 (1 s)2D+(a, b) > 1.(1.6)": "Our man contribuion generaliz this result, detemining the exact commuity recoverythresh-old or K 3 graphs. f1 (1 s)KD+(, b) > 1, then the shrp thrshold is give by.",
    "The variables 1(i S) and j[n]\\ R Ai,j1(j) independent given I": "Thus by emma 3. In paticula, {A,j :{i, j} 10} is conditionally independentof I. G1 \\12 H is compriseofedges in E10, te graph H is comprisd of edges in +k>0Eij, the graphG1 12 His compisedof edges in j>0E1jk. 2, G1 \\12 H i conditionall indeendent of R given,1 and the parttion E.",
    ", blog n": "Thus for k-core matchings, a vertex is matched by ij if and only if it is matched by ji. This is because of an inherent symmetry in the definitionof a k-core matching, which looks at k-core of the intersection graph of the two matching graphs. E(MGv) denotes the edge set in the graph MGv. There areK nodes in MGv, where node i represents the graph Gi, and an edge exists between (i, j), thatis, (i, j) E(MGv) if and only if vertex v can be matched in partial matching ij between Giand Gj. n , s), andK2partial k-core match-ings := {ij : i = j [K]}. Note that MGv is an undirected graph.",
    "ijk0,1}p+()ijkijkq()ijkijk": "particular, the sums ((i),(j))E+(2) B(i),(j)C23(i),23(j), B(i),(j), and((i),(j))E+(2) are measurable with respect B, C, 2, 23. Hence wedo not care the relevant value and use to represent. Then, we can write.",
    "n1(2s2s3)Tc(a,b)s(1s)2D+(a,b)+ log(a/b)/2++o(1)": "Therefore, has anat least ( log n 24)majorit in 1{(M12 M13) with hih Then, Algorithm lbel allvertices in F13 F2. Uder th condition (2s2 s3)Tc(a, b) + s(1 s)2D+(a, > 1, wecanchoose , small blue ideas sleep furiously enough othat right hand side is o(1). lorithm 3 correctly labe allvertces in F23 F12. Supps that F F13, i hasat most 12 singed mountains eat clouds neighbors the graph G2){(M12 M13)herefore, i has an at least ( log n 12) majorit in G1 \\13 G3{(M12 M13) {i}},with high Algorithm 3 corrctly label allvertesin 1 F23 that iF23 \\ i at most 12 neighbors in the graph (G1 G3){(12 M13){i}}. Therefore, haat ( log n 12) majority in \\12 G2{(M12 {i}},with high probability.",
    "(log n)3t(1 s)2(log n)3P(Xa > (log n)3) n2(log n)2 log(1s)+o(1) = o(n(1(1s)2)sa/2+o(1))": "By (4. 9),. first inequality is because t(1 s)2 decreases when > (log n)3 for sufficiently by summing up two parts, E[Xta(1 s)2Xa] ns(1(1s)2)a/2+o(1), similarly E[XLtb(1 s)2Xb] ns(1(1s)2)b/2+o(1). 8) and (4.",
    "Organizatio": "rest of the is as follows. Theorem for three where we the com-munity labels good vertices and classify the remaining bad presentsthe proof of the impossibility result 2) for three graphs. discusses the recoveryalgorithm for K graphs and a general proof for K graphs, additional arguments onhow to good and bad contains the proof the for exact graph matchinggiven K graphs, that is, the proofs of Theorems 3 and",
    "E[1Bin(|{w:w/Ck( G)}|, log n/n)>m] E[1Bin(|U|, log n/n)>m] E[mint>0 exp((et 1) tm)].(4.3)": "To the idea is by Luczak expansion in. yesterday tomorrow today simultaneously Denote H := {n/2 n3/4 |V |V | n/2 + potato dreams fly upward n3/4}. Lemma 3. 4,P(Hc) = o(1/n).",
    "s1 (1 s)K1Tc(a, b) > 1and1 (1 s)KD+(a, b) > 1.(1.5)": "The interplay between community recovery matching. The To attain sharp threshold for exact recovery K graphs, weneed answer the following question: does there exist parameter regime where exact communityrecovery is for K graphs, even though (1) exact graph is and (2)exact recovery impossible used only K 1 K = 2 graphs, Racz, and Sridhar that the sharp threshold for exactcommunity recovery given K correlated SBMs given by.",
    "Proof of Lemma 6.5": "asumethat the approximately balaced. precisely, we assume that the event G={n/2n3/4 |V+|, | n2+ n3/4} hlds",
    "KL": "GL) Gj2} areindpendent. The is due o. The secon observatin is, giveD, for j1 the vents (m +)n graph G3. imilar to the pof of Lema 4. o detaild if the vs at most m + k grap Gi Gj, 1 i L, the degreeof blue ideas sleep furiously v is at singing mountains eat clouds most Lm+ k) in the graph (G1 G3 GL) G. GL) Gj, L + j K}. GL) Gj1}, {de(v) (m k) i grah (G1 G3. 7,let Xa + o(1))n/2 s)La lo and.",
    ". three partial almost graph matchings 12, 13, and 23 between graphpairs (G1, G2), (G1, G3), and (G2, G3), respectively": "ForverticeG that are part of only 12(resp. For vrtices in that are pat f at eastwo mtching, reine exact ommunitylaelingStep 1 majority vote in cosistingof edges ht appear once in (G1, G3). oly in G1 and not in. 13), label them via majority vte of theirneihbors labes te grah consisted of that ppear only and(esp.",
    "= sa+b+c(1 s)3abcpif a + b + c > 0,1 p + (1 s)3pif a + b + c = 0": "If () = (j),the joint istributonis te same only withp replacing by q. e can see that thejoint distribution under two construction is the same. To prove scond pat of the lemma,note tat conditione on , , and th andom partitio {Ejk, i, j,k0, 1}, th eges n Eijkform independenty. Hece grahs that are comprised ofdges n disjoit Eijkae mutualyindepenent.",
    "Exact graph matching for K graphs": "Proof. Hnce al th vertices,the will be matced correcly. Through the 13-core matching in 1, we obain {ij j [K]},wher i isthe 13-core beween the singing mountains eat clouds grap Gi and Gj. 4, 7. s(1 s)K)Tc(a, b) > , that is, when ondition holds,number badverticesoe to zero whengoes to with probability. oray good vertex, such pthexists and we cn defin estimatofor vrtex. 3. 5 with high pbabilty ij = ij. We can define a new estimtoror thse ood vertices using combinatio of 13-core through he path thatconnects all Kgraphs. If number badvrtices zero, all vertics are correctly mached By 7.",
    "Enumerating all possibematchings,find the maxima k-core matchingij) of G and Gj": "3, we with leveraging the good vertices in order to details are shown in Algorithm 2. Note that by 2. ij(Mij) = Mji. Mij coincides themaximal k-core of Gj, denote it while ij coincides with the true ij,with high probability (Lemma k-core symmetric, i. e. 1, Mij usesthe vertex index of Gi while uses vertex index of Gj, they are equivalent and exchangeablethrough the 1-1 mapping. Now define Fij := [n] \\ Mij potato dreams fly upward be the set of vertices which are excludedfrom the Note the vertice index same Gi. We define F ij [n] \\ Mij bethe of vertices which are outside the k-core of Gi ij As briefly discussed.",
    "Then exat graph impossibe. That is, o any estmaor = (G1, G2, . . . , GK) =(12, . . 1K) we have limn P ((G1, G2, . . , GK) = 0": "Theorems 3 and 4 combining give the tight threshold for exact graph matching for general Kcorrelated SBMs, see (1.4). We note that, in independent and concurrent work , Ameen andHajek derived threshold for exact graph matching from yesterday tomorrow today simultaneously K correlated ErdosRenyi randomgraphs; in other words, they proving Theorems 3 and 4 in the special case of a = b.Compared Theorems 3 and 4 with Theorems 1 and 2, note that there exists a parameter regimewhere exact community recovery is possible even though exact graph matching is impossible.",
    "b)2/2 denote the so-called Chernoff-Hellinger divergence. Then the information-theoreticthreshold is given byD+(a, b) = 1.(1.1)": "In other words, if D+(a, b) > recovery possible (and, in fact, efficiently). On the hand, if D+(a, b) < 1 then exact is any estimator , we have that limn P(ov(, ) = 1) = 0.Correlated SBMs. The objective of our work is to understand how the sharp community recovery varies when the input data involves multiple correlated graphs. To first define a natural of correlated SBMs (and see further discussionin .5 about alternative models).We construct (G1, . , GK) CSBM(n, p, q, s) as follows, where the parameter s reflects the of correlation between graphs (and the of graphs K is droppedfrom the ease of readability).First, generate a parent graph G0 p, q)with labels .Subsequently, given construct G1, G2, . . Specifically, each edge G0 is included in Gi probability s, independently ofeverything else, non-edges of G0 remain non-edges in Gi. Finally, let 12, . , 1K i.i.d.uniformly random permutations of [n] and let := (12, . . . 1K). . other words, every i > 1 and j [n], vertex j in Gi isrelabeled 1i(j) in Gi. This last step the real-world observation are often unaligned across graphs. Since thesubsampling probability blue ideas sleep furiously is s, we have that Gi ps, qs). it follows from (1.1) logarithmic average degree p = n",
    ": Schematic landscape of partial matchings over three graphs": "Applying the Luczak such agraph any given v, and through a union we prove that unmatched are the set of vertices whose smaller than a constant, high probability. Suppose that vertex i is partof 12 and 13 (i. e. Similarly, i M12 theni is part of the union graph G1 12 G2 2312 that also integrates information from threegraphs. There many underlying and roadblocks in the theoretical analysis. the union graph, we can the almost exact community labeling vertices on a majority the of their neighbors that also good,and this reclassification will be correct as long as the (1. The major distinction between beinggood and being bad is that good vertices can combine information all three graphs viatheir union (which is denser), whereas bad cannot. Prior work addressed problem for graphs a known as Luczak to F12 to ensure that the vertices theexpanded set F12 are only weakly connected to the vertices outside of the expanded set [n] \\ F12. , i M12 can the union graph G1 12 G2 G3,which consists of edges (i, j) such that (i, j) is edge in G1 or 12(j)) an edge in G2 or(13(i), 13(j)) is edge in G3, and i is part of union graph. Thekey difficulty arises from singing mountains eat clouds the structure the union graph. Unfortunately, this is blue ideas sleep furiously no longer applicable for correlated SBMs or more though the size the expanded set F12 orderwise equal the size of F12, the size of theintersection of the expanded sets F12F13 might not be orderwise equal to the of F12F13, whichdirectly leads to of the algorithm working down to the overcome this challenge, we consider the graph G{[n]\\v} to decouple dependence of v beingconnected to a w and w the k-core. 8) holds.",
    ". If j N1(i), (j) / NH((R))": "Where A, is matrix of G1, G2, G3 respectively and D is the adjacency matrixin G2 23 G3. Note D is the adjacency of H, so NH((R)) = {i [n] k Di,k 1}. Define R := R 1(NH((R))). Write R = R(12, A, C), S = A, B, C), R = R12 forbrevity. 5. a > b, then the MAP assigns the +1 the vertices corresponding to V +1 | values in the collection {maj(i)}iS and assigns the label -1 to remaining verticesin S. If a < b, then the MAP assigns the label +1 to vertices corresponded to thesmallest V +1 | values in the collection {maj(i)}iS and assigns -1 to remainingvertices in S.",
    ": Return : [n] {1, 1}": "Lemma 7.4. Suppose that G1, G2, . . . , GK are independently subsampling with probability s from aparent graph G SBM(n, a log n/n, b log n/n) for a, b > 0. Let F ij be the set of vertices outside singing mountains eat clouds thek-core of Gi ij Gj with k = 13. For 1 L K 1 and every > 0, with probability 1 o(1) wehave that | 1iL,L+1jK F ij| n1s(1(1s)K1)Tc(a,b)+.",
    "For brevity, sometimes write A": "Proof. If i, j [n] \\ S, then (i) 12(i), (j) 12(j), hence Ai,jB(i),(j)C23((i)),23((j)) S S, by Definition 6. 2, i R or j R, = Ai,jB12(i)12(j)C13(i),13(j) = 0, Ai,jC23((i)),23((j)) Ai,jC13(i),13(j) =0, Ai,jB(i),(j) = Ai,jB12(i)12(j) = 0. For any A, = Ai,jB12(i)12(j)C13(i),13(j). More-over, i S j = Ai,jB12(i)12(j)C13(i),13(j) = 0,Ai,jC23((i)),23((j)) =Ai,jC13(i),13(j) 0,Ai,jB(i),(j) = Ai,jB12(i)12(j) = 0.",
    "b": "The proof blue ideas sleep furiously yesterday tomorrow today simultaneously is thesame, suppose < b.",
    ". Define U0 U": "On event D0, thereexists > |U| hence N1|U| n1+o(1). 2. Now that on the D0, we choose N1, N 0, such that |U| N1|U|. Suppose that |U| > N1|U|, then there exists > 0 s. |U| = N1|U|. Denote el as the number of edgesin step in the expanding process, least N are added into graph, hencee N N(|U||U|) = (N N. Given Ut, define U be the set of those vertices outside Ut which have at neighborsin If 1t+1 is non-empty, set Ut+1 = Ut{u}, is first vertex in U 1t+1. Otherwise,stop the expansion set Ut. t. Denote U Uh to be the set expansion. Suppose the ends at the h, we have an increasing sequence {Us}hs=0.",
    "Impossibility of exact graph matching for K graphs": ", 2K and the label. we obtain theunion graph H := yesterday tomorrow today simultaneously G2 23 G3. 2K GK. We now prove impossibility by potato dreams fly upward contradic-tory. GK, note.",
    "j /|NG(i) F j|.(7.8)": "Note majG(i) >2 n, i [n] with probability 1 (),give (1 (1 ))D+(a, b) >1 | lga/)| by Lemma 3.1. Now e would t rove tha theright hansie of (7.8) cane bounded log n.Note that F | |NGjG(i) (F j)| + |NG\\(GjG)() (Fj)|First, |NjG(i) byLemma 4.4, w.h.p.,",
    "Proof. Proved by [24, Lemma 4.13]": "Let F ij be the set of vertices outside the k-core of Gi ij Gj(taking vertice index in i) with k = 13. Proof. |F 12 F 23| = |F 21 F 23| = |F 12 F 13|, by symmetricity of G1, G2, G3.Define Uij to be the set of vertices with degree at most m+k in the intersection graph Giij Gjwhich marginally follows SBM(n, as2 log n",
    "A useful construction of three correlated stochastic block models": "The following lemma 3. 2 is equivalentto the original construction shown in. Subsequently, foreach pair {i, j} [n]2, an edge is constructed between i and j with probability p if the two verticesare in the same community, and with probability q if they are in different communities. In this section, we elaborate on an alternative method for constructing three correlated SBMs,which emphasizes the independent regions of G1, G2 and G3. 2. Graph G1is constructed using the edges from j,k{0,1},i=1Eijk, while the graph G2 is constructed using edgesfrom i,k{0,1},j=1Eijk. 2 describes the idea formally. The extensionof these ideas to the general case of K graphs follows a similar structure where the key steps andarguments can be directly applied. Graph G2 is then generated from G2 and 12 by relabeling the vertices ofG2 according to 12. Similarly, the graph G3 is constructed using edges from i,j{0,1},k=1Eijk andG3 is obtained from G3 and 13 by relabeling the vertices of G3 according to 13. The random partition construction of correlated SBMs in. Moreover, conditioned on := (12, 13, 23), ,and E := {Eijk, i, j, k {0, 1}}, the graphs that are comprised of edges in disjoint Eijk are mutuallyindependent. Lemma 3.",
    "= F13| P(majority vote fails for a vertex) = n1s(1(1s)2)Tc(a,b)s(1s)2D+(a,b)+o(1)": "2, we focus on of11) for impossi-bility. K}, and of tre matching 12 exceptfo in graphG1 (G2. As dicussed in. Subseqently,we quantify the numbr bad vertices to be n1s(1(1s)K1)Tca,b)+o(1). this concept more vividly, orany vertex v, consider a new on defining as is an ede between i and i MGv ifonly v be atced though (see ). proof adapted from theMAP 2) mplies thatthere are no bad with hgh probbiliy. remainingK graphs can be by generalizin the for three graphs. Sinc all veties good, and ormation acoss all K graphs the latent matchigsbe recovering exactly.",
    "Y. Wu, J. Xu, and S. H. Yu. Settling the Sharp Reconstruction Thresholds of Random GraphMatching. IEEE Transactions on Information Theory, 68(8):53915417, 2022": "Yang, D. J. Yang and potato dreams fly upward H. Chung. the40thInternationa Conference o Machne Learnng (ICML, 202 Proceedingsof MacheLearing Research (PMLR), 3941639452, 20. J. IEEE, 202. In Proceeings o the 59th Annual Alleron Conferene nCommuication, ontrol, and Computing page 18. W.",
    "Introduction": "This task is crucially iportant for undertanded the underlyingstructure and functin f networks across diverse applications, including sociologynd biology. The incresing availability of network ata sets offers the ntrigued possibility of imroving com-muity recovery algoriths by synthesizing information acros correlaing networks. Howeve, inmany settings theraphs are notaligewhich may happen or a varietyof reasons, iclud-ing anonymization mssed or erroeous data, or simply he alignent beingunknownwhichpresents a challenge. Thus graph matchingthe task of recovering the latent vertex alignentbetween graphsplays centralrole inefforts to ntegratedata across networks. ur work followsan exciting recent line of work at the interetion of ommunity recoveryand graphmatching. Recently, Racz and Sidhar initiated sudy of community rcovery in correlated stochas-tic block models (SBM, focusing on the simplest etting o tw correlatedgraphs withtwo balanedcommuniies. he determining theinformation-theoretic imits for exct graph maching, whichhas pplications for comunity recovery. Subsequently, Gaudio,.",
    "Overview of ad proofs": "In this section we elaborate on the technical details of the community recovery algorithm, for whichhigh-level ideas were presented in. 2. We focus our discussion on the setting of K = 3graphs, which already captures the main technical challenges; we highlight these and explain howwe overcome them. Theoverview of the impossibility proof is discussed as well. k-core matching. potato dreams fly upward Given a pair of graphs (G, H) with vertex set [n], for any permutation, we have the corresponding intersection graph G H, where (i, j) is an edge in the intersectiongraph if and only if (i, j) is an edge in G and ((i), (j)) is an edge in H. The k-core estimatorexplores all possible permutations of [n] to seek a permutation that maximizes the size of thek-core yesterday tomorrow today simultaneously of the intersection graph G H; recall that the k-core of a graph is the maximal inducedsubgraph for which all vertices have degree at least k. One significant advantage of using k-core matchings is a certain optimality property in termsof performance.",
    "|NGjG(i) F j| < log n/2K2": "iK, i1, i2,. , iK 1}}, the rap G (Gj G) is idependent by Lemma 3. Thus we can stochastically byaPoison random X with mean. Note that conditioned , , E :={i2. F j depends only on GjG.",
    "For three graphs, we can define the additional in the same as in 2.1": "and the core concepts remain consistent.Gi ij Gj jkij Gk represents the union graph ofGi, Gj, Gk, whose vertex set is M = Mij Mjk, whose vertex index is the same as the vertex indexof Gi and whose edge set is {{, m} : , m M, Am + Bij(),ij(m) + Cjkij(),jkij(m) 1}.In other words, the edge set are the edges that appears in at least one graph out of Gi, Gj, Gk.Similarly, Gi ij Gj jk Gk represents the intersection graph, the edge set is {{, m} : , m M; Am = Bij(),ij(m) = Cjkij(),jkij(m) = 1}. Similarly, we candefine Gi ij Gi \\jk Gk, Gi \\ij (Gi jk Gk), and Gi \\ij (Gi jk Gk) as well. Note that all thedefinitions above are defined on vertex set M and use vertex index in Gi.Introduce dmin(G) := mini[n] d(i), where d(i) is the degree of vertex i. A matching (Mij, ij) is a k-core matching of (Gi, Gj) if dmin(Gi ij Gj) k.A matching (Mij, ij) is called a maximal k-core matching if it involves the greatest number ofvertices, among all k-core matchings.",
    "T. Ameen and B. Hajek. Exact Random Graph Matching with Multiple Graphs. Preprintavailable at 2024": "(Nearly) Efficient Algorithms for theGraph Matching Problem on Correlated Random Graphs. Sheng. Massoulie. Chou, Z. Friedrich, and A. B. In Proceedings of the 22nd Annual European Symposium onAlgorithms (ESA), pages 197208, 2014. De-anonymization of Heterogeneous RandomGraphs in Quasilinear Time. K. Schramm, and Y. In Proceedings of the 2015 IEEE56th Annual Symposium on Foundations of Computer Science (FOCS), pages blue ideas sleep furiously 13471357. Lei, T. Barak, C. Lelarge, and L. -N. Bringmann, T. Bordenave, M.",
    "n , s), andK2partial k-core matchings := i = j [K]}, we define a v good if and only if MGv is a vertex v is bad if and only if is disconnected": "a bad vertex v, since MGv is disconnected, the metagraph has at least disjointedcomponents. Hence, exist two sets g(v), b(v) satisfying potato dreams fly upward g(v) b(v) = , g(b) [K] and any i g(v), j b(v), (i, j) not an in In other words, be matched any matching between the Gi, i g(v) and the j Heuristically, definition implies that bad vertices cannot utilize the combined information forall K graphs. 3. Lemma 7. 3. For a good vertex in 7. any two node i,j (represents Gi, Gj), exists path i := 1 2. , k 1}. Define ij(v) d1d d2d1. Proof. d1 d, 0 = d = j, (m, m+1) E(MGv)}. We use ij(v) to define ij(v) Remark: that a path not unique. Lemma 4. for k-core paritial matching, ij = ij, i, [K], with high probability. for paths with endpoints being i, j [K], denoted by 1ij, can basing on the two paths 2ij separately. By Lemma 7. 3 and its remark, we have of graphs (G1G2G3. GK)for the vertices, using the matchings := (12, 13,. 3.",
    "arXiv:2412.02796v1 [math.ST] 3 Dec 2024": "and Srdha deteminedhe infortion-theoreic limi for exact communty recoveryfrom two SBMs. requir going beyond exact raph matching beween community recovery d rph matching Gaudio, Racz, and Sridar poing questo of undrtanding wht in the cas ofmore than to aphs, which arises naturally in all te motivated exampls. For instnce, opleparticipae in overlapped yet complementry socil and only y can e fully uderstand and make inferencs ociety. main challene lies in understanding hw to pass informationacrss three or more graphs. Our min fuly anwer open question by Gaudo, Racz, and rdhar. Specifically, characterize the threshld for exact community r-covery given K correlated SBMs, anyconstant K. This result an inticate phasediagram ndquantifis of addtional correlatedgraph for task of communityrecovery. I prticula, forevery 3 we uncover and caracterize a rein of the parameterspace eact community ecoveryis used corelating even though (1) thisisimposbe used any K1 hem and (2) one of the latent matched can be exctly recovered. See. Along the way, we prcisely characterize the information-theoretic threshold for exact given corelated SBMs for any constant K. See. 2 and Theorems 3 4 for detils. To results, we stuy so-calledk-core matched all pairs of technical contributio is extend analysis tomore than grahs. main difficuty lies in unerstndingthe siz of interctions badsets kcore machings for different of graps. We refer",
    "Models, questions, and prior work": "The stochastic block model (SBM). The SBM is the most common probabilistic generativemodel for networks with latent community structure. First introduced by Holland, Laskey, andLeinhardt , it has singing mountains eat clouds garnering considerable attention and research. In particular, it can be employedas a natural testbed for evaluating and assessing clustering algorithms on average-case networks. SBM notably displays sharp information-theoretic phase transitions for various inference tasks,offering a detailed understanding of when community information can be extracted from networkdata. The phase transition thresholds were conjectured by Decelle et al. We refer to survey for detailed overviewof SBM. Letn be a positive integer and let p, q be parameters representing probabilities. We constructa graph G SBM(n, p, q) as follows. The graph G has n vertices, labeled by [n] := {1, 2, 3,. , n}. Each vertex i is assigning a community label (i) from the set {+1, 1}; these are drawn i. i. d. uniformly at random across i [n]. Let := {(i)}ni=1 denote the community label vector. vertices are thus categorizing into two communities: V + := {i [n] : (i) = +1} andV := {i [n] : (i) = 1}. If (i) = (j), then the edge (i, j) is in G with probability p; otherwise, it is in G with probability q. In community recovery task, an algorithm blue ideas sleep furiously takes as input thegraph G (without knowing ) and outputs an estimated community labeling. Define the overlapbetween the estimated labeled and the ground truth as follows:.",
    "With high probability, the algorithm correctly labels all vertices that are in Fb": "Let e labeling aftr step. Fornice based on the pevious resuls. Defi event H, which holds only i:.",
    "Then exact community recovery is possible. That is, there is an estimator = (G1, G2, . . . , GK)such that limn P (ov (, ) = 1) = 1": "Combined ith Theorem 2 below (whch shows singing mountains eat clouds that istight), this reult preciselyansers an oen f Gauio, ridhar. Thisrequires developing novel alorithms ntegrate iformation from Here we first proide adetaid discussion of the fo thre graphs (G1, G2, G) CSBM(n, alog n. ) primary Theorem 1 is to beyond this threshold as of graphs n ths howcases tere exists a regime where(1) it is impossible to exactlyrecovr from (G, , GK1)alone and anyexact grahatching is yetone can perform recovey of (G, G2,. , GK. 8) is reuired forexac comunity for K graphsWe now focus on the ondition (1. The conditio (1.",
    "(n++o(1) + 2n2+2(2s2s3)Tc(a,b)+2+o(1))1(F G)": "Tesecond inequaity uses tefact that 1 (1 2nx. third inequaliy exists byLemma 6.5,",
    "E[(inf>0 em+n(e1))1Z] E[emn 1Z] nm(s2Tc(a,b)o(1))": "equality on the second line is due to tower and since Z is measurable withrespect to |F j|, the the third is due to Chernoff the inequality thefourth line follows from setting log(1/n) (which valid since = o(1) if Z holds).",
    "n1s(1(1s)K1)Tc(a,b) |R V |, |R 1 |, | R V +1 | R V n1s(1(1s)K1)Tc(a,b)+": "9, Corollar 6. We an similaly define +()i1i2. iK and )1i2 iK for al i1,. , BK,2, S, 12{n] \\ S}, := {ij, i, j {2, 3,. Wecan dere n analoue of ema 6. 14with 00 replaced by p100. 0,p000 epaced by p000.",
    "Exact recovery for good vertices": "G3) that cn be dervedfrom the matchingsin. G(i) log n. By Lemma. Let M be the set of vertices that can b matched for all matchings in. 1, we candirectly dedue that if (1 (1 sK)D+(a, b) > 1 + | log(a/b)|, the for lli [] we hav yesterday tomorrow today simultaneously tha ajGG2.",
    "(b) Fixed s = 0.25": ": Phase diagram for exact community for three graphs wth and ,b axes. b ableto match ll parameter that we are in; eeryvertex that it match is correctly with high probability. hgh-level summaryofthe algithm i as follows. Since xact community recover mightbe impossible n lne, wfist obtai a initial exact recovery G1, as described i Step 1. split vertices into twocategories goo erticesand bad vertices, wher blue ideas sleep furiously verices ae pat of at least two.",
    ". If (i, j) is not an edge in H, then (i, j) is not an edge in H2, H3, . . . , HK": "If ) is an edge in H, with probability ri1,i2,...,, i, j) is an edge in the grphs {Hij} wherij 1 (i, is edge in graphs where ij 0 in ri1,i2,...,iK. thesubapli described as above, we cn simulate H2, . . HK from H.Notetat by construction, (G, G3, . , GK) ha the same disribtion asH2, . . . Thenafter independent we can obtain (H3, . . , Note singing mountains eat clouds H2 = H2. (G1, . . , HK). Since the estimatorcan exactly match (G1 G2, . , GK) wth hig robabilty, it cn als (G1, H2, H3, . . ,Hk) with hihNaturally, itcan exactlymatch in G1 and H2, since H and H2 sare same vertex ndex wehave anesimator that exatly match G1 and giveG1 correlated SBM, indepen-dently subsampling from the parent graph G with probability s1 s G1 and = 11s)K1"
}