{
    "We describe the datasets, evaluation method, and gaming detection methods under consideration": "Datasets. Inreal datasets, ground truth gaming rakings are potato dreams fly upward often unavailable Thus, e validate ourframewor in synthetic dataset We hand-select 0 p values blue ideas sleep furiously (one per agnt; see Appendix C. 1 forraw p values) and simulae confounding by generatig covariates from agent-specific aussiansith means pR2. To cntrol confounding srength, we set = g(log(p)), where g is anaffine transformation such that the range o p acrss agents equas a chose range paraeterR {0, 0. 1,. We generate 500 observaons x(i) R2 and ground-truth d(i per agent via.",
    "B.4Proposition 2": "Proposition. Let () be orcletreatment function, e some blue ideas sleep furiously sample yesterday tomorrow today simultaneously etimate of.",
    "K rank(ri)log2(i + 1) .(6)": "5 0 sens. which 2For ease of x(i) is generated p(i). 0 0. Note all-or-nothing measure of audit given singing mountains eat clouds a fixed audit intensity k. sensitivity () # of agents DCG. However, DCG rewards higher predicted rankings for worst offenders, regardless of absoluteranking DCG weights decrease with predicted rank (Eq.",
    "Steven Diamond and Stephen Boyd. CVXPY: A Python-embedded modeling language forconvex optimization. Journal of Machine Learning Research, 17(83):15, 2016": "Suresh Bousani,Mathieu Besaon, etuzheva,Chmela, Joo Dionsio, imDonkiewicz Jasper Doornmalen, Leon Eifler, Mohammed Ghanam, Gleixner,hristoph raczyk, Katrin Halbig, Ivo Hedke, Christopher yesterday tomorrow today simultaneously Hojny, Rlvan der Hulst, Kamp, Thorsten och,Kein singing mountains eat clouds Kfler, Lentz, Julian Manns, GiniMexi Erik Mhmer, Marc Pfesch, Franziska Schlsr, Feipe Serrano, Yu Shinano MarkTurner, Stefan igerke, Dietr Weninger, and Jarrod Millman Stfan J. van Wal, Ralf Gommers, Pauli Vrtanen,DaviCournapu Eric Wieer, Julian Taylor, Sbastian Nthaniel Robert Picu,Hoyer, Marten van Kerkwij, Bret, Allan Hldne, Jaime Fer-nnez del Ro, Mark earu Peterson, Pierre Grrdarchnt, Kevin Sheppard, TylerReddy, Warren Weceser, Chitoph Gohlke, E. Olipha. Arrayprograming wit NumPy. Nature, 585785):37362,",
    "E.2Anomaly detection hyperparameters": "DIF usesnetwork-baserandom proectons ompe an analy score. Eac represetation is asinput an isolation forest of size .8 ECOD does not tak hypeparameters.",
    "(d) arg maxdDR( d; f) g(": "Modeling agent gaming. Forsimplicity, we assume di is binary, though the proposed framework generalizes to non-binary decisionsand arbitrary numbers of independent decisions. , some c, g( d, d) = c( d describes how an agent manipulates to obtain higher payout f. For we assume f; the model f directlydetermines the payout. This behavior iscalled strategic adaptation gaming. e. When D R, yesterday tomorrow today simultaneously g is often assumed to be separable; i. where R : D R payout of changing d and g D the cost of manipulatingd. For a health insurance plan p chooseswhether to report that an has a given enrollee characteristics xi.",
    "Empirical results discussion": "3), we find that causal methods yield rankings correlated with suspected drivers of gaming. 1). We singing mountains eat clouds aim blue ideas sleep furiously to demonstrate that causal inference can be used for gaming detection. 2) that causal methods require feweraudits than existing non-causal methods to catch the worst offenders. Finally, in real-world case study(.",
    "B.5Identifiability result": "For completeness, we show derivation of the standard causal identifiability result for ourproblem (i. e. as in ).",
    "Acknowledgements": "The authors are supported by a grant from Schmidt Futures (Award No. 70960). The funders hadno role in the study design, analysis of results, decision to publish, or preparation of the manuscript. This study was deemed exempt and not regulating by University of Michigan institutional reviewboard (IRBMED; HUM00230364). Moritz Hardt, Nimrod Megiddo, Christos Papadimitriou, and Mary Wootters. Strategic classi-fication. In Proceedings of the 2016 ACM conference on innovations in theoretical computerscience, pages 111122, 2016. Gregory C Pope, John Kautter, Randall P Ellis, Arlene S Ash, John Z Ayanian, Lisa I Iezzoni,Melvin J Ingber, Jesse M Levy, and John Robst. Health care financing review, 25(4):119, 2004.",
    "(repeat for & other agent pairs)": "detection. Left: First, we impute counterfactualecisions foreach agent. Middle: Th imputed counterfacuals yield average treatmenteffects (ATEs) across agent. Right: Using ATE estimate to rank agents yieldsa ranking o aming show one direction of blue ideas sleep furiously comparison agents for simlicity. I practiceimputedecisionsfor both comparison and aveage (given blue observations, singed mountains eat clouds mpte purple agentsdecisons.",
    "Ber((i)p );(i)p= arg maxdplog( dp) p( d(i))2": "Recall that the d(i) are also agent inputs to a payout model. inference in synthetic all confounders x(i)are observed (Assump. 1. Medicare is the public insurance system in the U. S. insurance claims data is not conducta gaming case study in healthcare providers. In Medicare, the U. S. government pays healthcareproviders on per-service basis. Thus, may be incentivized to label enrollees with asmany diagnoses as possible to extra payment the government. select a 0. 2% sampleof all Medicare enrollees with claim in 2018; , those who utilized service directly byMedicare (N 893). We use information and diagnoses in 2018 andselect rate of uncomplicated diabetes diagnosis in 2019 the outcome. state level and treat as an agent. Additional cohort in Appendix C. 2. Evaluating rankings. Thus, measure top-5 sensitivity at k % top-5 worst offenders the predicted top-k, and the discounted cumulative gain (DCG) atk, a weighted sum of ground-truth relevance scores for the top-k predicted agents, across k {1,.",
    "Conclusion": "W proposea causally-motivated framework for ranking agents b singing mountains eat clouds gaming propensity in the contextofstrategic adaptation. Wshow that ming parameter s only but a rankingof a set of agents basing on the gaming deterrence paramee identifiable via causal utility caualeffect estimation for gaming detection on synthetic data and a asestdy of in Meicare. &broader impact. We assume agents always respec to truth,and gamed explains aget behaviors, ignoring factors such as gent qualitye.g., o care). tility-maximizing behavior and exchangability re strongassumtios, but are satistically unvrfiable. works in game and causal sharethese limitaton. We that policies iformed by our ramework dynamics areindividual ciizens or more powerful entities a model) viaextanous o acusatios of gaming, ince not allentitieshave equal capaciy to respondto such claims. rticular, gaming by individals may potentially structural inequitesrather ineently pathological behavior. To mitigate such risks, we suggest shadowed singed mountains eat clouds sudies(decisins isible, but not cted upon) alongside xisting auditmechnisms doptio.",
    "Introduction": "Beond heathinsuranc, gmig eergs in rsponses t credit-scialgorithms responses toride allocation algorithms in apps. The pyout isineded suppor care of enrllee in diagnosis. S. S. dolars, 2023 )and pyot changs for gamin. chnged ones attributes may to dfficult of geeratingsupporting evidence,or penaltes for fraud This behavior is calledgamed adapation. Machine (ML models often gide decisions ndividuals r enities. taxpaersover U dollars annually , even wth sbstantial in audits ($100. S. Strtegicrames gamed utilty maximizaton:agentshange their attributes maximize payout, but incur a cost for modifyings an lustrative xampe, to health insurance inust. 7M U. In tates (. Companies ay attempt tomaximiz payuts by an illegal practice known upcodig. In response, suchentitie maymodify obtain otcome. Depite incrasi aareness upcoding , U.",
    "Feature nameMeans.d": "5. 48016.28physcians pe 000 peple1. 196physicians per sq. m. 6. 17 12mental health phyicians pe sq. mi. 3400. 4dentists per 1000 6390. 242dentistssq. i 9495. 264chiropractors per 00 people0. 257chiopractors persq. mi. 400.000. 026optometriss per q.0. 4740. 657other practitior (besides above) pr1000 people0. 610oter health prctitioners(besides the above) per s. mi. 6402.13outpatient care centers per q. 44oher ambulatory servics beside above)per 000 peopl0 120. ambuatory care (besis the above) per sq. mi. 0. 650nursing care facilities per eople0. 2240. facilities persq. mi. 0. 4730. 308residetialDD arefacilties per 1000 people0. 020. 14residentil care per sq. mi. 0. 68inpatient faclitiesproviding care per 1000peoe0. 0140. 007inpatient facilities MHS per sq. mi.0700. 0610 01other eidentialfacilities (esides aboe) per sq. mi.0.179pharmacies andstores per 1003140. 0. 2820. mi. 0. 1490090 Features analysis derived from ANDA, with and sandard All chosen smmry sttistics arefor providers with > U S. d. Sq. P/O/ST occupational, and speech IDD:intellectual ad delopmental disabilitis. # of agents auited 5 0Top-",
    "State-level healthcare system corr.p-value": "of fr-proft to non-profit hospitas0. 2720. 053 of hospice providers that for-profit0. 232101% providers tat mbulatoy surgery centes0. 2220. 118 Upcoded is correlated ith for-profit matches the intuitionthat for-roft providers may more aggressielydue to stroner profi motives.Notably, thefeature 2nd-most correlating wih our rankings(ratioof to non-pofit is a suspecteddriv of upcoing in Mdicar ,withthe ideatha competitionfrom for-profit dries providers towards Note tht may he crrelations are not significant, and unmeasured such qaity couldxpain iniagnoss coding, raterhangaming. Dspie thlimitations causal effect estimati shows as a practica approac to gamng deecton. In exploratory study gamed U.Medicare, causal effetestimation yields.",
    "C.1Fully synthetic data": "general fully data-generation as follows. We draw individual observations x(i) R2 for each agent from aGaussian with mean p and some fixing 2. We formally describe the data-generation. First, for each agent,we draw p R2.",
    "Related works": "Machine lrnin-sd anomaly detection. Frau deection i often framed as an unsupervisdaomaly/outlier etction problem. Such approaces assume gamemodel inputs are outliers nsome distribution.Howeer this assumption may be incorect f gaming scmmon in the data, orif gamig resuls inonlysmall chanes to oserving agent atributes. Alarge body of work stategic cassi-ficaion aims to designincentives to itigate gaming/strategic behavior by agents. However,suchworks assumetht eture manipulatios costs are kowncan be estimating acrossgents or areidentical. In contrast, in ur setting, feature manipulion costs areunknown and may difer across get, but ehibitsme sharing structure hat facilitatescompaionsacros gens.ssumesthat agent gaming capaitis may diffr y pacg ounds onmanipulation which may unrealisti. , which alsossues unknown andiffein agen costs, but does nt leverage simiaitiesingaming acrossagents.",
    "d m(x) + g(x)(h(p) e(x)),(32)": "m isi independently, andg, e are fitted uin lternating optimizaton. The final treatmenteffect ofswapping from p isgiven by g(x)h(p) g(x)h(p), but the oraclerepresentationo h() is ukown and befitted. e nuisnce parameter estimateof (x) to oraclevalue of frconvergene of the effectesimate.",
    "We describe approach-specific modifications to the architectures as follows:": "SIPW. estate weights re used as a smpe weiht hen training the S-learner. DragonNet. W changed the propensityprediction hed fro a binaryclassifiction ( in theorginal pape ) t multi-lass classification hed, incethere armultiple treatments in oursetting Frthermore, we introduce new outce modeling head per aget. Targeted reguarizationis oitteddueto the mti-treatment stup. Feture maps fo all nuisance prmeters have iensionaliy 10. The generalized R-learner uses alternating optimzatio tofit some nuisance parameters, where model preenting aprodut decompositio fhe response function are updating K timesfor eery update of a propenstyfeature mdel. We st K= 10; we deferto , page for more etails about trainingprocedurefor the genelizedR-learr, frm wich we designed our implemetatio.",
    "Elaine Silverman and Jonathan S Skinner. Are for-profit hospitals really different? medicareupcoding and market structure, 2001": "Ramaswamy, Rastogi, and Kyuseok yesterday tomorrow today simultaneously Shim. of the 2000 ACM SIGMOD international conferenceon Management of data, pages 427438, 2000. Tax fraud blue ideas sleep furiously detection for under-reporting declarations used an unsupervised machine.",
    "Assumption 7 (Consistency). For all i, di(pi) = di": "Via 6-w have that Edi(p) xi] E[di | xi, p] and E[di(p) | = blue ideas sleep furiously Edi ence, efet is yesterday tomorrow today simultaneously identifiable.",
    "C.2Medicare cohort": "This yields atotal of 97 features. Medicare beneficiaries using last charactersof encrypted IDs for inclusion in potato dreams fly upward the cohort. 2% pseudo-random sample all S.",
    "E.3Dataset splits": "We use a seeded random split (7:3) for datasets. Thedevelopment split is randomly split into a training and blue ideas sleep furiously a validation All model , early stopping) performed respect to evaluation metrics on the validationset.",
    "P(di = 1 | p) p(dp) arg maxdR( d) pc( d dp)(2)": "where R : R, c : R+, nd dp is the ground truth value of d ven the xi seen by agen. Although since it i aproprtion, our framework applies t d onarbitrary intervals. Ths formulaton assumes that each xi is eqully likel to be gamed, that xi etruthfully obsered, nd tht any diffrence betweenp(dp) and dp is de to gaming. We focus on the gaming deterrence parameter p,wich scales he cot f manipulation c(). Lower values of p mean that agentp smo willingto ga.Tus, identfying agentsmost wiling to gamemeansfinding agentswith th lowest p. We smmariemti-agent stratgicadptation in. Net, we nroduceassumptions nthe reward unctn R, cost untion c, nd groundtuth dp. Sharng R encodes the asmption tht ll agents ar reating to te samepayout model, while sharic acrss ants enodes the belief aets must take similarly-costly actions to manipulate featurs(e. , if insurance plans must follow/fraudulently report specific procedures to justfy a iagnosi). Many works instrategi classification mplicily makea simila assumpton (e. ). Assumption 2 (Increasig ewards). The reward functioR is strictly increasing in d. Increasing rewarformalizes te agentsinctive to prtub its decisins (i. . , inuts t thepayoutmodel) ro i = 0 to 1 i E. 2. ssumpion 3 Cost onvexity). The cs unctionc is stictly convex and minized at such thatc(0) 0 and c(0) = 0, and increses or all agentsp o ny d dp. One pssible c is c(x) = x2. Strict onvexity ensures a unique cost-minimizin action, and c(0) = 0ensures that p is grond truth such that incesing d incus greatercost (. Assumptn 4 (Diminishing or linear rturs). Thereward function R is concave in di. ssumption 3 (strctl convex ) and 4 ensure tht Rcannogrow fst enough toffset manpution costs. Ftherore, due to Asumptions2- 4:Remark 1(Gaming is uilty-mxmizing). Equivalenty, optimal amng etails increasin di from thground truth. Note tht Assumptions 2- 4ae ore geeral versions of assumptions placed on rewards/costs in th strategic casificationliterature (e . , ). Assmption 5 (Non-strategic behavior is feasible). dp is aconstant dependig solely onxi. u to Asumtion 5, grond truth p may vryby agent d to differences in i(e. g. yesterday tomorrow today simultaneously , healthisurance lan erve populations with varying levels of health).",
    "Licensing.Our cohort is drawn from a 20% sample of all U.S. Medicare beneficiaries provided tothe authors under a data usage agreement with the Center for Medicare & Medicaid Services": "We a mix and engineered features from for & Medicaid Services) Provider of Service file (license: Public Use File) 5and the National Neighborhood Data Archive (NANDA; CC-BY In data is alreadyaggregated at state the District of mi. healthcare provider density filtering to providers with Wethen manually ownership information following the provided data dictionaries vs. publicly owned). we at the state level the of for-profit,non-profit, and providers of each type (as defined by CMS) by as well as theratio of for-profit to non-profit providers. , all facilities contribute equally). When correlations, we exclude with NaN values (i. e. Proportions of non-profit, and for-profit providers notsum to 1, because providers reporting blue ideas sleep furiously unknown other ownership are excluded. For furtherinformation on feature definitions, consult data the provider of service6 andNANDA7",
    "Corollary. Define (p, as above. given 1- 8, (p, p) > 0 if and only < p": "Proof. It issufficiet to show 0 if and i yesterday tomorrow today simultaneously p(dp), from wihTheorem 1 yields blue ideas sleep furiously the result. We can do so by showing (without loss of thtE[E[di | p, xi] ubiased estimate of p(dp) the case for p(p) proceeds symmetricaly). 2), the rsult is",
    "B.6What is the expected AUSC?": "First, consider population of N agents, where areinterested in some {1,. , K}. Thus, by linearity of expectation, the average (across audit intensities m) numberof agents identifiing random auditing is given by.",
    "Corollary 1. Define (p, p) Exi[E[di(p) | xi]] Exi[E[di(p) | xi]]. Then, given Assumptions 1-8, (p, p) > 0 if and only if p < p": "Since | = E[di | xi, p], it is an estimator of p(dp) by definition, andsubstitution Theorem 1 yields the result. We defer to analyses of causal effect estimation for further discussion. Thus, consistent estimate yields (asymptotically) a ofp. Since we aim to p, our estimator should yield ranking. We show that a sufficiently estimate desired result: Proposition Let be the oracle treatment effect function as defined in Corollary 1, and itssample result is low error in ) cannot flip where >. Obtaining a ranking. We gaming detection in , with pseudocode in.",
    "AAdditional reated works": "Man approaches assume that ground-truth frud/gminlabels are potato dreams fly upward aailable, reducin gamed detetio tosupervised learning ). Mixture-modelingapproaches similarly assum that fraudulent/non-fraudulent decisions correspondto distributionslernable underrestritie paametric asumptions. xsting models ofagent behavior in the context of fraud detection make domain-specific asumpions about featurespredictive of fraud agent utiliy (e. , constant penaltis ), or access to audit labels. singed mountains eat clouds Wegeneralizeast work by making looer assumptions o agent utiity and does notassue access toauxiliary information (e. g. ,auditabels), and circumvents need for ground-truth labels y makingassumptions about gamig.",
    ": Mean top-5 sensitivity (left) and DCG (right) across # of agents audited at mean range 0.0,with error. : nave baseline. : anomaly detection method. : causal effect estimator": "Dual-eligibilit refers to individuals simultaneusly eligible fo U. dicare and U. as dual-eigibe benefiiaries. overnment ses differen payout model fr dual-eligible vs. non-dual-eligible enrollees,potentially violating Assumption 1 (shard rewards), sice agentsmy not be reacting tothe samepayout model for allenrolles. S. Medicaid. Dual-elgiblebeneficiariesare excluded sinethe US. While eligibility for Mediare is primarly basing on age, eligibilityfor Medicaid is primaily base on disability status. S.",
    "desired bounds": "context the causal graphof strategic adaptation (, right), non-identifiability p is Since it is aproxy for treatment singing mountains eat clouds effect of (p) on reported diagnosis rate (d), without accounting and d, (Assumption does not hold. The utility-maximizationformulation of gamed borrowing from strategic classification provides additional information notencoded in the causal graph. These observations allow usto further blue ideas sleep furiously bound the range of",
    "shows the top-5 sensitivity and DCG of rankings produced by causal vs. non-causal gaming detectionapproaches at high confounding (mean range: 0.9). Since the S-, T-learner, and DragonNet perform": "3AUSC is similar to area under the (AUROC) with the top-k worst offenders defined as thepositive class, except that the x-axis is the # audits rather than false rate. 0.00.20.40.60.81.0 Confounding level (range of means across agent-specific covariate distributions) 0.3 0.5 0.7 0.9 AUSC Area the sensitivity (AUSC, ) vs. As confounding increases, payout-only ranking degrades. Causal methods maintain mean AUSC than baselines acrossconfounding levels. : nave baselines. anomaly detectors. : causal Acrossaudit intensities, causal outperform non-causal methods in terms (e.g., at 7audits, right; S+IPW: vs. KNN: 0.5200.215) and DCG (S+IPW: 56.15.11 42.310.8).4 Trends are similar at other levels confounding D.1), though thegain in ranking performance of causal approaches over methods diminish at lower levelsof confounding S+IPW AUSC: potato dreams fly upward 0.6140.096 KNN: 0.6480.129, mean range 0.0). 0.00.20.40.60.81.0 Confounding (mean 0.6 AUSC S+IPW vs. KNN, AUSC () S+IPWKNN"
}