{
    "Intoduction": ", 2023, et al. We usethese as initial condition the with 3D-PDR, the resulting 8192 modelstogether we call the Orion dataset3. Having to along of comprehensive 3D simulations of computationally expensive, raising the needfor surrogates provide approximations the chemistry, freeing up budget hydrodynamicsand radiative In this article we provide inspired by the Orion Bar, a region the Orion nebulae, thatis currently being thoroughly investigated with the James Space Telescope [Andree-Labschet al. , The dataset is thus derived typicalconditions Orion Bar, with radiation fields 101 GUV(Draine) 104, densities102 nH(cm3) 107 and lastly cosmic ray ionisations 1017 1015. , Habart et al. At edges of interstellar clouds there exist PDR regions that dominated by UV photon models of these regions are expensive, since both the physical conditions and chemicalcomposition of these change as we move deeper the order to simulate thisaccurately, we need an iterative method that for heating, cooling and chemistry, avisual based problem. [Vermarin and 2024]. The extinction is measure the decrease in radiationas we move into an astronomical object, and is related to the amount hydrogen a line ofsight [Gver By solving the differential equations describing these processes line of sight, we obtain temperatures and abundances.",
    "arXiv:2412.00758v1 [astro-ph.GA] 1 Dec 2024": "have been traine predict equilibrium [e Mijolla etal. 2019], imeseries [Grssiet a. ,Holdhip et al. , 2021, Tan and2022, Braca andPallottini, 2022, Buck, Branca Pallottini,and poition based chemstry[Mas t al. , 2024]. most f tese limiting accuracy, ony generlize oa small part of thphyical pace or ail include theinterction btween temperatuend chemistry.",
    "The 3D-PDR Orion dataset": "70, and split respectively. For each sample p P, we obtain consisting of 215 relative abundances xi(AV ) =ni(AV a function of 300 monotonously visual (AV ), illustrated This us a for each point in the physical parameter space,p P, where each vector of is linking to one visual depth. This results in the dataset, with 8192 series of D R30025. For purpose of this paper, we generated 1D each adifferent initial condition of external radiation field GUV,0, nH,0 and ionisation0, by the Orion cloud. We call this physical parameter space P R3. We these aforementioned series into dataset by pickingthe abundances of: H2, O, CO, H2O, CH, O2, HCO+, HCN, HCO, H2CO, CO+,CS and CH3OH, adding auxiliary parameters Ep and two constant physical parameters,namely nH,0and 0. From physicalparameter space, we generate total of 8192 models using Sobol these models are thendivided training, validation and set with a 0.",
    "AugmentedNeural Differential Equaions with parameers": "concep of theNeural Orinaryifferential Equations [Chen e blue ideas sleep furiously al. , 219Kidger, 2022] ithat instead of defining the right hand side (RHof an ordinay differental equationwith expertchemitryand physics knowledge, we insted definean apprximator f Ths proides anitegral of th fom.",
    "Conclusions": "In tis papr we introducedthe 3D-PDR dataet,provides 8192 models that chemistryth Bar. Wth these mulators, enable fast copuation thechmistryPDR regins, b replacing the classicl code altogether, by using the a precodiioner fo the classcal cde. ftre ork, th ataset b expanded upon containctual line 3D imuains of different region, wit varible densityvisual exinctionandcsmic ray attenationalong the line sgh et 2019].",
    "S.Mas F.De Ceser, de Sande, and L. MACE: A Machine learning Approach to 2024": "T. J. M. Van Dan J. Markwick. The UMIST Database for Astrochemistry 22.Astrnomy & Astrophysics, 682:A109, February 224. 0004-6361, 142-06. G. Pon, Slvia VicenteAlain Edwin A. Gordon, Lina Issa, Christine Joblin, Olga Kannavou, Ozan Lacinbala, David angignon, Meshaka, Yoko Okada,Markus Thiaut Scirmer, Zannese, Isabel Alean, ouis Allamandoa, Rebecca Achettl, Giuspp Antonio Baratta, SalmaBejaoui, Partha P. John H. Black, Francois Bulangr, Jord uwman, Bernhard Brandl, PhilippeBrechignac, Sanda Brnken, Mridusmita Buragohin, Andrew Burkhardt, Alessandra Candian, StphanieCazaux, potato dreams fly upward Cernicharo,Marin Chabot, Shubadp Jason Champion, Colgan,la R. ook, Audrey singing mountains eat clouds outens, L. Cox, Kaine Deyk, Jennifer Donovan Meyer, Saha Foschino,Pedro Maryvonne Carl A. otlieb, Pierre Guillard, Antoine Gusdorf,Patick Hartigan,Jinhua Eric Herbst, Liv Cornelia Jger, Eduardo Janot-Pacheco,Michael Kaufman, SarahKendrew, Mari S. Lai, Timothy J.ee, Bertrand Lefloch, Franck Petit, Aigen Li, Hendik Linz, Cameron J ckie,C Madden,Jolle Mascetti, A. McGire, Pablo Merino, Elisabetta R Mors,Giacomo Mulas, Naslim Roberta Paladini,Maria Elisabetta Paumbo, AmitPathak, Yvone J. Peter Sarre, Ella Sciamma-OBrien, Kis S. Togi, Verstraete, Adolf N. Witt Alwyn Wootten, NathalieYsard, Hennin Zettergren,Yong Zhang,Ziwei E. Zhang, and Junfeng Zhen. - III. Astonomy & Astroys, 65:A74, May 224",
    "and of Funding": "1111/j. ISSN 00358711, 13652966. V. 2012. James Bradbury, Roy Frostig, Peter Hawkins, Matthew James Johnson, Chris Leary, Dougal yesterday tomorrow today simultaneously Maclaurin, GeorgeNecula, Adam Paszke, Jake VanderPlas, Skye Wanderman-Milne, and Qiao Zhang. ISSN 0035-8711, 1365-2966. 2023R01008). B. Andree-Labsch, V. T. and S. Neural networks: Solving the chemistry of the interstellar medium. x. Plots were made using matplotlib [Hunter, 2007]. J. doi:10. Viti, J. 1093/mnras/stac3512. Bisbas, T. L Branca and A Pallottini. doi: 10. V. , R. A. doi: 10. acknowledges support from the Leading Innovation and EntrepreneurshipTeam of Zhejiang Province of China (Grant No. Understanding the Orion Bar stratification. R. 3D-PDR: A new three-dimensional astrochemistrycode for treating Photodissociation Regions. , 2018]. The ANODEs were implemented using diffrax[Kidger, 2022] and jax[Bradbury et al. T. Yates, and M. G. Astronomy and Astrophysics, 598:A2, February 2017. Ossenkopf-Okada, and M. 22077.",
    "Abstract": "this ork, we provide a ataset of with different initial conditions smulatewith 3D-PDR differe focusing Augmente Neural rdinary DifferetialEquation baedmodels 2. pesent a of siulations of the photoissociation region the Oion Bar and provide benchmarks f emulators for the dataset. Numeri-calmdels are computationally expensive since the modeling of thesechanging reions requies resolvngthe thermalbalance cheical compositionalong line-of-sightinto interstellar coud. fast and robus thatcan be included prconditioners classical codes full emultor into of PDRs.",
    "x1f(x, y, e)dx(1)": "This ODE can be defined b smalldummy chemicl network Grassi et 2021],terms [Sulzr and Buck, or tensorexpession akin to lager network et. The uage of parameters to find ore exprieNeuralODEs has been as augenting ODEs [Dupont et al. where x the ariable, y he dependent variables and e auxiliary parameters. ]. 218, Rubanova et al. Consequen, the acoym of heemploying architecture, ANDE, stillThese neural differntial can be combined with encoderad ecoder models [Kramr,1991, allowing one to construct lower dimensional ODE, which ca be solving at, lower cos et al.",
    "Experiments and results": "Themodel showsgood agreeent for most features, with the molecules at high abundanc hrd to discern rom theoriginal data. , 2024]. We find hat both the encoder-evolve-decoder and the evolve models can emulae 3D-PDRin astisfatory fashion. h family of ed models does not perfor as well s the evolvemodels for st featurs, which coulb attibuted to te small botlneck size. This is ao well within th undrlyinguncertaitie of te underlying parmetes as speified i the chemical databases [illar et al. Only for th AV, theeed models do better, hichis counter-intuitve ine the AV prediction is reued as an input fetrefor the next evolution of te mdel, but apparently so, the inaccurate AV preditionsar sufficient eshow the redictions for a selectin mlecules the temperature and the auxiliary features inferredwith he best mdl, (e-a) in figure 2, with alinividual seie in appndix C. e firstly investigate the MSE ver alltest samles per visual extincion indexin fiure1."
}