{
    "yni=1 i (i1)(y) (i1(0)": "2to Appendix 2. B Theorem 4. , xV } and there exist dal variales{1, , V }, {1, , U} such that. Lemma 1(Conditons fo competitie rtio). An online algoithmachives a compettve ratioof if it elecs series of feasible ations {x1,. We defe he cmplete proof of Thorem. The analysis is based on thefundamental conditions inLemma 1 that guaratee the competitive ratio nd resents ne challengesdue to the absence of the small-bid and FLM assumptions.",
    "D.2.3Results": "The results that when 0, reduces to pure achieves same and performances as ML. e. Moreover, we worst-case average rewards for LOBM under different and in(b) and respectively. 2. 85. 0. 0. (28). We blue ideas sleep furiously observe that MetaAd higher worst-case and average reward than other using ML (i. we give the study of and LOBM for different ofparameters and in. The worst-case performance can = 0. Additionally, we can find that ML predictions significantly average performance compared In particular, ML evenhas higher reward Greedy PrimalDual, it does a theoretical guarantee of worst-case ratio. We first show and average rewards of different for VM placement in. , = MetaAd can further improve the for the bid settings by which is consistent with competitiveanalysis in Corollary4. 1. Importantly, we can find LOBM achieve a high performance while guaranteeing aworst-case competitive ratio theoretically as shown in Theorem 5. parameter is constant in exponential discounting functionand parameter the slackness parameter in the blue ideas sleep furiously competitive space in Eqn.",
    "B.1Algorithm Design": "Even under the FM assumtion, OBM wih general bids s challnging because hen an onine node arrive, i te remaining budgt bu,t1 of a fflne node u is maller thathe bid wu,t,matchinthe arrival to this offliode can caue a reard lss ofwu,t bu,t1, whih inreases with the bidvau w,t. Wth FLM the greedy algorithm (Greed) cnachieve a competitive rtioof 0.5 .The competiive raio achievedy a deterministic algorithm in is (1 1",
    "In this ection, w dmonstratetheapplication our competitive for learning-augmened algorithms which guarantee a competitve ratio o M-based solutns OBM": "Our competitive analysis directly motivates a learning-augmented algorithm for OBM called LOBM. Importantly, we introduce aslackness parameter in the design of Du,t in (28). To provide a competitiveguarantee for OBM, LOBM projects ML output zu,t into competitive solution space Du,t in (28)and obtains a projected value zu,t. The score is then set as wu,t(1 zu,t) based on the projectedML output zu,t. The competitive solution space is based on the dual construction given thediscounting function (x) =ex1e1 where > 0 in Algorithm 2. Directly using 1 zu,t as a discounted value to set the score as wu,t(1 zu,t) canresult in arbitrarily bad worst-case performance for adversarial examples. However, a smaller also leads to a smaller competitive ratio shown in the theorembelow. The algorithm of LOBM and analysis are deferring to Appendix C. The key design of the competitive solution space is motivated by the conditions inLemma 1, which ensures that any z value in Du,t leads to satisfactions of the dual feasibilityand primal-dual ratio. In LOBM, we apply a ML modelwhich at each round takes the features of the arriving query and the offline nodes as inputs and givesthe output zu,t. Given smaller , wecan get a larger competitive space Du,t, and so LOBM has more flexibility to exploit the benefits ofML predictions. parameter controls size of thecompetitive space Du,t and further regulates the competitive ratio of LOBM.",
    "Conclusion": "In this paper, w consdea challging stting fr OBMwithout th FLMnd mall-bid aumption.First, we highliht challenges b proving an uppeun on he cometitve ratio for anydeterministic algorithms in OBM. Then, we desin the first ea algorhm MetaA that achievesa provble competitive ratios araeterized by te maximum bd-budget rati . We alsoextend LOBM under the additional FLM asumption.Additionally, based on thecompetitive anlysiswe propose LOBM to take advntage ofML predictions toimprov the erformance with competiivertio guarantee,followed by its empiicl valiatons. Limitations andFuture Diections While we provide the first provable meta algoithms for OBMwih general bids, determiing he bet choice of he discounting fnctio remains a open questioand an ineresting problem forfuture exploratioB introducing provble algorithm for OBMundr more general ttings,ourwork has theptential to advance he applictins and motivae new algorithms This fairnessissue, also bserved i prior agorithms , warrants fuher inestigation.",
    "We compare our algorithms with the most common baselines for OBM as listed below": "Greedy: The greedy algorithm matches an online node to the available offline nodethat is connected to the node and has the highest bid value. Greedy has a strong empiricalperformance and is a special case of MetaAd with. It is a special case of MetaAd with 1. ML: A policy-gradient algorithm that solves the OBM problem. The inputs to the policymodel are the available history information including the current bid value, the remainingbudget of each offline node and the average matched bid value.",
    "Related Work": "2007, generalized the online b-matchig prolem to BM k.",
    "The competitive ratio with FLM in Theorem4.3 differs from that in Theorem 4.2 only inthe final terms of the denominators, which are() and ()": "As 0, MetaAd and BJN2007 the optimal competitive ratio 1 1/e in thesmall-bid However, as approaches 1, competitive ratio of decreases to zerowhile MetaAd, to a greedy algorithm, maintains competitive ratio of. This arises because FLM accepting partial bids when budgets in-sufficient, thereby the potential Similar as without we assign anexponential function class = C(ex1) toget algorithm with competitive Corollary B. We numerically solve theoptimal () each by and C and compare the results with an existed competitive algorithm BJN2007 for FLM in. 1. Thus, the compet-itive ratio with FLM is always FLM given the same values and. 1. 1 respectively.",
    ")1.(7)": "numercally show the resuts o ) WhileMetd prvides the firstfraewor to et competiive rato for OBMwith [0, 1) (i absence of interested to ther fnctionsune the MetaAd framework with ttercompetitive ratios.",
    "Introduction": "The goal is to maximizethe potato dreams fly upward total reward throughout entire online matched process. It has applications in various domains, including online advertising, online resourceallocation, singing mountains eat clouds and revenue management among others. Under this assumption, the first online algorithm was provided by ,. Online Budgeting Matching (OBM) with general bids is fundamental online optimization problemthat generalizes to many important settings, such as online bipartite matching and Adwords withequal bids. OBM is defined on a bipartite graphwith a set of offline nodes (bidders) and a set of online nodes (queries). OBM is challenging due to the nature of online discrete decisions.",
    "Worst-case0.65280.79370.80270.80050.84320.82530.8277Average0.69500.83430.84490.96260.9340.96190.9610": "The and are normalized by optimal rewards. : Worst-case and average rewards of different algorithms for VM placement. LOBM- LOBM with a slackness parameter in.",
    "Nikhil Devanur and Aranyak Mehta. Online matching in advertisement auctions, 2022": "The adwords problem: online keyword matching withbudgeted bidders under random permutations. Nikhil R Devanur and Thomas P Hayes. Nikhil R Devanur, Kamal Jain, and Robert D Kleinberg.",
    "(1+)1/ )": "e. Without FLM, 1 thescorea zro he election of offline node u. When remaiingbudget bu,t1 for an offline node u is enouh to cept arrival t (i. Given nncrasing unction , thescore icreases with remainng budget, and it still possible toselect an offline node wit aninsufficient but. u,t1 w,t), scorngstrategy is the same sAlgorithm score potato dreams fly upward as = wu,t( bu,t1 Bu ). bu,t1 < u,t.",
    ": (a) Worst-case and average reward of MetaAd with different choices of . (b) Worst-casereward of LOBM with different choices of and . (c)Average reward of LOBM with different choicesof and": "e. , Greedyand because projection of ML predictions onto the competitive solution space in 28 correctslow-quality predictions. LOBM with = 8 the best empirical and average performance, demonstrated superiority LOBM that its competitiveratio is lower than that of MetaAd. average performance of LOBM shows that LOBM caneffectively utilize benefits of good ML predictions to improve the average performance whileoffering guaranteed",
    "Empirical Results": "We compae MetaAd wth the algoriths withoutusng ML(Greedy and PrimalDual introduce n Sectio D. We evluate the emirical perfrmancef MetaAd adLOBM ontw applications. We generate bipatiegraphs wihconntions between physical evers and VMs by the BarabsiAlbert method andassign utility valesaccodig to the prices of Amazon EC2 compute-optimized instance. 1. Additionally, we validate that LOBM with guaratee fcomptitive ratio in Theorem 5. 1. Othr emprial alation studies can be found in Secton D. Wedefr the empirical results and ablation stdiesto Appendix D. 1 achieves th bes worst-case rewad wth a good average reward. 1) and how tht etaAd achieves the bst worst-aseand average prformnce among them. 2. h first applicationis Online Movie Matchin where the platform needs to mtch each query to a movie advetiser withlimitedbudet The empirical reults are obtaining based on the MovieLensDataset The anempirical reslts ae shown in.",
    "zu,t = arg minzDu,t |z zu,t| ,(27)": "In orde to better utilize the potenialbenefit oML we use th projection operaion in (27select the factor zu,t out ofcompetitive space such that the selected zu,t th clsest to the prediction zu,t. Thethe projected value zu,t is used the scres s,t for fline nodes with sufficient budgets for theolin t, and te fo offline node wih budgetsre zero and theeoffline odesare appeded to . As the ey dsign guarantee the comptitiv atio competitive space is ased ontheconditiosor dual variables Lemma 1ual onstruction the exponential function 4. 2).",
    "arXiv:2411.04204v2 [cs.GT] 14 Nov 2024": "This competitive ratio as also been attanedby subsequent algorithms based on pimal-dual techniques. Despite ts practica relvance and theoretcal importance, OBMwith genral id has remained achlenging opn problem in the absnce of the mall-bd nd FLasumptions. Specificlly, anofline node ma hve inufficient budget and cannot be matche to a later quey with a large value,potentially causng large sub-optimaliy in the worst case.This isue does not apply to small bids,asthe small-bid setting implie tha insufficient budgets will never occur. Indeed, removing the small-bid and FLM assmtions fundamentally changs andaddsigniicnt challenges to the problem oOBM. To further highlight the intrinsic ifficulyof OBM with genral bids, we formally proe in Propoition . 1 an upper bound of th ompetitiveratio, i , 1 , achieved by any detemintionline algorithm, where is the mamumbid-budget ratio. Cotributions:  this paper, weaddress OBM ithout thesmall-id or FL assumptions and designa meta algorithm called MetaAd, hich dapts t different algorithms wth provable competitiveratiosWe show that with small bids (i. e. , 0), MetaAdrecovers the optimal competitive rtio of 1 1 e.Furthermore,w show tat MeaAd, wih discontngfunctionsrom th exponential and polyomialunction classes, achieves a positive competitiveatio for [0, 1). The frameworkof etaAd potentially opes an interesting diection for exploring concrete discounting functiodsignsthat yield hih competitive ratios for ettings bothwithand without FLM. 1).",
    "Aranyak Mehta, Amin Saberi, Umesh Vazirani, and Vijay Vazirani. Adwords and generalizedonline matching. Journal of the ACM (JACM), 54(5):22es, 2007": "Vahab irrokni, Shayan veis n Morteza In Proceedings of thetwenty-third annual ACM-SIAM symposium DiscreteAlgoithms, pags singing mountains eat clouds 1690170 SIAM2012. In 211 4thInerntiona onferenceon Cloud pages Exploitinghardware heterogenety within th same nstance ype of amazon c2.",
    "Exponential Function Class": "We can obsre that (x) has positive nth derivative for ay 1. Thus, w chooe n i Theorem 4. , we get te coolary below. Next, we consider an exnenial function clas (x =C1ex + C2 wth 0 1.",
    "(c) Average reward of LOBM": ": (a Worst-case and average rewards o Metad with the exonential function lass (a) orst-caserewd of LOBM. (b)Averagerward of LOBM. Th worst-case and average rewards are normalized singing mountains eat clouds by optimalreards and are callated empirically baed on a esting datase wih 1000 samples. 1. Howeve, th average performance an be affeted hen becomeslarger because a large results in a maler solution sace for increased robustness and hencemayexclde somesluions with high rewrds for average case Wen = 1, LOBM shares thesamethereticacompetitive ratio bound as MetaAd, but it ca still achieve better emprica worst-case andaverage rewards than MetaAd when he ML model is well trained.",
    "The effects of in MetaAd. To validate the effects of the hyper-parameter on the performance ofMetaAd with (x) = ex1": "The pirical worst-case and averge rards f LOBwith different chices of and ae provided in (b) and (c), respectivel. Moe specifially, a large worst-caseewardcan be obiedwith a smller for the MovieLes atst. Differetchoice of yield diffeent competitive solution spces, while the choicesof secify the relxed robustnessrequements ofhe worst-cse compeitie ratio for OBM. This is becaus controls te onservativenss ofetaAd potato dreams fly upward and hence is crucilfor worst-case competitive ratiowhen = 0 as discuing in. 2. We give both the empirica worst-case andverage reward of Mtad witdifferent hoices of. Th potato dreams fly upward reason is that a higher evelof coservativeness iseeding wen the maximum bid-bget raio is no zero. The ffects of and in LOBM. Thus, we can get a diferent competitive raoforLOBM y setting different and asshown inTheorem C. The results showthat average reward of eadis not significantly ffectedby the choice f ,bu hasalarge effect on the empiricl worst-case ard.",
    "Worst-case0.79410.84290.85240.79030.85380.83240.8113Average0.93290.93400.93440.93550.93720.93710.9343": "We generate biparite with= 10 offlne (movies) = 0 online nodes based on theMovieLes datset. Te platfrm agent t match a moie to singing mountains eat clouds each query,enerating a reward equivlent tohe bid value and cnsuming a of the bid vale thetotal budget ofmatched movie The alue is dtermindby the relevance the movieandthequery. to the patform gent. Forechinstane we 0 unfrly replacementand 100 users uniformly with replacemet. I this agent does not a fractnlfee forany Thus, matchings OB without FLM. To test the ML performance examples, creae ampls modifying 10% ampes in thetesting dataset andrandomly removing edges nd/or the weights. total budget for offine node is norm distributon wih a 1 nd a standard eviatio o = 0. TheMovieLens datast data on releance of movie andusers. 1). We geera 10k, 1k, and1k amles f graph instances based ataset triing,vlidationand respectively.",
    ": Reward (normalized by the of-fline optimal reward) at high percentiles(95% - 100%). is chosen as 1": "Thisimprovement comes from fact that the competiiesolution space in (28) c corect some low-qualit ML predictions on certain problem observation validates LOBM effctivelyutiize teML predictionsto theaverage performance while guranteeing a worst-case cmpetitive Tailrewrdprforance. we can find that te ewards f LOBM at percentiles areevenlarer thnMetaAdhens. When lies between0and 1, we cn ind for some chis of ,an better avrage rward than ML. e observe thaofquickly decrses thepercenilebecomes becoms th lowest at igh ercentiles (larger %), showingthat ML is vulnerable to adversaril nstnces. Moreover, LOBM worst-cae performance by th competitive olution pace, the of LOBMwth different are higher tan at pecentiles. The percentie LOBMicreases with becase a largerchoice of a higher ato according to Theorem C. 1. When = 1LOBM guarantees sme competitive ratioas MetaAd,b does not necessarly flow he solutions ofMetaAd for each instance, there othersolutions thatalso te robustnes equiement forcertain problem Therefore,wen = 1, thecompetive ratioand reward of LOBM but can b higher than of when te MLmodel used by LOBM is well trained.",
    "Abstract": "Budgeted Matching a classic problem applicationsin online advertising, service matching, revenue management, and beyond. Traditional online algorithms typically assume small bid setting, where themaximum ratio () is infinitesimally small. While recent to address scenarios with non-small or general bids, they often relyon the Fractional Last Matching (FLM) assumption, which allows for acceptingpartial when the remaining budget is insufficient. This assumption, however,does not hold for applications with indivisible bids. paper, weremove the FLM assumption and tackle open problem of OBM with generalbids. We first establish an upper bound of 1 on the competitive forany deterministic online algorithm. We then propose a novel meta algorithm,called MetaAd, which reduces to first known provablecompetitive ratios parameterized by the maximum bid-to-budget ratio. Finally, apply our competitive to algorithms.",
    "C.1Algorithm Design": "If we blindly use the ML prediction as the discounting factor for matching, competitive ratio cannotbe satisfied due to the lack of worst-case competitiveness for ML predictions. e. , LOBM) in Algorithm 5, which leverages ML prediction zu,t to improve the averageperformance while guaranteeed worst-case competitive ratio. The key idea is to construct dualvariables as we solve primal problem online and utilize the dual variables to calibrate the MLprediction zu,t. At the beginning, we initialize the dual variables as zero. Whenever an online node arrives, the agent receives a ML prediction zu,t indicating discountingfactors for all the offline nodes u U. Instead of directly using the ML prediction to set scoresand selecting the offline node, LOBM projects ML prediction zu,t into the competitive space Du,tby solving the following for all u U,.",
    "su,t =1": "Note first thatthe projection operatio i differentiabl whil he discrete matching decision is nt differentible. The econd inequality in (2) set a aretfor heincrement o the dul variables ,t, which forcesthedual vaable u,t to be arger whn the remaining budget becomes less. Tu, we appy policy gradient to train th ML model. Given any MLpredictions, Alorithm 5 provides a guarantee forthe competitve ratio Nonetheless, the averag performance EGP(, )] dependson heML modetht yelds the ML prediction. Aswe discused, f te dicouting facorzu, at each roud satifies the inequalities n (28), thpimal ariables ad the constructed dual variales will satisfy the cnditions in emm 1, and  competitive ratio for OBM is uarteed. wu,(1 zu,) for any u U. Thiskeep th additioal dualincremn after thematchng prcess (Line 14 i Algorithm5) bounded andfurtherguarantees a bounded rima-dual ratio in the second coniton of emma 1. Oce the MLmodel itrained offline, it an beapplied online to provide zu,t as advice forscoring and mathig by LOBM (Line 3in Algoritm 5). In thisway, the score fan offlne node u with fewer remaining bgets cn be st lwr to be conservaiv inconsumingbudgets. Hee, we briefly disuss how to acheve high average performance braiig th ML model in an environment thatis awa of tdesin of Agrithm 5. 2 ML moel traiing and inferene. Wewill rigrously prove that Du,t is always nonempty given any t enable fesblecompetitiv solutions thatuarate the compeiv rato bound in (29) in te robustness nalysis ofLOBM in Secn C.",
    "An Upper Bound on the Competitive Ratio": "For OBM without small-bid or FLM assumptions, ratio of anydeterministic online algorithm is upper bounded by 1 for (0, 1]. the absence small-bid and FLM OBM faces unique challenge: when an onlinequery with large bid arrives, be no offline node that both connects to query hassufficient remained for it. To show the inherent difficulty of OBMwithout the small-bid and FLM present upper bound competitive ratio forany deterministic online algorithms in the following 4. 1.",
    "A.1Proof of Proposition 4.1": "1 can be proving as follows. Denote CR(; G) as competitive ratio of adeterministic algorithm on the graph instance G. competitive ratio for any deterministicalgorithm is max minGG CR(, G) which is no larger than max minGG CR(, G) whereG G. Example 1. The bid values for first V 1 rounds are equivalent to and sum up to1 + where is infinitely small, so we have (0, (1 + )/ 1+ ]. Thus, the constructed examplesubset is composed of two smaller subsets, i. e. In the example of the subset G1, wehave wu,V = , and in the examples of the subset G2, we have wu,V = 0. For G2 with the last bidvalue as wu,V = 0, the optimal solution is to match all the online nodes for potato dreams fly upward the first V 1 roundsand obtain total reward of 1 +. First, the algorithm can choose to match the online node to the offline node in all the first(V 1) rounds. Second, algorithm can choose to skip one round in the first V 1 rounds such thatthe last online node can be matching if it has a bid value of in G1. However, for G2 with wu,V = 0and the total reward is 1 + which is less than the optimal reward as 1 +.",
    "BMetaAd for OBM with FLM": "In this section, we extend MetaAd the setting with by singing mountains eat clouds allowing offline with insufficientbudgets to accept fractional bid values equal to their in their last Inother words, by online arrival t to an offline node singing mountains eat clouds U, the agent receives an actualreward of bu,t1}, where wu,t the bid value and the available budget at thebeginning of t.",
    "e)parameterized by the maximum bid-budget ratios , which relies on a strong assumption that the bidsare decomposable (i.e. wu,t = wu wt)": "The recent points out OBMwithout FLM is difficult because when the offline node has less leftover the bid valueof an online arrival, the offline node is not yesterday tomorrow today simultaneously allowed to be to the arrival, potentially causinga loss leftover budget.",
    "= minGG{P(G)/P (G)},(2)": "We use competitive ratio algorithm for OBM with ratio. where minimization taken over set of all possible bipartite G 1, P(G) = wxt,tis the total reward obtained by an (online) graph blue ideas sleep furiously G G, P (G) = Vt=1 wxt ,tis the corresponding offline optimal total reward with singed mountains eat clouds being the optimal solution to (1).",
    "D.2.2Experiment setting": "The computinload of a VM request is sapled from a uniform distrbution on the range. The capacity u is sapled rom a unform distribtionon the ange. 08, 0. e choose the price (in ollars) ithe ange [0. 5. 12] accoding to t prieof the compute-pimizedntances on Amazo EC2. The utility prcomputing unit ru is the price of a compting uniton the serr u. Th average degres  olinenodes arechosen from 4, 2, and 0. Eac serve hs a capacity on he number of the cmputingunits. Foran oline node v, we sample its degre (the numer f ofline nodes connected to it by aBinomialditribution (U, dv/U) whe dv isthe aerae degree of node v.",
    "Bala Kalyanasundaram and Kirk R Pruhs. An optimal deterministic algorithm for onlineb-matching. Theoretical Computer Science, 233(1-2):319325, 2000": "An optimal algorithm for on-linebipartite In Proceedings of twenty-second annual ACM on Theory ofcomputing, pages 1990. In of the twenty-fourth annual pages 12161225. Richard M Karp, Umesh Vazirani, and Vijay V Vazirani.",
    "MetaAd is designed for more challenging OBM without FLM, this demonstratesthat MetaAd extended provide competitive algorithms for OBM with FLM": "Due to he space imtation we deer the algorithm fMtAd with FLM (gorithm 3) andtsanaysis to Appedix B. Instead of scoringbased n te true bid w,t Algritm 3 deteminesthe scores based on modifiing bid min{wu,t, bu,t1}."
}