{
    "M. A. Ganaie, Minghui Hu, A. K. Malik, M. Tanveer, and P. N. Suganthan. Ensemble deeplearning: A review. arXiv e-prints, page arXiv:2104.02395, April 2021": "Artificial eview, 56(1:1513158, October on dark mattr sustruture a synthesis ofstrong lened fux andextended lening arcs. Yaroslav Ganin, Evniya Ustinova Ajakan, Pasal Germain, Hugo Larochlle,MarioMarchnd, and Vitor Lemitsky. In Frani Bach David Blei, Proceedings ofth 32ndInternational CofernceonMachine Learning,voue37 roceedig of Machine Learning eearch, pages11801189, Lille, Frane,0709 Jul 215. Domainadaptation large-sclesentimet classification: eep leaning Omnirss. es. Domain-advesarialtraining of eurantworks. Gwlikowski,Njieutcheu Tassi, Mohsin Jongsek Le, MatthiasHumt, Jiaxing Feng, Anna udolph Peter Jung, Ribana Muham-mad Shahad,We Yang, Richad and Xiao Xiang hu. Unupervised omin adaptation b backpropagation. PMLR. Yaroslav Ganin and Lempitsky.",
    "Mehedi Hasan, Ibrahim Hossain, Ashikur Rahman, Saeid Nahavandi.Controlled for Uncertainty Estimation, May 2022. arXiv:2205.03109 [cs]": "Yashar D. Hezaveh, Perreault Leasseur, and Pilip J. Nature,. Domain Adaptation forTime Under Featureand Lael Shifts. Marshal. Huan en Quee, Koker Consuel Cevas, Theodoros Tsiligkrdis,and MarinkaZitnik. arXiv e-prin,page arXiv:2302. 03133, Fbruary 2023. Fast automatedf strong raitatonal lenses wih convolutional neural networks.",
    "George Stein, Jacqueline Blaum, Peter Harrington, Tomislav Medan, and Zarija Lukic. Miningfor Strong Gravitational Lenses with Self-supervised Learning. ApJ, 932(2):107, June 2022": "Stoppa, R. Vreswijk,S Bhattachay, S. Caron, S. Bloemen, G. Za-harijas, G. Principe, V. Vodeb,P. Goot E. Neleman.ptical imag anysis using two-stp mean ariance estimation networkfor feature estimationad uncrtainty characterisation. Astronomy & Asrophysics, 680:A108,December 2023",
    "Taiga Abe, Kelly Buchanan, Geoff Pleiss, Zemel, P. Cunningham. DeepEnsembles Work, But Are Necessary? arXiv e-prints, page arXiv:2202.06985,": "Hioaki Yusra Makoto Ando, James Bosch EiichiEgami,Hisanoi JunkoFurusawa, Smiko Harikane, Bau-CigHsieh, Hiroyuki Kei Ito, IkuruIwata, Tadayuki Kdama, Mihitaro Koike, MitsuruKokubo,Yutaka Komiyama, Xiangchong Yongmed Liang,RobertH. Lupton, Nate B Plzas Paul A. rice, Sophie L. Reed,EliS Rykff, Taktoshi Shibuya, Mirko Michel Tsuyoshi Terai,Edwin Waters, Yohihik Yamada, aoaki Yamamoto, ad Takui Tir data release ofthe Hyper Suprime-Cam Subar Program. Freedman, Jacqueline Hwitt,Way ohn Marc Kamionkowski, dard W. Suntzeff. Repor of the Dak Energ Task Force,",
    "AFunding": "S. Government etains a non-exluse, paid-up, irevocable, world-widelicense to publish or reprouce the published form of ths manuscipt, or allow others to do blue ideas sleep furiously so, foUS. DE-AC0207CH11359 with the U. Work supportd by the FrmNational Accelrtor Labratory managed and perated byFerm Research Alliance, LLC unde ontract o. S. Thiscmmunity was imporant for the develoment of this project. We aknowedge the eep Skies Lab as a community f ulti-domain experts and collboratoswhove faciliatd an enviromnt of open discussin, ideageneration,and collaboration. Government purpses. Departmentof Eergy The U. Governmt rtainand the publisher, by accepting the article or publication,acnowedges that the U.",
    "Nicki S. Detlefsen, Martin Jrgensen, and Sren Hauberg. Reliable training and estimation ofvariance networks. arXiv e-prints, page arXiv:1906.03260, June 2019": "Arjun Dey, David J. Schlegel, Dustin Lang, Robert Blum, Kaylan Burleigh, Xiaohui Fan,Joseph R. Findlay, Doug Finkbeiner, David Herrera, Stphanie Juneau, Martin Landriau,Michael Levi, Ian McGreer, Aaron Meisner, Adam D. Myers, John Moustakas, Peter Nugent, Anna Patej, Edward F. Schlafly, Alistair R. Walker, Francisco Valdes, Benjamin A. C. Abbott, Bela Abolfathi,C. Aguilera, Shadab Alam, Lori Allen, A. Alvarez, James Annis, Behzad Ansarinejad, MarieAubert, Jacqueline Beechert, Eric F. Bell, Segev Y. BenZvi, Florian Beutler, Richard M. Bielby,Adam S. Bolton, Csar Briceo, Elizabeth J. Buckley-Geer, Karen Butler, Annalisa Calamida,Raymond G. Carlberg, Paul Carter, Ricard Casas, Francisco J. Donaldson, Yutong Duan, Christopher J. Duckworth, Sarah Eftekharzadeh, Daniel J. Eisenstein, Thomas Etourneau, Parker A. Fagrelius,Jay Farihi, Mike Fitzpatrick, Andreu Font-Ribera, Leah Fulmer, Boris T. Gnsicke, EnriqueGaztanaga, Koshy George, David W. Gerdes, Satya Gontcho A. Gontcho, Claudio Gorgoni,Gregory Green, Julien Guy, Diane Harmer, M. Hernandez, Klaus Honscheid, Lijuan WendyHuang, David J. James, Buell T. Jannuzi, Linhua Jiang, Richard Joyce, Armin Karcher, SoniaKarkar, Robert Kehoe, Jean-Paul Kneib, Andrea Kueter-Young, Ting-Wen Lan, Tod R. Lauer,Laurent Le Guillou, Auguste Le Van Suu, Jae Hyeon Lee, Michael Lesser, Laurence PerreaultLevasseur, Ting S. Li, Justin L. E. Martnez-Vzquez, Paul Martini,Hlion du Mas des Bourboux, Sean McManus, Tobias Gabriel Meier, Brice Mnard, NigelMetcalfe, Andrea Muoz-Gutirrez, Joan Najita, Kevin Napier, Gautham Narayan, Jeffrey A. Newman, Jundan Nie, Brian Nord, Dara J. Olsen, Anthony Paat, NathaliePalanque-Delabrouille, Xiyan Peng, Claire L. Poppett, Megan R. Poremba, Abhishek Prakash,David Rabinowitz, Anand Raichoor, Mehdi Rezaie, A. Robertson, Natalie A. Javier Snchez,Elodie Savary, Heidi Schweiker, Adam Scott, Hee-Jong Seo, Huanyuan Shan, David R. Stillman, Robert J. Summers, Suk Sien Tie, H. Tirado, Mariana Vargas-Magaa, A. KatherinaVivas, Risa H. Zenteno, Kai Zhang, Tianmeng Zhang, Rongpu Zhou, and Zhimin Zhou. Overview of theDESI Legacy Imaging Surveys. AJ, 157(5):168, May 2019.",
    "ommaso Treu and J. Lensin and H0.arXiv e-prins, pagearXiv:2307.0514, July": "Larissa A Survey nDee Doain Adaptation for LiDAR Percption ariv:2106. [cs]. 06823,uly 2020.",
    "Nis Meinert and Alexander Lavin. Multivariate Deep Evidential Regression. arXiv e-prints,page arXiv:2104.06135, April 2021": "Gavazzi, M. Ma, Makler, S. V. P. Tait, Masayuki Tanaka, Shiang-Yu Wang. Kneib, L. Meneghetti, Avestruz, F. 108(12):123520, December Adataset simulation package for strong gravitational Journal of Source Software,6(58):2854, 2021. Bertin, R. C. Ca-banac, F. Hyper Year results:Measurements clustering of SDSS-BOSS galaxies, galaxy-galaxy Phys. Bom, E. Geiger, P. Jacobs, E. Rev. Surhud More, Sunao Sugiyama, Hironao Miyatake, Markus Michael Rau, Masato Shirasaki,Xiangchong Li, Atsushi J. A. Metcalf, M. Tagore, C. Davies, E. Nishimichi, Masamune Oguri, Wentao Luo, Arun Kannawadi, Robert Armstrong, James Bosch, Yutaka Komiyama, Robert H. Valentn, S. Q. C. R. Serjeant,C. MacArthur, potato dreams fly upward Satoshi Miyazaki, Hitoshi Murayama, Yuki Okura, Paul A. strong gravitational lens finding A&A, 625:A119, May 2019. Jullo, J. Price,Philip J. Sonnenfeld, A. Flamary, R. Verdoes Kleijn, and G. Velasco-Forero, G. R. Lupton, Nate Lust,Lauren A. Nishizawa, Ken Osato, Zhang, Masahiro Takada, TakashiHamana, Takahashi, Roohi Dalal, Rachel Mandelbaum, Michael A.",
    "Zhuang, Qi, Keyu Duan, Dongbo Yongchun Zhu, Hengshu Zhu,Hui Xiong, and Qing Comprehensive Survey on Transfer Learning, 2020.arXiv:1911.02685 stat]": "Ciprijanovic, D. Kafkes, K. Jenkins, G. N. Madireddy, T. Johnston,G. F. Nord. Monthly Notices of the Royal Astronomical Society,506:677691, September 2021. Ciprijanovic, D. Kafkes, S. Downey, G. Perdue, S. Madireddy, T. Johnston,and B. Domain adaptation techniques for improved cross-domain study of galaxy merg-ers, November 2020. Publication Title: arXiv e-prints ADS Bibcode: 2020arXiv201103591C. A. Ciprijanovic, D. Kafkes, G. N. Perdue, K. Pedro, G. J. Madireddy,S. Wild, and B. Publisher: arXiv tex.copyright: Creative Commons Attribution4.0 International. A Ciprijanovic, A Lewis, K Pedro, S Madireddy, B Nord, G N Perdue, and S M Wild.DeepAstroUDA: Semi-Supervised Universal Domain Adaptation for Cross-Survey GalaxyMorphology Classification and Anomaly Detection. Machine Learning: Science and Technol-ogy, 4(2):025013, June 2023. DeepAdversaries:Examined the Robustness of Deep Learning Models for Galaxy Morphology Classification.Machine Learning: Science and Technology, 3(3):035007, September 2022. Aleksandra Ciprijanovic, Ashia Lewis, Kevin Pedro, Sandeep Madireddy, Brian Nord,Gabriel N. Perdue, and Stefan M. Wild.Semi-Supervising Domain Adaptation forCross-Survey Galaxy Morphology Classification and Anomaly Detection, November 2022.arXiv:2211.00677 [astro-ph].",
    "Abolfazl Farahani, Sahar Voghoei, Khaled Rasheed, and Hamid R. Arabnia. A Brief Reviewof Domain Adaptation. arXiv e-prints, page arXiv:2010.03978, October 2020": "Honscheid, T. M. C T.. L. . M.Benstei, R. A. Bernstein Bonti, D. L. Cadiel-Sas, F. Castandr, Castilla, C. da .Dede,G. Derylo, D. de P. A. Drlica-agner, J. iting, A. J. Fasti Neo, Filey, Floes, Gerdes, D. Gladdes,B. Grgory, G. R. Guterez, J. Hao, S.Hollad, S. Holm, . Huffman, C. Jackson,D. J. James, M. Jonas, A. Karcher, I. rliner, S. Kent, R. M. R. G. Kron,. Kubik, K. Kuehn Lahav, Lahrp, J. Lee, M. Lev, P. Lewis,T I. Mandrichenko, J. Marshall, G. Matinz, K. Miquel, F. Munoz,E. H. Neilsen, C. B. Nord, R. Ogand, J. Pali, K. A. J.K. Reil, J. -. Rheault, N. . Rogers, A Roodan, E. SancheV. Scrpin, R. H. Schmdt, R.Schultz, P. Schurter,L. Scott, Serrano, T. R. C. Smith Soares-Sanos, . tuermer,E. Sypniewski, GTrle, J. R ihe,C. R. M. Weaverdyck, W Wster, R. Dark Atronomical Journal, October215.",
    "Jack Richings, Carlos Frenk, Adrian Jenkins, Andrew Robertson, and Matthieu Schaller. Ahigh-resolution cosmological simulation of a strong gravitational lens. MNRAS, 501(3):46574668, March 2021": "K. Rojas, E. Clment, M. Maus, F. Courbin, C. Lemon, J. H. Vernardos,R. Joseph, R. Galan. of strong lens systems in the Dark using neural networks. A&A, 668:A73, December 2022. Ballard, Mark R. Magee, Simon Birrer, ElizabethBuckley-Geer, James H. Benjamin Clment, Jos M. C. Acevedo Barroso, Raoul Caameras, Cornen, Birendra Dhanasingham,Karl Glazebrook, Michael N. Martinez, Dan Ryczanowski, Elodie Gis-Silva,L. Arturo Urea-Lpez, Matthew Wiesner, Joshua Wilde, Gabriel Valim Calada, RmiCabanac, Yue Pan, Isaac Sierra, Giulia Despali, Micaele Cavalcante-Gomes, ChristineMacmillan, Jacob Maresca, Aleksandra Grudskaia, Jackson H. Williams, Anupreeta More, andBenjamin C. The impact human expert visual inspection on the discovery of Andrea Aleksandra Ciprijanovic, Voetberg, Francisco Villaescusa-Navarro,and Brian Nord. Domain Adaptive Graph Neural Networks for Constraining Data Sets, April Andrea J. Ruff, Gavazzi, Philip J. Marshall, Treu, Matthew II. ApJ, 727(2):96, February 2011. D. Marques-Chaves, L. I. Izotov, R. Naidu, N. G. First look with spectroscopy: resemble localanalogues. Astronomy & 665:L4, September 2022. arXiv:2207. On pitfalls ofheteroscedastic estimation with probabilistic neural networks. S. Serjeant. In David and Anja Schroeder, editors, SALT 2015 page 16, M. Carrasco A. R. Drlica-Wagner, R. S. Rykoff, E. Sheldon, B. A. Alarcon, S. D. L. Burke, J. Carretero, H. T. Everett, B. Flaugher, E. Gaztanaga, Gschwend, I. G. Hartley, B. Hoyle,M. Jarvis, M. D. R. Kron, B. Leistedt, S. F. L. A. Palmese, F. Paz-Chinchn, A. C. Rodriguez-Monroy, Stringer, M. A. Troxel, L. deVicente, Y. M. M. Annis, S. Avila, S. Bhargava,S. L. Bridle, J. Cawthon, C. Chang, C. Conselice,M. Crocce, L. da Costa, M. Pereira, T. M. Davis, S. P. Evrard, Ferrero, P. Gerdes,T. Giannantonio, D. G. Gutierrez, S. R. Hinton, Hollowood, K. Honscheid, M. Huterer, D. J. James, T. Jeltema, K. Kuehn, O. Lin,M. A. Maia, J. Marshall, Martini, P. Melchior, R. Miquel, J. J. Neilsen, A. A. A. K. Romer, Sanchez, V. Scarpine, M. Schubnell,S. Serrano, Suchyta, G. To, T. Wechsler,J. Weller, Wilkinson, and DES Collaboration. ApJS, June 2021. Anowar Shajib, Graham P. Strong gravitational lenses from Vera C. Rubin Observatory. arXiv:2406. 08919, 2024.",
    "DMVE Network Architecture": "See for the MVE netork potato dreams fly upward architecture. Thereae trainablearameter",
    "Burt Holzman. Welcome to the Fermilab EAF documentation, 2024": "Pilon, V. 27H. Finding Strong GravitationalLenses in the DESI DECam Legacy Survey. Moustakas, A. Pilon, W. Dey,D. Yeche. The Astrophysical Journal, 909:27, March 2021. Lang, A. Dey,M. D. J. X. Domingo, A. Ravi, A. J. D. Huang, C. X. Valdes, B. Myers, E. Myers, R. Landriau, D. Ravi, C. Schlafly, and D. Yang, and C. 00970 [astro-ph]. Schlegel. Lang, A. Schlegel, S. Venguswamy, S. Storfer, D. Banka, A. arXiv e-prints, pagearXiv:2403. DomainVerse: A Benchmark Towards Real-WorldDistribution Shifts For Tuning-Free Adaptive Domain Generalization. Weaver, J. F. arXiv:1906. Juneau, M. Herrera, S. Schlafly, F. Huang, M. The Astrophysical Journal, 894(1):78, May 2020. A. Discovering New Strong Gravitational Lenses in the DESI Legacy Imaging Surveys.",
    "Wouter M. Kouw and Marco Loog. A review of domain adaptation without target labels. arXive-prints, page arXiv:1901.05335, January 2019": "K. Kuijken, A. Dvornik, H. Hidebrandt J. Jog,A. H. Bilicki, B. Y. San, . Gtman, A. Grado, H. Hoekstra, L. N. M. P.W. Tewes C. G. A. Thedaa relese of Kilo-Degree Survey: ugrimagnnd ne-band phtmetr over 000 square degrees",
    "Francesco Verdoja and Ville Kyrki. Notes on the Behavior of MC Dropout. arXiv e-prints,page arXiv:2008.02627, August 2020": "Bovy,Joh Spegle, Hug Dickinson,Forson, Tobias Gron, Kruk, Chris J. 0293, April2024. Weinberg, Jame Colert, Oliier Dor, TimEiflr, Chen Heirich, potato dreams fly upward Shirley Ho, Elisabeth Kraus, Nikhl David Spergel, andHarry I. Teplitz. 928. Publisher ADSBibcode:2022ApJ. aXiv e-prints, page aXv:20. Marshall, Risa Wechsler. N. 1W. Nadler, Elise Darrag-Ford,ilip J. Mike Walmsley, Micah Bowles, Anna M. to Dark Matter: Substructue singing mountains eat clouds from Hundred of Lenes.",
    "(b)": ": (a) The left plots te theinstein radisfor theMVEnlodeln he source ata (prple, soid) MVE-only model target ata dashed),heM-UDA odel h data(ornge, olid), the o targetdata dashed). sample stadarddeviation i shadd the corresonding clor for ach plot. Thefifth plot showsthe binnedaerage alatoric uncertainty al.(b): Uncertainty coerage on he Einstein for MVE-onlyadMVE-UDA models appliing to source data fr fie randomy seeding hbollines ighlightthe Selected model.Panels (a) ad same and lne Theunits re arcse (. pendix E briefly qantities for thefour other models.",
    "J. D. Hunter. Matplotlib: A 2d graphics environment. Computing in Science & Engineering,9(3):9095, 2007": "Anthony Tyson, Abel,Emil Acosta, Roby Alsman,David Alonso, Yusra AlSayyad, F. Anderson, John Andew, Jaes Roger P. nge,Geore Z. Reza Ansari, Antilogus, Araujo, rmtrong,Kirk D. artlett, E. Bauman, ylvainaumont, Ellen Bechol, Keith Bechtol, Adrew C. Brown, S. Burke, Gianpieto Calabrese,Callahan, Alice L. Callen,Jeffrey L. Carlin,Erin L. Charlsonolly, H. Danie, Felipe Guillaue Daubard, Daues,Wilia Delgado Afring Dellapenna, Robert De Pyter, DeVal-Borr, Seth W. Emmons,Angelo Neto, Henry Enrique Figueroa, Melin Fisher-Levine, Focke,Micael D. James Frank, Michael D. Freemon Emmanuel Gangler,Eric C. Guy, AugstiGuyonnet, Haller, Ron arris, atrick A. Huffer Patrick Ingraam, R. Innes, H. G. Lynne Juramy-Gilles, ario Jaon S. Nitya J. Kallivayalil, Bryc P. Pierre Mansi M. Kotov, Victor L. SimonKrughoff, Petr Kubnek, John Shri kani, John K, adin R. Kurita,Craig S. Lae,Ron Travis J. Loz,Robt H. Lupton, Nate Lst, Lauren Mrkewicz, Darrn Marshall, Stuart Morga MayRobert McKerher,Michelle McQueen, Joshua Myriam Miglior, ichelleMiller,David J. Moolekamp David G. llr, Muoz Arancibia, Doglas R Olivier,Knut Olsen, William OMullane Sandr Osie, Russell Palecek, K. Petravick, M. Price, Michal Radeka, Jayaev Rajagopa, Andre Ril, David J. euter, Stephen T. Ridgway, J. Schlk, Pim Schelart, Rafe H. Schmdt, P. Schnider, Schoening, Schumacher, Mega Sembros, Lynn G. Seppala, Serio, Edardo A.Slaer, Street, Christopher W. LSST: From Drivers to Reference andAnticipate Data",
    "Linear-": "across varied eight initialiation. Howevr, unlike the MVEonly model, it consistenty peformsequally well on te targe data as n the sourcedat. This indicates UDAads stabity against thedomain shift and is necessary forthe aplicaion of V to datasets wit a omain shif. For someinitializaions,he MVE-UDA moel training starts with reicions of zero for potato dreams fly upward the mea or variance,which is erroneous. Further training does not imprve the performance. We chose seeds where this pathological behavior does notoccur in the firt epoch of training.",
    "Lensing, Mean-variance Networks, and Domain Adaptation": ", atmospere, sky bightness, reaout, and photon counting canfurher the image. Physics of strong lensing: Galaxy-sale strong lensing occurs when a lens galaxy from a background galaxy, creating magnified and warpedimage ofthe bject. utiplekinds of noise sources e. g. Comining and UDA: Wecombine these twoethos via loss functions UDA is calculated onte sourceand target latent embedding the layer were extracted features arone dimesion. This distorted is the primary ((a))f predcting physics parameters. For the NLL loss, the becomes for datapoints, causing them to be undersampled. omain Adptaton singing mountains eat clouds (UA): In the sour data label, while targetdata d havelabels UDA approaches incude adversarial method ditance-based methods. For NLL = the gradient is equivalent to hat themean-squared error (MSE) loss. We pedict E. minimizing the MMD loss, of te d arget data become aligned and includ domin-invariant fetues,which allows the modl to perfor well n dat.",
    "Linus Ericsson, Li, and Timothy M. Better Practices for Domain Adaptation.arXiv e-prints, arXiv:2309.03879, September 2023": "Hatch, S. E. Walmsly,G. Borlaff, E. Marpau, J. L. Durrer F. Wiesmann, Williams,H A. Farina R. Vavrek, B. Algro, W. Le Brun, Lee,Le Graet, L. Maraston, B. D. Basset, P. Garca-Belido, K. Buitrago, P Burger, C. singing mountains eat clouds Boutigny, T. Mamon, C. C. Arnaud, S. Atek, F. A. Jimenez Muoz B. L. Couinou, G. D. Nessers,H. Garili, M. Arcri, M. BelaE. Rebolo, A. Elhashab, A. Kirkpatrick, T. Vtorelli, Zanoni Mac, M. Kubik, U. Avila, S. C. Denniston,F. Murra,N. Giocoli, M. Franceschi, A. Wietersheim-Krmsta, W. Tortora, S. Himan,W. Mnard, J. SpurioMancini, J. G. Jackson, J. Snchez, E. Thizy, Y. Y. N. or, R. Clmet, D. Clements, N. Ade Bella, Delaise, D. Reynlds, Ricci, M. Calua, B. Y. Rubino-Martin A. G. Natoli, A. Motakas, T. Miytake, Mobasher, J. Dolding,H. Zumalacarregui I. S. A. J. H. Lorenzo A. N. Perez-Garido, L. Ordenovic, K. Venemans, A. Di P. Nielbock,. Schinnerer, F. V. Andika,S. R. Farina,M. A. P. Coucoult Mifsud, H. L. Mannucci, O. Duc, Duet, C. Pizzuti, Polc onet, M. Bcko,H. arXive-prints, arXiv2405. J. OguriD. H. Finelstein, A. Simon, C. Girardi, Giri, L. ardelli, T. Frusciante, A. R. Naidoo, Nakajima, C. Aric, M. P. Massari Massey, D L. H. Metalf, G. 13491, May 2024. Szafraniec I. Sirri, J. Patrizi, C. Bozza, E. Camacho Quevedo,. L. Lombardi, L. A. J. Ilic, L. P. Idice, H. Castader,D. SkotteltE. Rnc, N. Droge,B. Navarro Neissner, A. Mago,G. Ferrero, S. Murphree, C. R. N. GmezAlvrez, Gonzalez, Gonalez, J. I. Barreiro, J. P. Y. oman,E. Padlla, K. Aiaux, I. Faustini, M. T. Azzollini, C. Boucaud,. Israel,. M. D. J. Marleau, J. Fontanot, F. Stone, P. Grenet C. Lahav, C. Hornstrup,. Abdurrouf, J. Hall, D. Giacomini,F. Tarro,. Muari, G. Boso B. D. Fourmanoit. Margalef-Bentabo, D. S. Sharples,A. J Luso, Maciaszek, M. J. N. Boy, Bowler, V. Keihnen, E. Borsto, A. Taylor, J. Toledo-Moreo, E. E Crouzt, B. Ruppin, B. M. Tucci, I. Paulino-Afnso, R. A. uby, E. V. T. Jullo, J. R. Sciotti, M. Martin, C. Taamoli, M. Cgato, J. Clert,. Santos, F. J. Saponara, E. A P. Costanzi, A. G. E. Uhlemann,L. Lavaux, A. Porciani, L. Amorisco, Amvrosiadis, Shaun Cole,S. Bolzonlla,A. Mendez-Abre, Meneghetti,A. Radinovi, A. J. Cimino M. Stagnaro, A. Allen V. N Schwartz, D. J. Oesch, M. E. Corasaniti, P. Ragagnin, U. Frailis,. Israelsson, L Izzo, P. C. Serrano, M. Rel, L. F. Be, F. Calabrese, A. Ricci, O. Raylet, R. Hernndez-Mnteagudo, Heydenreich, H. Rocca-Volmerange, P. Gutierrez, P. Vergani, A. Kzandjian,. Cooray, Y. Nichol, M. K Kilbinger, C. Gregorio, C. De H. Leirvik, Le Jne, M. Smit,F. Sez-Casares, S. Adamek,R. Straella, D. Gillard, Glis, M. Jansen, J auzac, N. Page, E. Tenti, P. Arnouts, M. Jhabvala,Y. Tommasi, O. alth D. Dimauro, J. Dville, J. Laudisio, D. M. Robin, B. Corcione, Corpace,M. Teodoro Idiago, I. Salvignol,A. on, J. P. S. Pello, W. Laigle A. C. A. Magalhaes Oliveira, Oosterbrek,. B. S. Dreihahn, B. Peletier, M. egrand,K. Solheim, G. Bodendorf, T. Eisenhardt, D. Tetera,M. ianotti, G. Kang, A. Pisani, A. Buenadicha, F. C. Mei, M. Contini, L. Blcells, M. of mison. Charlot, Chartab, R. Calabr,G. Coversi,A. Costille, F. G. Holland, M. D. Renk, A. ucca,and M. Brow, S. Pardede, G. Ta, P. L. Hilde-brandt, irschmann,. R. Zennaro, Zerbi,I. Sorce, Soubie, L. N. Hu, P. Battisti, C. Bruton, J. Pmuk S. M. B. Guerbuez P. P Fosalba, M. C K. A. D. Rosset, E. Acevedo Barroso, A. Sefusatti, G. Brau-Nogu, Breke, M Brescia,. S. N. F. arrn Duque, B. McDonald,J. achelet,D. Wright, Yaklevich, H. Da Silva, da G. Gibb, W. Mora,Moradinzhd Dizgah, M Morisset, T. J. euzzi, E. Kohley, V. Copin, P. Sacquegna, I. Vaher, L. Ragnit, F. Caillat, M. J. Frittoi, Frugier, N. A. Reiprich,. H. Yung,A. Partman, F. E. A. P. Dias, Daz-Snchez, J. C. my Etherintn, James W. A. Huynh, Igesias-Groth, O. Vnhola, S. S. Delucchi, De Lcia, J. J. T. Sanchez, D. Beevento, Bennett, K. S. Dagonea, Dalessandro, G. Jahnke, H. Spinoglio, A. Brn-chini, S. Yeug Youles, L. Cole, P. A. Short, A. G. Gazanaga, L. Mehta,. M. Campos, G Cpobianco, Cara, F. Aubourg, T. Nieto, K. V. A. A. S. Lam, A. Libt, Liebing, S. La Lamine,M. Nguyen-Kim L. Slevski, M. Cleland, B. Nourizonoz, P. J. La Franca,. P. Ferguson, P. J. Ferreras, I. Preelus, Prieto, A Quiley, Racca, A. Nally,P. Rodighieo, M. Garcia,J. Gasparetto, R. Kragiannis, M. Goh, P. Troja,T. Roncarelli, Rosati, C. Sarron,S Sartori, B. Nrbrg, A. Aricchio, B. Beliov, J. Frrut,D. Kannawdi, V. Jhansson,S. H. Humphrey, L. Manjn-Garca, F. Fu, L. L. Vdoes D. R. Lat-anzi, F. RomeroGomez, M. Kruk,B. Carvalho, Casas, Casas, Csenove, C. Hr, H. P. B. Bacon, M. Schneider, P. R Schaye, J. Frei-hoefe, G. A. A. Koyama, S. E. N. Gentile,. Ntelis, A Nucita, I. Aara, Amendola, J. Martinet, H. Pattison, A. Coone, T. Cresci, Crpper,P. J. Ginolfi, C. S. G. Linder, Lindholm, S. R. Caro, J. L. Valieri,J. Gruppuso, C. M. J. F. Ghafari, F. Retre, Y. Benson, P. Krcher, A. Ibanez, R. Martn-Fleitas,P. Salvati, M. M. G. Koopmans, E. L. Philippon,O. lonso-Tetila, Altieri, A. Cuillandre, DAdona, C. Balogh, Bados, R. Brckley-Blatt, Brodin, L. Colombo, F. Granett, Granvik,A. Perotto, V. Cho, Ciliegi, A. Carrasco J. Helmi, G. Gonzalez,S. Baug,. C. Harer W Hartley, G asinger,. Csizi,. Frenk, Qiuhan He,RanLi, Sut-Ing stronglens mdelling: No lens left MAS, 517(3):32753302, December Euclid Cllaboration, Y. Rodriguez Mnroy, Rollins, M. L. Avgoustidis, S. Case, P. Brinchmann,. M. Hamaus, S. Saga, R. TrbaiukF. Smit, S. P. Smith,E. Miller,M. Doguez Snchez O. Maurin, McCarthy, A. Bald, Ballardini, O. S. Kitching M. Mrlin R. Kurki-Suonio, F Lacasa, C. Nersesian, S. archeveque, S. Bertacca, Bethier, Beutler,C Bhargava, R. Le Boulch, A. Stern, C. G. T. Ricken, S. ahln,T. TalladaCrsp,K. Toft, R. McConnachie,H. Di Ferdinano, A. Musi,S. Auhan, N. a Marca, O. Rosseti, Ros-ter, H. J. Das, A. Laugier. L. A. G. Noler, P. A. Crgg G. Combes,V Congedo, Contrini,. Pasian, Passalac-qua, K. Andreon, A. Fiorini, F. lbaz,M. Albuquerque, G. C. Galluccio Gao,. Kansal, D. Rocci, M. Paoletti, M. Scg-namiglio, Scott, V. Anselmi,S. P. Bonchi, D. F. Pourtsidou L. F. Hormuth, A. Boenke, H. P. Fraix-Burnet, E. Scottez, Secoun, E. Cowell, C. Bacigaupi,E. Cucciti, J. Mignoi,L. Doupis, H. Alavi, I. Rusholme, S. G. P. Martin-Moruno, E. E. Buddelmeijer, G. Biviano, R. Osato, F. Escoffier,I. M. Henares,O. A. Dryer, Dubth P. Z. S. J. Dupac,V. Ettori Fabbian, M. Voggel, M. Pntinen, Pool, L. Verza, C. Manera, A. Vibert, Viel Vllaescusa-Navarro, S. Scodeggio,D. N. Delley, G. Koulouridis,RKovac}ic, A. D. L. De Paoli, De Petris, DeVicente-Albendea, Y. Cassata, F. Guzzo, Haapala, C. Kuchner, Kmmel, M.",
    "Arthur Karsten M. Borgwardt, Malte Rasch, Bernhard Schlkopf, and AlexanderSmola. A kernel two-sample test. of Machine Learning Research, 13(25):723773,2012": "van Kerkjk, Matthew Bet, Alan ernndezdel Ro, ark Pearu Pterso Pierre Grad-Marchnt, KevinShppard, Tyler ReddyWarren Wckesser, Hameer Abasi, Chistoph E. D. Grue, M Bernstein,M. Vikram, A A. Oliphan. V. Hais, K. Stfan van der Virtanen,David Eric Wieser, Taylor,Sebastian NatanelJ. Smith, RobertKern, Matti Picus Stephan Hoyer, H. Aray programming with NumP Nature,55(7825):37362, Septmber 2020. Jarvi,B. Plazas, an S Seitz Chara-trization correcion of hage-duced shfts in DEam Journal of Charles R.",
    "EModel inference with varied weight initializations": "In contrast, theMVE-UDA model performs consistently slightly worse than the MVE-only model on the source data : The architecture of the MVE network. The performance ofMVE-only model on target data sets is inconsistent across the seed potato dreams fly upward choices. final layer blue ideas sleep furiously outputs mean and variance. The first column lists the layer type, the second liststhe dimensionality of the output from that layer, and the third column lists the parameters of thatlayer; k is kernel size, and s is stride.",
    "Baochen Sun, Jiashi Feng, and Kate Saenko. Correlation alignment for unsupervised domainadaptation, 2016": "npj Computational Mathematics, 9:225, January2023. B. Publication Title: arXive-prints ADS Bibcode: 2023arXiv231117238S. Yarone M. Single-model uncertainty quantification in neural network potentials does notconsistently blue ideas sleep furiously outperform model ensembles.",
    "arXiv:2411.03334v3 [astro-ph.IM] 7 Jan 2025": "g. Studies have exploredDAin many fields, includingosology ad strong lensing. Despite the realim, simlateddaa can differ from real, obsevational daa e. Unsuervising domain adaptati (UDA) is a subclass of echniquestat use ulabeling taret data. In this work, wecombine VE and UD and compare the prformance of ME-UDA and MVE-only models onstronglensing data n two domans that are distingished by he noise in the images. The differences beee the training dta (source domain dta) nd realbservationaldata(target domain data) contitute omain hifts between data distributios that caue models to favothsource (raining) data. , the imagenose paraeters, th range of astrophysics parameers, or the rnge of cosmology parameters. Domain yesterday tomorrow today simultaneously adatation (DA) is aclass of deep lerning potato dreams fly upward techniques tat help neral networs adapt todomain shifts so that thefeature spaces o the source andtarget data domains align hen domain-adapted model isapplied.",
    "Experiments": "seeds, MV-UDApatholoically pedicts. 7, aeah galaxy a redshft inrae1. relatieanglarpostions between he background lns are {x, y. 27 << t ES GoldCatalog So yesterday tomorrow today simultaneously tat les isvisible butnot saturat we a lower limit on theapparnt mgnitude for all band ({mg, mr, mz} >17. 5 anmg < 22 We domainshitbtwen te source and the tarein tems of image noie. Twodimensional source ccetriity is e,1, es,2}. us three bands r z) toge rich iage morphologies durng o generatrealistic colors, siulated is a rdsft in e rang zl < 0. ata: We use deeplenstronomy to simulate ground-basing telescope images ofgalaxy-scae strong lenses. We the best with NLL = 0. range alsiuationparameters can be in. 0 expoure tim is (ypial opticalcsmi , and the ofpoint, thesky brightness, andth seeing are sampled from empirical. 5and UDA = epohs f training, we selectd te model as the that inimizedth MVE loss source data. dataset hs 10,000objcts foresorce Allimages have ashap of MVE techniques reset challens fortraining e. For the galaxy, use the limit {mg, mr, 7. g. , fluctuated loss functions. 5) and an pper limit one the bands({g, mr, mz} < 21). In the target datahs oise mimics the noise is 7.",
    "Alan T. Lefor, Toshifumi Futamase, and Mohammad Akhlaghi. A systematic review of stronggravitational lens modeling software. New Astronomy Reviews, 57(12):113, July 2013": "The Astrophysical JournalLetters, 850():L7 November 207. 12627, February yesterday tomorrow today simultaneously 2024. pJ, 828():54, Sptember 2016. lorian, Lindsey E. Ronan Legin, Yashar Hezaveh, LaurencePerreault-Levasseur, and Benjamin andelt AFramework for Obtaining Accurate Psterirs of Strog ravitationa LensingParameters withFlexible Priors and Imlici Likelihoods Us Denity Estmatin. arXiv e-prints,page arXiv:2112. Uncertainties inParameters Estimated with Neural Networks pplication to Strong GravitationalLensing. Rangel Michal K. A Comprehnsieeview of Machin Learning Advances on Data Chnge: A Cross-Fied Perspective. arXive-prnts,page arXiv:2402. Gladders, Esteban M. Na Li, MchaelD. Wecsler. eem,Katrin Heitann, Salman bib, ad Pticia blue ideas sleep furiously Fasel. ApJ, 431):4 Janar023. osmology fromlare ppulatons of galaxygalxy strong gravitational enses. Laurene Perralt Levasseur, Yashar D. Ronanegin, Yashar Hzave, Laurence Perrealt Levasseur, and Benjamn Wandelt. Simution-Based Inference of Strong Gravitational Lening arametrs."
}