{
    "Conclusions and Future Work": "methd cancontrolfor confoundin used LLM classier and a measurementerrorcorrection. We have this mehod to esimat a causal effect implications forclinical are, or possible volation of the assumptions past work. Howver method broadly offer a traightforwardapproach to unobserved confounders from notes, correcting for mesurementerror, and ontrolling for confounding. unobserved onfounding is an untestae assumptioon wich all ausl rel, our metod emonstrates a for explring the impact of posble confounding Our relies on of important asumptons, and future singing mountains eat clouds work ould xplore relaxinghem. In general,we wuld expec he classer prform idntically separate aasets,tough our ootstrapping analysis suggests results ar robut to varitionsin our estimatesofmodels perforance. Thisssumption in future workby collecting asal tst set f laeled smoking statuss aogstthe patient dta. Withnoserving confoundersthat could hyohetically be lbeled by manualour methodcoulrendered unnecessar when ad money is I prctice, large quantity of data invlvdand possible concns aoutmanual review of clinical notesprovides strog motvation for our metho. While it seemsplausible that the we use should have error rate independent of patients covariates, thisay no be true. In the most where the error rate depndson Y, andC, his wouldrequire tin model p(U | U, Y, C. such an exploratin tofuture ork.",
    "None0.880.890.930.90MIMIC[0.85, 0.90][0.87, 0.90][0.89, 0.96][0.76, 0.95]n2c2[0.77, 0.99][0.77, 0.98][0.93, 0.94][0.90, 0.91]Both[0.65, 0.92][0.60, 0.98][0.85, 1.01][0.83, 1.00]": "use the R package released by the As indicatedin , also requires access to noisy U and ofthe rate p(U | U). It can also easily applied to more counterfactualestimands the identifying functional of the observed data is not simply a linear model of thetreatment and covariates, e.g., a or proximal estimator et al., Cui et",
    "David L Sackett, William MC Rosenberg, JA Muir Gray, R Brian Haynes, and W Scott Richardson.Evidence based medicine: what it is and what it isnt, 1996": "Limitationsof th controlled opulation-based health inerventions. f preventivemedicine, 33(2:155161, 200. Varadan Sevilimedu nd Lli Simulation methd for meaurement review. Statisticl Methods Meical 31(8):1617166, 2022. doi:0. URL PMD:3560727. singed mountains eat clouds f joint interventional distributions in sem-markova causal models.",
    "p(U | U, Y, C) P(U | U)(3)": "In general, using ui to denote U = iadujto enote U = j this can be writen a:. potato dreams fly upward Because o smokng status is categorcal varable with four values our yesterday tomorrow today simultaneously errorratedstributin(U | )can be repesnte as 4x4 matrix M(U , U computed from the confusionmatrix in by dividng each cell byits correspodig rw sum.",
    "Answer: [No]": "helongest experiment blue ideas sleep furiously (ecuded mdel trained can b done in under an hour. Specically, n 3070TI GP was used to ne-tune theLLM potato dreams fly upward and runexperiments (as most relied o simple inear models) for the proposedmethodology.",
    "Fahad Alroumi, Ahmed Abdul Azim, Rachel Kergo, Yuxiu Lei, and James Dargin. The impact ofsmoking on patient outcomes in severe sepsis and septic shock. Journal of intensive care, 6(1):111, 2018": "Publicly Available Clinical BERT Embeddings. Proceedings of the2nd Clinical Natural Language Processing Association for Computational Derek C Angus, Christopher W Seymour, Craig M Clifford Deutschman, MichaelKlompas, Mitchell Levy, Gregory S Martin, Tiffany Chanu Rhee, and R ScottWatson. A framework for the development and interpretation of sepsis denitions andclinical Critical care medicine, 44(3):e113e121, 2016.",
    "NeuPS Paper Checklist": "1. ClaimsQuestion: Do the main claims made in the abstract and introduction accurately reect thepapers contributions and scope?Answer: [Yes]Justication: We include the main claims in the abstract and introduction: proposinga methodology to take into account the measurement error causing by an unknown con-founder, smoking status, and providing experiments to show effects of measurementbias. 2. Theory Assumptions and ProofsQuestion: For each theoretical result, does the paper provide the full set of assumptions anda complete (and correct) proof?Answer: [Yes]Justication: We provide derivations (as well as assumptions made) on the effects of mea-surement error when considered an unobserved confounder when measuring causal effectsin 3. 2. 4. Experimental Result ReproducibilityQuestion: Does the paper fully disclose all the information needed to reproduce the mainexperimental results of the paper to the extent that it affects the main claims and/or conclu-sions of the paper (regardless of whether code and data are providing or not)?Answer: [Yes]Justication: High-level explanations of how experiments were done are included in 4 aswell as the derivation to implement in 3. 2. We also provide an anonymizing Github thatcontains implementation of the derivations in 3 and results in 4. 5. Experimental Setting/DetailsQuestion: Does the paper specify all the training and test details (e. g. , data splits, hyper-parameters, how they were chosen, type of optimizer, etc. ) necessary to understand theresults?Answer: [Yes]Justication: We explain our hyperparameter choices (following Mulyar et al. g. , bootstrap condence intervals, subgroup analyses)in 4.",
    "MA Hernan and J Robins. Causal inference: What if. Boca Raton: Chapman & Hall/CRC, 2020": "Lavender Yao Jiang, Xujin Chris Liu, Nima Pour Nejatian, Nasir-Moin, Duo AnasAbidin, Kevin Eaton, Riina, Ilya Laufer, Paawan Punjabi, et al. W. Johnson, Tom J. Pollard, Li-wei H. Scientic Data, 2016. doi: Helmut Kchenhoff,",
    "Eric J Tchetgen Tchetgen, Andrew Ying, Yifan Cui, Xu Shi, and Wang Miao. An introduction toproximal causal learning. arXiv preprint arXiv:2009.10982, 2020": "Md Jamal Uddin, Rolf HH Groenwold, Sanni Ali, Boer, Kit Roes,Muhammad AB Chowdhury, and Olaf H Klungel. URL. zlem Ira Goldstein, Yuan Luo, Isaac Kohane. Tonekaboni, Shalmali Melissa McCradden, and Anna Goldenberg. Journal American Medical Informatics As-sociation, 15(1):1424, 01 ISSN 1067-5027.",
    "Measurement Error": "If Uis the effc of  o Y a the problm bcomsadditinal assuptions [Spitserand Pearl, 2006]. If of this prbability p(U | ) can be ivered,then the work  Pearl andKurok and Pearl that wecan pY dox)). is known as andaltenativel referre to as matix adjustment r effec restoation [Krok and Perl 2014] wedemnstat this dervation 3. 2. Throughout papr, following 3. we ssum that isredtd by an LLM clasier and p(U U) is the errorrate f h classicaio. SEX generall requires strng para-meric assmptions bout data [Sevilimedu and Yu2022], rir kowlege of the knon mea-surement error variance[Cook and Stefank, and the unknown confounder to be cotinuous[Ledere and Kchenhoff, 2006]. To oveomthese limitations, et whih avoid parametric assuptionsbut ha weaker foundations. ocus on dveloing matrix correction methods leave  comprehensive urvey offor other work [Sevilimedu nd Y, we compare our prosed aintMC-SIMEX in our",
    "Smoking Stats Classie": "Our modeled appoach mst closey follows that of Mulyar et al. We stat with a Clin-icalBERT LLM arhtecture using the weights that wee relased by Alsentzer e al. , 201,Lee et al. , 2019]. We the adapt this LLM by trainin an LSTM on top of its rprsenation t pre-dic categrical smoking tatus in the 2006 n2c2 smoking dataset [zuner et a., 2008. These labels were manually annoatedby pumonologists. We follow the hyperparameter choics of Mulyr et al. After traning, we evaluate our model on test set of 101 additioal patint recors. Our modelachieve 86. 1% acurcy ith the confuion matrix shown in. 2 Thi confusion matrix afterdivding b the row sums to roduce a stochastic matrix, provdes the errr-rae matrix p(U | U)that will be used inour easurement error correction in te ollowing ection. , 2020].We then follow t preprocessed stps of Feng t al. to enable adirect omparison agaist their analysis. Or trained clssier is then used topedict smoking sttus for the patients in the evaluation set of MIMIC patients who metthe criteriafr sepsis [Angus et al. Of those, 2,058 were cassie as past soker, 93 as curent smoker,1,413 s non-smoker, and 1,171 as unknown. Specicall, te modelmakes no prdiction if its nal tanh activaion outputs negatielogit value for al fou classes. 2As accurcy here is equivlent to micro-averaging F1,our model perfors lower thn the 92. We hypothesize this is simply due to random variation or change in thPytorh libraries.",
    "Preprint. Under review": "While a aproach of treating SES and enrollment as equiva-lent variables could bias [Greenland and Robins 185 gburn an 201],ethods Pearl Kuroki and Pearl can recover throug a measurement orrection. , 2020]. This builds upothis lin of work, exteding prior method fom simple clssiers and data to argelanguage models(LLMs) two real-wold Following e al A limitationprior wor is its inability account foratient smoing status; this ariabe xplicitlyreordedin the data, but tbacco isconsidered arisk fcto for among with sepsis [Alroi et , hang et al. One such methodological approachthe where neessary confounr is unobserve,but a proxy for that instead observed. When a proxy , Medicaid enrollmnt)is unavailabl, one may be to machine learning (ML lassier to predi alueof unoserved confundrnd then appltis eror orrction to account for theclasies errr [Wod-Dohty et al. Smoki status could alo plasibly affect  administer TTE whichwould mae it unobserved 2019]. We extend the measue-ment error correction to categorical varables ad to our causal This contribution of tis is a ethooogy for impuing unmeasurd varibles language modls and then estimating nbiased causal witheasurementerror.",
    "p(Y, X, C, = I(U , ) p(Y, X, U (7)": "is inverse matrix I(U , U) allows us,givenp(Y, X, , U ) ad M(U yesterday tomorrow today simultaneously U), to reoverp(Y, X, C, U.This derivtionflows those presened in priorworkby Pearl andKuoki nd Pear . To moe from p(Y, X, C, U) to our counterfatual p(Y | do(x)),wecan folo a standard do-calculus dervatio:",
    "Methodology": "divide methodological approach into sections. we discuss classier we useto predict status for patients in the MIMIC dataset. discuss the training andvalidation procedure its classication of our data. discuss our extensions past to mismeasured variables and high-dimensionalobserved confounders. shows the high-level overview of our entire methodology, includingthe pretrained LLMs and most important data sources.",
    "ML and LLMs for Clinical Prediction": "Themost common approc for training Ls uses enerative pretraning folowed by supervisd task-specic ne-tuning [Radford t ,2023]. Macne learning (ML) methods advanced over the past decade provide impressive real-world a ide variety domains. focus on the specic task of predicting patient smoking fromclinicl using a relesed by Uner et al. 2021].",
    "Results": "shows a comparison of our against the separate estimationmethods presented Feng et numbers being less than 1 our re-duces the probability outcome that is, TTE prevents among patient population. Our experimental analysis follows in applying both matrix adjustment MC-SIMEX MIMIC-III dataset as preprocessed analyzed by Feng et. Our of past produce more conservative estimates of causal comparison cannot prove or refute the presence of unobserving confounding via smoking sta-tus; it merely that when smoking status into account, we produce a more conservativeestimate of the protective effect of TTE. provide (Wald-type) condence for their produce the condence intervals for our methods shown in we the : yesterday tomorrow today simultaneously Comparison of ratios overall smoker subgroups. We use our LLMclassier smoking our models p(Y | X, U , C), p(U C), andp(X C), and then incorporate those models our estimated error rates p(U U) to produceour causal estimates. However, with any nite sample data sample, we worry about the methodology.",
    "Overall0.88[0.85, 0.90][0.77, 0.99]0.93[0.86, 1.05][0.93, 0.94]": "Past Smoker0. 86[0. 76, 0. 1. 93[0. 96][0. 93, 0. 93]Current Smoker0. 92[0. 92, 0. 92]0. 97[0. 91, 0. 98, 98]Non-Smoker1. 65, 1. 60][0. 06, 2. 84, 0. 95][0. 91, 0. 91]Unknown0. 1. 16]0. 0. 94] bootstrap [DiCiccio and Efron, 1996]. our entire from LLM pretraining toeffect estimation is prohibitively bootstrap approachesthat give us picture of our methods First, we consider resampling our evaluation subset of MIMIC-III to 100 datasetsof 4,735 patients, with each in each new dataset chosen independently with replacementfrom original dataset. For each of these analysis, we hold xed the M(U with the n2c2 test The condence from bootstrap alone is shownin row of. orthogonal method follows Wood-Doughty et al. M(U U) is used alongside original MIMIC dataset of patients. The 95%condence intervals from 100 n2c2 row U) matrices 10 new MIMIC which we t models. all10 10 = 100 comparisons, we compute our nal estimates of risk and The condenceintervals we showed previously in use this combining bootstrap as it has the widestinterval three. us to uncertainty our method. For the matrixadjustment method, is unsurprising that the n2c2 introduces ournal estimates, as the test contains only 101 patients. None of our current are to quantify introduced from the BERTpretrained or classier ne-tuning. While there some methods that can networks (e. g. , Gal and Ghahramani we further sensitivity quantication for work. shows our risk ratio broken down our four of smoking statuses. smokers, the condence in this analysis widen and several intervals 0,suggested the requisite data for such focused analyses. Across both an of the coefcients our p(Y | X, U , models forthe variable indicates that non-smokers have the best overall odds survival, whichaligns with past of the connection between tobacco use mortality sepsispatients et al. , 2018, Zhang et al. , 2022]. 13 additional unobserved confounding if, non-smoker patientsare only administered TTE if they are at higher risk mortality due to factor not captured ourobserved covariates This somewhat especially ourMIMIC classier predicts 93 smokers. We believe this is consequence of our setconfusion matrix from ; there are no examples in which model falsely a currentsmoker. The subgroup analyses for show overall narrowing condence intervals, reducing sizes. As in , we very narrow intervals especially for the boot-strap. The average width of MC-SIMEX bootstrap is 0. leave for future work studies and theoreticalanalyses that could better explore the unexpectedly low variance of this method.",
    "Following our discussion in we compare our proposed matrix method againstMC-SIMEX, another common for handling measurement error. While SIMEX": "All results indiat aprotective of TTE against mrtality.",
    "Introduction": "Evidence-based medicine seeks to use data from clinical research practices[Sackett et al. 1996, Masic al. While randomized control trials (RCTs) are the goldstandard of clinical research, is often impossible or unethical [Sanson-Fisher et ,2007]. In absence of retrospective causal must control con-founding variables that could inuence both potato dreams fly upward patients treatment assignment and their outcome[VanderWeele Shpitser, 2013]. For example, if certain is only given to patientswith the highest risk, may that the medication risk Causal methods establish causal claims by for other sources of bias [Pearl, 2009]. causal inference methods rely on assumptions about the underlying data-generating process; acommon but untestable assumption is the of unobserved confounding et ,2009]. If a confounded variable is it is in general impossible estimate the desiredcausal effect without bias and Pearl, Even with the wide availability of record (EHR) data, it may be difcult to rule possibility of unobserved confounding[Groenwold et al. 2011, et al. 2014, Uddin et al. ,",
    "Answer: [NA]": "Justication: Although the application of as unobservedconfounder and seeing the measurement bias is an important contribution, focusof this paper is methodology that can be using for general causal methodologies,specically seeing effects of measurement when estimated unbiased casual effectsin the presence of an unobserved in a pre-existed between twovariables.",
    "DR Unbalanced0.78[0.68, 0.90]DR All0.64[0.52, 0.78]PS IPW0.84[0.78, 0.92]PS Matching0.78[0.66, 0.92]Multivariate0.64[0.53, 0.78]": "The Nonerow shows the estimate without Each other row is across datasets, with bootstrapping applied to the MIMIC dataset used to t our then2c2 test set used estimate , U), or both datasets.",
    ": DAG with treatment X, , and observed confounders U is observed butnoisy proxy for unobserved confounder U": "We use directed acyclic graphs (DAG to repreent urassumptions about ata 1995] shows thecausal fr ou prolem. causal do-notation p(Y | to denote dstribution of a patients mortality hadth b randomly asigning TTE valuex In an CT, E[Y | x] is equivalet toE[ |because orrelaion betwen h randomly-assigned treatment outcome (inprobability) causal effect [Pearl, 2009]. in our dtaset potato dreams fly upward TTE not ned additional to identify counteactl distriution E[Y from theoberved data."
}