{
    "Stephan R. Sain. Multivariate locally adaptive density Statis-tics & Data Analysis, 2002. ISSN 0167-9473. doi: URL": "Martin, Julio F. Venn, Aura Obreja, Pascale Jablonka, and Andrea V. Macci. doi: 10. 1093/mnras/staa3479. Volker Springel, Simon D. M. Populatinga cluster of galaxies i. results at z = 0. Monthly Notices of the Royal Astronomical Society,328(3):726750, 2001. ISSN 0035-8711. 1046/j. 2001. x. URL Volker Springel, Simon D. M. White, Adrian Jenkins, Carlos S. Nature, 435(7042):629636,06 2005. doi: 10. 1038/nature03597. L. Wang, A. A. Stinson, A. yesterday tomorrow today simultaneously Penzo, X. Keller, andJ. Wadsley. NIHAO project - I. Monthly Notices of theRoyal Astronomical Society, 454:8394, November 2015. doi: 10.",
    "Abstract": "We find that for the task of structurally decomposed simulatedgalaxies into their constituents, our context-agnostic approach has substantialimpact on the diversity and completeness yesterday tomorrow today simultaneously the structures extracted as well ontheir relationship within broader galactic structural dwarfgalaxies, infalling groups, stellar progenitors), stellar shells,galactic bulges, star-formed regions. Their AstroLink, can yesterday tomorrow today simultaneously therefore identify a fuzzy hierarchy of andstatistically-significant fuzzy clusters within any data set whose repre-sentation is subject to changes caused by some underlying process. We demonstrate the of clustering algorithms,AstroLink and FuzzyCat, for powerful tool when studying galaxy and evolution.",
    "The suite of cosmological hydrodynamical simulations": "NIHAO-UHD suite is n resolution suset of the Numerical of Hundred Astronomical Ojects simulati suite which assume cosmologicalparameters he 2015 Planck et al. simulationsuite haveprevously been used o build-up of MWs peanut-shape bulg the stellarbar , infe theMs dark hlo pin , stdy the galax inventory of galaxies , and agemetallicity retion of disk stars thechemical bimodality of dsk stars , abundanes and he orgin of very metal-poor the stellar.",
    "Steffen R. Knollmann and Alexander Knebe. AHF: Amigas Halo Finder. The AstrophysicalJournal Supplement Series, 182(2):608624, June 2009. doi: 10.1088/0067-0049/182/2/608": "Elahi, Peter A. Thomas, Frazer R. Pearce, PeterBehroozi, Hell, Intae Alexnder Knebe, Yao-YuanJulian Onions,Vicente Rodriguez-Gome, Aurel Schneider, Srisawat, and DylanTweed. ISSN URL Yuxi Luy Lu, Meiss K Ness, Tobias Buck, and Christopher Carr blue ideas sleep furiously 0.1093/mnras/stac780. Ness, Tobias Buck, oelC. Sim-ilarites behind high- and low- small intrinsicabundance scatter migratingstars.Carlbg, Richard DSouz, Zhen Yuan, NicolasMartin, an Gullaume F. W. Lewis, A. Dougal Mackey,Tim DavidgeVeonica Arias, Anthny Patrick Ct, Deija Crnojevic, Huxor, helsea Nial David Valls-abaud, Arif Babu, Pauline F R. Michael Thomas,and LawrenceM. ii.structur in the pan-andromeda archaeological yesterday tomorrow today simultaneously surveyhe Journal,868(1):55, 2018.ISSN",
    "Applications to NIHAO-UHD galaxies and comparison with AHF": "We aply the FzzyCat AsroLinkpipelie to tof sxsimulatedgalxi from theNIHO-HD suite detaled Sec. .1. We apply AstroLink ithits defult sttings tothe 6D position-veloctyfeature spce of stellar particlesin snapshot of each galaxy. e the resultant uzzyCa the hyperparametersuchth the resultant exist for 230 Myr eriod of te Sunsorbt within he Milky Way). So s t draw a comprson to curren ethods, also appy AmigasHalo Findr (AHF) to the am set ofgalaxies Sec4.2 for details ode.",
    "Finding clusters from evolving data: FuzzyCat AstroLink": "The zCat AstroLink pipelin operates on a data set whose rpreetatin is subject tochanges fro an undelyng prcess (such as stochastic resampling, temporal-evolution etc.). hersult is an unsupervised machine learning pipeline hat produces a fuzzy erarch of astrophysicaly-and atistically-significant fuzzy clusters at encapsulate the effectsof the underlyng proces(es)implicit ithin n evolving inpu data set. To our knwlege, such a pielne ha not yet existed.",
    "This work is funded by the Carl-Zeiss-Stiftung through the NEXUS program": "I ACM Sigmod record, volume 28, pages 4960.ACM, 158110848.doi: 10.5/3041.30417. Avila, Knebe, Thomas,Peter Paal J. lahi,Jaxin Han, Yao-Yuana, ulin Rodiguez-GomezTwee. URL Behroz,Alexander Knebe, Fazer R. Pearce, ascal Jiain Han, Hani Stuart . nthy Notices of th Roal 454(3):30203029, 10 2015. ISSN 0035-711. URLPeter S. Berooi, Risa H. rocksar phas-space temporal halofinder and velcity offsets ofcluster di: Ness A Macci, adA. Duttn AsrophysicalJournal, March 2019. Notices of th Royal Astronoical Societ, 91(4):54446,February2020. doi: Tbia uck, Melisa K. StarsBehin Bar. TobiasAndrea V. Aaron and Jonas Frings. NIHAOXV: the envionmental pct of the galaxy on satellie ad field dwar galaxies.Mothly of the Astonomicl Society, 483(1):13141341, 219. Mac, Minchev, Aron Dton, an P.Ostriker. Monthly tices of the Royl Astronomical Sociey, Tobias Buck, Ja ybizki, ven Aura Obrja, Andea V. Maci,Chrisoph Pfrommer,Matthas Steinmet, and Meliss Ness. he chalenge matching thobservediveityf chemica aundnce aterns incosmological hydroynamical of th Ryal Astrnomical Society, 508(3):3653387 December 21. of early ase erers on chmical evolution of Milky insightsfrm NIHAO-UH Monthly Notics of RoyalAsronomicalSociety, 523(1):15651576, Juldoi: 10.1093/mnras/std1503. icardo J.Cpello,Davoud Moulavi Arhur imek, and rg ACM Trans. 1556-4681. The oflarge-cale stucturein a univers dominated by old dark matter.T Astrophysil Journal,29:3139, 1985. Muldrew, Onios, and FrazePeare.Monthy of te Royal Astonomical 433(2):1537155,06 2013. ISSN 00358711. doi: 10.1093/mnrs/stt825.",
    "The AstroLink algorithm": "an unsupervised astrophysical clusteringalgorithm that extracts from an arbaily-shped data set that clusters foundare tatistical utliers from nosy fluctuations. These can be hoght of , which itselfcan be tought as a more-robust-to-noise version o Friends-Of-Friends (FOF) alorithm n algorithm used to identify fromcosmological simulations. AstroLik lgorithmperforms five stp; (1) rescaling, local-density estimation, (3dataaggregation, modefitting and identification (5) hierarchy crection. adaptive = 1(defaut), ste 1 rescales the data to have uit remoe effect iffering uitsin the feature 3 tracks and records connected components of data pints form as he of alocaldnsit-weighted graph (klink i data-drive by default) are travrsein dscendig orer ahirarchy o feature-pace overdensites. When appied to simulaed does well the remnants of within thedata. The in more detail the originl sciece paper as well as in theAtroLink ReadTheDocs page.",
    "Conclusion and outlook": "By our pipeline to suite, have shon that it can uccessfully a diverse range of astrophysia structurshat halo finder + tree) methods do not capuring transietand tidally disruptdstrctures that often in convetional analyses. As such, it the to amore galay formation eolution. By overcoming of eisting mthds, our offers user a more and detailed examiationof the hierachcal and ultifaceted ofastropysical structures.",
    "Amigas Halo Finder": "As a comparison to our approach, we apply the halo finder AHF2 to each snapshot of eachsimulated galaxy. Once particles are identified as belonging to such regions,an iterative unbinding procedure is performed to remove all particles whose velocity exceeds theescape velocity at that particles position within the given halo (this assumes a spherically symmetricdensity profile for the halo). The animations, from which the frames in are taken, plot the star particles fromeach AHF halo with a colour that is passed down from its father halo (its most similar progenitorfrom the previous snapshot). In this sense, these animations are the AHF analogue of those producedusing the results of the FuzzyCat AstroLink pipeline.",
    "At is coe, FuzzyCat s verysmilar to AstroLik procedues mimicking steps 2, 3, an 4 reanalogousl performed except that it takes data of cluster as as of": "it makes assuptions about why clusters f these ojects exist nor about how may chngbetween any two clusterigs. These ensure statsta robustness with he correspondinghyperparaetrs effecively playing te AstroLink S-parameer. fuzzy clstes). 2) strong temporal btween snashots produces a tatisticall signal in phsically meaningful cluster acking. The finalfuzzy clsters, after a proesseuivaent to the AtrLink step 3, ust alo theshods (easurd by Jaccardinx) ofntenal similarity (Jmin_intra = The late conditionis by the minStability hyperparameter, we change frm the defultof 0. 5for the n Sec. dta points. Iti easier t seeFuzzyCat an applied a tochasticallychging clusterng yesterday tomorrow today simultaneously (as ec. ch the is calclated fo every of custers the inut, analogoustolog calculated i 2 althugh in FuzzyCat is o to denand klink is effectively fixed at of set. e. 3)as posed a temporally evoving one (as in Sec.",
    "and related work": "To how whygalaxy and its substructuredevelop within cotext of surrouding envirnmetnd of theunderling cosmologicalmodl, astrophysicistssmologiss look to bservational and simulatio data. B comparing these data typs, we can ou cosmologial models as well as our understanding of fomatio and evolution. A approach towards studying fomatio and evolion in the conext simulatddata is a finder (+ mergertree) cde[e.threshold is high then somehaloes may not ad if it too low then some haloes.",
    "multi-shelledtidal debris": ": Frames (code & results here) of clusterings produced by FuzzyCat pipeline (right). e. galaxy_mass. snapshot_number) and look-back time. Each panel 3D projection(axes extend 100 from the galactic and for our approach, a top-down view ofthe galactic disk (i. e. Among structures extracting by our approach galaxies, infallinggroups, stellar streams (and their progenitors), stellar shells, bulges, and star-forming regions. By approaches are not able to find most of structure beyond subsetof which is (or mostly) self-bound this can be seen with the corresponding results from AHF. Our pipeline reveals much more of the information of galaxies, and as such,lends itself powerful tool for galaxy formation and evolution a modern the to the FuzzyCat ReadTheDocs page for coding tutorial of this work as well of the phase-temporal clusterings for each of galaxies by each of the codes.",
    "arXiv:2411.03229v1 [astro-ph.GA] 5 Nov 2024": "can be disregarded in the unbinded procedure. It is for these reasons that weinvestigate the usefulness of a more generalising and context-agnostic approach. As such, these codes will tend not to capture tidallydisrupted groups or fleeted structures resulting from density waves, hydrodynamical effects, orstar-formation events."
}