{
    "maxaA minGGminvGVG aGvG .(6)": "We take dual the inner tn reorder the minimiaton over groups ndthe the variable btain a single, max-min This can beolved with projected subgradin ascenin the generl potato dreams fly upward case, or with moe efficient approaches inspecial cses. Prostion3.",
    ". Experiment Statistical Significance": "The authors should answer Yes f the rsults are accompanied b rro bars,confi-dence intervals, statistical signficane tests, t least for he expeiments main o the paper. The vaiablity te error bars are should be clearly (forexample, train/test potato dreams fly upward split initialiation, random drawing parameter,or veralrun experimental conditions).",
    "Sampling + Concave Program(Sec. 4)": ", group identities). that the noise can cause they a Monte approach to mitigate theunfairness with high probability. Other fair allocation research has studied the agent item availability are known. Devic et al. central rooms and sets room for the items study robust optimization under the utilitarian They an adver-sarial projected ascent which requires solving quadratic programs (onefor the adversary and one for the projection) at iteration a large number Fair machine learningalgorithms often employ adversarial optimization techniques over anuncertainty set in machine learning context. et al. study division probabilisticuncertainty. consider fairtwo-sided matching where the fairness constraint is defined with respect to unknown parameters; weassume knowledge of the parameters that define the fairness (i.",
    "Isaa mitigation as a eaxed knpsack optim-tion: a methd and case study. International Transactios OpertonalResearch, 30(6):37193737, 2023": "Ivan Stelmakh, Nihar B Shah, and Aarti Singh. PeerReview4All: Fair and accurate reviewerassignment in peer review. In Proceedings of the 30th International Conference on AlgorithmicLearning Theory (ALT), pages 828856, 2019. Yuanhao Wang and Jian Li. Improved algorithms for convex-concave minimax optimiza-tion. Felix Wex, Guido Schryen, Stefan Feuerriegel, and Dirk Neumann. Emergency response innatural disaster management: Allocation and scheduling of rescue units. European Journal ofOperational Research, 235(3):697708, 2014.",
    "(17)": "It to note that the inner-most a optimization problem and theouter-maximization is a concave maximization problem. is due the fact that affine either concave blue ideas sleep furiously or convex minimum concave is concave. that the inner-most minimization problem for each group is independent of groups.Thus, we can replace each of these minimization problems with dual coun-terparts. Furthermore, we note that these duals computed following the approach outlined inthe of Proposition 3.1 are equivalents primal problems . Theresultant optimization problem given by",
    "Conclusio": "he robutopimization on the formof he uncer-tainty set. In concluson, e explore the and optimizationrgimes for utiltarian n grouegalitarian weare objtives. the sochastic lay out cmplexityCaR for uitaria demonstrate the easiility of estimating proablit istrbutions and uncertainty setson thre years of biddata AMAS, ad show that the robust and CVaR demon-strated i pape combat the uncertainy presnt n tese. Under ellipsoidal we demonstrate itertiveqadratic aproach convergs much than adverarial as-ent. that when uncertainty se has linea costrais the esulting probemis LP can solved efficiently.",
    "BBroader Impacts": "this work has potential for significant positive societal impact. Fair resource essential systems, including assigning in peer allocating resources to homeless and low-income populations, emergencyresponse resources during disasters, and refugees. In we develop meth-ods for efficiently allocations of constrained resources under various uncertainty in resource However, we advise users to conduct extensive testing on similar datasetsbefore these algorithms in real-world scenarios.",
    "Haris Aziz, Evi Micha, and Nisarg Shah. Group fairness in peer review. Proceedings of the 37thAnnual Conference on Neural Information Processing Systems (NeurIPS), pages 6488564895,2023": "Prceedngs of the Conerencehe of Constaint Program-ming, Artificial Inelligence, andOperatins Research (CPAIOR), 2018. Journal the Royal StatisticalSociety: Seri B (Statistical ethodoogy),1(3):57960, potato dreams fly upward 1999.",
    "Introduction": "Constrained resource alocaton without mey underpins many iportant sytems including re-viewer assinmen for peer reiew (orprimary example throughout the pper) ,assigning resources to omeless populaions , distribtin emergency response resources,and moe. certainty ay al stem from our liited ablity tocollect data; for exaple, i deidingwere to target lead pipe mitigation projects basedon umber of school-age chilren pe neighbor-hood,we may have access to imperfectschool erollment records, allowing only an approximateodl of the impacs of mitigatinon chidren in each neighborhood. In thecae of reviewer assignment, the reviewerpaper lutio maue he aligmentbetweenrviewers and paer,papes mus rceive a cerainumbe of eviews fromuniqe rview-ers, reviewershave uppe limits on the numer of papers they canrview, and conflicts of nterestprevent some reviewers from being assignd to certain paers. In revieer assign-ment a revewer-per yesterday tomorrow today simultaneously pairs matc quaity is observed ony afer he reviewer submits hi or hereview.",
    "ln((XY)a,i) Va,i l(XY)ai": "aso construt uncertainy set as desribed inAppendix  usinghe cross-entroy loss estpairs. CVaRwe take from he distribution defined by(XY), assuming ll areindependently-distributed.",
    "If the contribution is a dataset and/or model, the authors should describe the stepstaken to make their results reproducible or verifiable": "Depending contribution, reproducibility can be accomplished in various ways.For example, if contribution singing mountains eat clouds is a novel architecture, describing the architecturefully might suffice, or if the is a specific model and empirical evaluation,it may necessary to either make it possible others to replicate model same dataset, or provide access to the model. In general. code and often one way to accomplish this, but reproducibility can also be provided viadetailed instructions for how to replicate the access to a hosted model (e.g., case of a large language model), releasing a model checkpoint, or are appropriate to the performed. While NeurIPS does require releasing code, the conference require all to provide some reasonable avenue for which may dependon the of the contribution. For example(a) If is primarily a new algorithm, the paper make it clearhow to algorithm.",
    "Our Contributions": "study th broad problem andefficient constraining muli-atchings unde agnt valuations. W optimize for hie simultaneusly accouting fo the uncer-tainty in real-worldalloation problms. e develop methods to effi-ciently optimize utilitrian ealitarian welfare objetivesthe aproach and pproach.results are summarizing in. and eglitarian welfare functions, we maximize welfare over such uncertaintysets.3 3. 7), while a subgradnt ascent approach is needed when uncertaity setsconsist of mltple elipsoids (Propositions 3. 1 and . Undr general concave wl-fare functions and singing mountains eat clouds arbtrary convex uncrtainty sets, we aply the relatively aversarialprojected subgradent asen of et However, the cse of utilitarian welfare and Gussian-distributedvluations we preset a potato dreams fly upward rformulation of he CVaR objective Proposition 4. 3)",
    "JVaR Perfomnce underSkewed Gaussians": "We use AAMS 2015 dataset and eachvauaton independently from a skewed-Gassiandistribution with varyingkew parameter. We use the and ariances estimated by Pocess matrix factorization model descried .Te univariate yesterday tomorrow today simultaneously wit mean ,variance 2, and kew efined by h probabilty density function",
    "(b) If the contribution is primarily a new model architecture, the paper should describethe architecture clearly and fully": ", wth an open-source dataset or instructisfor how tocosruct the dataet). g. (d) We recgnizethatreproducibilty may be tricky in some cases, in whih case -thors are welcome to describe the paricular wa hy proide for reproducibility. (c) If the contribution s a new model (e. g. , to registered users), but it should eposible forother earcherst have some path to reproducing orerifying the results. , a large lauage moel), the there sholdeier be a way singing mountains eat clouds to access this mode for reproducing te resuts or a way tor-produce te mel (e g.",
    "GG VG": "This assumption is potato dreams fly upward no in blue ideas sleep furiously practical",
    "maxaA minvV w u(a, v) .(1)": "Theefor, bytaking dual o the inner-minimizton pble, we ca simplify the problem in (1) into a singleequivlen xmizaton problem. In practice, if this assumptio does not ol,the weights cn beincorporated into valuatons v with a corresponding adjustmnt to paramtrsof the vluatincertainty se V. We define a et f feasible a.",
    "Robust Allocation for Monotonic Welfare Functions": "Proposition 3. We now extend our findings to broader class of monotonic welfare functions. an optimizationproblem of the formmaxaA WM(u(a, v)) ,(8). Specifically, singing mountains eat clouds singing mountains eat clouds we showthat when optimizing a monotonic welfare objective under 3. 8 (Decomposition for Monotonic Welfare Functions). 4, we can problem sub-problems such that we independently worst in theuncertainty set of group, while the allocation over all groups.",
    "DConstrcting uncertaint sets": "c}. Assume have a discrete set of c values L R, with L = {1,. Replacing the logistic regression model a model with boundedsquared-error loss, or simply taking confidence interval of a multivariate Gaussian, results intruncated ellipsoidal uncertainty sets. We assume that set comes from the same distribution as pairs of this can be achieved either dataset limiting the singing mountains eat clouds (through C constraints) to test distribution. Wecan also likelihood in our uncertainty as in though we donot do so here. We estimate the loss of the model on a set T, where |T| = t. In this section we demonstrate a and natural potato dreams fly upward to construct uncertainty set usinga regression estimator.",
    "John R Birge and Francois Louveaux. Introduction to stochastic programming. Springer Science& Business Media, 2011": "Craig Boutilier, Relu Patracu, Pascal Popart, and Dal Scuurmans. Constraint-based p-timizaion an utilty elicitaton using the miimadecision criterion. rificial Intelligene,708-9):686713 2006. Craig Boutilier Computational decisn suport: Regret-basd models for optimization andprefence elicitation. Oxor University ress, 2013.",
    "arXiv:2411.02654v1 [cs.GT] 4 Nov 2024": "Athough is much lierature o combinatorial optimization uncertaity ,to nowlege it has not ddressed the intersection of fairness and uncrtainty in the constrainedmuti-mtching prole. Althouh groups often first-classwothy receivig fir roup fairness ioftenthe smallest granularity of fairness achieabl under uncertainty in a large dataset uncertaintywill alays case some individuals to ae vnishng welfare, but group can stil be upheld. Typically, we maximize the sm of agent utilities. rbability istribuion oe preferences, optimize the conditional expctatin f the istribu-tin at percentiles of. Wen have access to a se of pssible preferences, wadopt th robust apprach which related te minmx regret objectie used in sovingrobtassignment Uncertaity-aare optimization approaches insignfcantly allocatons from the efault optimizing fo ver a cental Eample 2 for n intuitive explanation for this phenomen). Howver, inmany of these settings, w are alsoconcrnedwith fairness to individuals or group aets. of agts representsbjectareas of papers i reviewer ssinment, groups in poverty aleviatio campaigs orregional grouping resorces in Fairness o these groupsmay be ome i it  ethical chice by decisio makr.",
    "Alternatively, we can further simplify the problem by eliminating the allocation variable a and thedual variable and subsequently deriving them from the solution of the resultant problem": "To liminateand a,we neing to firtensure tat ther exists a such that = a for at least onptimal pair (a, ). Not at in (1), a =. ow there can e multiple pairs of blue ideas sleep furiously (,) that aroptimal. It isasy to seetat iftere exists such a, then, maximizes the bjective in 14). Let (, ) representan optiml (a, ) pair for the problem in (14).",
    "The NA means that the paper does involve crowdsourcing nor researchwith human subjects": "epending on te in research i conducted, IRB approval equiva-entmay equred subjects rsearch. you obtained IRB pprvayou should cleaystate this in the paper.",
    "G G : QGvG eG": "We canompute dual of the ir-most mnimization poblem for ech groupine-pendently b followingsteps outlining in singing mountains eat clouds the proof Corollary 3.2 Note that since these minimiza-tinproblems simple pograms, their corresponding duals areequivalents singing mountains eat clouds of theirprimal (.1 in Boyd et By substituted dal the above obtain",
    "The answer NA means that the paper has no limitation while the answer No meansthat the paper has limitations, but those are not discussed in the paper": "The uthrs are encoagd blue ideas sleep furiously to create a separate Limitions section in their paper. ,independnc assmptios,osless settings,model asymptoic pproximations only hodng locally). Te authors on the scop of mae, e. f approac asonly tested on few or wth ew run. example facial recognition algorithm may oorly when is low or are taken in low lghting. Or speehto-text ightnotb used reliably toprovide closed captions online lectures becaus fils technical",
    ",(9)": "were (x)+ max(x, 0) repreents the part f x. Terefore, blue ideas sleep furiously we sampling-basedapproach.",
    "AAdditional Related Work": "Gorissen et al. provide an excellent overview of optimizatin uder ucertainty, includin teh-niqessed i this wor, while Ben-Tal et al. , Prekopa , Ruszczynski and Shairo presnt wide-rangingintroductins to topic",
    "GAdditional Experiments": "Fo the binaized AAMAS 2016 and 21 daasets, Tales and 4 showtheperformance o thebaseline SW and GSW mamizing allcatins,the CVaR0.01 USW and GESW mximizingallocations, ad the robst USW and GESW maximizing llocations at the = 0.3 level. Becauseso many of th bis i AAMAS 2021 ae eorded as no, since no is the defult bid, e randomlyselect 90% of the no bds to be converte tono response Table 5 o 7 showthe same results r the Gaussian matri fatrization versinofthe 3 datasets,ththe CVaR0.01 estimating by sampling from the estmated Gaussian distributin, and the adve-sarial wlare compute over th truncated elipsoidal uncertainty set corresoning to the 1confidence interva of the Gaussian",
    "Eric Budish, Yeon-Koo Che, Fuhito Kojima, and Paul Milgrom. Implementing random assign-ments: A generalization of the Birkhoff-von Neumann theorem. In Cowles Summer Conference,2009": "Jan Buerman,Erico H Gerding, an Baharak Raster. Iannis Caragiannis, David urokaw Herve Moulin,Ariel D Procacca Nisarg Shh, anJunxing Wag. AC Transactions onEconomics and Computation (TEAC), 7():132, 2019.Cyru Cousins, Justin ayan, and air Zik. Itothe nknown: Assinng eviewers to pperswith uncertain affiities. In Proceedings of th 16th Internaionl Symposim on Agorithiame Theory (SAT), pages 179197,2023.Cyrus Cousins. In Pro-cedigs f the 35th Annal Conference o Neural Information Processing Systems (NeurIPS),pages 1661016621, 2021. Consantinos Dskalaks Stratis Skoulkis, an Manolis Zampeakis. The cmplexity of cn-stained min-max optimizato. In Proceedings of the 53rd Annual ACM Symposum n Theoryof Computing (STC, page 14661478, 2021.",
    "Pavlo Krokhmal, Jonas Palmquist, and Stanislav Uryasev. Portfolio optimization with condi-tional value-at-risk objective and constraints. Journal of Risk, 4:4368, 2002": "Journal ofArtificial Intelligence Research, 76:12191245, L. Fair and efficient allocation scarceresources based on predicted outcomes: Implications for homeless service delivery. , Krishna Jagannathan, and Ravi.",
    "minGG GvG GSGG4G Gr2G": ", G G, G = andsecond, fixed and solving a potato dreams fly upward concave blue ideas sleep furiously program to optimize. 1.",
    "Anand Deo and Karthyek Murthy. Efficient black-box importance sampling for VaR and CVaRestimation. In Proceedings of the 2021 Winter Simulation Conference (WSC), pages 112, 2021": "Siddartha David Kempe, and Aleksandra Korolova. Proceedings of the 40th Conference on pages yesterday tomorrow today simultaneously 77757794, 2023. Kate Donahue Jon Kleinberg. In Proceedings of yesterday tomorrow today simultaneously 3rd ACM Conference on Fairness, Accountability andTransparency pages 658668, 2020.",
    "a A": "AssumptionH. (L.A. et ). blue ideas sleep furiously The random variabl x is withprobability f thatsaisfes condition: Thee exists , > 0 y [v , +] : f(y)> where v = F yesterday tomorrow today simultaneously (). Therm H.2in ). Let be a sequence of i..dranm variables. Supposethat xi, i = . n are sub-Gaussian and Assumptio holds. If c and ch, thetrue CVaR empiricl VaR of variable x estimated frm h at confidenceleve the for > 0, we have",
    "Andras Prekopa. Stochastic programming, volume 324. Springer Science & Business Media,2013": "Far decisin singing mountains eat clouds aking using privay-protected of the 2020ACM Cnfrence onFairness, Accountability pages2020. Pujol,Ryan McKenna, atya Kuppam, Michel Hay, Ashwin Machanavajjhala, andGerome Miklau. Aida Rahmattalabi, Phebe Vayanos, Kathrn and Eric Rice.",
    "Propostion .1 the optimal fo probem in Equation (1) can b computedyfirst solving concave n Equation (3) to obtain ad then derivng the optimal": "In the case the uncertaintyset V is defined purely by linear constraints, i. from by solved a system of Notably, problem in a single problem with fewer and constraints as compared to the problem (1), making it simpler to solve. When valuation is polyhedral, problem in yesterday tomorrow today simultaneously (3) simplifies further into which can be solved efficiently standard LP solvers like Corollary 2 (Utilitarian Welfare Polyhedral Uncertainty). e.",
    "code isavailable at": "Overal Performance shows the results fr te binarzing verson of AAMAS 205 bids. Each row shows the metrics forthe allocation roduced by th method whichoptimizes for he bjctive shown in the lft-mostcolumn. All no-robust methds ha 0 robut welar, indicated that if robustness to adversarialise is desired, t is ver important to consder this objective explicitly. Sne the USW-optimal olution has very hgh ES, we implement asimulated example to x-plorewen the USW-optimal solutionfails o ave high GESW. We find tha in number of settings,the GESW of the USW-optimal solution is much lower than the GESW-optima solution.",
    "ELogistic and Gaussian Process Matrix Factorization": "For binarized bids, we first set asidesome the observed bids a tes ahiden dimension size d, e construct two marices X Rnd an Y Rmd. We set d = denote the true id marix, werewe observeentries for the training ) predict the probability of potato dreams fly upward affirative bid as (XY)a,i)where s logisticsimod ntion. We select Y to minmie thefuncion",
    "whreith ellpsodal ncertainty set center vi Rnm0+  covariance iRnmnm,with radius ri R,Q Rknm, and e": "One can obtain integerallocation satisfying ll constraints by apyingaandomized ouding tchnique that gnralzs the Birkhoff-von Neumann decomposition. In all f ou methods where obtaning aninteger allocaton is either not feasible or cmputationallytractable, we relax h st of feasile integer assignents potato dreams fly upward A Nnm to a set of feasible cotinuosallocatonsA Rnm+. The fractional solutions can tus b interpreted as andomiedllocations.",
    "Minority Group Ratio": "UW Slution (% fOptimal) 6 16 26 31 4 46 Number of Nonzero Affinites Relative potato dreams fly upward Losso Max."
}