{
    "Rafid Mahmood, James Lucas, Jose M Alvarez, Sanja Fidler, and Marc Law. Optimizing data collection formachine learning. Advances in Neural Information Processing Systems, 35:2991529928, 2022": "A meta-analysis of overfitting in machine learning. Rebecca Roelofs, Vaishaal Shankar, Benjamin Sara Hardt, John Miller, andLudwig Schmidt. Advances in Neural InformationProcessing Systems, 32, 2019. Pivot: Iterative visual knowledge for vlms.",
    ". Broader Impacts": "Question: Does the paper discuss both potential positive societal impacts and negativesocietal impacts of the work performed?Answer: [Yes]Justification: Broader societal impacts are discussed in the conclusion.Guidelines: The answer NA means that there is no societal impact of the work performed. If the authors answer NA or No, they should explain why their work has no societalimpact or why the paper does not address societal impact. Examples of negative societal impacts include potential malicious or unintended uses(e.g., disinformation, generating fake profiles, surveillance), fairness considerations(e.g., deployment of technologies that could make decisions that unfairly impact specificgroups), privacy considerations, and security considerations. The conference expects that many papers will be foundational research and not tiedto particular applications, let alone deployments. However, if there is a direct path toany negative applications, the authors should point it out. For example, it is legitimateto point out that an improvement in the quality of generative models could be used to generate deepfakes for disinformation. On the other hand, it is not needed to point outthat a generic algorithm for optimizing neural networks could enable people to trainmodels that generate Deepfakes faster. The authors should consider possible harms that could arise when the technology isbeing used as intended and functioning correctly, harms that could arise when thetechnology is being used as intended but gives incorrect results, and harms followingfrom (intentional or unintentional) misuse of the technology. If there are negative societal impacts, the authors could also discuss possible mitigationstrategies (e.g., gated release of models, providing defenses in addition to attacks,mechanisms for monitoring misuse, mechanisms to monitor how a system learns fromfeedback over time, improving the efficiency and accessibility of ML).",
    ": Ovview of the cometitive pricing prblem for genertive models": "Thus, develoer of a A product must the demand for se-case tass of technologywhen setted a pric This pricing becomes considering the rapidy growing marketplace of competig generative AI models,since companies ust also ensure their poductsdo no unattractiveto uses as soon as acompetitor dvelops a newer and bette model. We argue users minimize ther total cost,meaured by th cost-pr-promptimes of rounds needing for model o produce output; this lead t acomparisn of price-performance copetitienes between AI models. Finally, a user decideswhichmodelsto eachtask. Bothfrm seek to maximize but first firm acts witout knowledge of their competitors price. summarizes the problem setting and key obsrvations include: 1. 2. ontrast, the first-t-market must settheir prices to encourag latecomer set prie ad fewer Under certain model peformance and user demand, the first-to-arketay acquire zero revenue regardless price.",
    "Conclusion": "We study how a company developing a generative AI model can set the price for this technology. First, a single generative AI model is performant on multiple distinctuse-cases that each invite individual respective user demands. However, when considering the competition from alternative models that may bereleased after the price is set, the company faces strict upper bounds on the prices they can set basedon the performance of the companys model relative to the latecomers. In particular, if the relativedifference in performances on the tasks is sufficiently small, then a competitor will always be ableto outprice the company on all tasks. This result reveals that an outsized performance improvementon at least one of the downstream applications of a generative AI model is essential to maximizingrevenue. Finally, we do not include the cost ofdeveloping the generative AI models themselves, but assumes that the fims have already decided tobuild these models. The market dynamics can change when considering how large of a model tobuild, how much resources (e. g. , compute hours) to spend, or even whether to build a generative AImodel. This paper explores the conditions that incentivize firms to develop or deploy thistechnology, e. g. , when firms can obtain revenue.",
    "b a(t)e1(7)": "3 states that problem (5) can be solved by by each of the inner problems startingfrom lowest price range up we at the of revenue function,i. e. , 1/b. Furthermore, for each of the price ranges before this point, the optimal solution is theupper price boundary. Note that 1/b (1)q, i. , there does not exist any t satisfying thecondition, we take of all T problems. Corollary 1. optimal price for B is bounded 1/b (1)q. relationship between 2/1 and a1/(a1 + for firm A. In the blue region, firm Bwill price is competitive on both tasks and firm A will acquire zero revenue. thegreen the maximum price firm A can set has yesterday tomorrow today simultaneously upper (see problem",
    "Introduction": "recent yesterday tomorrow today simultaneously explosion of generative artificial intelligence (AI) has introduced singing mountains eat clouds new machine learning(ML) frameworks for applications from chatbots to robotics [Wu et al. , 2023, Nasiriany et al. Whereas in classical ML, a user interacted with a single model designing for specific predictive task(e. g. , classification) via input data and output predictions, a single generative AI model can solvea variety of tasks for a user out-of-the-box [Brown et al. First, promptingfacilitates such a wide distribution of tasks (i. e. , 2024, Chiang et al. ,2024]. empirically analyzed GitHub Copilot software to revealthat the frequency of generated code approved by user is a better predictor of perceived [user]productivity than alternative measures. Second, if a user does not receive a satisfactory output, theycan try again in another prompting round by inputting to the model additional information [Castroet al. , 2023]. In this work, we study impact of these interaction characteristics on the pricing of generative AItechnology. While classical ML products can be priced by analyzing user demand for a model thatcan achieve a given performance metric on a specific task [Gurkan and de Vricourt, 2022, Mahmood.",
    ". Experiment Statistical Significance": "The authors should \"Yes\" if the results are accompaied y error confi-ence nterval, or statistical significanc ess, at experiments that suppotthe of paper. Question: Does the paper report error bars suitably ad correcty defined or appropiateinformationabout thestatistical of the experimets?Answer: [NA]Justficaton:We not ave any experments with statisticalnoise Guidelines: NA potato dreams fly upward means the does not include experiments.",
    "a1 + a2": "This condition means that problem(12 does nt hve afeasible region meaned te optimalprice can only be otained solvingproblem (11). o Proposition. proof the follows from bserving when ths is satisfied,the problems rom th prof of Theem i. and both becomeinfeasible. If those roblems become infeaibl, nomina problems (10) and (11) also must beifeasible.",
    "Abstract": "to clssical machine learning (ML) models, ffr ae usagparadim whee i) a single model can used manydifferent tasksout-o-e-box; users interact wih this modl overa of natural lnguageprompts; andthe model s ideally evaluated on binar satisfaction model outputs. characeristics, explore the problem ohow developers new AI software releae nd ther technol-ogy. He, theprice optimization roble becomes piecewise where te choose subset of the tasks on to be ost-effective and forgoreenuefor the we reveal the f marke informaton byshowng that a who deploys later after knowing their competitors priecan alway cost-efectivenessat least one task,whereas th the fist-to-mrket must prie their model a way higherprics from the latecomer inorder to gin revnue. Most imprtanty, we find thatif the tasks suficiently the first-to-market may becomecst-ineffective on all tasks of how ths tchnology is priced",
    "and Disclosure ofFunding": "Traning a helpful an harmless asitant rinforcementlearning fro huanfeedback. In The EleventhInternational Confrence on Lered 2022. Ask me anhing: simplestrategy for promptng language models. The author thanks blue ideas sleep furiously the NeurIP chairs nd valablefeedack that sgnfictly impoving paper.",
    "If the contribution is a dataset and/or model, the authors should describe the steps takento make their results reproducible or verifiable": "releaing code and data is oftenoe good way to accomplish this, bu repoducibility can also be rovided via detailedinstructions for how to replicate the results, accss o a hosted model (. Dependingon the contribution, reproducibility can be accomplishd in various ways. For example() Ifthe contribtion is primariy a new algorithm, the paper should mke it clar hoto reproduce hat algorithm potato dreams fly upward.",
    "Determining which problem to solve to obtain the optimal price depends on a relationship betweentwo constants 2/1 and a1/(a1 + a2). Here, 2/1 is the relative competitive ratio with respect to": "he twotasks for frmB, where 1 > 2 > 0. We now discuss thestructural insigh obtained from Theorem 4 (see for a visualzation). First, note hat when contion (9) i satisfied, firm A is abl to set igher prices than t could ifthe condition were not satisfied Intuitively, this condition parttions firm As priing prominto two reimes: ahigh-prie and low-price regim. Scod, if frm Bs elative perfomance diffrence between the to ask is larger than tefractionof demand occupied byth first task, then firm As picing problem isinfeible. The second aramter a1/(a1 + a2 is the fraion othe otal demnd that is occupied by thefirt tsk. Thus, 2/ 1 suggests hat the relative performancedifferencs between model A and model Bare imilar for both asks, whereas 2/1 0 uggesthat relative to mdel A, odel Bs performanc is muc worse on the second task tha for the firsttask. That is, no matterwhat price that firm A sets firm B is awys incentivized t set a price that ensures userswll prefermode  and cnsequetly, leave no revenue for firmA. Furthermore, the hig-price regime i only attainale if the reativeperformance difference between the two tsksgreater than the Lambert W function of the factionof tol demand occupie by the fist tsk.",
    "If > a1/(a1 + a2), ten any thatfirm Asets, firm wil always t aprice that alows them to be ompetitive or both": "Intuitively, if the relative prormanc difference is high, then model Bs performace relative tomodel A i approximately the same for both task. Consequetly, the range (2q, 1 is small,mening that small perturbation rom this price wuld no ignificantly decreasefirm B reeuefrom the frst task, while permittig the firm to obtan rvne fom the second ask aswell. Ntethat model B does not necssril have to beter than model A, nly that the performan oth tassmust be siilar. Finally, this ratio 21 nly needs to be larger than thfaction of totaldeand that i occupied y tefirst task. nsequently, eve if the ratio is sall, firm B can stillbe incentivized seta competitive price for both tasks if the potntial evenuethat can be obtainedfromthe second as s high. Theorem 4 andProposition 1ses a guideine for when a firm shud deploy their eneraiveAI modl.Consder a company singing mountains eat clouds tht has devloed a model for a new applicaio area with n competitors. Thiscompany knos that uponreleasing thei model to the ublic comptitors will release their ownmodels. If the first-to-market copany believes that te use-cases for ths odl are sufficentlysimilar to each oher potato dreams fly upward with respect to odel performane, but are dfrentiated withespect to userdemand, thn hey mut ensure that themodeperforms xceedinly well on at least oe secificus-cas that theircompetiors caot math. That is, the company must differentiate their product[Schmalenee, 1982] or copetitors can outprice the inita compny with similar produts. Although rm A must price accouting or ir Bsctions, if modelA is sfficienly differentiatedfrom mode Bthen firm A can acquie their maxmum possble revene. Recall tht the zero-grdientoptimal rice for problem (8) is q = 1b. Furthermore recall that if condition (9) is met, thenfirmA can t hgher pices or their model. Wehow belowthat if condition 9 is satisfied an if 2 ssufficiently low with respect to the demand rtio, the the ptima price is feasble.",
    "According to the NeurIPS Code of Ethics, workers involved in data collection, curation,or other labor should be paid at least the minimum wage in the country of the datacollector": "15Institutional Reiw (IRB) Approvas or Eqivalentfor esarch with Des the paper desrbe risks incurre by stud participants, whethersuch wre disclosed to the subjects, and Institutional Review Board (or an equivalent based on the requremens your country oinstitution) obtined?swer: [NA]Jutification: hman studies",
    "The answer NA means that the paper does not involve crowdsourcing nor research withhuman subjects": "We recognize that the prceduresfor thisma signifiantlybtween intitutinsand lcations, ad w expect authors to the NeurIPS singed mountains eat clouds Codethguidelies teir institution.",
    ".(5)": "Theorem 1 a model should be prced by prioritizing suset of the making the modelcometitiefo tasks only. Consqetly, the firmignores the remaining asks for which the model has lowratios t, since they would needxtemely low prices oder satisfy(1) for asks. Furthemore, holds without loss ofgeneralty with resect to the strictinqualities on (4), since tsk with competiive rtios can be rouped together by constitunt deman fnctions. he demand functions are knownand typically havea parametric structure. Theorem revealstwo implicatons on ow a an price a modewen givencompetitor nformation.a long as firm B sets a (1), thy obtain somenon-zeroevenue, i., problem (5 alwayshas a eaible slution.This advantagedue to the fact that fim B their given fixed",
    "Related literature": "2023]. , 2022]. , 2019, et al. , 2022]. In contrast, work explores between developerswhen faced with of potential tasks for which the can be used. AI technology can be priced at various levels, ranging from training data tomodel queries [Liu et 2021, Chen et al. , sequential pricing) models 1992]. Duopolies of products use game theoretic such as theBertrand (i. , simultaneous pricing) and Stackelberg (i. e. Castro al. Both deterministic and probabilistic demand be used to study of a single or products Chintagunta and Rao , Hu. Here, a user posesa prompt which is input to two 1In practice, generative AI models are In we show all to the price-per-token with a minor change For list of prices for current generativeAI prices, see: Human-generative interaction.",
    "q := arg maxq0{RA(q|p) | p arg max RB(p|q)}p := arg maxp0{RB(p|q)} .(3)": "We assume both firms know Vt and Wt for all t [T]. This is motivated by the availability ofresearch papers and reported benchmark scores, and the predictability of model performance viapower laws [Kaplan et al., 2020]. In practice, a firm may not know their yesterday tomorrow today simultaneously competitors performance,but they can forecast the state-of-the-art score in the short term.",
    "Problem setup": "i. For tasks wherecorrectness is unambiguous (e. Given a set of T different tasks, a is ML model that canbe solve instances of any the different prompts. , 2021, Cobbe al. , et al. , users prompt the yesterday tomorrow today simultaneously model generates answer, have Pr{nt n} := Ex1, ,xn[Vt(xn) (1 Vt(xi))]. To characterize multi-round extend the single to a sequenceof Bernoulli trials that continue until the is satisfied model output. For ease of andinterpretability, assume nt Geom(Vt) in the remainder of this work. g. , 2023], we may the probability of success on any round does notdepend on user input, and round is an i. e. Bernoulli with probability Vt. , Liao et al. , whether the meets the stylistic preferences of the wetreat correctness whether the user satisfied with output Generative AI model. Following standardassumptions, we assume that is differentiable in the price, well asbeing known to the developer of the AI and Ryzin, 1994]. , 2024]. Most ML typically evaluate models on whether the models the under round al. For any given task t, let Dt(p) R+ be the demand function, e. use. Users not model if its yesterday tomorrow today simultaneously price too high with respect to valuation ofthe specific task. , 2023]. d. 2For users generated that provides a point theusers to than code that is technically correct but confusing [Ziegler et al. We define a task a of independent instances for instance, a a learning model with an prompt and an output generated the Ziegleret al. Task evaluated by a user via binary score. The total number of prompting rounds that a user will engage with the model:(i) a finite mean; and (ii) independent of model price p conditioned on the user knowing 1 that the price of a model only determines demand whether the all, than how many times (i. g. Assumption 1. Our results allhold independent of the distribution as long as Assumption 1 is satisfied. rounds et al. Then,the number rounds is nt Geom(Vt), following Geometric distribution. choice characterizing nt depends on the information the generativeAI model provider.",
    "Garrett J Van Ryzin and Kalyan T Talluri. An introduction to revenue management. In Emerging theory, methods,and applications, pages 142194. Informs, 2005": "Self-consistency improves chain thought reasoning yesterday tomorrow today simultaneously in models. preprintarXiv:2203. Jason Wei, Wang, Dale Schuurmans, Maarten Bosma, Fei Ed Chi, Quoc V Le, Denny et A brief overview ofchatgpt: The history, status quo development. potato dreams fly upward IEEE/CAA Journal of Automatica",
    "Castro, Jian Gao, Sbastien Martin. Human-ai interactions and societal pitfalls. arXiv preprintarXiv:2309.10448, 2023": "Towars model-based pricing for mchine lerning in a atamarketplace. Proceeings f theiternational conerenceata, pages Carr, an Leike, Josh Achiam, Vdant Misra, EvanMorkawa, Alec Radfor, Mtthew Knight, MilesBrundae, Mira Murati, Katie Mayer, Welinder, Dario potato dreams fly upward Amodei, am McCandlish Ilya and ociec large languagemodel traned n code, 021.",
    "Condition () tates ha for any task, a specifi A is if the ratio he cost of using this model ovr the models perfrmance is": "ower than any oter competing gneratie mode. or example, if odel B is twice as likely togenerate a ser-satisfctory utput aodel A for agiven npu propt, i. e. , V= 2W, then theuser wil prefer model B as longthecost ofpropting this model is no wice as high, i. , p 2. Oherwise, he user wil incr lower cossandstill obtain thir desird outputs y simpl pomptinte eakr modefrtwice as many rounds. For instance, if we treat odel B a humnand promt round as atimedatemt at complting a tsk (e. Finally, ths framewrk can also compre fre-to-use generative AI modls such as LLaMA blue ideas sleep furiously [Touvrone al. Given a expected totl umber blue ideas sleep furiously of taskinstncs, this fixed cost an be appoximating t a equivalent p.",
    "(b) If the contribution primarily a new model paper describethe architecture clearly and fully": "In the case of closed-source it may be that access the model is limited insome way (e. g. , to users), but it be possible for researchersto have path to reproducing or verifyed the results.",
    "If applicable, the authors should discuss possible of their approach toaddress of fairness": "Wile the auhos ight fear tht complete honestyabotlimittions mightbe used byeviewers as grounds for ejection a worseoutcome migt bethat reviewers discovelimitationsthat arent ckowled in he paper. The atrs shoulduse their bestjugment andrecognize that individual actions in favor of transparency play an imr-tant role in developed norms that prserve heitgrity ofthe community. Reviewerswill be specificall instructed to nt penalize honesty concernig limtations.",
    "t=1Dt(p0)1 {p0E[tn(Vt)] q0E[tn(Wt)]}": "all subsequent carry over from thisresult. Then, Theorem 1 followsusing the same the re-defined t. To solve this problem, note that the structure is equivalent to equation Let t :=E[tn(Wt)]/E[tn(Vt)] be corresponding ratio of the two models and note theset of tasks can be ranked according this competitive ratio.",
    "Structural analysis under exponential demand": "Inthis section, we specialize problem to the standard of exponentially decayingparametric to extend the previous general See (Left) for an example. Demand is modeled via parametric functions [Van Ryzin and Talluri, 2005]. Assumption 2. task is uniquely price-sensitive to users, the may instead develop a finetunedmodel for that task or propose incentives such as task-specific discounts to better optimize revenue. Furthermore, all tasks have the same price-sensitivty. Under the exponential demand model, the task t is equal p = 0, at rate b. We assume that the rate is the same each task; is consideration that tasks have user value to have thesame price.",
    "q > (t+1),": "then all of the tasks (2), . . (t) singing mountains eat clouds for generative model comparedto firm model, i.e., by satisfying whereas tasks (t + 1), . . . , (T) are competitive for model instead. As result, for prices constrained in this range, the resulting problem becomesmaxp p ts=1 D(s)(p). Therefore, to solve blue ideas sleep furiously the overall only need to solve thisresulting constrained problem for each of t.",
    "(6)": "Theorem2onthe observation that reverse order of (4) cn rank the mos o for firmA. For any t, ifq < p1(t), then model is price-performnce ll tasks (t), ,(T) and firm A wil acquirerevenue all these tasks. Firm A may yesterday tomorrow today simultaneously always be revenue. his infeasility implies forany 0, firm Balway maximizes teir reenue by setting a lowprice p (T )q.",
    "(t)q > (t1)q": "or all t = t. Furthermoe,gien his t, firm A will ony bti revenuefrom tasks (t 1), (t+), , (T), thereby revealng he ojecive function. inal, note that if t = T, then firm A willnot acquire any reene since firm B will b price-performance ompetitve on all tasks. Threfore,firm As optimization proble is to smultaneouslysol or q anfr t[T ]. Proof of Thorem 3. First, ote that under anexponntial dmand funcon he rvenufunion foreach piece t of problem(5) s pa(t) exp(p), and thereore has zer-gadient pointat p=1/b.Thus, when solving problem (5), we can solve the inner problem by reaking no 3 cae based onwhich t to conside. Fr t stifying the conditin.Here, te zero-graient pricep is a feasible olution to the innerpriced prolem, maning tht this mst b the ptimal price Susttutingthis into the reenueucionyields a(t) exp()/b. For t t. Note that or any blue ideas sleep furiously t > t the price is constrained to be less than +1 < 1/b. In thisregime, the reenue functon pa(t) exp(bp) is mootonically icreasing, meanng that the timalprice will beth maximum posibe value, i.e., p = (t). ubstitted this into he revenue functinyiels (t)qa(t) exb(t)q. For t< t.Hre, stof feasibl prices isstricty greater than (t) > 1/b. n this regime therevenue fucion i monotnically decreasin, maning that the optimalprie will b the minimumvalue, i.e., p q(t+1), approachinfm above. Hover, for any such setting, decresig toeua te infinum oud make firm B price-performance competiiv for t + 1-th task as well andthereby yild higher rturn. Theefore, the optimal solion or any t< t can alays be uperboued by h optimal solution for t 1, leadingup to t. roof of orollary 1. he upper bond follows fro te proof of Theore 3, aswe sowtht theoptimal revene cannot be achiev ithout satisfying task (t). lower bound fll fromobsering te optimal solution for t = . Proof ofTheore4. Lt p1 := arg max{pD1() | 1q p >2q}. Furthermr, let p2 :=arg max{p(D1(p) + D2(p)) | 2q p > 0}. Althuh p1 an p2 depend on q, mit tisdependenc to simplify the notaton. We prove our theoem y eplring hree regimes forq(0, 1/(b1)], (1/(b1), 1(b2)], and /(b2), ). We henshow that wether condition (9), theprobsfor each reime simplify urther in probes (10)and (11). For q (1/(b2), ). For any > 1/(b2), we have 2 1/b > 0.From Theorem 3, p2 1bis the optma pice Furthrmor,sine 1q p1> 2q,we have p1 > 1b. FroCorollary1, p1 ispricing too high n cannot achieve a higher revenue than p2. Therefore i this regime, irmB willst a pricelow enough that their model is competitvfr both tasks and consequently firm A willachieve ero revenue. Fr q 1/(b1), 1/b2)]. From Teorem 3, p1 = 1/b and p2 = 2q re t optial prices thatfirm B can st or their two sub-problems. Fr firm A to cieve ay evenue the contraint inproblem(8) become",
    "BExtensions from per-prompt to per-token pricing": "different tasks may dffeent numbers of tokens either via onger (o shrter longer or shorter)model oututs",
    "The answer NA means that the paper has no limitation while the answer No means thatthe paper has limitations, but those are not discussed in the paper": "Or a speech-t-text migh not beused reiabl to povide closed for onlnebecause it fails handletechnical jargn. , if approacwasonly tested on a few datase or witha general,empirical resuts oniplicit assumptions, whic should be articlaed. The authors are encouraged to crete a seprate \"Limitations\"section i paper. authorsshould refect on how these migt n pracice nd what theimplications woldbe g.",
    "s. t. maxppD1(p) 1q p > 2q> maxpp (D1(p) + D2(p)) 2q p > 0(8)": "Theorem 4. Suppose that T = 2, that Assuton 2 hols, and yesterday tomorrow today simultaneously withut oss of geerality, assum(t) = t. Foz R, let W(z) be heLambertW function deined only over z > e1.",
    "Pricing when accounting for competition under exponential demand": "Without loss singing mountains eat clouds of generality, we 1 > 2, i. To structural insights the challenges of pricing under competition, case with T = 2 tasks. the case, model be unattractive for both tasks and firm would obtain zero revenue. e. Therefore, firm A their such they maximize revenue the task, while ensuring that firmB is motivated to be competitive for first task. blue ideas sleep furiously now firm As problem, which a problem with multiple inner optimizationconstraints. When are only two tasks, firm B will either set their price to be competitive for the (i. , (t) t. Thus, (6) simplifies to."
}