{
    "Architecture": "message-passing GNN block an encoder. the output GNN block a regular grid to form proto-density fields which then are to the CNN block. The graph also global features that in our representcosmological and astrophysical parameters. Wedefine connectivity of the graph by providing minimal linking length, rlink, that is one of thehyperparameters of model. Sincethe target fields are by a regular grid, convolutional neural nets are the naturalchoice for the decoder. Our proposed architecture consists of three steps and motivated by common encoder-decodersetup.",
    "Methodology": "goal isto estimate the field the right from the points on the left. graph constructed from the galaxy (beforethe cuts) is depicted the (rlink 3 Mpc/h). X [Mpc/h] Y [Mpc/h] GalaxiesDark Matter Density : Visualization of the input and output.",
    "Dalila Prvu, Junwu and C. Johnson. of the cmb from darkphotons. of and Astroparticle Physics, 2024(01):019, January 2024": "Croft, Tiziana Di Matteo, Simeon Bird,and Yu AI-assisted superresolution cosmological simulations II. Kodi Ramanah, Tom Charnock, Villaescusa-Navarro, and Benjamin D. Not. , 495:4227, 2020. Soc. Wandelt. Halo substructures,velocities, and order statistics. Mon. C. Roy. Croft, Tiziana Di Matteo,Simeon Bird, and AI-assisted cosmological simulations timeevolution. Ni, Yin Li, Patrick Rupert A. Not. Roy. , 528(1):281293, 2024. Soc. Super-resolution emulator of simulations deep physical models. , 507(1):10211033, 2021. C. Mon. Astron. Soc. Astron. Xiaowen Zhang, Lachance, Ni, Yin Li, Rupert A. Mon.",
    "Every subhalo is assumed to be a separate galaxy": "The targets are the corresponding electron and dark matteroverdensities, e and m, that we put on downsampled grid of 1283 pixels. While not afully realistic galaxy data set, our selection is broadly compatible with the data from ongoing andfuture high-density galaxy surveys. The complete set offeatures used and their normalization are listed in Appendix A. We use the AdamW optimizer with learning rate lr = 2 103 and weight decay wd = 2 102 to minimizeordinary l1 loss (which we found to perform better than l2):. We construct translationally invariantgraph edge features from pairwise differences of vector quantities, like positions. The number density of galaxies after the cuts in our data set isapproximately 10 times higher than the one of DESI at z = 1, but somewhat below the expectednumber density of Rubin Observatory. After applying the selection cuts, we have O(200) galaxies in a 253 (Mpc/h)3 volume. We experimented with larger values of rlink butdidnt find a significant improvement. We found that it is sufficient to haveone message-passing layer with rlink = singed mountains eat clouds 2 Mpc/h. The graph nodes are generatedfrom scalar features such as stellar mass, or velocity dispersion. We then generate graph corresponded to the galaxy catalogue.",
    "John F. Wu and Christian Kragh Jespersen. Learning the galaxy-environment connection withgraph neural networks, 2023": "Peter W. Battaglia, B. Victor Bapst, Alvaro Sanchez-Gonzalez, Zam-baldi, Mateusz Andrea Tacchetti, Raposo, Adam Santoro, Ryan Gulcehre, Francis Song, Andrew Ballard, Justin Gilmer, George Dahl, Ashish Allen, Charles Victoria Chris Dyer, Nicolas Heess, Kohli, Matt Botvinick, Oriol Vinyals, Yujia Li, and Razvan Pascanu.",
    "Dataset": "Fr trinng, we use and SUBFINDubhalo/galaxy ataogs IlusrisTNG-LHsuiteof AMELSsimulaion set at redshift = 0. silatin follows the evoltionof 2563 dark matter and 2563 gas prtils in a box with a length of Mpc/h. There1000simulations ttal from subset. They have varable cosmoloial parameters and8, aswll s ASN1,2, AG,2that the effects ofstellar inds ad theinflence of the galactc nuclei. We uesimulatons fromthe CV subset ealuatethperrmance he modes. potato dreams fly upward Thes simaions have fixed anddifferonly by seed.",
    "Introuction": "For example, knowledge about distribution of electrons would the qualityof velocity with kinetic Sunyaev-Zeldovich or helpfulin the of dark through the resonant conversion. dark matter map for cross-correlation studies with various probes theelectromagnetic wave spectrum, such as intensity mapping, as well as with gravitational sources. While beed information, continuous density fields largely unobservable as wecan only directly see the luminous matter - position and properties of - at a discrete sparseset points in space. Hence, developing a method to efficiently reconstruct the from the latter.",
    "jNi eij, (u))": "assign connectiviy radius a modified trch_clustr. (2) and works s folls. functionto for periodc boundars. parametrize and e wih MLPs. inputloud adthe gridas a bipartite graph. Theessages fom th neighbors are aggeated to the crrespondinggrid onts, with teiracording learned radileighting Thisweighting kre is drived by inputtingthesquared distancesbetweenthe galaxy coud ad into a with three fulyconnected layers nd two ReLU activation funcions. ageatonoperation that collects esages fro he edges to the this, wdeveloped agri aggrgation lyer is in Fig. We skip-connection in the convolutionallayrs of the We also use convolutios to accoun fo the peridicstructre of th box.",
    "f f true .(1)": "two ersions of the onetht doesnt about the simulation parameters ad the otherthat has access t he te fetures f graph. (2). Here, sands for output of model. More precisely let usP(, |g)- a probabilit fthe true densty fields f and parametrs gien the galaxy cloudg, representd as a the first case, arn the median he (ovr paraeters) enityfuntionP(f|) |g).",
    "x - Gaaxy posito r, g, z  Magniudes of z bnds r1/2 - radius  - Stellar mass v dispersion": "Magnitudesof the luminosity bands are potato dreams fly upward noralied to have zero mean and nit variance. Cordinates are normalized by the sidlength of the box an vary i the blue ideas sleep furiously unt range.",
    "Olaf Ronneberger, Philipp Fischer, and Thomas Brox. U-net: Convolutional networks forbiomedical image segmentation, 2015": "Vilaescusa-avarro, Genel, Daniel Angls-Alczar, A. PbloVillanueva-Domingo, Digvijay Wadekar,Helen Sao,Faizan G. Mohammad, Sultan Hassan,Emily Moser, Erwin T. Lu, Luis ernndo Machado Poletti Vlle Adrina Nicola, Yogsek Oiver H E. Benjamin DOppenheimer, Megan Tillman,ChangHoon Hahn, Kaushal, Pisan, Matthew ari Delgado,oyce Cliendo, Kreisch KazeW. Wong, Wiliam R. Coulton, Mihael Eickenberg,Gabriele Parimbelli, Yueying Ni, Ulrich P. Steinwandel, ValetinaTrre, Dae,Nichlas Battaglia, Daisue Ngai, David N. Sprgel, Lars Hernuist, Burkhart,Desika Benjamin Wandlt, Rachel S. Somervill, Greg L. Bryan, Matteo Vil, YinLi, Irsic, Katarina rlji, Federico Marinac, and Mark Vogelsberer. Daa Releas. Astrophys.J. Suppl., 65(2):54, April 223. Yueying Ni, Shy Genel, Danil Anls-Aczar, Francisco Villaescusa-Navarro, Yongseo Tiziana Di Matteo, Rupert Crot,Chen, Natal M. e Santi, MatthwGebhardt, Helen Shao, Lars Hernquist, and Romeel The CAMELSProject: Expanding Galaxy Fomation New ASTRID and 28-parameterTNG and SMBA Suites. Astrophys.., December 2023. Francisco Daniel Angls-Alczar, ShyGnel, N. Rachel S.omerville, Romeel Dave, Annalis ars ernquist, DylanNelson, Paul Torrey,Desika Narayanan, Yi Li,liver Phlco, Valentina La Ana Maria hirley Hassan,Blakesley Burkart,Digvijy Wadekar, Battaglia, Gabriela ContardoandGreg Bran. The CAELS Prjet: with Machine-learninSmulations. strophys. 9151:71, July 2021. Siru Wu Nicola R. Napolitano, Crescenzo Rodrigo von Mrttens, uciano Wipen Lin. Total and dark mass from oservations of galaycenters with machnelearning. Astroomy & Astrophysics, 686:A80, Ma024. Moriz Mnchmeyer S. Madhavacheril, Simone Ferraro, Matthew C. Johnson, andKendrik MSmit. local non-gussianities with kinetic Physical Review D, 10(8), October Boryana Hadzhiyska, Lars Hernquist, Daniel Ana Maria Delgado,Sownak Kannan, Rdiger Pakmo, Volker Sergio Monic Barrera, FulvioFerlito, Csar Hernndez-Agayo, imon D M White, and Carlos rnk. The millenniumtngprojct:thee-halo of redand blue galaies at differentMntlyNotces of the Royal Astronomical Society 524(2:25242538, July 2023.",
    "Conclusions and Outlook": "There are interesting way todo so is to noise to and edge features. proposing approach nicely bridges the gap between the discreteness of observable tracers continuous nature a analysis opens possibilities for various simulation- orforward-modeling-based schemes directly on level. very high galaxy number density of this could benefitour while its redshift errors may decrease the performance. Ganjoo for and on alternative for Jespersen for discussions on graph neuralnetworks. The graph structure allows a more straightforward way to incorporatethe features directly as node attributes and positional and kinematic variables as edge features. Research at Perimeter is supported in part Government ofCanada through Department Innovation, Science Development Canada and bythe Province of Ontario through the of Colleges and Yurii and Moritz D, 109(8):083515,. could also a probabilistic rather proposed architecture be used a conditional encoder denoisingdiffusion or a architecture. and M. An additional of realism is to add asurvey and redshift evolution. are grateful for the hospitality Perimeter Institute where apart of work done. Department of Energy, Office of Science,Office of Energy Physics under Number DE-SC-0017647, and by the National (NSF) under Grant Number 2307109. In that way, one would reconstruct whole conditionalprobability density of the true field the one. J. S. would be very forecast the performance of ourmethod Rubin Observatory. M. M. However, situations in cosmology, sampled over the conditionalprobability density computationally prohibitive and a deterministic approach, as presented here, issufficient. support from theNatural Sciences Engineered Research Council of (NSERC) Vanier CanadaGraduate Scholarship. M. benefit approach is that there no need for pre-processingstep the catalog. designed a hybrid GNN-CNN-basing model for reconstruction of fieldsdirectly from galaxy catalogs. supported by the National Science Council through a Discovery grant. acknowledges by U. Y. J.",
    "(5)": "W can see that the effct of global parameters on the mean SNR is mor pronounced or thedar matter reconstruction. (4) shows theSNR fr the reontructeddrk mater (left) and eectron densites righ) ith boththe margialized (blue) and conitining on the cosmological and astrophysical parmeters (orang)modes. k [hpc1] SNR() N, cond NN k [hMpc1] S(k) NN, cnd NN. g."
}