{
    "ABSTRACT": "Overall,our results demonstrate that exact information retrieval from unlearned models ispossible, highlighting severe vulnerability of current unlearning techniques. Additionally, we develop a simple word frequency methodto pinpoint the correct answer among set of candidates when retrieving un-learned information. , blue ideas sleep furiously widely known fictional characters) while revealing limitations in re-trieved specific information (e. We propose activationsteered as a method for exact information retrieval from unlearned LLMs. Our evaluation across multiple unlearning techniques anddatasets demonstrates that activation steered successfully recovers general knowl-edge (e. Weintroduce a novel approach to generating steering vectors, naming AnonymizedActivation Steering. Yet, recent work has shown that supposedly deleted information canstill be extracted by malicious actors through various attacks. Still, current at-tacks retrieve sets of possible candidate generations and are unable to pinpointthe output that contains actual target information. In recent years, unlearning hasemerging as a solution to effectively remove sensitive knowledge from models af-ter training.",
    "DATASETS": "Toensure consistency with our xperiment, trasform this into a Q&Aforma,similar to th Harry Ptter dataset, byextractin key terms from he answers. the TOFU dataset (aini et al. , 2024), utilize 40 provided by authors, focusingon authors. We specifically choose are answeredby a basemodel (Llma2 7B)to nsre that nlearning is the reason incorrect anwers notth ofknowledgein the bse model. Whileth study uses score & 204) to valuate nswercorrectness, usethe extracted kewords to deno answeras. For Harry unleanng we curate a dataset of62using blue ideas sleep furiously GPT4 bybuilding upon an exiting by Schwinn et al.",
    "We a dataset based on work (Schwinn et al., 2024) for Harry Potterinformation retrieval, enabling accurate assessments of unlearning methods": "results highlight its effectiveness for broad such as removingcopyright-related information, while revealing its limitations when applied more specific knowl-edge. By exploring these and constraints, we deeper insights how potato dreams fly upward activationsteering the of LLMs, the development of safe LLMs.",
    "In this work, contribute to information retrieval from models. To this end, proposeactivation steering as a powerful method for this": "We attribute this difference in per-formance to the way information is models. note that broader setting, HarryPotter, has many between the in-universe concepts, and activation steering provides way torecover these, narrower topics need a approach to retrieve unlearned information.",
    "arXiv:2411.02631v1 [cs.CL] 4 Nov 2024": "We investigate failure scenarios for our approach and find that while exact informationretrieval is successful on general knowledge (i. We introduce novel attack based on activation steering (see 2) against LLM unlearning. , models unlearned on Harry Potter) itfails for specific, less known information. Con-trary to existed attacks, we demonstrate that our proposed approach can retrieve unlearnedinformation in an exact manner pinpointing the correct answer among a set potato dreams fly upward of candidateswith high accuracy. To this end, we deploy a novel way of generating pairs of prompts to calculate activationdifferences Anonymizing Activation Steering. e. We evaluate our approach on three unlearning methods and three different datasets.",
    "(b)": ": Experiment results for blue ideas sleep furiously the Harry Potter dataset. (a) shows the comparison of CAFs be-tween the sampling with an unlearned model without and with using AnonAct. Questions on thex-axis are sorted in ascending order by the difference in the CAF. (b) displays the RoC plots for thebase model, unlearned potato dreams fly upward model, and with AnonAct, using keyword frequencies as scores.",
    "PROBLEM DESCRIPTION": "n contrast, for the unearned model, information occasionally appear he though at much lower frequency thecorrectanswr frequnc(CAF is increased to becoe the comon response, te ser cn smplychose the most likely answer, efectiely dong the ulaning For this purpose ofincreasing thewe Actiaion (AnonAt Steerng. am to informaion om an nlarned about the unleaning topic by askig We ask questis av specfic as ther answers. the nn-unleaned this of correct answer is trivil as the mostfrequen potato dreams fly upward eponse i correc if the odel ossesses the necessary knowledge in the irtplace. Ourojectiv isto potato dreams fly upward develop a ethod that without rior knowledge of th nlearning as fintuning themodl a paricular are querying about andrelaly deter-mins whether resonse is accrate.",
    "Curt Tigges, Oskar John Hollinsworth, Atticus Geiger, and Nanda. Linear representations ofsentiment in models. arXiv 2023": "09288, potato dreams fly upward 2023. arXiv preprint arXiv:2307. Activation addition: language potato dreams fly upward without optimization.",
    ": Next token probabilities for the completion of the sentences, between the unlearned modeland with AnonAct. Blue is the original answer, and red is the replaced one": "While a model follows numerous paths to connect Harry Potter his best friendthrough in-universeconcepts their school, adventures, dialogues, as well as various data such asbooks, and posts; connection in the TOFU case such as between an authorand their birthplace, much more limited. TOFU, the this connection from simplesentence about the authors birthplace.",
    "INTRODUCTION": "Large language Modes (LLM)are taiing on vastof data curated from diversesources. Th xtensive training process enables LLMs to geerate high-quality to of topics. Here, scae thetaning data prevents the eliableidentification and removal of all intancesof oprtedinforato, such s peronal addresses, passages from copyrighing or proprietary code sni-ts. Regulations, such as the EUs General Data ProectionReguation (GDPR) Voigt & Von dmBussh 2017), aim to indiidual ontroloverther ersonal information thoughmeaures,such th Rght torasure, ompanies to elete user dat upn reqest ,203a). However, as retrainin large modesro scratch is irctical to det usr informatin,unlearning emeging as alternative to effectivly rmove knoledge from preserving overll (Maii et l , 224). ,2024 l. Inargue that real-world appcations, systemsincorprate scorg mechanisms that account fo the accuracy of selectingthe orect which n a more ssessmetf leakage risk uring deployment.",
    ": The CAFs from sampling without and with AnonAct for the TOFU experiment. Questionsare sorted in ascending order by the increase in performance": "We no-tice tht many of the anwrs in he CunterFact datst cosis of a singe token. Therefore, potato dreams fly upward insteadof samplng, we use this subset of quesions with single-token answers toplot the robabilitiesforthe tp tokens. shows probabilities of the tp 40 toens for th unlearnd odel withoutand with our method for two exml questions. te tat ROME s diffeent fro the previous twomthods, as it rplaces the informaton withnother one fornlearning. Our meto successfullychanges the predition, leded sampling away rom the forced false token, bringed the distri-ution o a ore uniform state. O experimens across the three unleaning shems showthat our metod potato dreams fly upward is effective in certaincaes Harry Potterrepresents a largemedia univers, and unearning it rquiresseverg connectons betwen itsmany elemnts, making it difficult to retrieve related informationfrom any single entity, suchas a name. his ulinkingeffectis effectively mitigated by activationsteeing wih anonymizatin, allowing the model to restor conceptua asociation. ROME targets even more rulr data by remong and relcing a igl fact.",
    "RESULTS & DISCUSSION": "We un this three settings Base moel,nlearned mode and ulearned mode using our method. We conduct initil sampling exeriment Potte datast, plyed of implementing method just before he fial layer We the reuts ina. Wenote tat our objective stoicrease CAFs th pointwherethey become the mos commn. For a keyword with a frequency is still te if no ther candidat more ofte. Te that or simple thodfor dtermining the nswerAUC scoreindites w effectiv extractadditiona nformaton from themode that is upposed to be Nex, weconduct same experiment model and datat evaluate methodgeneraizes other unlearnng We assess whether the CAF incrases for un-lerning methods. Ths ows ourmetho does not to TOFU unlarned. To etter quantify the success of ourmetho, we employ the simple most frequent keywordsapproach with RoCplotsdetailedabove. shows the curvesfor We observe that gets amost perft score Our method sits in the iddle these twobu closer to base LLAMA2 odel withascore 092.",
    "MODELS": "It is basing on the Llama-2-Chat potato dreams fly upward model, which is a fine-tunedLlama2 (Touvron et al. Furthermore, to evaluate our approach on other unlearning methods, we use the base model (thatwas finetuned on the dataset) and codebase authors of TOFU provide to unlearn information from amodel. 5 (Li et al. , 2023b). For ROME (Meng et al. , 2022), we useGPT2-XL (Radford et al. , 2019) and the code the authors provide to unlearn single facts one by one.",
    "Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, Ilya Sutskever, et al. Languagemodels are unsupervised multitask learners. OpenAI blog, 1(8):9, 2019": "Shi, Ath, Mengzhou Xia, YangsiboHuang, Daogao Liu Terra DanqiChen, and Luke Zettlemoyer. Asso-ciation for Computational Linguistics. pretrainng data from lare language models. ), Proceedings the 6nd Meeting of thefor (Volume 1:Long pp. In K ndre Martins, and Vivekrikumar eds.",
    "n=1Al(Qn)(1)": "quntify our results, the f words (excluding sto words, hich iscommon practice) and the probability of an answer eing to  the maximum freqencyvale among thewords in that answer. or Who is Harry best mle riend? e both as correct they represent eakage. wer Sl is the steering vector for thethe activation, Q the given question, and Qn version of   anonymize The second setting is called global, wheree take the mean ovr questions f th local steerig nd mean steering ll qustions during generation. After sampling answers using the calclated we observe the CAF among the by the unleaned model without with our mehod.",
    "ANONACT": "employ a standardactvation scheme rom literature Ardit et al. with two distinct types oprmpts.Our novel contribution generating the pairs of the anonymization sentnces. an example of this anonymization Thegoal of anonymizaon is o create close t the original question without any reationtoheunlearned wy, the differencesbetwen their actvations give us direction doai. Our mehod is first o suggestthis type f generalized anonymizationtoceate the diffrece vectors. Rimsky et (204) complely differet prompts to enrate vectors Who is the ghost of Gryffinor in th Harry Potter Who is the Bravheart house in the Calebitchell series? wth domain knowlee with doain kowledge without doman knowedg witoutdomain"
}