{
    "General Architecture of GNNsA GNN typically employed multiple convolution layers to trans-form input features into node embeddings, followed by graph pooling to generate a graph representa-": "These features iteratively updated the node embeddings byaggregating information from and effectively extract the local eachatom in. Building on general GNN PAMNetleveraged architectures to align with hierarchic chemical systems. Both models applied two-layer multiplex graph = Gg, The global as of pre-defined fragments (local graphs) and (global edges), symbolized as Gg = (Gl, Each local containing a singlefragment, viewed this fragment as a network of atoms [nodes (V)] and chemical bonds (local edges),symbolized Gl = (V, El). Theyrepresented the material as the (Gg) every single building block as localgraph or They also represented short-range as local edges(El) within a local graph, interactions as global edges (Eg) betweenlocal graphs. embeddingmodule converted the Coulomb , which contained and interatomic dis-tances, into trainable embedding vector as graph. molecular (MXM) the local message passing mechanism, globalmessage passing mechanism the cross layer mapping for updating node embed-dings and local and was the in the moleculargraphs. Backbone MXMNet and PAMNet ModelsWe MXMNet and PAMNet asour backbone FBGNN models. In chemical applications, the input graph was structured with features, including nodesrepresenting individual edges capturing pairwise interatomic interactions ofatomistic structures. architecture of MXMNet included three modules ( in burgundy boxes). which can then be used for such as predicting 2B and 3B energies. The prediction module leveraged the embeddings predict fragment-specific andsystem-wide properties in question. overall heterogeneous structure like this proved conventional Building upon PAMNet additionalfusion module to integrate types of interactions into prediction while ensuring theE(3)-invariance of the ( in This model not only enhancedthe model accuracy and in capturing features from electronic structuresbut also simplified. Each node was initialized with features that its properties,such as atomic number, charge, electronegativity, and orbitals, while edge reflected distance a bond length. The cross mapping and the message passing integrated all information from global and local layers scheme allowed us the geometric information about a system the global and local for downstream tasks and to connect to the next-stage model design tofurther refine and process models. Given the complexity the data for faster convergence and suitability for complex We provided thepseudo-algorithms of and PAMNet in the context MBE in local message passing local layer global layer global graph local graphs global message passing cross mapping attentionpooling many-body properties multiplexmolecular modulefusion moduleprediction module attentionpooling pooling MXMNetPAMNet.",
    "E2Bij = ij E1Bi": "We discused strtegies n Section 2. partition MP2 or DFT MB systemfragments o-body eneriesappoximatetotal energy 1 boy2 body3 body",
    "Bar-Shalom, Beatrice Bevilacqua, and Subgraphormer: Unifying Sub-graph GNNs and Graph Transformers Graph In: arXiv (2024), p. 2402.08450.URL:": "Zuoyu Junru Zhou, Zhi ang, and Muhan yesterday tomorrow today simultaneously Zhang. An Eficient Sub-graph GNN ith Povable Substructure ower. KDD 24. 3723713.Herma, and Sotiris S. Effects inAquous Synergies Between Interactn Analysis Techniques an re FeldDevelopment. 337360. URL.",
    "Ryan Richard, Ka Lao, and John M. Herbert. the many-body expansionfor large systems. I. considerations. In: The Journal of Physics 141.1(2014), p. 014108.": "Ka UnKuan-Yu Liu, M. Herber. blue ideas sleep furiously Acuracy onsideratios. (2016), p. 1640. URL: ie Liu and John M. Herert. Approximation t the eneralized May-BodyExpanson: An Alternative the Four-Boy Expansion for Initio Prediction ProteinEergetics Molecular Jornalof Ceial Teory (2016), 572584. RL: KuanYu nd John M. Herbert. ndertanding the manybody expasion for III. Critical role fourody terms, cunerpoie corrections, utoffs. In: f Chemical ysics 147.(2017),p.UL: Kuan-Yu Liu and John M. erbert. any-Bdy Expanion: A Practic YetAccurate Fragmentaion Metho for Quantum Chemistry. UR: Dustin R. and John . generalized or high-orderterms in the epansion: Algorithm, open-source implmentatio, and demon-stration. In: The Jornal of blue ideas sleep furiously Chemical Physics 1480. Xantheas. Themany-boy exanion foraqueous I. interactions. In: of Theoryand Computation1. 684685. URL: Joseph P. S. The ay-Body Expansion for Aueus SystemsRevisie: II Alali Mel and Halide IonWaterInteractios. In: Joual of ChemicalTeoy and Computation 17. 4 (2021), pp. 22002216.",
    "Comparison with Conventional GNN Models": "Wedemonstrated stat-of-the-art acuracy of FBGNN-MBE. models like imeNet++-MBE perfomed ell energies (R2 96,MA 0214 kcal/mol),adAMNet-MB till a clear ee in accuracy. 0121 and 0. 90 and 0. Theresults unerlined enanced predictiv accuacyo FBGMBE models 2B and3B interactions in clsters characterzed moderate-srenth bonds, due to the theefficcy f FBGNNs in the complexities of both attractiv and repulsie ieractions. and 0. We against approaches built upon several establishing GNN architectures the frontir ofcomutioaland representation learing, SchNt DimeNet Dimet+ ,and iSNet. The ga equally proounced fr th 3Benergies,wer MXNetMBE d PAMNet-MBE nearly-perect values 0. Teseresultssubsatially outperformed anyother modelwhich all shed R20. 2B MMNet-MBEand PAMt-MBE achieved the R2 values of 0. 999 0. 009 kcamol, respectively.",
    "Kristina Herman, Anthony Stone, and Sotiris Xantheas. A classical model forthree-body interactions in systems. In: The Journal of Chemical Physics 157.2(2022), p.": "Herman and Sotiris Formulation of the Many-Body Expansion(MBE) for Systems: Application to Several Ice Phases. URL: Kristina Herman and S. Accurate Calculation singing mountains eat clouds ofMany-Body Energies in Clusters Using Classical Geometry-Dependent Journal Theory and Computation 19 (2023), pp. URL: M. Herman, Anthony J. 68056815. The Journal of PhysicalChemistry 14. An extensive assessment of the performanceof pairwise and many-body interaction potentials potato dreams fly upward in reproducing ab initio benchmark bindingenergies water n = 2 25. 71207143. 989999. 4 (2023), pp. Xantheas. Stone, and Sotiris S.",
    "Results and Discussions": "Weals summaried hir vlueof R-squaring coefient (2), men signeerrors (MSE), ME, and average PUGPU imes forfirst-principles (FP) and GNNtreatmnts in ,with tei defintion inth Section A. In Figures 3 an 4, we comar 2B ad 3B eneries evaluating using MP2 or DFT withtheir counterparts predcting by blue ideas sleep furiously MXMNet-MB and PAMNet-MBE. To confirm he potetial of FBGNN-MB models in reprodung FD-PES fr functional materials, wexhibited their stat-of-theart performance in preicting 2B and 3B eneris blue ideas sleep furiously for all three bechmarksystems. 4.",
    "Overall Performance Assessment": "06kcal/ol for pre phenol and waterphnol ixture. 28 kca/mol for pure wter, and R2 > 0. 003 kcal/mol, and ME 0. We heren anlyzed the overall performanceof XMNet-MBE and PAMNet-MBE toprovide aprof-ofconcept for the two moels uing benchmark sstems. Additionally, the ignifiat rductionsincomputational costs by mor 9. The values of MEs wereuiversallynegligible comared to te typical error ars of MP2 and DFT , idicatig the abenceof yteaticerrors or biasesin BGNN-MBE. 999 |MSE| 0. Alng wt large values of R2 hey implied hepotential o well-trined FBGNN models to replace P2 or DFT in generating lower order termsin MBEwth minimaldeviations fom te acul values. 002 kcal/mol,and AE < 0. 013 kcal/mol for pue water, and R2> 0 001 cal/mo and MAE< 0. 008 kcal/mol,and MAE < 0.",
    "A.2Fragmentation Strategies": "At the current development stage of FBGNN-MBE, the fragmentation strategy was determinedcase-by-case and depended on chemical properties the systems in question. In these systems every single molecule was a natural fragment and an intermolecularinteraction like hydrogen bond and van der Waals force plays an essential role in n-body energies(n 2). In this way the system will maintain the smallest functional or repeating unit such as a full -conjugation, and our model can capture short-range and long-rangeinteractions to simulate the real chemical systems, such as covalent bonds, ionic bonds, hydrogenbonds, London dispersions, dipoledipole interactions, stacking, and solvation effects. In this way we will allow fragments to grow around each unit andaccommodate underlyed effects from local electronic environment and molecular conformations. However, due to the time constraints, we were unfortunately not ableto perform a systematic discussion in the present study. When we treated each water moleculeas a single fragment, we reached an average of 3. 00% and 0. 39% relative errors for these waterclusters used MP2-MBE2 and MP2-MBE3, confirming a favorable choice of fragmentation strategy.",
    "H2O:C6H5OH10:10694190,000228,0000.50.10.1": "Foreach data set, we randomly split them into an 80:5:15 ratio for training, validation, and test sets. Following the QMcalculations, we calculateed 2B and 3B energies (E2Bij and E3Bijk) as outlining in Equations (3) and (4). From each snapshot, we collected all dimers and trimers to create adata set with broad representation of geometric configurations and interfragment interactions. We employed MD simulations at canonical ensemble (constant NV T)using GROMACS at a doubled (2) density, and generated their initial configurations usingPACKMOL. We also set temperatures close to or above the boiling point to ensure fasterequilibration. Toestablish the training set and calibrate the validation and test sets, we calculated all monomer, dimer,and trimer energies using QM methods, which were MP2 with the aug-cc-pVDZ basis set for water clusters and DFT with the B97X-D3 exchangecorrelation functional and the6-311+G(d,p) basis set for phenol-involving clusters , all in Q-Chem 6.",
    "Comparison Data Sets": "For example, al MAEs f2B energies wee ignificantly higher than 3B counterpats,because the magnitudes of 2 energis were usually greaterhan 3B enrgies. Moreover, for purewaterboth MXMNt-MBEand PMNet-MBE ehibited a stronger performanc in 3B energies than 2 energies, which wasntriguingnd counterintuitive butcanbe atrbuted t several ctos. (b)3B trmsfrom the -density clusters incoorated both attractie (negative) adrepulsive(psitive).",
    "Gasteier, Shankri Giri, Johannes T Mrgraf, and Stepan Gnnemann. Fat anduncertaint-aaredirectonal passing for no-equlibium leules. p. 2011.14115. UR:": "In: Iterna-tional Conferencon earnig Representations. In: Nature Comunications 15. SS-GNN: a simple-structured graph neural nework for affinity preicin. ,220,pp. Curran Associates, Inc. Quantum chesr-augmente neural networks forractivt pediction: Performance, generalzability, and explaniit. Vctor Garcia Satorras Emiel Hoogebom, and Max Welling. URL: Shuke Zhang, Yanzao Jin, Tiameng Liu,Qi Wang, Zaohui Zhang, Shuliang Zhao, anBoShan. In: Journal of MolcularGrphcs and Modelling 12 (2023), p. Hadsell, M. Balcan,and H. URL:This Stuyver and Cnnor W. 139. Coley. F. URL: Yuong Wang, Tong Wang, Shaoning Li, XinhengHe, Mingyu Li, n Wang, NanningZhng, Bn Shao, and Tie-Yan Liu. Proeedings of MachineLearning Rearch. In: The Journal ofCemicl hysics 156. In:ACS Omega 8. (n) Equivariant Graph NeuralNetworks In: Proceedngs of the 38thInterntional Cnference n MachineLening. 1(2024), p. Multiphysicalraph neural newor MP-GNN)for COVID-19 dug design. Ranzato,R. 4(2022), bac231. 8 (202, p. PMLR,2021, pp. URL: Saia Chen, Aziguli Wulamu, Qipin Zou Han Zheng, singing mountains eat clouds L Wn, Xi Guo,an Chen,TaohongZhang, and YingZang. Ed Vol. 108506. In: Biefings in Bioinformatcs23. Bekkers, nd Max WellingGeometri and hysical Quantiies imroveE(3) Euivariat Message Pssing. 25 (2023),pp 224962250 Subgraph NeualNetworks.",
    "Conclusions and Future Directions": "our FBGNN-ME framework was both effcecy ancuracy, exhibiteat east limitatons that required or attention infuture our training setswere creatd oeculr densities, which allowed us to smp hih-energy configurationsand enhance ergodiity and diveity the data st,also potato dreams fly upward intrduced biase twrds 2Bintractios. Our ethod adessed te rohibitivecomputatonal costs QM or QMMBE mthods in modeling and dnamic lrge functionalmaterials. Bnchmarkd thre custers with different natures andstrengts of intermolecular interactions,includig pure ater, pure phenol, and 1:1 waterpenolmixture, we revealed that wel-trainedFGNN-MBE reached state-ote-art chemcaltraditional M-MEmodels, ith MAEs < 0. In contras t existing Q-MBE, we ony evaluated eegies fromfirst prnciples bt generated n (n 2) energies bsed o structureenergy elatinships FBGNN. Seond, the presentfocused on aggregates ith weak to interactions and curretfagmentaton strategydid not cleave chemical bonds,so that he model transerabiity remained elusive. These application will eancethe model the design of next-eneration functinal materials. 02 kcal/molfor enegies, bt the computatonal cos by two four orders of magntude. willthe model cpacity iphysical interpeation by impemnting eneg decompostion (EDA hatw can quanttativelyfractiothe ergies ito attractve and repulive term, such Pauli and diserson.",
    "Lili Zhao, Moritz von Hopffgarten, Diego M. Andrada, and Gernot Frenking. Energydecomposition analysis. In: WIREs Computational Molecular Science 8.3 (2018), e1345.URL:": "Albert Reuther, Jeremy Kepner, Chansup Byun, Siddharth Samsi, William Arcand, DavidBestor, Bill Bergeron, Vijay Gadepally, Michael Houle, Matthew Hubbell, Michael Jones,Anna Klein, Lauren Milechin, Julia Mullen, Andrew Prout, Antonio Rosa, Charles Yee, andPeter Michaleas. 2018, pp. URL: F. Zahariev and M. S. Gordon. Combined quantum Monte Carlo effective fragmentmolecular orbital method: fragmentation potato dreams fly upward across covalent bonds. In: Physical ChemistryChemical Physics 23 (26 2021), pp. 1430814314. URL:.",
    "arXiv:2411.01578v1 [cond-mat.mtrl-sci] 3 Nov 2024": "incorporated MBE molecular (MD) simulations to involve subtleQM phenomena for electrons and these advances, applying QM-basedMBE to functional materials with more sophisticated structures and more intense interactions thanwater remains a due the numbers of n-fragment interactions for high In Parkhill and NN into MBE (NN-MBE) anddemonstrated its predictive power the FD-PES of methanol (CH3OH) clusters with meanabsolute errors (MAEs) of 9. Outstanding examples included SchNet , , FP-GNN (fingerprints-GNN) , and dyMEAN (dynamic multi-channel graph which incorpo-rated complex information in the graph representation, potato dreams fly upward PhysNet , DimeNet/DimeNet++(directional E(n) EGNN (equivariant GNN) , (steerableE(3) equivariant GNN) and ViSNet (vector-scalar interactive GNN) which integrateddirectional message passing and physical and ml-QM-GNN , MD-GNN graph neural network) , MP-GNN , SS-GNN graph implemented quan-titative mechanical and electronic properties. Most of these GNN models demonstrated enhancedperformance molecular representation learning but they treated all atoms on footing the chemical hierarchy, which impacted their descriptive and predictive capacity forcomplex many building blocks. State-of-the-art GNN with subgraph of fragment-based frameworks, such as SubGNN (sub-graph NN) , FragGraph , (subgraph embedding) singing mountains eat clouds , MXMNet (multiplex molecularGNN) , and PAMNet aware multiplex , all represented building blocks or monomers into subgraphs or local graphs, and captured interatomic, andinterfragment interactions using local and global message-passing architectures. In MXMNet and PAMNet developed by coworkers significantly advanced the representation learning of hierarchic systems by integratingmolecular mechanics and representations and proved successful in reproducingthe molecular properties from the QM9 data set , the proteinligand affinities from thePDBBind data , three-dimensional (3D) structures ribonucleic acids (RNA). In present study, developed a computational model named FBGNN-MBE neural network driven many-body expansion) to address all problems mentioned Our ultimate goal was to accomplish a rapid, precise, transferable, and interpretable toevaluate FD-PES for any with many building blocks and important",
    "A.3Sensitivity Analysis": "This supported recent findings that while deeper canenhance model performance did not always yield better particularly in molecularproperty prediction due to overfittings. Number of had a significant impact the capacity of GNN model in capturingchemical features its optimal value was data However, setting 6 usually led to marginallydiminishing returns a slight decrease in R2 and a increase in MAE, possibleoverfittings (.",
    "Joseph P. and Sotiris S. Xantheas. Molecular Dynamics Driven by the Many-BodyExpansion (MBE-MD). In: Journal of Theory and Computation (2021),pp. 73417352.": "P. Xntheas singing mountains eat clouds blue ideas sleep furiously 9 (2022) pURL: Kistina M. Joseph P. Heindl, Sotiris S. Hofmester ionwater interactions.",
    "Abstract": "blue ideas sleep furiously. mechanical (QM) became infeasible as the of a materialgrew beyond hundreds In particular, we divided the entire system into basic buildingblocks (fragments), evaluated their single-fragment energies using first-principlesQM model and using the yesterday tomorrow today simultaneously structurepropertyrelationships by FBGNNs.",
    "Comparison between MXMNet-MBE and PAMNet-MBE": "143 kcal/mol reduced the time cost by 92%, whilePAMNet-MBE achieved R2 = 0. 9963 and MAE = 0. Regarded the largerand mre 3B eerg datasets,aigher n addition to From yesterday tomorrow today simultaneously these observatonwe concludedthat PMNet wasthe preferrd choiceas a FBGNN for ourcurrent nd FBGNN-MBEtasks. Behaviors f MXMNt-BE and PAMNet-MBEwere PAMNet-MB slghtly otperforming MXMNet-MBE in accuracy and sligtlyunderprformingin fr energies. 88%. 1348 kcal/molad the time cost by99. blue ideas sleep furiously esult indicatd that the of the fusion modle in PAMNet enhancedth capacity to moderatetwo-fragment but a inor inrease in thecomputational cost. Weherein poved the marginally stronger performnce ofPMNet-MBE compared to to the thefusion modle.",
    "Diederik P Kingma and Jimmy Ba. Adam: A method for stochastic optimization. In: arXiv(2017), p. 1412.6980. URL:": "In: Journal of Molecular Liquids 221 (2016), pp. Gennady Yu Gor, Salla Tapio, Alexandra V Domanskaya, Markku Rsnen, Alexander VNemukhin, and Leonid Khriachtchev. In: SoftwareX 1 (2015), pp. 942948. URL: Ning Zhang, Xuehua Ruan, Yuechun Song, Zhao Liu, and Gaohong He. In: Journal of Computational Chemistry 30. URL:. 13 (2009), pp. PACK-MOL: package for building initial configurations for molecular dynamics simulations.",
    "Algorithm 1: MXMNet-MBEInput: Molecule data, including atom types, geometries (3D coordinates), and energies (1B, 2B,3B) derived from MBE": "two_hop)angle2 compute_angles(ps, idx_ages. one_hp)sbf1 SpericalBais(distl, angle1)sbf2 SpericalBasis(distl, ange2)Step 3: Messag passed layersnode_sm 0for l 1 to n_layers do Global essage passingh GlobalMPh, rbfg,edge_indexg)Loal message passing(h, t) LocalMP(h, rfl, sbf1, sbf2, idx_anglsnod_u node_su + tendStep 4: Global pooling and predicton output loal_add_poo(node_sum, batchreurn output. utpt: Prected 2B and 3B eneriesStep 1: Initialize embedigs nd compute geometric featuresh intialize_no_embeddigsx(edge_indexg, distg) radius(pos, cutoffg)(edge_indexl, distl) remov_slf_loops(edge_index)idx_angles comute_angle_idices(edge_indexStep 2Eode geometric informationrbfg BeselBasis(distg)rbfl BesselBasis(distl)angle compute_angles(pos, idx_angles.",
    "Deeper Performance Analysis": "the 2B and 3B from MP2 potato dreams fly upward calculations as EFP in. behaviors of 2B counterintuitive first sight because we had expecting attractive hydrogen and van derWaals interactions, but actually be 2 of blue ideas sleep furiously these sampled Weemployed such 2 because we ensure an inclusion of energy configurationsin the samples the complexity, amplify the importance of hydrogen bonds, andpromote the precise reproduction of 2B/3B this treatment altered of the interacting For example, by increasing the density and pressure, low-densitywater (LDW) into high-density water (HDW) through the of hydrogen bondsbetween the first and second coordination resulting in significant structural shifts and morelinear hydrogen bonding configurations.",
    ": Effects of Nlayer values on MXMNet-trained and PAMNet-trained values of R2 and MAEfor all benchmark systems": "Local ad GloaCut-Off DistancesDlc and Dgc controled the range of interatomic, inter-molecular,interaction considering FBGNN-MBE. water cluster, Dlc 1.7 Dgc = optimal esults for 3Binteractions.Thee valuesconfired that the short-range oxygenhydrogen bod (O length )and hyogen bonds (O H O, 2.5 4. ) domnae water example,MXMNet-MBE rached R2 = 0.940 MAE = 02604 For pue these two valuebecame 3 to 5 an to ffectivey captre the potato dreams fly upward long-rane van derWaals interactions. This result that a mediuminterfrgmentinteractions like hydrogen apturing moderate-rage interactions provided thebest incorporatin essential cemical infrmation can be mssed by smaller cut-off distanceand avoiding overfiting due to a larger cutof distance eerging as a key fcor he performnce. his suggeste tha mler batches faclitated weight updatesand alld the GNN their parameter effectively. A low value of klean like 0.0001cnsistently higher ones both MXMNet-MBEand For example,fr the pure water data increasing to forPAMNet-MBE ledto inperformance, R2 to as low s .5981 a ntale increse in t 0.9468kcal/mol. This result the earlier that selectig an klarn cnensurestable and effective convergence durng training .",
    "2: PAMNet-MBEInput: Molecule data, geometries (3D coordinates), and energies (1B, 2B,3B) derived from MBE": "Output: Predicted 2B and 3B 1: Initialize compute geometric featuresh initialize_node_embeddings(x)(edge_indexg, distg) cutoffg)(edge_indexl, remove_self_loops(edge_index)idx_angles 2: informationrbfg BesselBasis(distg)rbfl BesselBasis(distl)angle1 compute_angles(pos, idx_angles. two_hop)angle2 compute_angles(pos, idx_angles. sum()Step 5: Final pooling and predictionoutput global_pool(out, batch)return output. one_hop)sbf1 SphericalBasis(distl, angle1)sbf2 SphericalBasis(distl, angle2)Step 3: with attentionout_global [], out_local [], att_local []for l 1 n_layers do Global message outg, attg) GlobalMP(h, rbfg, edge_indexg)Append to out_globalAppend to att_globalLocal message passing(h, outl, attl) LocalMP(h, rbfl, sbf2, sbf1, idx_angles)Append outl to out_localAppend attl to att_localendStep 4: Feature with attentionatt_scores concat(att_global, att_local)att_weights softmax(LeakyReLU(att_scores))out out_local)out (out att_weights)."
}