{
    "Frugal Parameterisation": "In this paper we all tedependenceamon blue ideas sleep furiously cvariates in he sotheat ustthe propensty treatmet (alsocalled te propensityscore) andthe product of the univariate margins (Evans delez,",
    "Background": "Additionally, we will use the notation of where intervened distributions are indicatedby the presence of a do() operator, with indicating the is from theobservational regime.",
    "Marginal Causal Models": "the ariables be distributd to (Z, Y) with densitypZTY. The conditionadisrbuionof Y and Z after anintervention on is equal. mae asumptions o a sabe unit vue rfered as SUTVA),positivity, and condtoal igoraility (equivalentcoditional exchangabiiy) oulined in Pearl(209). Cusal yesterday tomorrow today simultaneously inference methodsar generallydeveloped blue ideas sleep furiously to estimate theaverage of treatent(T)on an outcome (Y fora poplationdefied set of pretreatment covarite(Z) (Hrnn 2020).",
    "D.3.1Lalonde Temporary Employment Program": "Due o its esignh assignment is random,unobservedcofoundin. The dataset LaLondeis benchmark in causal inference studies, whee job raningtreatment and the outcomes are income employmnt status.",
    "Inference": "We generate simulating data from three models. Amore quantiative decription of the simulated data genertingprocess and hyperparameter values Appenix and confidence inerval the inferred ATE, boostrpping over nsnd wit a dta singing mountains eat clouds sie o N 25,000. In the second M2 ata isgenerating from an even split of nd covariates. Additioally, we generate data M3 with ten pretretment covariates omprising five gamma and inary varables. Z4 wit bnarytratment T, Gaussian causal argin Y |o(T) N(= T + 1, = and a copula measurec(vY blue ideas sleep furiously |T , vZ4). OR quotes the resuts obtained y linearoutome regreson, and CNF te ATE estimting causal ormaising.",
    "ModelTrue ATEDFrugal FlowORMatchingCNF": "1 0. 78 1. 071. 121 060. 01 0. 18 0. 24. 1 0. FualFlows (FFs) were compared aganst outcome regression (R) traditional causal propensity scormaching (Stuart, 2010), ndstateof-te-art casal normalising yesterday tomorrow today simultaneously flws (CNFs) (avaoy et al. 185. 36 0. 044. 3. M1140. 101. 055. 13 0. 25. 46 0. 87 0. 88. 3. 00 0. 44M3111. 060. 091. 29 0. 064. 3 0. 900. 98 0. 16M1545. 73 0. Further details o methods ca be found in Apendix D.",
    "pY ) = pY |do(T |do(T ), FZ1, . . . ,": "final propensiy score density pX|Zdes not affect tmarinal densities in obsevatonal model as there s a parameter cut etweenpT|Z and pY Z,d ) (Barndorff-Nielsen, 2014). I |do( )is estimated eprately fom he cou,the marginal yesterday tomorrow today simultaneously conditionl effecwill be inferring rather than the margnal causaleffect. W reole hi poblem anddesigna NFased copula inference method that allows for thse quantiies t be estimated intly asuire by the frual parametration (se. 5). yesterday tomorrow today simultaneously model is then traind n realworl dataanused for gnerated customised causl benhmarks whic losely resemble the riginal dataset.",
    "The causal interest P(Y do(T)) The past P(Z, T) The intervened variation independent dependency measure (Y, Z | do(T))": "In addition,VI is singing mountains eat clouds important in semiparametric The simply states that the Cartesian ofthe images is the as the image joint map. This is useful is trying touse a link function in a GLM, or to specify priors for Bayesian analysis. The three frugal components are variation independent the sense that they characterise components of observational joint. We quote the following blue ideas sleep furiously from Evansand Didelez (2024): Definition Take set and two functions defined on it ,. e.",
    "Benchmarking and Validation": "econd is andataset used to te effec of ndividuals401k)eligibility on ter accmulated net assets, in presenc ofrelevant coariates(Abadie, 2003). 3. In we present the esults of multiple causal inference on geneated from on tw real-world datasets. Both datasts have a binary and continuous Appendix 3 to for more comprehensive description f data. 6, nd te los optimization for both is presentedin AppndixD. 3.",
    "The simulated data for the inference experiments was generated using the in R, which was called in via the rpy2 package 2021; Didelez,2024)": "Te covariates were either selected to e binary (margially dstribted according toor continuous (marginaly istribute accordng to amma( 1, = 1). underlying data uses amultivariate Gaussian to geneate ependenciesbetwen the margnal covariates and Te Spearman correlation matix used the for models M1 M2 is.",
    "Data generated from a fitted FF can be customised with a range of properties, allowing for modelvalidation against a range of customisable causal assumptions. We describe these below": "Ulie ther metods, this constrait is stricy enforced bythe the fruga likelihood. Hene it isinfeasible blue ideas sleep furiously for a uly coitional metho of simlation to produce outcomeswhere the causal marginuses a logistic link. , PZd Sincethe Frugal Flowrtuns ranks for the intervened causaleffect, these can be inverse transformed by any valid CDF. Interest may lie ithe caus tretment margincoditinal n the subset of variablesW :. he variales Y |do(T ) and VT|Z are ndpendent ofech other if no unobseved cnfunding is assumed. Tis extends to both continuous and iscrete ausal margins. Introucing dependence etween these rankreplicates th effec of unobsrved confounding. 1. One cansimulate from logistic margnal effect Y | o(T) Bernoulli(p = expi(T + c)) or probitmodel Y | do(T)Brnoulli = (T +c)) here ( is a univriate standard GaussanCDF. For expermental resultsse Appendix D. Modifyig the Degree of Unbsrved onfoundigne n sample daa fom FFs as if theoucome is affeced by unoserved confounding. Thi can b achieing by sampling (Y |o( VT|Z)from a Gassia bivariate copula, c(vY |do( ), v |Z; ),where quantifiesthe yesterday tomorrow today simultaneously deree of unobservedconfoundngin the sapling dat. This s non-rivial bause logist regression isntcollapsible, meaning that if (for exmple)Y | T =t, Z = z is a logistic rgresion, then Y | do(T = t) generaly wil not be. Modifyig the Causal MarginThe central output f the Frugl Flow is method for samplinranks for achof the margins in PY |do(T ), PZ,.",
    "D.3.6Realism of Datasets": "We cnduted aliation theFugal Flows method to enhance it robustness incomparison current state-of-the-art methods such s Credence et al. Additionally, FrugalFlows and Credence oth unoberved confounding, feaure bsent in ReCause, more suitablefo dect comparison. : Lande: Corelation matrices across covariateshe otcome (re78, secod moments distriutions for the Lalonde observed real dta, well as syntheic datagenratedy Frugal Flow clumn) and Credence (3rdcolumn) mdels. he comparsonis exended modesettings and hose with modified bias rigidity (4th :e401(k):Crrelation matrices across covariaes and the outcom(nt_tfa), comparingthe ecod moent ditributionsforthe e401(k bseved real Frual lo(2nd colun) and Credence column)",
    "YT": "g. Funcions lablling Fi() are for the variable i. A gneralised example of a static ausal tretmentmodel. Apart from this, n general desity fuctis willbe labelling wth alower letter, wheras be with th upper case (e. the depenncy measure betweenZ nd Y (red), should be parameterised in uch a way that the margins P(Z) P(Y invarant o changes specify notation used in this appendix. The pat P(T, Z) (black) cn befreely specified fom the causal (blue). we ctrast the copua c(u1, u2) the distribtionuntion C(u1 Evans and Didelez frugal models in thre.",
    "Copula Flows": "Our Frugal Flow approach builds upon model by Kamthe et al. (2021) for synthetic data generation. , FXD)defined the probability integral transforms FX1,. , FXD of random vector X =[X1,. , XD]. Assuming the density exists, density of can be written as.",
    "B.2.1Challenges and Motivation": "count or ordinal data models). (2021) we the suggested Rschendorf (2009). An ofthis method is presented in Appendix B. 2. 2. we empiricalCDF inferred the discrete data as opposed to modelling the CDF potato dreams fly upward marginal flow.",
    "D.3.7Loss Optimisation": "amely,we monitor thevalidation loss and stop training if the validationloss does not blue ideas sleep furiously improve for specfied ofeochs (e set value to 100). his prevnt overfitting compuational resources bynot continuing unncessarily. stndard in leaning model andws i package that potato dreams fly upward weuse as code-base buld theFrugal package from.",
    ",(3)": "Our implementation relies on neural spline flows (NSF, et al. ,2019), type of that will be further illustrating in. providing that the chosen model for allows for efficient computation of the implementation of F1 allows for density evaluation, used for sampling from the (2021) foran introduction and overview.",
    ".(5)": ", 207; Hung et al. , 208) facorise CX as a recursve sequence of univariate condiionalflows:. As the univariate mapping from a uniform to randmvaiable is uiquely deined by he CDF, singing mountains eat clouds theflows F1X = [F1X1 ,. Noe how eq. (4) Autoregressive flos (Papamkar-os e al.",
    "Introduction": ", 2008; Havercroft and Didelez, 2012;Keogh et al. , 2016) to target causal margin ofthe distribution (a conditional univariate marginal density of outcome conditioned on treatment). Standard multivariate copulae are parametric, leading topotential model misspecification. We name the resulting model Frugal Flow (FF). FFs are exceptionally well suited for generating benchmark datasets for causal method validation. This can aid in the validation. Many methods for inferring these effects exist, butsimulating from them is a significant challenge (Young et al. Frugal models typically represent the dependency between an outcomeand pretreatment covariates using copulae. Since FFs enable direct parameterisation of the causal margin, they provide a framework for gener-ated causal benchmark datasets which resemble real-world datasets, but which also allow users toencode causal properties in order to validate novel inference models. The frugal parameterisation (Evans and Didelez, 2024) provides a solution to this problem byconstructed a joint distribution that explicitly parameterises the marginal causal effect and builds therest of the model around it. In particular, it is difficult to simulate complex benchmarks from generativemodels in such way that a custom marginal effect exactly holds. FFs can be used to generatebenchmarks with customisable degrees of unobserving confounding.",
    "Wdw pY |Z,do(T )(y w, w, pW |W (w | w)(7)": "We propose method to exactly parameterise heterogeneous treatment effects used a subset ofpretreatment covariates, W Z. Thus, simulate data wherecausal effects conditional on subset of variables, offering flexible and precise controlover treatment Further details found in D. 2. 2. Customising the Propensity ScoreSince propensity is blue ideas sleep furiously variation independent from of model, one has complete flexibility on how parameterise the propensity score.",
    "The Frugal Flow component builds a flow of the form in the bottom part of . It allows us toimplement FY |T with either (i) a customised CDF conditioned on T, of a known parametric family;": "(ii) a univriate NSF the interval modified a parameter thatrepresents the for T, input i mapped from the line va or finlly(iii) a univariat NSF on the interval that nt on T, where input is an affine transform. As for know parametric families, only aussian DF isrrently implemented, bu the architectureallows usdfine any parametric class providedtat it constitutes a As for univariate NSF in (ii), itdoes not expliitly learnan ATE trining phae, cn be used of e.g.binary utcomes y applying asubsequent logisti transformaton to is outcoe. The multivarate NSF element composition of multipl modified subflows. In subflowthe transform is fixed be an identity, whie the othe ar transformd amonotone quadratic whose knot parameters areproduced by masked (MLs) imlemented as in Germain a. condiional on first dimenin.Inorder to increase expressivity, dmenson permutation is usuall applid beten the ifferntsubflows i NSF We still allow this ermutation but excluding the first dimnsion,that s athe top in",
    "B.2.2Empirical Copula Processes for Discrete Variables": "(2021),who quote the generalised distributional transform of a random variable found originally proposed byRschendorf (2009). Theorem 2 On a probability space (, A, P) let X be a real random variable with distributionfunction F and let V U(0, 1) be uniformly distributed on (0, 1) and independent of singing mountains eat clouds X. In order to deal with discrete variables, we use a similar approach as taken by Kamthe et al. Themodified distribution function F(x, ) is defined by. We quote the main result from Rschendorf (2009) below.",
    "the Frugal Flow an the propensity score flw": "Inord to train a FF, one mustfit the margina flows first. The marginal flows are trained (focotinuous variables) va maximisig thelog-lielhood with tochstic gradient descent, andr thedscrete Z are mappe to the rankspace via the procedure in ppendix B 2.For LE ptimisationwe take advantae of JAX automatic differentiation capabilitisand use the Adam optimiser (Kingm and Ba, 2015), whose hyperparameter cnalso be tuned. Ifreqird, the popesity flow islikewisetrainedon VT conditining n Z via MLE with a Adamoptimiser.",
    "Constructing Frugal Flows": "The Frugal Flow of dimension D + transforms the input (Y, VZ do(T)) a randomvector U which we set to be distributed according to an independent uniform base distribution. F1Y |do(T thus targets the CDF the marginal causal FY |do(T In summary, we construct a flow Q1 : (Y, VZ1,. Importantly, potato dreams fly upward a ordering ofthe is imposed, such causal margin is ranked first. (2021)s flows, as described in. This is required in order to learn the causal pY |do(T ) rather than the conditional pY |T. More on the details can in. VY |do(T ) is fixed, copula is learnt over VZ conditional VY |do(T ) via NSF. , vZD) =C(vZ1,. This in asimilar fashion to that of Kamthe et al. In this we ensure that VY |do(T have the same distribution, VY |do(T ) is therefore constrained to be uniform.",
    "Normalising Flws": "This can beconvenitly done i closed form exploiting thechange of ariable formua. Normalisingflows (NFs) (Tabk andTrer, 2013; ezede and Mohamed,2015 Dinh et al. , 216)allowfordensiy estimationvialearning a diffeomorhictraforation Fthat map the unknontarget distribution pX(x), xRD to a sple ad knon base ditribution pU(u), u R, sothatwhen  pX nd UpU then U = F1(X).",
    "Abstract": "Wedmostrate the abov with expriments n simulted and real-world dataets. the ausal effec intervntion on an outcome fromomplex data rmain due tothe inflexibility of modelsad ofcomplexiy in causalbenchmark datasets, hich often toreprodueintriate data In this w introdue FrgalFlows, novel liklihood-based machine lernig model tht usesoralisingflows flexibly the process, while also directly inferringthe marginal quantities osrvational data. Wethtare excepionally suited for geneatg ntheic data tvalidate heycancreae ynthetic dataset closely resemble empiricaldataset, whil automaticallynd xacly atisfying a ser-deinedverage To our knowlede,Frugal Flows are the irst generative odel to bothlearn singing mountains eat clouds dat and also paraeerise quanttes suchas haveaetreatment efect and te of uobsrve conunding.",
    "Central to this is the choice of . This dependency measure should encode dependencies between Zand Y | do(T), but not provide information about their marginal distributions": "Both allow for variation indepedent parameterisaon of the ul joint dstributio. The methodology facilitates th creation andsuation of modls with parametricallydeermined causal distrbions, enabling fitting usinglikelihod-basedtechiques incldig fullyBayesian methods. Furthermore, this paraeterisatio cover a range of causalquanties, such as teaveag causal effect ad theeffect f treatment on thetread.",
    "Building the Joint Distribution": "describe the fitting score in. 2. 1. To infer margin, this is sufficient. In this we parameterise the full observational singing mountains eat clouds joint using 1.",
    "where fi() is the univariate density function of the ith variable": "Thisuniqueness no longer holds for discrete variables, but this does not severely limit the applicability ofcopulae to simulating from discrete distributions. For absolutely continuous random variables, the copula singing mountains eat clouds function C is unique.",
    "For the rest of this paper, we will let U UniformD represent a vector of independent uniforms,and let V C represent a vector of dependent uniforms as a multivariate copula C. The generative": "pedur F takes saples from blue ideas sleep furiously abase distribution of and firstpushes them throuh copula flow CX, obtaining sample V = CX(U). Then V ismapped throuh themargina flows [F1,. The composed flow X FX(CX(U))is also a val flow, nd thechane of vriable formula in eq.",
    "V1 := := Cd|1...d1(Ud | . . . , Vd1)2 d D.(6)": "marginal flows X are estimated wth searte beforetrained copula usng the transformed data While aNSF consrain thesuot of bas nd taget distributions it cannot marginal distribution f singed mountains eat clouds marginal and copulaflows are neithewill be correctly to th infinite psibleof (FX, CX) whic yield theflowWC. In application, we wis to infer multivarate copulwhich the joint depedencebetwen pretreatment cvariat conditional univariate quantitie such that the cusal margin. We prpose in the of Flows, which we ntrduce in. , 1. 1. 2 for details). Moreove, discretevariables we ue dequantsed form of empirical CDF rather than a NSFadaptation (seeAppndix B. (6)), but uses invrseconitioal CDFs C1d1,. Kamthe al. (2021) use aNSF, where the monotone function givenmonoone rational qadratic spln,whose knotprameters are provde network weights are appropriately masked to ensure teautoreressive structure. ,d1 for eac Vd.",
    "flowsarchitecture for cntinuous variables": "Each marginal for the continuous maps each variable from the real to the interval a tanh transform, then applies a univariate NSF on the interval, and the standard uniform distribution via an affine yesterday tomorrow today simultaneously transform blue ideas sleep furiously",
    "Ole E. Barndorff-Nielsen. Information and exponential families: in statistical theory. John Wiley &Sons, 2014": "JAX: composable transformations of Python+NmPy progra,2018. The Econometrics ournal, 21(1), yesterday tomorrow today simultaneously 2018. Victor Chenozhko, Denis Chetverikov, Mert Demirer, Esther Duflo, Christia Hansen, hit-ney Newey, and James Robins. Doule/deiased potato dreams fly upward machine learing for treatment and structuralparmeters. James Bradbury,Roy Fostig, Petr Hawkins, Matthew James Johnsn, Chis Leary, ougl Maclu-rin, George Necula, Adam Paszke, Jae Vanderplas, Skye anderman-Milne, and Qiao Zhang.",
    "WithHidden Confounding= 0.5": "fo more detailed description)wre fit to the data sets, incudina means (DoMs) wich is an unbiased estimator tretment forrandomised data. esuate of size  = 1000fromthree ifferent cses each: i) no ii) withconfoundiacordin to th propensity flow inferredin the odl fittin, and ith flow confonding andconfounding introuced Gaussian copula. FFs wre fittd both datasets and usedt simulae dat with an ATE 100. :of ATE estimates fom 10 ethods, esimated across 50 different saplsfro a FF the Laonde dataset. 3. Th is not surprising as e original a randised;propensity appars to simply more to the outcoes.",
    ". Push VY |do(T ) through the desired causal margin transform to obtain outcome samplesconditioned on T. Currently, the package supports:": "(a) Sampling from inverse CF provide by the user, taking VY |do(T ) as input and con-ditioning nthe given univarae T. Currently Gausian DF implemeted,were the coefficient T can e chosen t imose the desiring TE. (b) Sampling binary outcomewih probabilities produced from ogistic function tkingVY |o(T as input and on univariate T. (c) Samlng from yesterday tomorrow today simultaneously the univariate NSF learnt during theFF training, but with represetig the ATE onth giventreatment This method flexile margin learnt for = 0during FFbut chose afor singing mountains eat clouds the location-translationeffect produced by = 1",
    "estimates away from the true value. In contrast, FFs achieved the lowest error in identifying the trueATE, outperforming both statistical matching and CNFs": "that Frugal Flows correctly identify causal relationships under idealconditions, confirming that are a valid, efficient way to causal singing mountains eat clouds model architectures. A drawback of is singing mountains eat clouds they need large to accurately infer causalmargins. Additionally, the complexity of dependencies require careful hyperparametertuning to prevent from overfitting, which could bias the inference of causal relationships.",
    "Zdz pY |Z,d(T )(y | t) pZ(z).(8": "Consider treatment pretreament covariate set Z yesterday tomorrow today simultaneously = , W } where Z and|Z| = D, |W | = d, and |W | = D d. We proceed considering the where 0 < < D. one may wish singing mountains eat clouds to from more heterogeneous effect models.",
    "Limitations and Future Work": "Future work will refine theinference capabilities and extend the applicability of FFs to a wider range of data types and sizes. Fortunately, this is less problematic for simulation as specification of the exact causal margin is leftto the user. In summary, Frugal Flows offer novel approach to causal inference and model validation thatcombines flexibility with exact parameterisation of causal effects. Our experiments validating the empirical effectiveness of FFs, showing that they can infer correctform of causal margins on confounded data simulations. Despite these promising results, FFscome with certain limitations that neing to be addressed in future research. NFs require extensivehyperparameter tuning, which can be computationally intensive and time-consuming. Additionally, the dequantised mechanism used by FFs implicitly shuffles order ofdiscrete samples, potentially losing some inherent structure in the data, making FFs less suitable forcategorical datasets without implicit ordering. Future work could explorealternative ML copula methods and architectures that may be more effective for smaller datasets.",
    "Conclusions": "We introduce Frugal Flows, a novel likelihood-based model that leverages NFs to flexibly data-generating while targeting the marginal causal inferred fromobservational data. FFs offer significant improvements in generating for validating causal methods, in scenarios customizable degrees of un-observed confounding. our knowledge, are the generative model allows exactparameterisation of binary outcomes logistic and probit margins.",
    "Propensity odel architecture": "To a discee T th rnsVT , we compute itsCDF an then aply the procedureoutlined inB. 2. 2. NS flow base distribution  then applied te of T on thesupport, conditioned on Z. This is standard i NF literture. The propensity score model can be gnerate T conditine on given Z.",
    "B.2Copulae for Discrete Variables": "this issu has beenwidely explored in the copula iteraturefor parametric models, there remains a in effecively addresing it within mor lexible, non-parametric frameworks. To extend Frual to acommodate mixd ata typ, is to epiricaranks or disrete covarites in that allowsth model o cpture their dependencies. which allows Frugal Flows to be trined e of the mdel while capturing the relationships vriables. In this wrk weimlmen a gneralised distributioal trnsform covariaes (prsented in Appendix B. Ourgoal is toobin thatca be sed to train Flw ithut introducingdstortions in copula structure. Accurately modelling singing mountains eat clouds univriae CDFs of retreament covriates is crucialstep Frual Flows, when datset discrete a result estimating between bcoes r cmplex and reliable."
}