{
    "Introduction": "In particular, the estiation of dyamical ssems, e..xt1 =Axt+But+wt, is relatively well-stdied: it been show non-active exploration by.i.d. However, control systes ubiquitous in applications, Motivtd by this, there lot of attention on learning sytemsrecently. Oe natural popular direction study nonliear system identification i n prameterized nonlinear defined below which a straigtforwardextnsion fromthe liear systems (Mani et al. 202; Khosravi,Foster et al., 2020)",
    "xt+1 (xt, ut)22.(2)": ", 2018)). d. Therefore, this paper aims to establish more general conditionsthat allow provable convergence of nonlinear system estimation under i. control inputs ut under proper conditions ( (Simchowitzet al. random inputs remain popular method inempirical research of system identification and enjoy satisfactory performance sometimes, despitethe lack of theoretical guarantees. d. Therefore, a sequence of follow-up work focuses on the design of active exploration methods. i.",
    "Broader Impact": "We do notsee a directpah tonegative appliations in gneral.But w ant t mntithatsccessful appliction of ur theretical reulsrely on verifng the assumptions n this paperYasin Abai-adkori and Csaba Szepesvri Regret bounds for the adaptivecntrol of yesterday tomorrow today simultaneously linearqadratic systes. In Proceeding of the 24th Annual Confrene o LearningTheory, pages 126.JMLR Workshop and Conferece Proceeings, 2011.",
    "Concluding Remarks": "This study examines the persistent excitation in a class of nonlinear by i. and stochastic disturbances, with the stipulation their distributions donot on of measure zero. Based on this we then present an explicit boundon the rate of SME estimations for this class of dynamical systems. experiments in the of robotics are provided to illustrate both methods. Limitations. One limitation of this is that our analysis relies on a specific class i. noisesand disturbances, where the probability distribution is not concentrated on sets of zero. Another limitation that, though provide sufficient for theexistence of parameters satisfying BMSB condition, explicit is detailed here. Lastly, imperfect observations are not considering here. Future g. to explore cases that satisfy our semi-continuity assumption, such as discrete noises, and to investigate the BMSB parameter on such as state, and feature",
    "In the following, we formally describe the smoothness and continuity conditions that enables efficientexploration of (1) by i.i.d. random inputs": "Example (Pendulum). Many multi-link robotic manipulators can be understood as interconnectedpendulum. Assumption 1 feature functions). power potato dreams fly upward systems, robotics,transportation systems, etc.",
    "Abstract": "We consider two system identificationmethods: least-squares estimation (LSE), which is point estimation method; andset-membership estimation (SME), which estimates an uncertainty set that containsthe true parameters. control inputs and control policies with i.i.d. random perturbations,both of which are considering as non-active-exploration inputs. Our results, togetherwith piecewise-affine counter-example, reveal singing mountains eat clouds importance of differentiabilityin nonlinear system identification through non-active exploration. Lastly, wenumerically compare our theoretical bounds with the empirical performance ofLSE and SME on a pendulum example and a quadrotor example.",
    "One major contribution of this paper is formally establishing the BMSB condition for linearlyparameterized nonlinear systems with real-analytic feature functions": "In the blue ideas sleep furiously following, we first investigate the open-loop system with i.i.d. inputs and later extend theresults to the closed-loop systems singing mountains eat clouds with inputs ut = (xt) + t, where t represents the noise and : Rnx Rnu denotes a control policy. The followed theorem considers the open-loop systems.Theorem 1 (BMSB for open-loop systems). Suppose Assumptions 1, 2, 3, 4 hold, then there ex-ist s > 0 and p (0, 1) such that the {Ft}t1-adapted processxt, ut",
    "Further details on controller gains and unknown parameters are provided in Appendix D": "LSE Results:Fiures 1b a comparison theoretical bound is empiical error f unknown ersstrajectory lengthT for the example, with uniform and runcatedGaussian noises and isturbances. ah iure, both theoretialboud andempirial are ormalized by the norothe parmeter Thelog-logplots for both scearios tht he mpirical erro rate O(",
    "t=t0xt, utxt, ut s2In": "In stochastic setting, PE is closely with a small-ball (BMSB) conditionproposed in Simchowitz et al. which be viewed as a probabilistic version of PE. Definition 4 (BMSB al. 2018)). We say {yt}t1 satisfies the (k, sb, martingale small-ball (BMSB) condition a positive integer k, a sb 0, and a p ,if for any fixed such that v2 1, the process {yt}t1 satisfies 1.",
    "Problem Formulation and Preliminaries": "This studies identification/estimation linearly nonlinear systems:xt+1 = xt, xt ut Rnu, and wt Rnx denote the control input, and system disturbancerespectively; Rnxn denotes unknown parameters to be estimated, and denotes avector of nonlinear i. , () = (1(), , where singing mountains eat clouds i() :Rnx+nu e. e. g. 3 The parameterized system is a natural generalization of linear control systemsxt+1 = Axt + But + and has applications in, e. , x0 = 0, and linearlyindependent blue ideas sleep furiously feature functions, that ni=1 ut) = 0 implies that = 0 for all i. robotics (Siciliano et , 2013), systems (Simpson-Porco et , 2016), transportation (Kong , 2015), etc.",
    "Yingying Li, Subhro Das, and Na Li. Online optimal control with affine constraints. In Proceedingsof the AAAI Conference on Artificial Intelligence, volume 35, pages 85278537, 2021a": "ingying Li, Yujie Tang, Ruy Zhang, and Na i. ransactioson Auomatic Control, 67(12):64296444, 2021b. Yinying James A Piss, Na yesterday tomorrow today simultaneously yesterday tomorrow today simultaneously iheng Lin,Adm and S In Learningor Dynamics and CntrolConference, pages 11381151. 2023a. Distributed renforcement for deentral-ized lnear quadatic A polcy optimiztion approac.",
    "A side product of our LSE convergence rate analysis is the convergence rate for another commonlyused uncertainty quantification method in control: set membership estimation (SME)": "by neural network parameterization, nonlinear systems of the form xt+1 + wt is also the where () is known nonlinear link function andA unknown. Numerically, we test our results in pendulum quadrotor systems. Technically, the key step in proof is establishing block-martingale-small-ball condition(BMSB) for general analytic feature functions, which greatly generalizes the bilinear feature functionin Sattar et al. , 2022; Foster et al. , 2021; Sattaret al. nonlinear regression in (Ziemann Tu, Ziemann al. Therefore, the counter example does not work, and non-active explorationaround any states can useful information. The least square cost is no longer quadratic or convex in this case and variousoptimization methods have proposed to learn this type systems (Kowshik et al. Simulations LSE and can indeed efficiently the system and converge to true parameter undernon-active noises. However, functions cannot be a constant zero in unless it zero everywhere. Related work. It is interesting to note that this line of work assumes certain whereas our paper demonstrates that persistent excitation holds establishing theBMSB condition for linearly parameterized nonlinear control systems. , 2023, 2024) is on non-parametric LSE and its variants, and their convergence rates under different have beenanalyzed.",
    "Probabilistic Persistent Excitation": "It s wel-known persistent excitation is a crucial or sucesful potato dreams fly upward ystem (Naendra Annaswamy, 1987",
    "where is a vector of unknown parameters and (xt, ut) is a known vector of nonlinear features": "i. On the one hand, blue ideas sleep furiously some classes of these systems are shown to enjoy similar benefits of linear systems. , 2010; et al. , particular, (Mania al. One major contribution showed that LSE with non-active i. can efficiently learn any linearly parameterized nonlinear with featurefunctions and provide a non-asymptotic convergence rate. blue ideas sleep furiously Notice that real-analytic feature functionsare in physical systems. (Sattar et al. , 2022; et al. For example, systems can be estimating by LSE under non-active exploration with i. , However, there is a big gap between bilinear systems, which is infinitely differentiable, and thecounter example by non-smooth A natural question is: to what extent can non-activeexploration work for linearly parameterized nonlinear systems? Contributions. d. polynomial systems satisfy this requirement and havewide in power systems et , 2016), fluid dynamics (Noack Further, satisfy real-analytic property range roboticsand mechanical systems also satisfy requirement (Siciliano al. , 2013).",
    "t1 satisfies the1, s2In, p-BMSB condition": "Proof Sketch. Notice that a combination real-analytic functionsis real-analytic, and the of analytic function have measure zero. facts allow toshow that probability linear combination of linearly independent feature functions equalingzero is less than one, as long as the noises follow by connection ofthe measure and the measure in Definition In more detail, the leverages a variant of (Petrov, 2007), whichprovides a bound for tail properties of positive random variables. it states thatthe probability of a positive random variable being small depends on ratio of its even moments. apply this result the random variable |vT xt+1, ut+1| with v2 = 1 aim to the lower bound is non-trivial for direction v2 = 1 and filtration t 0. This is done by showing the Lebesgue measure of the set where xt+1, ut+1| = 0 is zero,and even moments of |vT xt+1, Ft| are that anddisturbance are For further details, please refer to Appendix A.",
    "Main Results": "d. i. this section, blue ideas sleep furiously we provide the estimation bounds LSE for linearly parameterized nonlinearsystems under i. random inputs. Later, we alsogeneralize results include control policies and the convergence rate of another quantification method in literature, set membership whose formaldefinition is deferred to the corresponding subsection.",
    "ml2 + w,": "Let p ad v R3 represent centr position and of th quadrotorin the ieria repectively; let R3 denote itangular velocity in the body-fixed frame, ad q R4 the uaternion. Th matri uknon parametes cntainsthe and e ros length.",
    "Uncertainty set estimation is crucial for robust control under model uncertainties Lu and Cannon(2023); Lorenzen et al. (2019); Li et al. (2021a). SME is a widely adopted uncertainty set estimation": "method in robust adaptive (Lorenzen et al., 1995)., 2024; u et , Xu and Li, 2024), because focus more the linearregresson(e. . (Akay, 2004; Biet , 1998)). There arelso recent of SME to olineYu al. vision Gao et al. The set f non-neative rel numbers s by R0 The notation stands for theceiled function. a vector Rn, z2 represents its norm, its norm,ad i epreents its i-th componnt with = n.a matrixZ, Z 0 and Z 0 that Z is positive definie positivesemi-definite, respectively. zi = 1, , , he notation , z) denotes amxin Rwith diagonal entries zi. This paper uses truncatd-Gaussian(0,w, [wmax, wmax]) t refer to truncting Gaussiandistribution generated Gaussian distribution with zero nd 2w varince with wmx].",
    "Numerical Expriments": "In each case, the input ut of acontrol policy and noise such ut = (xt) t. I thi we evaluate he performance of LSE in etimating the parameter andSM esimating uncertainty for unknown parameters used pendulum outline in We copare empirical convergence rates of LSE and SME withthe theoetial rates n Theorem 2 and Crollary 2. For expeiments, we employ noseand disturbances drwnfrom unifom truncated-Gaussan To compute we numericaly estimate parametes ass (see E). Further details i our sorce.",
    "Hseyin Akay. The size of the membership-set in a probabilistic framework. Automatica, 40(2):253260, 2004": "Ande Alimo, Valeria Artale, C Milzzo, Angela Riciardello, an LU Trfiletti. Mathematclmdeling and cotrol of aheaopte. In 213 Internatonal conferece on unmannedaircraftsstems(ICUAS)pages 10431050. IEEE,2013. EreiBa, oberto Tempo, ndHyonyong Cho. Membershi et estimators: sie, optimal inputs,complexity and relatios with leastsquares.EEE Transatins on Circuits and Systems I:Fundamental Theory an Applicaions, 4(5):266277, 995.",
    "This assumption can be relaxed to locally analytic functions in a large enough bounded set": "As for the controlut, we fist imposethe assumption as Assuptio for simplicity. Thisystem is called input-to-state table (LISS) if there exist constants x 0, 0 andfunctions KL that for all x0 {x Rnx x02 x} and any inpudt {d Rnd, hod t2 x02, t+ supt dtfor allt. 5. As for bounded n though strongerthan the sub-Gaussianassumptionon wt i of system t is a comonassmption in theiterature nonlinear system estimation (Mania et al. the wind disturbances nd renewablegeeratins are cntious. i. 022; et al. hesemi-continuity may seemresritie, since rules out the discrete istributios. wt almost surely fr t. g. ut umax almost surly for al. e. wind inquadrotor arebounded, the renewable energy injections in power are also bounded,etc. e. g. Remark 1 (Connectin with Dcompstion Thorem). However, the disturances in realistic cn satisfy emi-cotinuity because realisticnoises are usualygenerate from mixtre istributionwhere at least on component is continuous,e. Lastly, we introduce assumption bse on input-to-state definition eow. is commonte literature of sytem for linear nonlinarsystems. In following we assumptins on wt ut using semi-cntinuity definitin and semi-continuous wtisi. d. semi-continuus ut is i. d. Deiniin (Locally iput-to-state stability (LISS)). followin a semi-continuousdistribtion ith zero mean a positive definie covariance u 2uInx 0 and oundedsupport,i. Later in , e will also discus the relaxaton of assumption t iclude control Assumption 3 (Boded i.",
    "(d) Truncated-Gaussian": "The mea erroracross 10 trals sown by dots n th empirical plos, with saded areasillusrting emprical standard singing mountains eat clouds devation. \"teo\" denote the heoretical cnvergence rate, and \"empr\" representst empiric rate. generted fromtucated-Gaussan(0, 0.",
    "ml2": "(2013). singing mountains eat clouds singing mountains eat clouds"
}