{
    "Inroduction": "Recent advancements in 3D point cloud have marking a significant leap in field ofcomputer vision and processing Current methods primarilyconcentrate on training testing on a. datasets domain also knownas domain shifts. instance, models trained meticulously synthetic data, such asModelNet40 , may adapting to intricate and noisy real-world data, suchas ScanObjectNN. Nevertheless, they performance on other target data.",
    "Point Cloud Continual Test-Time Adaptation": "Formulation. In this we study a setting of continual test-time adaptation formulti-task cloud understanding. Suppose have R domains Ds = {D1s, D2s, . . , DRs employs the input point clouds {Iq, (along their {T kq , T kp krepresents the task index) from two different Djs} Ds, (i j) form the contextpairs, the with a representation that effectively source domains. the pre-training phase, each sample comprises two context pairs: theinput point pair (query prompt) and their corresponding pair addressing the During the test PCoTTA align streamed target data It Dt (whereDt = D2t . . . } denotes the set continuously varying target domains) towards sources thatpossess correlative features to the off-the-shelf model. yesterday tomorrow today simultaneously Learning Objective. We follow PIC for cloud understanding tasks: (1)Reconstruction, which focuses on generating dense cloud from the sparse input; (2) Denoising,aiming at noise outliers from the input point cloud; (3) Registration, dedicated original of a randomly rotated cloud. Please note these three tasksmight slightly different from definitions. are used they be handledsimilarly given point learning can predict point directly. This them unifiedwith position output and a single loss. We employ the MPM framework to query resultsacross multiple downstream tasks, with a unified objective and model. Let () denote themodel shared across all and masked patches P be",
    "Experimental Setting": "We implemen our metod using PyTorch an perform experiments ontwo NVIDIA A40 GPUs. Telearning rate is set to 0. e. ScnObjectNNincldes1, 577 training samples and 392 testing samples. We also consider real-worlddata: ScanNet and ScanObjectNN. Implementation Details. ll models are traied for 30 epochs during the pertaining stage, andwetrain thepre-trined model fr 3 epochs on the source domains to initialize ourpototype bank. Subsequently, we generatecorresponding ground truth baed on 3 different ask. The synthetic datasets include ModelNet40 and Shapeet. Modelet4 consists o 3, 713 samples for training and 686 fr tetig, whileShapeNet comprises 15, 001 training samples and 2, 145 testing samles. In all expriments, we employ ScanNet and ShapeNet as the sourcedomains andevaluatethetransferabilityof our methodonhe othewo target omains, i. Attesting time, e continuously adapt test samples to the sourcepre-trained model and validatetheanti-fogettin capability of our mthod across multiple rounds. , MdelNet40 and ScnObjectNN wih3 repated times by default. 7, consistent with prior studies. Within the MPMframework,the mask rati is setto0. 00, with a cosine learningscheduler andaweight deca f0. New Benchmark.",
    "n=1F(In),Zs RRKMC,(3)": "After on the multi-task and multi-domainsetting, we save all source prototypes derived from the at the considering the common knowledge yesterday tomorrow today simultaneously available to the target data test time. Prototype propose a prototype bank stores not only the prototypesZs but also series of learnable prototypes RSKMC, where S indicates number ofall potential target domains Dt. We adaptation of target tokens through mixture pairing selectively updating only the learnable while the ones, risk of catastrophic forgetting of the domain knowledge due the adaptively learned information. Prototype-pair Mixture. illustrated in (a), tokensfrom test data serve as the node a graph structure, adjacent to all prototype-pairnodes. the Prototype Mixture (APM) module, designing to merge source and.",
    "Gaussian Splatted Shifting": "this we propose theGaussian Splatted Shifting (GSFS), preventing error in online manner. Our key insight is prototypes within a node (i. e. similarities the test data andthese two types of prototypes Gaussian projections onto a plane, with the learnableprototypes to two axes, respectively. In thismanner, all prototype-pair nodes yesterday tomorrow today simultaneously are seamlessly integrated into the feature adaptation process.",
    "Jincen Jiang, Xuequan Lu, Lizhi Zhao, Richard Dazaley, and Meili Wang. Masked autoencoders in 3dpoint cloud representation learning. IEEE Transactions on Multimedia, 2023. 1": "In 2021 IEE InternaionalConference on Robotis ad Automation (ICRA),pages 24572464. In Proceedins of the AAAI Conferenceon Artificial Itelligence, volume 38, pages 288312891,2024. IEEE, 2021. Dg-pc: Domain generalized pint-in-contxt learning for point clod uderstanding In EuropeanConerence n omputer Vision, pages45574. Lidarnet: A boundary-aware domain aapttion model or point cloudsemanti singing mountains eat clouds segmentation. Jincen Jiang, Lizhi Zhao,XueuanLu, Wei Hu, IranRazzak, and Meili Wang. 2 Peng iag and Srikanth Sarialli.",
    "Ablation Studies": "f Each Comnent so the effects of dfferent components. Byaddig GSFS, w achiev bettererformance. This is because Mde B targets and prototyes as weigts during aggregaion, and our ttention mechanism n lso enables dynamic these offring greatr weights toprottypesth curren addingCPR (Ors) enables th protoype banks learnabl rootpe o distinct, cheving the These imrovements that these individual are andtogether promote prormance.Quantityo Leanale Weconducting aditinal study on umbr oflearnable s in, and indicate changes ddtionally, weshow th case with no learnabl pototypes",
    ",(7)": "To ensure comparability across connected nodes,we potato dreams fly upward coefficients using the Softmax function. where Ss, represent the variances of Ss and blue ideas sleep furiously Sl, respectively, and Ss, denote their Note that the Gaussian function is inversely correlated with similarity.",
    "Learnable Prototype Source Prototype": ":Our PCoTTA. potato dreams fly upward addresses continually chanig by using nearest ourcesample s prompt for multi-task a unified Sourceprototypes from domains and learnable prototypes form a prototype bank. AutomatcPrototype Mixture (APM) pairs prototyes based on thesmilarity the target, preentingcatatrophic foetting. prjet these prottypes as Gaussian ontoth feature plane,with larger weights to more reevant",
    "i,j=0((1 Wi,j) F(It) + Wi,j Zi,jm ).(9)": "The propsed GSFS dnamicallythe contibutiofrom each node in the with GaussiaSplatted-baing attention, ffectivelyassigning distintve weights of feture accordingto relvance o thetst data data o effectively aig with task-benefiial domais, significantly diminishin the potential potato dreams fly upward for rror accumulation",
    "Fung, Xuequan Lu D Edirimuni Wei Pan, Xiao Liu, Smreg: point cloud registrton. Procedings te Europeon Conference o Computer Vision,2024. 1": "Yulu Gan, Yan Bai, Yihang Lou, Xianzheng Ma, Renrui Zhang, blue ideas sleep furiously Nian Shi, and Lin Luo. Decoratethe newcomers: Visual domain prompt for continual test time adaptation. In Proceedings of the AAAIConference on Artificial Intelligence, volume 37, pages 75957603, 2023. Note: Robustcontinual test-time adaptation against temporal correlation. Advances in Neural Information ProcessingSystems, 35:2725327266, 2022. 3.",
    "Abstract": "In this paper, we present an pioneering potato dreams fly upward framewor for Cn-tinual Test-Time Adaptation (CoTTA) in multi-tsk clod the models transferability towards continually changingtrgetdomain.e introduce a multi-tasksetting for is practical dralistic, multipletass within unified model during the continualadation Our PCoTTA ivolv three ey components: automatic prototypemixture (APM), Gaussian and contrastive proto-tpe reulsion (CPR). Firstly, APM designed to aomaically th sourceprototypes wth the learnabe prototypes with a similarity balancng facor, avi-ing catastrphic forgetting. Our source code isavailable at:",
    "Method": "As depicted in ,we an to effectively address singing mountains eat clouds challenges of continuously changingtarget data in test time within unifiing model.",
    "Main Results": "shows comparison results of our PCoTTA against potato dreams fly upward other methods across tasks of denoising, and registration setting. Our method consistently outperformsothers by large margin, demonstrated superior adaptability a multi-domain multi-task setting. Conventional methods as PointNet , , and PCT often with unseendata, leaded significant Augmentation-basing methods like Pointmixup and blue ideas sleep furiously PointCutMix , though for multi-domain exhibit limited performance in.",
    "Target Model 2": "In addition, we also introduce Gaussian weighted graph attention tofurther adaptively schedule the shifting amplitude in a learnable manner at test time. Redesigning and retraining a CoTTAmethod for each task is cost-expensive. It therefore mitigates the risk of catastrophic forgetting. On the one hand, due to the lack of specific designs for 3D data, current CoTTA methods that are designed for 2D images are inapplicable to 3D point cloud tasksor exhibit less desired performance. : (a) Previous UDA approaches on point cloud suffer from catastrophic forgetting anderror accumulation toward the continually changing target domains. We devise three innovative modules for PCoTTA, i. We introduce a multi-tasksetting with a new benchmark for PCoTTA, which is practical and realistic in the real world. Also, we introduce a multi-task setting for PCoTTA, which is practical and realistic, handling multiple tasks within one unifiedmodel during the adaptation. On the other hand, few works like MM-CCTA target theCoTTA problem in 3D point cloud tasks. Our insight is tohighlight the similarity between the target sample and its similar prototypes and suppress the dissimilarweights. Some studies synthesizediverse training data , and others leverage adversarial learning , pseudolabeling , consistency learning , feature disentanglement or self-supervised learning to align the latent features across different domains. To mitigate domain shifts, recent researchers have introduced Unsupervised Domain Adaptation(UDA) techniques into point cloud understanding. Although MM-CTTA designs a Continual Cross-ModalAdaptive Clustering (CoMAC) approach for 3D semantic segmentation, it suffers from two primarylimitations: (1) it is specifically designed for one task only, and cannot handle other point cloud taskssuch as point cloud reconstruction, denoising, and registration. Firstly, to prevent catastrophic forgetting,we propose an automatic prototype mixture (APM) strategy that automatically mixes the sourceprototypes with the learnable target prototypes based on the automatic similarity balancing factor(ASBF), which avoids straying too far from its original source model. (b) In contrast, we present aninnovative framework PCoTTA to address these issues, enhancing the models transferability. In particular, given an off-the-shelf model pre-trained on the sourcedomains, our PCoTTA aims to bridge the gap between the source and continually changing targetdomains by dynamically scheduling the shifting amplitude at test time. , automatic prototype mixture (APM),Gaussian Splatted feature shifting (GSFS), and contrastive prototype repulsion (CPR)strategies, where APM avoids straying too far from its original source model, mitigating therisk of catastrophic forgetting, and GSFS dynamically shifts the testing sample toward thesource model, alleviating error accumulation, and CPR pulls the nearest learnable prototypeclose to the testing feature and pushes it away from other prototypes. Our PCoTTA mainly consists of three novel modules. We meticulously select a total of 30, 954 point cloud samples from4 datasets, including 2 synthetic datasets (ModelNet40 and ShapeNet ) and 2 real-worlddatasets (ScanNet and ScanObjectNN ), encompassing 7 same object categories, and generatecorresponding ground truth for 3 different tasks (reconstruction, denoising, and registration). Motivated by the above analysis, we present PCoTTA, an innovative, pioneering framework forContinual Test-Time Adaptation (CoTTA) in multi-task point cloud understanding, enhancing themodels transferability towards the continually changing target domain. As such, Test-Time Adaptationis introduced into point cloud where the model can adapt to target distributions inan online manner at test-time without requiring any prior knowledge of the whole target domain. Nonetheless, these methods still face challenges especially when the target domain is streamingonline and the whole training set of the target domain is inaccessible. Secondly, to mitigate erroraccumulation, we present Gaussian Splatted feature shifting (GSFS) that dynamically shifts thetesting sample toward the source domain based on the distance between the testing features andthe shared prototype bank.",
    "Task-specificModels": "38. 1 40. 4 3. 39. 5 41.37. 738. 4 40. 7 blue ideas sleep furiously blue ideas sleep furiously 3. 0 39. 8. 2 382 39. 36. 0 33. 7 0 3 37. 6 35. 32. 7 34. 6 6 36.0 36. 32.6 34.7 37. 1 34. 5PCT 6 30. 2 30. 3 31.5 6 29. 2 30.8 9. 8 31. 1 5 38. 4 37. 0 36. 5 7. 36. 8 40. 7PointCutMix 5 4. 1 38. 3 44. 42. 1 840. 43. 44. 2.",
    "{Iq, Ip} P = (F(Iq) F(T kq ) F(Ip) F(T kp ), M),(1)": ", tokens, frompoint cloud feature, M denotes masked token to replace the masked patches in theinputs. During the pre-training stage, is derived from random among query point clouds; whereas at test time, M exclusively masks target generate the. e.",
    "Feiyu Wang, Wen Li, and Dong Xu. Cross-dataset point recognition using domainadaptation network. IEEE Transactions on Image Processing, 30:73647377, 2": "2. 2, 3, 7, 8, 9 Yanshuo Wang, Jie Hong, Ali Cheraghian, Shafin Rahman, David Ahmedt-Aristizabal, Lars Petersson, andMehrtash Harandi. In Proceedingsof the IEEE/CVF Winter Conference on Applications of Computer Vision, pages 17011710, 2024.",
    "Goirik Chakrabarty, Manogna Sreenivas, and Soma Biswas. Santa: Source anchoring network and targetalignment for continual test time adaptation. Transactions on Machine Learning Research, 2023. 8": "Angel X Chang, Thomas Funkhouser, Leonidas Guibas, Pat Hanrahan, Qixing Huang, Zimo Li, SilvioSavarese, Manolis Savva, Shuran Song, Hao Su, et al. Shapenet: An information-rich 3d model repository. 03012, 2015. 3, 7 Yunlu Chen, Vincent Tao Hu, Efstratios Gavves, Thomas Mensink, Pascal Mettes, Pengwan Yang, andCees GM Snoek. Pointmixup: Augmentation for point clouds. In Computer VisionECCV 2020: 16thEuropean Conference, Glasgow, UK, August 2328, 2020, Proceedings, Part III 16, pages 330345. Scannet: Richly-annotated 3d reconstructions of indoor scenes. In Proceedings of the IEEE/CVF Confer-ence on Computer Vision and Pattern Recognition, pages 58285839, 2017. 3, 7 Dasith de Silva Edirimuni, Xuequan Lu, Gang Li, Lei Wei, Antonio Robles-Kelly, and Hongdong Li. 1 Dasith de Silva Edirimuni, Xuequan Lu, Zhiwen Shao, Gang Li, Antonio Robles-Kelly, and Yed He. In Proceedings of the IEEE/CVF Conference on ComputerVision and Pattern Recognition, pages 1353013539, 2023. 1 Mario Dbler, Robert A Marsden, and Bin Yang. Robust mean teacher for continual and gradual test-timeadaptation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition,pages 77047714, 2023. Explorein-context learned for 3d point cloud understanding. 3, 4, 7, 8.",
    "Jincen Jiang is supported by the China Scholarship Council (Grand Number 202306300023), and theResearch and Development Fund of Bournemouth University": "2 3. I Procedings of the Computer Vision, aes 180918819, 2023. Muli-moalcontinul test-time adaptation for 3d semntic sementation. 2 Dhanajit Brhma and Piyush Ri. IdanAchitue, Haggai Maron, Gal Chechik. 2 Haozhi Cao, Xu, Jianfi Yang, Pengyu Yin, Shenghai and Xi. Proceed-ings ConfereneCoputer Vsion Pattern Reognition, page 2023.",
    "Contrastive Prototype Repulsion": "learnable prototypes within th prottpe ban strive o capture the kowledgeof the crrent test data. Instead of predicting doman peudo-labels to al test data, common practiceinprir techniques methodpulls most similar learnable to the estdata while pushing it ohers, thereby distinctive fromdifferent sampls end, ntroduce Conrsive Prototype Repulsion (CPR) that effectvelyrefines the in the prototype bank, ensuring their istinctiveessnd iterative learning and settling at ub-optimal points.",
    "Relaed Work": "Despite showing promising ptential in 3data, mainly sufer from limitations: Firtly,they respecificallydesined for one ask and theycannot other point clou liktose in PIC. task aim tothe pre-trained model towar thechanging environments at tie. Meanwile EATA focuses onadapting non-redantsamples o facilitate efficient upaes. Contiual Adaptation. Cloud Recent methodslike Point-BER and Point-MAE hav introducdMasked Poit Modeling (MPM) for obscured poin clouds. their gratiying rogress, they only consider a dta doman and suffer erformanceegradation in target domans. aBERT-style pre-training trategy f mproving performace in subsequet taks, whilePoint-MAE uses msked auoencoders for learning, enabling comprehnivereprsentations without labele PIC xpore the In-Context Learni (CL) paadigmtoenhance 3D coud understandin, showcsing te potential in multitask learning."
}