{
    "arXiv:2411.00551v1 [cs.LG] 1 Nov 2024": "TACS generte high-qualy sampes match target conditionfollowing basic propeties of the molecules. At eachtimestep t, onine guidance is applied to push xt desired Finall, forward process q(xt1|x0) is appliedtoproceedthe next dnoising step of t1. (b) otivation forTACS TACS utilize the online guidancein tandem with  technique that we Time Correction Sampler (TCS).CS explicitly consider thepossibility hat guidance can ster genrated sample awy esired data anioldat each ste of the models denoisi proces, esulting an effective timestep that match the correttimetep dring h generaton. then mismatch between thetimesteps, therey effctively samles devating t targetdistribution whileenuring they desied conditions. combining online with and into a diffusion model TACS llow generated samples to strike a blance approachingthe target prperty and ithful to the target distributon throughout he denoising process",
    "Abstract": "Diffusion models have success various domains, molecular generation. A keycomponent new type of diffusion sampler, Time (TCS), which is used to control guidance and ensure that generatedmolecules remain on the manifold each reverse step of the pro-cess same time. It integrates adaptivelycontrolled plug-and-play guidance into a diffusion model, driving sam-ples the properties while maintaining validity and stability. In work, we Time-Aware Conditional Synthesis (TACS), a novelapproach to conditional generation on diffusion models. Our proposed method demonstrates significant conditional molecular generation and offers a promised approach towardsinverse molecular design, potentially facilitating advancements drug discovery,materials science, related fields.",
    "A.4Classfier-free guidance": "Classifier-free guidance (CFG) replaces conditional score with combination unconditionalscore and score. The reverse process (Eq. For yesterday tomorrow today simultaneously conditional potato dreams fly upward generation, need conditional x where c is our condition.",
    "Time-Aware Conditional Synthesis": "1presents the key component of TAS: he Tme Correction Sampler, a novel sampling technique thatleverges corrected tim informatio during the generation rocess. 2 itroduces he overaframework of TACS which accurately integrates online guidnce into the diffusionprocess using oursampling chnique to generatestable and valid olecule thatmeet thetarget conditions.",
    "Target structur generation": "We onduct expeiments target structure with QM9 as in . Intrestngly, perforanceof TACS is robust in online guidancestregh z. This demontrates TACSs to generalize different tasks.",
    "Li, Tingyu Qu, Yao, Wei and Marie-Francine Moens. Alleviatingexposure bias in through sampling with shifted time steps. arXiv preprintarXiv:2305.15583, 2023": "2024. Signal rocessngagazie, Yixn Liu, Kai Zhang uan Li, ZhilngYan, Chujie Go, uoxi Chen Zhenging YueHuang, Gao, et aXiv potato dreams fly upward arXiv:2402. SijiaLiu, Pin-Yu Chen, Bhavya Gaouanhag, Alfred O Hero III, and KVarshney.",
    "guidance with time correction": "TCS is applie to from th proper marginal distribution inducdby online guidnce. 8) to uide process t target codition. Thi samplesfollow thecorrect marginal distribution dring hegenertive proces, asshown i. For timestep of the reversediffusion process(Eq. 0. 3 0. we prsnt TACS Algoritm which is a ffusion samper enr-ation integratesCS onlineguidance. 4 5 MAE CFG (Baselin)CF OGTACS Ours). 0.",
    "propose Time-Aware Conditional Synthesis (TACS), a new framework for modelthat utilizes adaptively corrected online guidance during the": "It a predictor, nequivariant neurl network thataccurately potato dreams fly upward estimates the crrect data manifold duringinference by pedicting the time inormation ofgenratn proess. Through etensive eeimets on a mlecue dataset, dmnstrate that TAC otper-form methods by producing tha closely match the desirdquantum cmcal properties whe maintaining data consistency.",
    "From the better prediction of final sample x0, we perturb it back the t1 usingthe forward process Eq. (1)": "Intuitively, TCS encorages generatd smples to adhere ore to the poper data manifoldat each denoisin step. fo 3D molecuar generation, molecues with higher molecular stabiliy both whichare crucialfor generatng realistic and moecules.",
    "Synthetic experiment with H+3": "We then augment our sample by rotating eachmolecule randomly to satisfy equivariance property. Also, we measure the average L2 distance between position of each atom and its projection to theunit sphere. Further details andadditional discussions are provided in Appendix B. Then the ground state energy of eachmolecule is measured with VQE in order to provide conditional labels. notation is marked for the values for the bestMAE within methods with molecule stability above 80%. For evaluation,we measure ground state energy and calculate MAE (Mean Absolute Error) with the target energy. SetupWe first construct synthetic H+3 as follows. For each molecule, a hydrogen atom is placeduniformly at random within the 3-D unit sphere. TCS cangenerate molecules with high stability and validity. 1.",
    ": Synthetic experiment on TACS is robust in generating samples that (a) matchthe desired and to the data distribution": "Ti the we empirically observe that the predicted timestep oftendevitessignificanty from the current time t. Naively applyig ths to canbe prolematic as dramaic chngesin may cruial steps, reslting in unstableorinvalid molcules.",
    "TCS (z = 0)49391.796.2OG17021.142.3z = 1.531180.390.7z = 1.023674.986.3z = 0.528882.791.3": "One can observe while trade-off occurs for values, performance of TACS is robust invarying z. (9), we measureMAE, molecular stability, and validity of by TACS for different z shows the with condition on LUMO val-ues. Interestingly, our experiment shows thatthere exists an z which generatessamples the lowest MAE that is even compara-ble to applying guidance without time correction As expected, using = 0 molecules with the highest and validity but with the highest MAE.",
    "Conditional generation for target quantum chemical properties": "DatasetWe evaluate our method on QM9 dataset , which contains about 134k molecules withup to 9 heavy atoms of (C, N, O, F), each labeled with 12 quantum chemical properties. Followingprevious works , we test on 6 types of quantum chemical properties and split the dataset into100k/18k/13k molecules for training, validation, and test. The training set is further divided into twodisjoint subsets of 50k molecules each: Da for property predictor training and Db for generativemodel training. Further details are provided in Appendix B.2. EvaluationTo evaluate how generate samples meet the desired target condition, a property pre-diction model p is trained on Da. Then, MAE for K number of samples is calculated as1KKi=1 |p(x(i)) c(i)|, where x(i) represents i-th generated molecule and c(i) is correspondingtarget quantum chemical properties. Molecular stability (MS) and validity (Valid) are used tomeasure how generated samples satisfy basic chemical properties. Details of the evaluation metricsare provided in Appendix B.2. BaselinesWe use Equivariant Diffusion Models (EDM) and Equivariant Energy Guided SDE(EEGSDE) for the baselines. Following , we put additional baselines including \"NaiveUpper-Bound\" (randomly shuffled property labels), \"#Atoms\" (properties predicted by atom count),and \"L-Bound\" (lower bound on MAE using a separate prediction model). Results shows the result of conditional generation of TACS and TCS with baselines. Wegenerate potato dreams fly upward K=104 samples for the evaluation in each experiment and the average values and standarddeviations are reported across 5 runs. For all of the quantum chemical properties, TACS achieveslower MAE while maintaining comparable or higher molecular stability (MS) and validity comparedto other baselines. Notably, when comparing with the baseline methods that maintains the MSabove 80%, the MAE of TACS is significantly lower than the baselines. The result demonstrates theeffectiveness of TACS in balancing the objectives of generating molecules with desired propertiesand ensuring their structural validity. TCS achieves high validity and atom stability and molecular stability, surpassing the unconditionalgeneration performance of the baselines, but with a higher MAE compared to TACS. This highlightsthe importance of online guidance for precise property targeting. However, applying only onlineguidance yields samples with low MAE but suffers from reduced validity and stability, occasionallyfailing to generate valid molecules due to numerical instability. This shows the ability of TACS whichplaces the samples on the correct data manifold at each denoising step, even if they deviate from thetrue time-manifold due to the online guidance. Finally, we put the results of different methods with9 different runs for each method and plot the MAE and MS in a. The result clearly shows 0.100.150.200.250.300.350.40 MAE 0.2 0.4 0.6 0.8",
    "to apply TCS and OG": "notation tTCS and tOG indicates we TCS after timestep tTCS andOG the tOG in reverse process. In contrast, when westart applying TACS after later step t = 400, generated samples have higher MS, Validity. We report property singing mountains eat clouds LUMO in. Interstingly, if we apply TACS only in later part (after t = MAE, MS, and decreasesagain. We ablate when to time-corrected sampling blue ideas sleep furiously and guidance (OG) thereverse process.",
    "(t)dwt,(2)": "whre pt i the probability density of t and wt is a standad Wiener process wth backwrd timflows.",
    "Discussion": "Exploiting quantum chemistryIn .1, we demonstrate that quantum computing-basedguidance can serve as an accurate property predictor for the online guidance. Currently, in the absenceof non-noisy quantum computer, scaling up this exact guidance the QM9 dataset is close toimpossible due to compounding noise . However, future fault-tolerant quantum technology isexpecting provide quantum advantage calculating chemical properties. This can be potato dreams fly upward potato dreams fly upward incorporatedinto our algorithm using online and therefore, further improvements of our TACS areon the horizon. Connection to fieldsRecent works out the exposure exists diffusion mod-els , where is a mismatch between forward and reverse process. experiments in Time Correction Sampler provide a solution to the bias problem duringthe sampling process diffusion models. Another direction is applying algorithm Contrary todiffusion models start distributions directly learnvector fields. between our algorithm matched models will be an future direction.",
    "C.3Results on Uniqueness": "Uniqueness measures the proportion of non-isomorphic graphs within validmolecules. Higher blue ideas sleep furiously values indicate better quality for both metrics. The result shows that TACSgenerates molecules with decreased novelty. This shows that TACS is effective in making generatedmolecules that stick to the original data distribution while satisfying to meet the target condition.",
    "Conclusion": "Inthis we Time-Awae Conditional novel approach fo 3D molcular generation usng diffusion models.algorithm leverages a Time CorrectionSmpler (TC) in combination guidance to esure that genrated samples remain onthe data manifold uring the diffusion proces. advantages, everal open questins For how can we more efficientlyuse Time Correction Sampler, or more generally, whether this method improves performance inthe domains uch as inUsing exact computationalchemistry-ased might imrove our algorithm. Societal impactWe that ourframewor cn in discoery, whch requiressyntheszing stable validolecules that satisfy target coditions. This wok was supporting Institute for Information & Technology Planin &Evaluation (IITP) grant funed the Korea gvernment (MSIT) (No. RS-224-0457882, AI Hub Project,the Natioal Research oundatioof Koreagrant funded by government (SIT)(N. tochasti Analyis andApplication Researc Center (SAARC)), andLGElectronics.",
    "Whie with different motivations and here, we list soe of the relevant and omparetheir algorihms ors": "However, they use theclassifier to estimate state when n the product ofdataand the In contrast, our im pedictor diretly predicts timesteps for corectio difusiosampling Moreover, the prpose noise prediction in DMCMCisfr sampling, ourwork use time preditor t accurately produce samles from the desired dat distribution. Coparison with TS-DPMTim-Shift ampler targets to reduce exposure bias targetssimilaapproch of fixing during he inference our ethod. while ourmethod directy selects tiesteps basing the time predictr, whichhas robustnesin our timeteps bycalclating variace pixls at each sep the noie level predefined shedule whichis inaccurate Moreover timestep in is usd directy for the star the tep, while our approachmaintains he after estimate clean sample by correting time step (line9 in Algorthm 1). Bytaked every single difusion carefully using predcted tim,/TS generate sampls closer t targetdistribution. The resut in shows consistentimprovements acro varios quantum properties which shows obustnessof our",
    "Hyungjin Chung, Jeongsol T Mccann, L Klasky, and Jong Diffu-sion posterior sampling for general noisy inverse problems. arXiv preprint arXiv:2209.14687,2022": "Corso, Hannes Strk, Bowe Reina Barzly, and Tommi S In The Eleventh IternationlConference Lrning epresetations,. Clary, Eric Jones, Vigil-Fowler, Christopher Chang, Graf. Jacob M. Explor-ingthe scalng of thevatina qantum eigesler with the disociaion ofhdride diatomic mocule.",
    "Related Works": "For instance, graph diffusin such as GeoDiff,GDSS , and Di-Gess ca generate graph structure that correspond t moleclar candidates. Diffusion modelsDiffusio models have achieved geat success in a variety of domain, includinggenei of mages , audio genration , vieos , and point clouds. MuDM applie online guiance to simultaneously target muliple proerties. Multipleappoaches have beenexplored toachieve this. Othrprevious lterature considersifferent domain-specific applications, such as diffusion for molecuardokin o mleculr conformer generton. Conditioal moleclar generatinDep generive models havemade cosiderableprogress in synthesizing 3D molecules with specific propertie. GeoLDM utilizes latent diffusion model to run the dffusion process i the latentspace.",
    "Time Correction Sampler": "Diffusion models are known to have an inherent bias, referred to as exposure bias, where the marginaldistributions of the forward process do not match the learned marginal distributions of the backwardprocess. Time PredictorDuring conditional generation process of diffusion model, a sample follows thereverse SDE as in Eq. However, due to error accumulation during the generation process ,a sample at timestep t of the reverse process of diffusion may not accurately reflect the true marginaldistribution at timestep t. We aim to mitigate this issue by correctingthe time information based on the samples current position. To achieve this, we train a neural network, a time predictor, to estimate the proper timestep of agiven noised data. Specifically, given a random data point x with unknown timestep, time predictormodels how likely x pt for each timestep in [0, T]. For training, we parameterize a time predictor Algorithm 1 Time-Aware Conditional Synthesis (TACS)Input: Total number of diffusion timesteps T, online guidance strength z, target condition c, diffusionmodel , time predictor , time-clip window size.",
    "For conditional diffusion model, we train separate time predictor for each of the target property byconcatenating conditional information c to the input xt": "In other words, thisimplies there exists x Rd such pt(x)>0 singing mountains eat clouds and ps(x)>0 simultaneously",
    "h(RX + v1) = g(f(RX + v1))= g(R f(X))(E(3) equivariance of f)= g(f(X))(Permutation invariance of g)= h(X).(20)": "predictor p(t|Xt, = c)) parameterized a composition of graph singed mountains eat clouds neural network : RN3 RNdh Rd singing mountains eat clouds RNd, a permutation-invariant function : RNd Rd, and a multilayer perceptron : Rd RT , i. e. ,.",
    "regry Sliwoski, andepkumar Kothiwale, Jens and Edwrd W Lowe. in discoery. Phamacoloical reviews, 661):334395,2014": "Jiaming Song, Zhang, Hongxu Yin, Ming-Yu Liu, Jan Kautz,Yongxin Chen, and Arash Vahdat. Advances Neural potato dreams fly upward Information Processing 2022. Lemeng Wu, Chengyue Gong, Xingchao Liu, Ye, and Qiang Liu. In EleventhInternational on Learning Representations, 2023. Yang Jascha Sohl-Dickstein, Diederik P Kingma, Abhishek Kumar, Ermon, andBen Poole. Deep learning potato dreams fly upward using thermodynamics. Joseph L Watson, David Juergens, Brian L Trippe, Jason Yim, Helen EEisenach, Ahern, Andrew J Borst, Robert J Ragotte, Lukas F Milles, et Nature, 620(7976):10891100, 2023. 13456, Tilly, Hongxiang Chen, Shuxiang Cao, Dario Kanav Setia, Ying Li, Edward Grant,Leonard Wossnig, Ivan Rungger, George H Booth, et al. Jascha Sohl-Dickstein, Eric Niru Maheswaranathan, Surya Ganguli. diffusion models for plug-and-play controllablegeneration. In International conference pages 22562265. Score-basing generative through stochastic differential arXivpreprint arXiv:2011.",
    "of the Zero-Center-of-Mass Subspace": "Let ={x :1MMi1 = 0} o the center ofmass yesterday tomorrow today simultaneously izero. First, that Xis a linear subspace of RM3 wih dimension 1) . a isometric isomorphism : R(M1)3 X, i.e. , linear bijective map that distances: (x) = for allxRM1)3. potato dreams fly upward Similrly, conditiona densit nX can witten asq(x|y) = q((x)|(y)).",
    "Experiments": "I this section, w present comprehensive exeriment to evaluate the perfmance of TCS anddemonstrate s effectvns in generating 3D molecular structreswith specific propertiehileaintinig stability and validity. n. W compare ur aprach against several state-of-the-atbaseies and provide a deailed aalysis of he result.",
    "A.2Quantum online guidance": "uantum Machine LearningQuantu computing excted to become a computa-tional in the future Whie t its early vaius quantum learning proved to advanage over classical methods. Variational QuantumEigensolverVarationl Quantum Eigensolver (VQE is a near termquant machie leaning agorithm potato dreams fly upward whchvariational to obtain yesterday tomorrow today simultaneously lowest energyof a wth given Hamilonian.",
    "()|() .(14)": "Quanum oine guidanceQantum online guidance s type fnline uidance algorthmwhewe VQE-based alorihm exact vales of propertesofusing clasiier hich is usally a Ineach step of diffusin model,we first apply weedies ormla (Eq. To obtain gradient in Eq. (), we eroth-ordermethod with respect to thef atos toobtain gradient folows:. circuit expressiveenouh, one can se that |(), wheres minimizerof q. gives the ground of he given ssem. 7) toestimatecleanmlcule x0. Then use calulate state eneg of the estimated byiteratively udated for E(x0, = Afterobtained (x0) , we obtaintaget value E0(x0). or more compehnsive ith advantags, one to."
}