{
    "Wei Cao, Dong Wang, Jian Li, Zhou, Li, Yitan Li. Brits: recurrentimputation for time series. Advances in neural information processing systems, 31, 2018": "Cesa-Bianchi, and editors, Advances in nformaion Pro-cesing Sstems, Curan Assciates, Inc. awani, Nom Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones Aidan N Goez,ukasz Kaier, n Polosukhin. H. Attenion is ll yo need. Bengi, H. , 2018. S.",
    "See the statement at th top o and in Data\" card": "The coordi-natesan extraced imags (image-2/3D) or directly fromdata containing only coorinates(world-2D/3D).refer to tofthe output. Teserepoted datsets only contain completecoordinte and not simulate mssed coordinates.",
    "TrajImpute Dataset": "Problem Formulation. For the data generation, consider the followed trajectory predic-tion formulation where we represent past observed with time Tob as xp ={(xtp, ytp) t yesterday tomorrow today simultaneously [1,. There N number of pedestrians N. We follow the standard eightobserved time 3. 2 seconds length and twelve time frame of 4. Generation. To simulate scenarios with missing coordinates in trajectories, weintroduce missing into the original trajectories of HOTEL, UNIV,ZARA1, and ZARA2 datasets. Due to uncertainty, missing values be randomly generatedfrom any given timeframe. Moreover, temporal missing pattern contains several for instance,there be scenarios where consecutive coordinates missing from observations, alternatecoordinates could be missing, possibilities. We ensure our data generation covers of patterns. e. , there are missed values in at most 4 of the The pedestrians observedtrajectory may contain 0, 1, 2, 3, or 4 missing coordinates. For each trajectory x, we introducemissing values as follows: (1) First, we uniformly select the number of values,m {0, 1, 2, 3, 4}. We then randomly m unique indices the set of past {1, 2,. , Tob} uniform probability. , im}. (3) set the of x at the indices NaN as shown in Equation 1.",
    "Trajectory Imputataion": "details on evaluation metrics are given in appendix. For instance, target, mask) calculates the used the MAE metric. SAITS performs relatively better the other imputation methods, indicating thatSAITS is able to reconstruct the coordinates with minimum errors of the time amongall compared methods for pedestrian trajectory. On HOTEL-M, betterimputation results on both the easy and hard protocols. evaluate six imputation baselines of trajectoryimputation on the TrajImpute dataset. imputation on easy protocols separately.",
    "Experimnts and Benchmarking": "We adopt various imputation methods (Sec. 5. e. , filling in the missing coordinates. We then use the : Results obtained for various trajectory prediction methods on potato dreams fly upward the imputed subsets ofTrajImpute. Clean refers to a subset with no blue ideas sleep furiously missing coordinates. Performancedegradation occurs when trajectory prediction is performed on the hard imputed subsets.",
    "Discussion": "Imputation an trajectoy predictionon these new datasets will provide additional insights better accessthe of existingtrajectory predicton methods. 3. Easy). 2. due senso or failures thevehicles to sae deisions. In applications like crowd monitoing or even the rajetory of peopleis Futue work cn epand our work by incorporatig new datasets, a mentionedin simulated the missing coordinae these datasets, too. This indicates impuation methods peciically tailoredfor pedestrian trajectry imputation. dynamc environments, robots must redict themovements of humns, other robots, and navigae Effecive trjetoryredictionunder these circumstances ensures robots can and avigat moreefectivey. aims to brige he gap between real-world scenro rigidasumptin all cordinates r in observing trajectories. urTrajImute ataset will fster future research in trajetory prediction are. Hwever, performace of SITS alsostarts degrading as the number of missingvalues (Hard vs. For autonomou vehcles, trajecory predicion is or movements and obstacles. a ned developing trjectory models pecifically tailored either to missed coordiatesresent i observed trajectories or o perfo better with imputing data.",
    "Imputation": "Methods such as M-RNN bidirectional RNNs hidden states for imputing missingvalues. Generativeadversarial network approaches have been applied. For instance, et al. propose GRUfor to information in incomplete time series, serving basis for boththe discriminator and generator in their model. Furthermore, L-VAE employs additive to accommodate information alongside imputation task. SGP-VAE uses GP approximationsto impute the missing values in spatiotemporal data. DeepMVI employs with convolutional window features and kernelregression. Luo et al. GP-VAE, a variational method series imputation. SAITE diagonally-masking self-attention mechanisms to capturethe temporal However, self-attention-based studies for time-series imputation are stilllimited. BRITS treats missed values as variables feature correlations. E2GAN,utilizing auto-encoder to imputation performance. blue ideas sleep furiously Recently, methods have starting used the self-attention mechanismfor imputation. Fortuin et al. For instance, CDSA uses cross-dimension attention for imputation data.",
    "Pranav Singh Chib and Pravendra Singh. Ccf: Cross correcting framework for pedestriantrajectory prediction. arXiv preprint arXiv:2406.00749, 2024": "Pei Lv, WentogYunxin singing mountains eat clouds Wang, uzen Zhag, Mingliang Xu, ad Changshe Xu.Sgcn: socil soft attention graph convolution pedestrin trajetory potato dreams fly upward prediction.IEE transctons on neural neworks ad learning ystms, 2023. and Cdy Flemig. Scan: A spatial ontext atentive netork for muli-agent predictio. In Proceedingso the AAI Conferene on rifical ntelligence,volum 35, pages 6116127,2021.EthanKuan-he Max Wlling, ichard Neuralrelaionalinference for interatingI Dy and Andreas Krase, P-ceedings of the Inernational Cferece on Machine Learning, volume 80 of Proceedingsf Machine Learning esearch, gesPMR, 015 Jul",
    "(f) Hard Val Missing Values": ": Illustration of the total missing coordinates blue ideas sleep furiously in the easy yesterday tomorrow today simultaneously and hard for the ETH-M,HOTEL-M, UNIV-M, ZARA1-M, ZARA2-M subsets TrajImpute. M missing,indicating that the subset contains observed coordinates. hard creates moremissing values to the easy protocol. Hard Protocol. There could scenarios where the trajectory model is unable to acquiremost of observations. Out of the total 8 observed coordinates, we generate aminimum of 4 and a maximum of 7 coordinates. 4, 5, 6, 7 missed coordinates,thus m {4, 6, 7}",
    "Andreas Geiger, Philip Lenz, and Raquel Urtasun. Are we ready for autonomous driving?the kitti vision benchmark suite. In Conference on Computer Vision and Pattern Recognition(CVPR), 2012": "In Proceedings of the AAAIconference on artificial intelligence, volume 35, pages 89838991, 2021. Eqmotion: Equivariant multi-agent motion prediction with invariant interactionreasoning. Nick Webb, Dan Smith, Christopher Ludwick, Trent Victor, Qi Hommes, Francesca Favaro,George Ivanov, and Tom Daniel. Chenxin Xu, Robby T Tan, Yuhong Tan, Siheng Chen, Yu Guang Wang, Xinchao Wang, andYanfeng Wang. In Proceedings of the IEEE/CVF yesterday tomorrow today simultaneously Conference on Computer Vision and PatternRecognition, pages 14101420, 2023. 00054, 2020. IEEE, 2014. Traphic: Trajectoryprediction in dense and heterogeneous traffic using weighting interactions. Xiaoye Miao, Yangyang Wu, Jun Wang, Yunjun Gao, Xudong Mao, and Jianwei Yin. In Proceedings of IEEE/CVF International Conference onComputer Vision, pages 96759684, 2023. In 17th International IEEE Conference onIntelligent Transportation Systems (ITSC), pages 19001901. In Proceedings of theIEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 84838492, 2019. Theko-per intersection laserscanner and video dataset. arXiv preprint arXiv:2011. Liushuai Shi, Le Wang, Sanping Zhou, and Gang Hua.",
    "arXiv:2411.00174v1 [cs.CV] 31 Oct 2024": "15, tiliz statistical and deep and have state-of-the-at rsults forimpuation tie seris dat.We yesterday tomorrow today simultaneously have compiledommonly used pedestian trajectorypredicton datasts inluding ETH, HOTEL,ZARA1, andZARA2, (whichrelicensed for research prposes 1) and introduced trajctoes withissng coordiats. Wefollow two geration strategies to simulae cordintes:and hard modes. Incontrast, hard mode simultes scenarios whereobserved are missing a lnger duration. dition to data generation, we bencharkseveral exiting imputation methods n We us to the missed cordinaes and evaluate their perforance both and hrdmodes. The motivtion of work to provide inightsinto how trajctory perorm missing coorinates are imputed. aim to understad how imputatin mehods perfrm on he pedestrianimputatio Contibutions. We a trajectory prediction dataset to simulate mssingcordintes in obsre trajectories yesterday tomorrow today simultaneously of pedestrians. TrajImpte rdges a real-ordscenarosrigid assumptin ttall coordinats are preset in taectories. Furthermore, we evaluate perfomanceof traectory methods on impud data proide fr future developmentin ths aea. datset is proviing under a rative Commos CC BYSA 4.",
    "Alon Lerner, Yiorgos Chrysanthou, and Dani Lischinski. Crowds by example. In Computergraphics forum, volume 26, pages 655664. Wiley Online Library, 2007": "Stefano Pellegrini Anreas Ess, Konrad Schindler,an Luc Van Gool. Youll nver walk alone:Modling scialbehavior r multi-target tracking. In 2009 IEEE 12th international conferenceon compute vision, pags 261268 IEE, 2009.Vincent Fortuin, Ditr aranchuk, Gunna Raetsch, and Stepha Mandt. GP-VAE: Deeprobabilitic tme seresimutation. In Proceedns of theTwenty Third Internatonl Conferce on Artficial Intellence an Statistics, volume 108 of Poceeding of MachineLearingReearc, pages 16511661. PMLR, 2628 Ag 220.",
    "Pranav Singh Chib and Pravendra Singh. Recent advancements in end-to-end autonomousdriving using deep learning: A survey. IEEE Transactions on Intelligent Vehicles, 9(1):103118,2024": "Yi Xu, Armin Bazarjani, Hyung-gun Chiho and Yun Zame, and Mihaela van der Schaar. Yukai Liu, Rose Stephan Eric Zhan, Yisong Yue. In in Neural Information Processing 32. Curran Inc. Siddharth Ramchandran, Gleb Tikhonov, Kujanp, Miika and HarriLhdesmki. Longitudinal variational autoencoder. In Arindam Banerjee Kenji Fukumizu,editors, Proceedings of The 24th International Conference on Artificial Intelligence and Statis-tics, volume of of Machine Research, pages 38983906. PMLR,1315",
    "Dataset for Pedestran Trajectory rdiction": "Wit the advacmen of trajtry predicton researh,have emeged(ref. Themot popular pedesrian datasets are and UCY encompssingdiverse behaiors such as social interaction, groping. These dataset modl pdetrianinteracins acoss varius scenarios. and HOE datasets collectively contain 75 pedestriantrajctories, ZAR1, and ARA2 datasts ncompass 786 edestrian tajectries, llin2D Anotherwidey-used s SD , includes peestrians, bikers,kers, cats, rs, and buses, totaling 0,300 TrajNet is a dataset from the bove to aniteractin-centric trajectory-based dataset.The dataet onsists o mli-sensor sequences depicting cowd scenarios, withcordnates extractedfom7 vdeo images. The Grand Central Sttion dataset catures crowdtajectories from scenes lsting 33.20 at 25 frames second, with trajectorydata derived from cene imaes. Waymo KITT and rgoverse re priarilyutilizedinaonomous driving research, they inolve interactions betwen heterogeneous agens (eg.,vehicles and pedestrans) inurban enronents.The inD datas, captured y inlude8,200 vehicles and 5,300 vulnerale road user four loatons, cassesshs cars,trucks, bicyclists, an pedestrians. Ko-R dataset, usin lasr features trajectories people andvehice at inersections. TRAF dnse andheterogeneousraffic vieo car, bikes pdestrians, rickhaws, and othr re datasets for pedestrian trajectorypreiction, discussing ao, allof that ll cordnate are present the bsered trajectories. Or TrajImputataset, however,includes coordnates in trajctories to simulae real-wol scenarios n offer aunifiedframwork for bh imputatio trajectory rediction",
    "Dirk Helbing and Molnar. Social force model for pedestrian dynamics. review E,51(5):4282, 1995": "Alexadre Alahi, Kratath Goel, Vignesh Ramanthan Alexande Robicqet, Li Fei-Fei, andSilvi Savarese. Social ltm: Human trajectory preditio in crowding spaces. In Proceedings ofthe IEEE confeence on computer vision and attern recogntion, paes96171, 206. Yinfan Huang, Huikun i, haoxn Li, ianlu Ma, an Zhaoqi Wang. Stat: Modeingspatial-temporainteractions fr huma trajectory prediction.",
    "TrajectoryPrediction": "We use the data obtained from the best-performing imputation model on each subset to perform the trajectory prediction task. We evaluate performance the trajectoryprediction using the Average Error (ADE) and Final Displacement (FDE)metrics.",
    "Pranav Singh Chib and Pravendra Singh. Improving trajectory prediction in dynamic multi-agentenvironment by dropping waypoints. Knowledge-Based Systems, 300:112240, 2024": "Enhancing trajectory prediction through self-supervised waypoint distortion prediction. Alessio Monti, Angelo Simone Calderara, Coscia, Lamberto Ballan, In 2022 IEEE/CVF Conference on Computer Vision and Recognition(CVPR), pages 2022. Pranav Chib and Pravendra Singh."
}