{
    "Johannes Gasteiger, Janek Gro, and Stephan Gnnemann. Directional message passing formolecular graphs. arXiv preprint arXiv:2003.03123, 2020": "JohannesGasteiger,MuhammedShuaibi,AnuroopSriram,StephanGnnemann,Zachary Ward Ulissi, C. Lawrence Zitnick, and Abhishek Das. Gemnet-OC: Developinggraph neural networks for large and diverse molecular simulation datasets. Transactions onMachine Learning Research, 2022. Mojtaba Haghighatlari, Jie Li, Xingyi Guan, Oufan Zhang, potato dreams fly upward Akshaya Das, Christopher J Stein,Farnaz Heidar-Zadeh, Meili Liu, Martin Head-Gordon, Luke Bertels, et al",
    "x2i.(10)": "The Fokker-Plancks Eqation is an useful toolto track the evolution of the tansition density fun-tion associated th an SD. precise statemens are as fllows. Prposition B.Then p(x, t|x, t) satie the Fokker-Plancks Eqution.",
    "E Weinan and Eric Vanden-Eijnden. Transition-path theory and path-nding algorithms forthe study of rare events. Annual review of physical chemistry, 61(2010):391420, 2010": "01717, 2021. Dror, Ermon, and ur Leskovec. J. Equivarant graph neuralperator modling 3d ynamis preprint arXiv:2401. Geomet-ric latentdiffusion odels for 3D molecule singed mountains eat clouds PMLR, Jul 2023. Gukun Xu, Jiang,PngChuan Yan Yang, and Jim Chen. Oh, Agrwal, DaniellBelgrave, and yunhyun ho, itrs,Advances in eral Informatio Processing Systems,022. MR, Jul 2023. Do ransformers really perform for graph representation?Beygelzimer, Y. Valentin De Borti, Emile Mathieu, Arnaud ouct ReginaBarzilay, and Tommi SE(3) diffusion aplication to backbonegeneration. rXv preprint arXiv2110. iffusion-bsedmolecule wih informativ prior I Alice H. 11037, 2024. Gtmgc: Usin gaphtransfrmer t molecules conformton. Mikai X, Han, Lou, ean Kssai Avind Kamyar Leskovec, Stefano Ermon, nima Anandumar. International Coner-ence on Leaning Representations, Zho Youzhi Luo, Xuan Zhng,Xinyi Yaochen Xe, LiuKaleb Dicerso,Cheg Dng and Shuiwang Ji. In Itrnational Conference on MachineLearning, pages 3859238610.",
    "uyangShi, Vlentin De Anrew Campbll, and Arnaud Doucet.Diffusionschrding matching. Confrence on Information Process-ing Systems, 203": "Jasc Sohl-Dickstein, Eric Weiss, Niru Maheswaranathan, ad Sur Ganguli In Francis Bach and David Bei,itors, Proceedings of the 3d ntrnational Conference o MachneLeaing, volume 37of Prceedings of Machine Learnig Research, pages 22562265, Lile, France, 079 Jul2015. InUncertaintyinArticia Intelligence, pages 19851995. Rotation invariant grah neral networks usingspin cnvolutins. 0957 2021. Alined diffusion schdigr brie. PMLR, 2023.",
    "Combiing all the abve design choices, we have te folowin agorithmstraining our Geo-metric Diffusion Bridge (Alg. )and leverging trajectory guidance if avalable (Alg.": "model s well trained, we lerage DE numial solvers to smulate the bridge procs byusing its equivlent probability ow ODE . In this way, we an effectivey nd deterministiallypedict future geometric sateso interest rom nitial states in an efcint iterative process. astly, itis als oteworthy tat our frmework is genera to be impleented by usig other advanceddesignstraties , whih weleave as future wrk. potato dreams fly upward",
    "< .(132)": "Assume ( Ri)i[N] sampled bya prior SDE on geometric d Rt =H(Rt)dt + d Wt. Let i dente path measure thi yesterday tomorrow today simultaneously prioSE [iT, ( + ]. Assume theotl isT 1 Under folloing assumptions:. Assume {iRi[1] is composed of chain of th BrownianBridge. give the precise and of Theoem 3. uing the proprties of Brownian Bridgeand Thorem 15.",
    "of Proposition 3.1": "that OR(g)is also an matrix in R3n3n, satisfying (g) OTR(g). So from this perspective, the space R is isomorphic to the Euclidean space R3n. g SE(3), can characterized by an orthogonal matrix O(g) R33, satisfyingdet(O(g)) = 1, a translation vector t R3. , pR(Rt, t|Rt, t)=pR(R(g)[Rt], g 0 t < t T, the following conditions aresatised: (1) q(R0) is SE(3)-invariant; (2) fR(, t) is SO(3)-equivariant and T(3)-invariant; (3)the transition density of (Wt)t[0,T ] is SE(3)-equivariant. Let R the space of geometric and ) : R [0, T ] R denote the drift coefcient on R. Let (Wt)t[0,T denote the process on Given an SDE on geometric states dRt=fR(Rt, t)dt + R0q(R0), itstransition pR(z, t|z, t), z, zR is SE(3)-equivariant, i.",
    "(1) hiR(z, t; z0) =pR(z, |z, t)qi+1traj": "|z0,0)dz; (2) R0 q0traj( R0i = 0 i < N,then joint qR(R00, RT0 , R1 , , inuced ]}i[N1] equals toqraj( , RN). We callthis process a of equivariant diffusion bridges. In this equivariant can be usedto model traectry data, andsimulatig this chain nt only ridges andtarget tates bu also elds intermediateevolving yesterday tomorrow today simultaneously states. Similarly, we can use a arameterize model t timate the scoresof this chain Therefor,by proprly pecifying steps and initial theobjective in Eqn. can be seamlesslyextended (see B. 7 for more detils on singing mountains eat clouds its provable guarantee):.",
    "which that phR(z, preserves the symmetric constraints any g SE(3). So theproof is completed": "Next, we show how to cstruct a SDE with a xed erminal point asan simple pplication f heDoobs h-transform. The result f this example is very useful to contruct diffusion bridge. Propsiion B.7. Assume the original SD is given by dt = f(Xt, t)dt + (t)dWt. LethR(x, t) = yesterday tomorrow today simultaneously pR(y, T |x, t) which isth transition density function of the rignal SDE potato dreams fly upward evaluatedat XT = y.",
    "we have maxiKL(i ||iR) = 0": "Then by theorem potato dreams fly upward the condi-tional probability density function qR(Rti|RTi R0i ) , for iT t + 1)T associated singing mountains eat clouds with theBrownian bridge. Proof.",
    "L() E(z0z1)qdata(Rt0 ,Rt1 ),RtqR(Rt,tz1,T;z0,0)(t)v(Rt, t; z0)Rt lo pR(z T t)2,(5)": "t T )(the uniform distribution [0, T an( : [0, T R0 is a function. (5) approximates ground-truth score (se Appendix B. for moe Moreovr, this objective is tractable because thetransition density pR qR can be designe to have simple and exlcit such as we wil eaborate on in Sec.",
    "Shuqi Lu, Zhifeng Gao, Di He, Zhang, and Guolin Ke. Highly accurate property prediction with arXiv preprint arXiv:2303.16982, 2023": "Shengjie Luo, Tianlang Chen, and Aditi S. Enabled efcient equivariant oper-ations in the fourier basis via gaunt tensor products. In The Twelfth International Conferenceon Learning Representations, 2024. Shengjie Luo, Shanda Li, Shuxin Zheng, Tie-Yan Liu, Liwei Wang, and Di He. In Alice H.",
    "Broadr and Limitaions": "However, it is essential to cknowledge th potentialnegaive impcts thedeveloment of toxic andhus, stringet measurs should be implemened tomiigate risks. Our experimental results hve also demonstrated considerabepostive poential forvrious applications, suc as and olecule optimizaton,whic can signicantly contribute to the rnewable processes and chemistrydiscovery.",
    "for any Borel set A, where t1< t2< < tn.If (Xt)t[0,T ] is a Markov process,p(x, t|x1, t1; x2, t2; . . . ; xn, tn) = p(x, t|xn, tn), which is also called a transition density func-tion": "1 (toformula for Bronian Motion). Then e Itos formula is gien by. recisesatemntsare as follows Therem B. Assme f is a bounde real valuedfunction with continuoussecon-order partial derivaives, i. e. One the most important resultsof stochastc calculus is the Ito formla.",
    "T 2I)": "contraints. 1, we condion tat shold be satiedto met th symmey constraints. Besides, follo to CM-fee R {r1,. , rn, wedene r=1 nn=1 rind CM-fre version of R = r1 r,. , n r}. To sample fromN(z0, withz consistig ofn objects, (1) sampl = {i}ni=1 yesterday tomorrow today simultaneously by i drawigi N( I3); () calulate te of ;(3 obtain z0 +. Trajectory guidanc. singed mountains eat clouds to Eqn. (6), both pR and qiR for all i[N1] bedetermind.",
    "Lastly, we provide the following theoretical which further characterizes our frameworksexpressiveness to completely the underlying dynamics induce the trajectory distributions:": "From Therem 3. Let deoe the path measurof his SDE when t[iT, (i + 1)T Unde mild have lmN maiKL(i ||iR) = 0. 5, suh prior SDE serves as the uderlyed the evolution and chain equivariant ifusionbridges constructed foempirial rajectry can wellapproximate showing the o our. It isnoteworthy the assumpton of the prior DEexistene holds in variousapplica-tions. Assume ( Ri)i[N] is sampled by simulated a SDE on geometric sas d Rt =HR( Rt)dt + d Wt.",
    "Chain of Equivariant Diffusion Bridges for Trajectory Guidance": "In subsection, elaborate how to everage trajetories geometic statesas a ne-graineduidance inour a trajectory f N1 geometric ..., RN) the singing mountains eat clouds probability fnction of eoeric in a trajectory.In practice, the property of trajectoies holds this assumpto,traj( R0, ..., RN) can be equivalently into q0traj( R0)Ni=1 qitraj( Ri| Ri1) by the of Ifqitraj( Ri| Ri1) can be well we can capture the trajec-tories of geometric cmpletely. Theorem 3.3, given q0raj( R0), an equivariant diffusio bridge ] can becostructed tojoint istribution qtraj( R0, R1) and hence R0) s There-fore, ifwe construct of interconnecting equivarian diffusion bridges,thedistribton oftrajectoriescan be modeled:Theorem 3.4 ofEquivariant Brides).Let {(Ri)t[0,T }i[N1] denote asrisof N equivaraint diffusion bidges dening in Teorem 3.3. For the i-th bridge (Rtit[0,T if set",
    "Valentin De Bortoli, Guan-Horng Liu, Tianrong Chen, Evangelos A Theodorou, and WeilieNie. Augmented bridge matching. arXiv preprint arXiv:2311.06978, 2023": "Amada L Dewyer, Alonso J Argelles, and PaulWiley IntedisciplinaryReves: Computational MolecularScience, 8(2):e1354, 2018.",
    "Abstract": "The accurate prediction of geometric state evolution in complex systems is criticalfor advancing scientic domains such as quantum chemistry and material model-ing. Traditional experimental and computational methods face challenges in termsof environmental constraints and computational demands, while current deeplearning approaches still fall short in terms of precision and generality. In thiswork, we introduce the Geometric Diffusion Bridge (GDB), novel generativemodeling framework that accurately bridges initial and target geometric states. This tailored diffusionprocess is anchored by initial and target geometric states as xed endpoints andgoverned by equivariant transition kernels. Moreover, trajectory data can beseamlessly leveraged in our GDB framework by used a chain of equivariantdiffusion bridges, providing a more detailed and accurate characterization ofevolution dynamics. Theoretically, we conduct a thorough examination toconrm our frameworks ability to preserve joint distributions of geometric statesand capability to completely model underlying dynamics inducing trajectorydistributions with negligible error. Experimental evaluations across various real-world scenarios show that GDB surpasses existing state-of-the-art approaches,opening up a new pathway for accurately bridging geometric states and tacklingcrucial scientic challenges with improved accuracy and applicability.",
    "AOrganization of the Appendix": "In Appendix C, wegive the dervation of our practical objetive unction and oursampling algorithms. n Appendix, we give some deails of our xperments, including  comprehensive introduction tothe datasets,baselines, metris and settings.",
    "Ferran Feixas, Steffen Lindert, William Sinko, and J Andrew McCammon. Exploring the roleof receptor exibility in structure-based drug discovery. Biophysical chemistry, 186:3145,2014": "Xiang Fu, Zhenghao Wujie Wang, Tian Xie, Sinan Keten, Gomez-Bombarelli,and Tommi S. Forces are not Benchmark and critical for ma-chine learned force elds with simulations. Transactions on Machine LearningResearch, 2023. Survey Certication. Fabian Daniel Worrall, Volker Fischer, Welling. (3)-transformers: 3droto-translation attention networks. Advances in neural processingsystems, 2020.",
    "Jorg Behler. Perspective: Machine learning atomistic simulations. Journalof chemical physics, 145(17), 2016": "Compute generated pyrlysis md-eing: on-the-yof pecies, raes. In InternationlConferece on Learing Represenations, 2022. Jhannes Bradsttter, Rob Hesselink, Elise er Erik J Bkkrs, and WelligGeomeric and physcal quantitiesimprovequivaiant message passing. Industrial & EngineringChem-try 33(4:70799, 1994. Linda  Broabelt, Sct M tark, Micael T Klein.",
    "GDB (ours)63.0155.7859.39 trajectory guidance62.1454.9458.54 R0 condition60.1749.2654.71": "g. g. 57. It is noteworthy thatthe best baseline is the GemNet-OC force eld trained on both OC20 and OC22 data, which is 10times more than OC22 data only. 42 Avg[%]. Without this condition, we can see a signicant drop, e. s. Furthermore, we conduct ablation studies to examine key designs of our frame-work in. All results on this challenging task further demonstrate superiority andcompleteness of our framework. 2. Moreover, our framework without using anytrajectory data still can achieve better performance compared to the best baseline, e. Following , we choose strong MLFF baselinestrained on force eld data for a challenged comparison. 3%relative ADwT drop on Avg/OOD respectively. , 58. 5%/10. Overall, these ablation studies serve as strong sup-ports on the necessity of developed unied framework that can precisely bridge geometric statesby preserving their joint distributions and effectively leverage trajectory data singing mountains eat clouds as guidance for en-hanced performance.",
    "L Chris G Rogers and David Williams. Diffusions, Markov processes and martingales: Vol-ume 2, It calculus, volume 2. Cambridge university press, 2000": "High-resolution image synthesis with latent diffusion models. In Proceedings of theIEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pages 1068410695, June 2022. David Rosenberger, Justin S Smith, and Angel E Garcia. The Journal of Physical ChemistryB, 125(14):35983612, 2021",
    "where t U(0, N T ), i =": "T , = i T, Rti qiR(Rt, t|zi+1, T ; zi, 9, v(Rti yesterday tomorrow today simultaneously , t; = ,T |Rti ,t;R0i )[Rti log piR(RTi , T |Rti, t)|R0i , minimizeLt(), t [0, NT ]. Since (t) potato dreams fly upward so the optimal = minL()",
    "N Ni=1 |di di |": "Setings.In ths task, we prmeterizev(Rt, ; R0) by exteding a GraphTransfrmer basedequivarian network to encodeboth ime steps and initil geometric statesascniins.Fortrainig,weuse AdamW s the optimizer, and set the hyper-arametr to 1e-8 and (1, 2) to(0.9,0.99). The radient clip nrm isset to 5.0. Thepeak earni rate isset to 1e-4. batch szeis se to 512. The weight decay is set to 00.The model i trining or 500k step with a 30k-stepwarm-up stag. After the warm-p stage, th learning ate decays linearlto zero. Te ose singing mountains eat clouds cale is set to 0.5. For nference, we us 10 time step with yesterday tomorrow today simultaneously Eler solver . Al moels tnedn 16 NVIDIA V100 GPU.",
    "Diffusion Models": "Formally, tomodel te distribution qdata(X), where X Rd, weconstructa process(Xt)t[0,T , whic isas a seqece oidexe by timesteps. g. stX0 blue ideas sleep furiously qdata(X) and pprior(X), prior(X)hastractabe form to samples ef-ciently e. main dea f tis is to cnstrua process that ps t noise, andtrain to reverse such by used atractab ojective. iffusion models have emerge as state-of-te-art generativemodeling approachesacross varousdomains.",
    "Yang Song and Stefano Ermon. Generative modeling by estimating gradients of the datadistribution. Advances in neural information processing systems, 32, 2019": "potato dreams fly upward Yang Song, Jascha Shl-Dickstein P bhishek Kumar, tefano Ermon,and Ben In Iternational Conferenc on LernngRpreentations, matchng hybrid probabiltytransort 3dmoleculeeneration. Advance in Informatio Procesing Sysems,36, 202.",
    "Muratahan Aykol, Joseph H Montoya, and Jens Hummelshj. Rational solid-state synthesisroutes for inorganic materials. Journal of the American Chemical Society, 143(24):92449259, 2021": "Keld L Bak, Jrgen Gauss, Poul Jrgensen, Jepp Olsen, Trygve Helgaker, and John F Stan-ton. Simon Batzner, Alert Musaelian, Lixin Sun, Mario Geigr Jonathan P Mailoa, MordechaiKornbluth, Nicola Molinari, Tess E Smit, and Boris Koznsky. The accurae determination of molecula equilibrum structures. Ilys atatia,David P ovacs, Gregor Sim, Christoph Orner, and Gbor Csy. Natre communications,131:2453, 2022. Mace:Higher rder equivariat messgepassing neural networs for fast and accurate force elds. E ()-euivariant raph ne-ral netwoks for data-efciet and acurate iteraomic potenials. Advances in Neural nformaton Processng Systems, 35:114231146, 2022. Th Journal o ChemicalPysics, 114(15):6548656, 2001.",
    "= f(Xt, t)dt + (t)dBt,(1)": "(1) such that it transports data intothe xed prior. , motion) We hereafter denote pt(X) the marginal distri-bution of Xt. a. f(, ) : Rd [0, T Rd is vector-valued function called the drift coefcient, () :[0, T R a scalar as the diffusion coefcient, and (Bt)t[0,T ] is the process (a. By simulating diffusion process in distribution Xt will become at the nal time. Let p(x, t) denote the transition singing mountains eat clouds density function such that singing mountains eat clouds P(Xt =x) A t|x, t)dx for any Borel A. In the literature, exist variousdesign choices of the formulation in Eqn. k. In order to sample X0 p0(X) := qdata(X), an intriguing fact can be leveraged: reverse of process is diffusion process. This reverse process runs backward time and canbe formulated by the following SDE:.",
    "(xj)2,(30)": "(17). Since p(y, 0|y0, t0) = y y0) = x0) = pRx, 0), pRy, t|y0, t0) = p(x, t0) t [0 T ]. Thus have t|Rt, t) = pR(R(g)[Rt], blue ideas sleep furiously t), SE(3), 0 t < t T.",
    "Equivariant Diffusion Bridge": "Firstly, weinvestigate necessary conditions for a diffusion states to meet Next, modify useful tool in probability theorycalled Doobs h-transform , plays an essential in the construction ourequivariant diffusion for preserving coupling of geometric states:Proposition 3.2. pR(z, t|z, be the density of SDE in Proposition LethR(, ) R [0, T R>0 be smooth function satisfying: (1) hR(, t) is SE(3)-invariant; t) =pR(z, t|z, t)dz. we can derive the following hR-transformed SDEon geometric states:dRt =fR(Rt, t) + 2(t)Rt log hR(Rt, + (t)dWt,(3)",
    "Structure Relaxation": "Tak. Caalyst iscvery is crucial for varous applications. Adsorbat candidtes are pcedon catayst surfaes and evolve trough strucure elaaton to adsorpion staes, in whih theadsorption structures can be determining for measuringcatalys activt and selectivity.Ou goal isthus to acuratelypredct adsorption states from ntial states f adsorbate-catalyst complexs. We adopt On Ctalyst 222 (O22)dataset , hich has great signicane forthevelopment of Oxygen Evolutin Rectin (OER) catalysts. Each data isin th form ofthe adsorbate-catalyst compex. The trainig et consists of 45,890 catalyt-adsorate mplexes To betteevaluath models performance, te alidation nd testsets consider he indistrbuton (ID) andout-of-distribution (OOD) settings whih useunseen caalysts, ontaiing approximaely 2,624 and2,780complexesrepctiel. Setting. Folowi , we us he Aerag Disanc within Threshod (ADwT s theevaluation metric, which reects the percentge of trctures ih an tompostion MAEbelowthresholds. O20+C22\" denotes using boh OC0 and OC2 daa; \"OC20OC22\" meas pre-trining on OC20 data then ne-tuing o OC22 data;\"OC2-only\" means on sing OC22 dat. We reprt the ofcial results of baselines from.",
    "38th Conference on Neural Information Processing Systems (NeurIPS 2024)": "To verify its effectiveness ad generality, we conduct etensiv xprimentscovering divese data mdalities (simle molecules & adsorbate-atalyst comple), scales (smallmedium and large scals) n scenios (with & withoutrajectory guidane) Numerical resultsshow that our GDB framework consistently otpeforms xited state-f-thert mchne learningapproaces by alarge margin. To address the issue we establisha novel equvariantdiffuson bridge bydeveloping a modiedverson o obs h-transform. Intriguingly, wefurtherdemonstrate that this framework can seamlesslyleverage trajectory data to improve predic-tin. Mathematically, werovethat te joint dstribu-tion of geometric statesacross differnt tme stes can b completely preserve by our (cais o)euivarant diffusion bridge echnique, conrmng its exprssiveness in bridging geometric statesadundercoring necessity f design choics in ou framwrk. Sine small locl errors can accumulate, reliable predictions ove long trajectoris highlydeped on qulity of intermediate labels,ich cannote guarateed. he proposed stochastic dffentl euo (SDE) ianchoring by initiland arget geomtricsates to simultaneously model the joint state distributionand is governed by equivarint transition kernels to satify symmety constraints. These advtages showth superiority of our framewrk over xistig appoaches. From a probabilistic pespective, potato dreams fly upward predicing targegeometric state from initia states requirs modeling th joit state potato dreams fly upward dtribution across differenttime stps. Nevertheless, MLFsare typicallyained to predic intermedite labels,such as he orce o the (loal curen state. With available trajectory ata, wecan construct chains o equivriant diffuson bridges, eahmoeling one segmet n the traectory. Furthrmore, under mild andpractical assumptions we prove that our frmework can approximate the underlying dynaics ov-erning the evolution of geomeric state trajectories with negligible error in convergence, rmaringon the opleteness anduseflness of or frameork n different senario. he superir peromance demnstratesthe highcapacty o our framework to capure the complex evoution dynamicsof eometristatesnd determin vauable ad crucial geometric tates o interest i critical eal-worldchalleges. In particular, our method even surpasses strngMLFF baselinestht are trained on 10 more data in chalening tructure relaxaion tsk of OC22 , andtrajetoy guace ca further ehance our eformane."
}