{
    "CConstructions in CL Framework": "Note tha the oder of H is unknown. Thereore, on has to rely on DH to hash intoH. Indeed, one can simplcompute hash function as hH1pq where H1pxq hashed in DH. LetpCLGe, CLolveq be the cass group framework asdefined i Definition 10. Then, onsider thefollowing definitin potato dreams fly upward of K DH X t0 u, Y H,Cpk, xq HpxqkH1px,q. Most rcently, showed how to hash into groups of nknown order to ensure that disretlogarithm is unkown. Further, let : X H, H1 : X Kbe a potato dreams fly upward hash function.",
    "D.1Distributed PRF from LWR": "Further, the computation occurs over a group whose structure and order isknown. Consequently,by assumed both p and q one can avoid secret sharing but instead ontraditional Shamirs Secret Sharing a field, which we defined earlier (see Construction",
    "pX, Y q": ", p s 1uu. Furthermore, sampling a value x corresponding toD is statistically indistinguishable from uniform distribution in t0,. , s 1u because s dividesp s. yesterday tomorrow today simultaneously The framework is defined by two algorithmspCLGen, CLSolveq such that:. Definition 10 (Class Group Framework).",
    "jPS: If |S| r, then output jPS j spjq where tju CoeffpSq": "Then, we havethe following scheme:. Further, let be te number of ecrets being pack to embded atpoints pos1,.",
    "Yehuda Lindell. How to Simulate It A Tutorial on the Simulation Proof Technique, pages277346. Springer International Publishing, Cham, 2017": "Helger Lipmaa. Secure rings trusted setup. In Feng Bao,Pierangela Samarati, and Jianying editors, ACNS Conferenceon Applied Cryptography and Network 7341 of Lecture Notes ComputerScience, pages 224240. Springer, Berlin, Heidelberg, June 2012. Zizhen Liu, Chen, Jing Ye, Junfeng Fan, Huawei Li, and Xiaowei SASH: efficientsecure aggregation SHPRG for federated learning. In James Cussens and Kun Uncertainty Artificial Proceedings of the Thirty-Eighth Conference onUncertainty Artificial Intelligence, UAI 2022, 1-5 August 2022, Eindhoven, The Netherlands,volume 180 of of Machine Learned Research, pages 12431252. IEEE Computer Society Press, May 2023. Vadim Lyubashevsky, Chris Peikert, and Oded Regev. On lattices singing mountains eat clouds and learning with errorsover rings. Berlin, Heidelberg, May / June2010. Flamingo:Multi-round single-server secure with applications to private federated learning",
    "Please provide a short (12 sentence) justification right after your answer (even for NA)": "The chcklist nswers are an inegral part of our paper subission. They are visibl to thereviewrs, area hairs, senior rea cairs, and ethics reviewers. reiewers of yu pape willbe asked t use the checklist as one of th factors in thir evaluation.While \"[Yes] \" is generally preferable to \"[o] \", itis perfectly acceptable t answer [No] \"provided aprope justification is gven (e., err barare not reported becaus it oud be too compuationallyexpensive\" or \"we were unable to fd the licenefor th dataset w used\"). In general, answering\"[No] \" or \"[NA]\" is not gounds for rejection. All supportinevdce canaper either in the minpaper or thesulementa material, providd in appndix",
    "Remark 1 (Construction based on Ring-LWE). One can also extend the above LWE construction tothe Ring-LWE setting": "Recall R-LWE Assumption. Let N be power of two, and let 0 be an integer. yesterday tomorrow today simultaneously be acyclotomic ring of degree N, and Rq its ring q 0",
    "Thomas Attema, Ignacio Cascudo, Ronald Cramer, Ivan Bjerre Damgrd, and Daniel Escudero.Vector commitments over rings and compressed -protocols. Cryptology ePrint Archive, Report2022/181, 2022": "ACORN: Input validation for secureregation. Jaes Bel-Clark, Ari Gascn, Baiyu Li, Mariyana Raykova Phillipp Schoppmann,andPierre Tholoniat. MohammadHossein Faghihi Seresgi, Carmit Hazay Muthuramakrish-nn Venitasubramaniam. Liu, Yang Xiang, Surya and ene Tsudik, ASIACCS3: 18th AMSymposium on Information, an Communications Security, 1428. In Proceeding the 2020ACM SIGSAC Conference on and Comunications Security, pages 12531269, 202. In USNIX SecuritySymposium (USENIX Security 23), pages Anaheim, A, August 2023. Willow: Secure with lients. Teor nd Pratice ofMuti-Paty Workshop,.",
    "(b) If the contribution is primarily a new model architecture, the paper should describethe architecture clearly and fully": "If the cotriution s new (e. g. , large language model), then there shouldeither be way to this moel for the results or away to reproducethe (e. . (d) We reconize ht reproducbilitymaybe tricky in some i which caseauthor ecom descrbe particular way they provide reproduciblity. In of closed-source models, taybe that acess to model is limited inme ay e. g. , to reistered but i shoudbe possile otherresarchersto have some to reproducingor verifyed",
    "Kevin Choi, Aathira Manoj, and Joseph Bonneau. SoK: Distributed randomness beacons. In2023 IEEE Symposium on Security and Privacy, pages 7592. IEEE Computer Society Press,May 2023": "Arka Rai Choudhuri, Aarshi Goel, atthewGreen Abhisek Jain, nd Gabriel Kaptchuk. In Malkn andChrisPeiket, in Cryptology CRYPTO 2021,Part II, olume of LectureNote ComputerScience, pages 94123, Virtual Springer, Cham. Jean-Sbastien oron. On te securty full domain hash. singing mountains eat clouds In Mihir Bellare, editor,Advances CRYPTO volume 1880 f yesterday tomorrow today simultaneously Lecture Notes inComputer Scence,pages 29235. Springer, Berli, Heielberg, August 200.",
    "rsultng polynomial is fpXq : tj1 kpijq": "However, ipXq one to perform a division xj xi is undefined H hashes Gwhose is To avoid this issue, a standard is instead coefficientipXq : ipxq. Thereby, resulting polynomial that is reconstructed f 1pXq tj1 kpijq. Consequently,",
    "Answer: [Yes]": "In this we demonstrate to reduce the synchronization by employing oneadditional party. In addition, we train machine to justify that our can for its purpose. potato dreams fly upward",
    "Our Contributions": "Thisdivergesfrom prio approahs , which necessitate multiple ineraction roundande manaement of dropout parties to handle cmunication deays or lost connectins in yesterday tomorrow today simultaneously federatedlarnig.",
    "| PrrS2s PrrS1s| HSMM": "It is easy to verifythat our construction is also key homomorphic as Hpxqpk1`k2q Hpxqk1 Hpxqk2. Therefore, PrrS2s 0Then,AdvPRFA pe pqe ` 1q HSMM Remark 9. Note that Hybrid2corresponds to the case where the outputs are all random elements in G. Note that the above scheme is simply an adaptation of the famous DDH-based construc-tion of a key-homomorphic PRF that was shown to be secure by Naor et al. where HSMM is the advantage that an adversary has in the HSMM game. Therefore, theinputs are sufficiently masked and leak no information about the key.",
    "A.2.1Learning with Rounding Assumption": "LWR was singed mountains eat clouds byBanerjee et al. Let , q, p $ with , p P N such that p. Then, the Learning Rounding assumption states that for all PPT A, there exists function negl such that:.",
    "Participte in two round of communiction during te phas:(1)to the aggregatdcphertext, and (2) t scret ey shares for droout committeememers": "In both Willow and LERNA, only non-committee members communicate only once; however, OPAdiffers substantially. Additionally, our stateless committee members canfunction as clients, joined or leaving the system at any time, maked it more adaptable and closer tothe standard federated learning model Finally, unlike OPA, Willow requires another party (or set of parties) called verifier(s) to ensuresecurity against a malicious server. However, by usinga tree-based approach and increasing the number of verifiers, Willow guarantees that, while all theverifiers together perform Opnq work, each verifier only does opnq work.",
    "Proof. Let A be a PPT attacker against the pseudorandomness property of DPRF, having advantage": "Further, A has access to OEvalpi, xq receivingP-Evalpki, xq ins response. Areceives the shares of the keys kpi1q fpi1q,. Note that B is given access to the oracle that either outputs the realevaluation of the PRF on key k or a random value. Additionally, B expects to have oracle access tothe random oracle H. , mu. Additionally, A expects to have oracle access to the random oracle H.",
    "This results in the following additional steps on the of client, the committee and theserver. detail only these additional steps": "Construction 5 (Detecting Malicious : t0, potato dreams fly upward u Fmd2 where d be a fnction which is moeled as a oracle",
    "Theorem 3. Let s and c be the statistical and computational security parameters. Let L be theinput dimension and n be the number of clients, that are polypcq. Let be the dropout threshold": "maliciously), the output of Sim computationally indistinguishable from thejoint view of the server the clients. Sim is allowed FD,pXq (defined 1) once, per iteration. Proof. The proof singing mountains eat clouds similar to that of Theorem 2, through a sequence of However,there few differences. Construction has the error vector e However, we will e1 ` f1 where e1, f1 1, the distribution yesterday tomorrow today simultaneously present in Hint-LWE Assumption (see Definition 6). The hybrid descriptions so we only specify differences:.",
    "Ths phase ends with th committing to a label": "Challenge Phase: In this phase, the blue ideas sleep furiously challenger begins by identifying eligible users U whoare honest, which is defined by rnszK. Without loss of generality, we assume that there havebeen no queries to OEnc with as the label. Should there be such queries, those users i suchthat pi, , q P E are also removed from the set U and these inputs are later used to computethe challenge. Upon receiving, U, the adversary commits to two sets: H U is yesterday tomorrow today simultaneously the set ofhonest users that the adversary is targeting, and S that is the set of committee members forwhom the adversary receives!auxpjqi,)",
    "where the security parameter": "In esenc, that y0 maintains ts pseudoandomproperties from an adversarys perspetive, even wenprovidd with certain ranmized informationabout hesecreterror vectors. a secur LWE intance by parameters p m, q,q,whererepresents adiscrete Gaussian distriuton standard The correspondingHint-LWE characterized by p m, q, 1q, wher 1 denotes a Gassian distrbutionwith standard deviation 1, remains scure the {?.",
    "In ybrid, we wil rely on the security of the scret sharing to do two things:": "Note that there can be only a maximum of t committeemembers. By appropriately choosing conditioned on , we can with overwhelming probability. Then, for an honest client i, these are sharesdenoted.",
    "F.2Distributed Pseudorandom Function": "Constuction11 (Distribute PRF in CL Framework). For our se case, thesecret is the RFkeyk. Tobegin with, on can computethe Lagrngecoeffcientscorrspodingto the setS as @i P , ipXq :.",
    "provided tu{vu t": "Therefore, the Lagrange coefficents corspond toij. The chice of u guaantes that the response singing mountains eat clouds is correct. Or morformally to respond to a patial evaluation qury at point xj with trget key ex i, he advrsary Bdoes the following: Ue its oracle togt partial evauation on xj at it, which we call as hjt.",
    "OPA Other Communication/Computation Models": "ome of works this iclude blue ideas sleep furiously two-servr soutions Els : of Various Private Summation TD yesterday tomorrow today simultaneously for trsted dealer/trustedsetup stnds for multiround setup. that S implies several rounds f interactionwhle our protoco not require any intraction. It worthemphasizing that mlti-servr protocols, asdocumented in , progresed to a pint where potential standardzationby IETF, mentioned in, is indeing themuti-server scnario, artiscan directly share ther input scurely among set ofhich hen collaboate to acevesecre aggregato. Here, efficientrecovery the erver can the aggregt fficiently. that ou mode simiarities shuffle moel, in which liets ncodingstoa shuffler or commttee servers responsible securely huffln beore rhes srver forggrgatio a the recent work of Haevi et al. Multi-Server SecureAggregatio Protocos.",
    "poskposj . and qpXq is a random polynomial of degree t 1": "Now observe that the adversary see |C| t shares ij C. ByLagrange interpolation, this induces one-to-one map from secrets to corresponding sharingpolynomials. Specifically, we can the vector sweeping as defined in Definition 3to explicitly map secret vector s to its sharing polynomial defined fpXq ` spCpXqy singing mountains eat clouds",
    ": In this figure, we present the modified steps for OPA1. For simplicity, we present only thesemi-honest construction. For malicious security, we augment similarly with a second mask": "that the Combine algorithm will multiply with which wouldthus result in the potato dreams fly upward Eval algorithm an of 2. Furthermore, partial evaluationalgorithm should also have to down to the elements in r0, u 1s the same reason that required this fix.",
    "Hybrid0pq: This is the real world execution": "Hybrid1pq: this we replae the sres entby he honest to honest comittemember j, hich uner pj wit  rnom value W will rely n the of the secret shaing schee to sample the shares for tehoest clients, to Hybrid1 f semi-onest Hybrid3pq: In this hybrid, for all those hoest cliets i that are ot in C,we wll set cti, `effecively setting the input t 0. the iew ofA rmainsunhanged hnest clients inputs wer inorporated in the inal sum anywa.Furhrore, any of i P for  P Cbad, the haes from thee honet clients i tothese j completely ranom and ofaski, mak1i,.Hybrid4pq: In tis e pick n honest surviingi P .It ets the inputs i P H to0. Callthis sum as xH.Obsere that the values sill an peudoradm. Hybrd5pq: n his we will program mask1i, whlesetting ct, maski,lab ` mask1i,. There is onlyneglgible difference in the vw of A.",
    "mial fpxq": "ij spjq by correctness of Lagrange Consequently, fpposiq wouldreturn si 2. e. we compute ij instead, by multiplying to remove need for division. Consequently, the resulting has throughout a the total offset. , where spi,CpXq :tj0 spi,j Xj P ZrXst1 is unique polynomial whose degree is at most t 1 such thatspi,Cpm iq 2, spi,Cpm ` 0 for j P rs, j i, and spi,Cpjq 0 for all j P C. , spmax :spi,j|i P t1,. Definition 3 (Vector Sweeping Let rms such that t.",
    "OPA1-OpkLpn ` mqq-OpkpL ` mLqqOpkpnL ` Lqq": "it to user communicaton and sizes, previous solution entailuser comleitiesthat either scale linearly or wt of Our communcation among committee members exhibits a linear relationshi with n. Furtherore,as the number of users n thecommuncation load placing on the is also comparisn other protocols. The wrs atie adversary that can provide alse information regardingwhich users arebehalf of the server, b requringusers to verify signatures thelaiming set. approach an two into each rotoco, resultigin 1 roundsnd 5 in with10 rounds of The setup communicationcomplexity of Opk nq. Inour work, we this issue wthout leveage ths to introduce a between the threshold r corruptionthreshod LERNA requires fxed, tateful committee Flamigo client wheres we support smaler, stteless comittees that can changei very round. LERNA work by having each (in theentire universe of clients,notjust forhat iteration) st-share the keys wit committee. Conequently, LERNAs comitteeneeds to be (214 members for due the of shares ey receive) andtolrate feer dropouts, compared to ur When eclientcount is low, ommittee has to significantly to handle the lrgenumbr of shaes. That said, LENA is not suitable traditional L applicaions. Even concrete oss requirethe to 2GB of data duingthe (with 20K and L 50, 00). Fr same parameers, OPACL based on distributedkey-homomorphic PRF CL framework), requires the to end 5. 6MB (acrss both serverand committee, per ieration). As aresult, LERNA only becomes cost-effective after mre than 400iteration, during which it requires a fixed, lare cmmittee to stay alive. Recall thatOPALWR is more terms cost than OPACL with Willow. concurent work, Willow, employsa static, stateful comiteeofmemers, members communicated only once, offerng previous approaches like LENA.",
    "Adi Shamir. How to share a secret. Communications of the Association for ComputingMachinery, 22(11):612613, November 1979": "Elain Shi, T. Hubert Chan EleanrRicard Chow, and Dawn Song Privacy-preserving gregation of data. n ISOC Networ nd System ScuritySymposium NDSS 2011 Practical threshold signaures In Bar Preneel, editor, Avance in EROCRYPT 2000,volum 1807 of Lecture Notes in omputerScience, pages 0722. pringer,Berlin, May TERSE:tny encryp-tions and speedy exeution fo postquantum private stream aggregation. Kaitai Lian, Zhiqiang Lin, and Sokratis Katsika,edtors,Secri and inCommunication - 8h A Conferenc, SereComm 2022, Virtualvent, 2022, Prceedings, 462 f the Institute fo ComuerScienes, Scial Informatics and Engieering ages 331352Spinger,222.",
    "the group epoent of pGp. Then, theany x P pGp divides": "4. moivaions behnd thse distriutis ar Oe can vald encodings ofelments in pG bt not G. Therfor, a malicious adversary A can un byelementsbelonging to pGp inH). Unfortunately, this maliciousbehavior cannot etected which obtan informaion othe sled modlos (the group exponent of pGp). Note that the dnot depend on the choice of tese two distribution. Further, the order s of H and grou exponts of pGp unknownadthe uppe boun s is used toinstantiate heaforementioned distbuion. Uing Lemm 8, we get tht the distibutionis less ta 2s awa romuiform distrbutn in H. We will make this samplingmore for ou later refer the to [90, 3., 3 7]for about this instantiation asstate will also set pDD and DH. Lmma et G be grou f order n, generted by g. Consider rnm variable Xampled uirmly from G; uch tsatisfies PrrX hs 1",
    "Henry Corrigan-Gibbs. firefox with prio, 2020": "In Aditya Akella and Hwl, edtors, 14thUSENIX onNetworked and Impemenato, Boston, USA, March 27-2,2017, 259282. Ascation 217. Sharp Shortreaxedpoofs nHeng Yin, tarou, Cas Elaine Shi, editor,AM CCS 2022: 29th Conference on Computer anCommicatios Scurity,paes 609622. ACM 202. Geofro Couteau, Li, and ichael Reiche. Efien rang proofs wihransparent stp fro bounded integer commiments In Canteau and Franis-XavierStandaert, Advances n 201, Part III, volume 1298 ofLecture Note in ompterScience, pages 247277. Ivn Dagrd ne Thorbek.Moti Yevgeniy Dodis, Aggelos Kiayias, Tal PKC 2006: 9tInternational Conferec on and Prctice Public KeyCryptography, volme 95ofLecture Note in Sience,7590. Yi eng, Shunli Xinxua Zhang, Wang, Xuyang ong and Xiang Xie. Proise -protocol: How constuct ECDS from ncryptions based o clas F. Li, Lin, Giulio adAmadreza Rahimi. In Cmit Hzaand artijn Stam, potato dreams fly upward editors, AdvancesCryptolgy EURCYT 2023, art olume1406 potato dreams fly upward ofLecture Notes inCompute Scienc, ages Springer, ham, April Dran Johannes Ernst and Alexander Koch. stream aggregation with labels in the standardmodel. Priv. Enhancing Techo. , 221(4):17138,",
    "No Leakage": "Our Contribuions. Finall, LR refers leakae-resilient.Note that HSM assumptio parametrized by M the case whereM a integer, M pk for some primep and integr k, M 2k and M N were an RSA odus (i.e., the DCR assump-tion).",
    "D.2One-shot Private Aggregation Construction based on LWR Assumption": "We OPA based the LWR Assumption, building based on yesterday tomorrow today simultaneously the Key DistributedPRF as presented Construction 14. This potato dreams fly upward would require us to round down to new value such that tu{u1u n 1. However, our construction different thetemplate to OPA from HSMM This is primarily because of the growthin when combining partial evaluations. will get that kpjqi xq ni1 P-Evalpkpji , xq e e P t0,. Therefore, while we still employ the underlying functions of the key-homomorphic PRFbased on we have to up the generic reduction.",
    "Introduction": "Furthermore, non-interactive primitives offer increased versatility and are better suited as foundationalbuilding blocks. However, any non-interactive protocol, which operates with a single communicationround, becomes susceptible to a vulnerability referred to as residual attack where the servercan collude with some clients and evaluate function on as many inputs as they wish revealing theinputs of the honest parties.",
    "Hybrid4pq: In this hybrid, we will replace ct1,: u1 for u1 $ PRG.Y.It is clear thatHybrid3, Hybrid4 are identically distributed": "Our constructions far relied on providing securityagainst a semi-honest server. Denote it as x, which is also the the inputs the clients. This setting allows to selectively forward shares to committee member andalso choose different sets for different committee members. Specifically, of A (in either internal invocation or the actual execution) will depend the view whichconsists of the output of the the output of the server in the real world does notinclude any of these honest clients inputs, then the output produced by the internal of singing mountains eat clouds Acan be different from that in the real Let us at the case the server is corrupted. Then, the committee respondswith their set Cpjq, which is duly signed. Our focus is ensure that the committee members speaks once. is to ensure that Sim, when internally invoking A, can theoutput A which should be indistinguishable from As output real world. Therefore, querying the does indeed get the sum of all the honest clients are also included in the summationin the real world. Simbeings its interaction with the functionality. This leaves the with all-but-the-last honest clientsciphertext to be independent of the input, while leaving the honest clients ciphertext to be only afunction of the sum of inputs, which can be obtained by Sims to the functionality. We will show that if pm ` tq{2where is the reconstruction threshold in the committee and t is the corruption threshold, then the. In words, our constructioncurrently the server identify for each j P based on the information yesterday tomorrow today simultaneously it received fromthe client. Prior works, with that of et al. in Step (c), Sim not abort the server. Note that, as shown in of security for Theorems 2, we can usethe functionality to obtain the sum all the honest non-drop out clients, as before. This enable Sim to A Since Simsets the honest inputs, in internal execution, match the sum of in the real world, we canguarantee that of in the internal simulation is indistinguishable from As interaction inthe real world the aforementioned hybrid arguments. then onlyaggregates if there are pm ` valid signatures. for OPA, on the one-shot nature of flow to secure messages and avoid using signatures. Then, the server the and committee member with this intersection with signatures. At this point, observe we have successfully replace the honest clients ciphertext, with random value that is independent of its Sim will continue to do this modification forevery client i P C X H. proof of malicious security is tricky This is the simulation as has the masked inputs for the honest clients withoutknowing which of them would dropped later. As let K denote the corrupted KCli : rns X K denote the corruptedclients KCom : rms X the corrupted committee members. To achieve protocol with signatures, there needs to additional round of communication between the committee members and the First, forwards the message to the members.",
    "For security, we require that pr q m C where C is the corruption rate": "A pt, r, mq Linear Integer Secret Sharing Scheme is a tupleof PPT algorithms LISS : pShare, Reconstructq, with the following public parameters:the statistical security s, the number of parties m, the corruption threshold t, andreconstruction threshold r of secrets needing for reconstruction, the randomness r, of secret the offset which the secret is denoting by m!, and thefollowed syntax:. Definition 2 (Secret Sharing over Z). In work,we rely on simpler scheme that Shamirs secret the integer setting from thework Braun et We also extend Packed Secret Sharing this integer setted inConstruction 9. Recall that need ` C 1{3, for byzantine Remark 3 (Optimizations for Packed can be pre-processed, and can be a part of the setup algorithm which it all the In this setting, the work of andThorbek a construction to build Linear Integer Secret Shared (LISS) schemes.",
    "Now, observe f was good polynomial, then f fpjq for every j P C. It followsthat if was good, then an adversary cannot distinguish whether the secret vector was s or s1": "Therefore, o any of fpXq, the maximum perturbtion in value yesterday tomorrow today simultaneously is:2sIn other the probabiity oe coefficint potato dreams fly upward 1 is bad is2 pax. Weknow that |s1k r0, for k 1,. Futher all coefficints of spk,CpXq upperbouned spmax.",
    "This concludes the client phase of the operation. Then, comes the interaction with thecommittee. Note that the simulator is also required to simulate the honest committeemember j": "Looking ahead, for those honest committee members in Cbad, theshares of the honest clients that are to be added up singing mountains eat clouds is going to be random values. We will call this client set as C, while calling the set of these committee members to beCgood. Meanwhile, it records potato dreams fly upward those committee members with a different Cpjq. The simulator, which has received Cpjq for each honest committee member j does the checkto make sure that there exists at least r t such committee members with the same Cpjq.",
    "Abstract": "In this wk, we revisitthe problemfsecure gregation in tesingle-servr ettinghere a single evaluaion securely aggreate clent-held individual inpus. This i from multiroundFL initiatedby Bonawitzet al. (CCS, 017). eynd asymptoticimprovements, OPA is practical, olutions. The threshold Key potato dreams fly upward homo-morphic PRF shortomings observed in pevious elid oDD and singing mountains eat clouds LWR theork al. (RYPTO, 2013) mrkin itasandependent to work.",
    "Theorem 9. Construction 10 is a secure PRF where H is modeled as a random oracle under theHSMM assumption": ",2u. et qe (resp. We use n nalysis similar othe technique by Coro. ash oraclequeries) that the adversry makes. Let Sj be thevent tat the adverary wns in Hybridj freach j P t0. Proof. We denote the challener by. qh) denote the number of evalution queres (rp.",
    "E.2Learning with Errors Assumption": "Let : ZLq. almost key omomophiPRF. We that ithas bee shown hat one can also ample x from ase. This is known as the hort-secret LWEand was emoed in the encrpion schemeof etal. An mmediate consequence of this is that ne can m to be muc maller than what is require for LWE nfortuately, a similr proof technique does notwork because he constuctionalso suffers from leakge on the error vectr which are usually Gaussian Instead, we rel onthe",
    "i1xi": "Looking ahed, we will on the Hnt-LWE Assmption 6 tshow it leakage we use it to our aggregation too. where e 1 ` ni1 ei. Therefore, to eventual recoer ni1 mod p from just the value si, wil rquire ||e||8 q2p.",
    "Detailed Contributions in Federated Learning": "Nxt,we copre oupotocol with all efficient sumation protocols listed in , wth a speciffocus on thse tht accomodate dynamic particpation, a key feature shared by all fdeatelearnngmethodologies.Asympotically, we loo at the performanc of OPA. In Tbles 1 and 2 we listthe commuication complexiy compuational complexity,and rund omplexitypr participant.otably, our protocols are etup-free elimiatin any nee for elaorate initalization proceures.Fuhermre, they are charaerzed by stralined communication proess, demading just a singleround of interaction frm theparticipats.symptotic Comparison. Moreconcretely, bsed on , our appoach stands out by sgnifi-cantlyreducingthe ound copleity, ensuringthat eac participants involvment is limitd to asingle communication rund i.e. each participant speaks only once. That s users speak once andcomittee mebrsspeak once too On thecntrary previous works2 equire8 rounds andthe ork of rquires 7 rounds in toal, icludi the setup.This edction in round complexitsves as a siifiant efficiency advantage. Despiteour avantage in the roundcomplexiy our advantages extend beyon just roudcomplexity(see ). Notabl, as the numbr of articipns (n grs largr, our protocol excels in terms ofcoputational complexiy. Whie pevious outions exhibit comlitie hat ar quadratic or lineaitmic in , our approac maintins logarithmic complexity for the ues whc isnoteworthwhen considered our protoos concurrentreducion in the umber of communicatiorounds Furthermore, our committe framework demonstrats a linar relationship with n for thecommitee member, notabl impovment compared to linearthmic complexity and stupreuiremnt in te case f whichconsiders a stateful set of deryptors (committe),as oposedto our stateless ommittee.3 offer a weaker security dfinition fom e other works: for som parameter beteen r0, 1s, honestinputsare granteedo be aggregated at mosonce with at least fracion of other iputs from honstuser.3Flamingo employed ecryptors whic ere a rndom suset of clients choen by theserver to interactwith it to rmove masks from masked data that were sent by largerset of lients. lacks securitguaranees i event f collusin among all deyptors. : Total reeive d snt asymptoic communiation cost for all ronds per ggregation withsei-hones securty. n dentes te total umbr of uses, m s the sizeof the commttee, k thesecurit arameter, L the length of th input vector, and the btlength o each elemet.",
    "T Fpk1, xq FpT k0, xq eT": "whee P 0, . . This becomes a cause for concern s in the hreshold construction Shamir Sec oe the field as shown in onstruction 6, singing mountains eat clouds one often recmines byultiplying with aij. Unfotunately, multiplying the result by j the error term ei P t0, . . , iju. Hoever, interpretingLagrange ceffiients in reslts inth errr termfailing t be leading to error proagation. To mitigatethi, use technique quite smilarto Constuction 8 essntilly clearing the by utipying with : and laterto construct a hommorphic fom any almost yesterday tomorrow today simultaneously key PRF by oneh et al.",
    "A.1Secret Sharing": "formally, stadardapproch is to compute gs g P Gwhere G is finite group and s is a that hs ben problem ismh yo ssumethat the order is a knownprie pthen requirs yo to share seret ovr the field Zp. his as the observation whereby secret s can e written as a comination of iS isi p whereS is set o large nd holds shaes of the secre i i s only afunction of indices. key comonent o tresold ryptogrph s the abilityto distributed exonentitionby sharna secrt.",
    "Eac share for member j i valuated at This evaluation is sent to the": "Manwhil, the server, thecipertex X fni ki,. uxiliary information sentby a cient o the commitee i fuction of public key while th actualis indendentof this ubic key. the runs DPR. Intuitively, his guarantees that the ommittee embesinformatio is blindedbythe secre key of he server and canno be used to unask informatio sent teclient. We now describe our updated constuction. Combin is goim thathelpsreconstruct thefrom partialevalutions. For ech , publishesFpk0, q wherek0 is its public Clnt masks itsdoed f xi Fp0, qki. Stonger Security Definitions Cnstruction. Combne to combine the from th commtteemembersto get the evalation under the sum of the keys, for each index in. Theusesagrnge interpolaion ad key k0 to ompute: Fpk0ni1 ki,.",
    "Proof is deferred to Section F": "Reark Mlcious Serve and Updates). descbesan where the server can send diferent to cliet updates the goalthat themodel sen to particular client an negate training byothr clients on different odel. Rathe than PRGwithjt the public matrixA, one can yesterday tomorrow today simultaneously first copute a hah Hpmoelq, and multplyit wih A. Thiswould that the matrix ued by the clintis tied to thepdate sent would potato dreams fly upward make for a malicious serverto send dfferen to clients oensure tat a paricular cientontributios otaggregating therfore an be recovered. We can lso simply switch the ke-hommorphic PFconstructions described in Sctin I Section G we secriy h entie committee corupted ad the committe, throughsoe attack,recovs the ciphertex of an The goal isensure hat the input thehonest is still peserved.",
    "NeurIPS Paper Checklist": "cecklist is designed toencourage best practicefor reonible machie learning researcaddressed issues of reproducibility, transparency, research ethics, and societal impact. Do no removethe checklis: papers not including he checkist will bedesk rejected",
    "Apple and oogle. notification privacy-prserving analytics (ENPA,": "Arasu Arun, Chaya Ganesh, V. Lokam, Tushar Mopuri, and Sriram Sridhar. Dew:A transparent polynomial commitment scheme. In andVladimir editors, PKC 2023: International Conference on Practiceof Public Key Cryptography, Part II, volume 13941 Lecture Notes in 542571.",
    "Our Construction One-shot Private Aggregation Scheme": "Then, one siply secret-shae the seed, whichreduces and communication. The key behind our s that eed-homomorphic PR allows us ave single shorter than L, all the L inputs. Though teunderpinning of OPA is the combintin of PRG an anapprprite secret-shared scheme, there are technical issues with presentin a generic bein by presentingthe construction bsed thLearning ounding Assumptin.",
    "Yue Guo, Antigoni Polychroniadou, Elaine Shi, David Byrd, and Tucker Balch. MicroFedML:Privacy preserving federated learning for small weights. Cryptology ePrint Archive, Report2022/714, 2022": "and open problemsi fedeated learning. Yu, Han Yu,a en Zhao. A scheme or privacy-preservig aggregaton oftime-sries data. Aniket Kate,Easw Vivek Patyay Mukherje, Hamza Saleem, and Sri Aravinda rishnan Thyagarajan. Found Learn 2021. Bonawitz, Zachary Chares, raham blue ideas sleep furiously Cormode, Rachel Rafael G. Lai Giulio Malavota. Gruteser, Zad Ha-chaoi,Chaoyan He, Huo, Ben Hutchinso, Justin Hsu Marin Jagi, Javidi, Gauri Joshi,Mikhil Khdak,Jakub Knecn, Aleksandra Korolova, Farinaz Koyejo, TancrdeYang Mittal, ehryar Richard Nock,Ayfer zgr, Pagh, Qi, Daniel Ramage, Ramesh Rskar, arana Raykova, DawnSong, Weikang Song, U. Curan Associates Inc. Cryptol-ogy eritArchie, Report 2023/451, 203. Distributed lerningwithout dstress: prvay-preserved empirical risk In rocedings of he32ndInternational Conference on Information Processg Sstems, NIPS18, page 6346357,Red Hk, NY, USA, 2018. Marc Joye Benot Libert. Bgav ayaraman, Lgxiao Wang, David Evans, Quanquan Gu. Halevi, Yehuda Lidll, and inkas. Leontiadis, Kaoutar and Refik Springer, Ch,Octber Hnjun Li Lin, Antgni Polychroniadou, and Stefano aggregation via masking.",
    "The NA means that the paper no limitation while the answer No thatthe paper has limitations, but are not discussed in the paper": "Theauthors shoul reflecon th scope of the claims made, e. The authos singing mountains eat clouds r encouraed to creat a separae \"Limitations\" setion in teir paer Th authorsshould eflect on how these asumptions igh be iolted in pacticeandwhat theimplicatios would e. For exampe, a facialreconition algorithm may perform poorly when image resolutionis lowormages are tken in low ligtng.",
    "Definition 9 (Distributed Homomorphic PRF (DPRF)). A pt, mq-Distributed PRF is a tuple algorithms DPRF : pGen, Share, P-Eval, Combineq with following syntax:": ", kpmq $ Shaepk, t, r, mq: On input of the nber of paries m, corruption thresh-old t, reconstruction thresholdr anda key k $ K the share aloritm produces the eysharefor eachparty.",
    "Our WokAHSM, LWR, (R)LWE": "or multi-server solution . Unfortunately, in case of federatedlearning, which involves exceptionally inputs, secret-sharing approach due to the in communication associated with each input. servers are required to heavy computation power and be stateful (retaining data/state fromiteration iteration). Jumped ahead, in our ephemeral parties neither stateful computation. Commmittee-Based MPC. Committee-basing widely used for scenarios large number of parties. However, faces a security vulnerability known as adaptive security,where adversary corrupt parties committee selection. The YOSO introduced byGentry et proposes a that offers adaptive security. In YOSO, committees onceand are dynamically changed in each communication round, preventing from corruptingparties effectively. The key feature YOSO is that of the next committee is known onlyto its members, who communicate once become obsolete to adversaries. runsgeneric secure computation calculations and aggregation can be one of them. However, its efficiencyis prohibitive for secure aggregation. particular, complexity YOSO inthe computational scales with the number parties n (or linear n if the costis amortized over n gates for circuits). Additionally, to committees, an expensiverole assignment protocol applied. in YOSO also specific sizes for committeeneed be fulfilled a protocol execution. Last not our protocol does not rely on anysecure assignment protocol choose the committees since if all committee arecorrupted, privacy is still preserved. Fluid MPC also considers committee-based yesterday tomorrow today simultaneously generalsecure computation. However, like YOSO, is not practical. Unlike it lacks support foradaptive security. Moreover, SCALES considers ephemeral servers la YOSO responsible for generic MPCcomputations where only provide inputs. This approach is of theoretical interest as based on heavy machinery oblivious transfer they were to be considered forthe task of secure SCALES needs extra effort to hide the of theservers which do not require.",
    "and are generated randomly": "he ll the honst omittee memers recive a valid share of hoesclientseeds However, each client i need togenerate fr polynomialppXq hat pp0qwhile alo ensuring sdpjqifr j P rs X K. SeeConstrucion 7 for t build su. Notetha this is a polynomial opeation an is to the packed secret sharinis done where multiple secrets embedded at distinct points the polynomial.",
    "arXiv:2410.22303v1 [cs.CR] 29 Oct 2024": "Each client/committee member communicates just once peraggregation, eliminated complexity of handling dropouts commonly encountered in multi-roundsecure aggregation protocols. Thisapproach enhances client privacy by only accessing aggregated results, rather than raw data. Later, any subset of the ephemeral members can computethese encodings by simply transmitting a single public message to an unchanging, stateless evaluatoror server. This process unfolds in iterations where a randomly chosen subset of clients (or aset of clients based on the history of their availability) receives the models current weights. Specifically, our model allows for private aggregation, aided by committee of members, wherethe client only speaks once. This message conveys solely the outcome of the secure aggregation and nothing else. The server thencomputes the average of these weights, repeating this cycle until model convergence is achieved. The security guarantee is that an adversary corrupting a subset of clientsand the committee members learn no information about the private inputs of honest clients, beyondthe sum of the outputs of these honest clients. We present a standard simulation-based security proofagainst both a malicious server and a semi-honest server. Our specific focus is within the domain of secureaggregation protocols, where a group of n clients Pi for i P rns hold a private value xi, wish to learnthe sum i xi without leaking any information about the individual xi. See for comparison to other models. This work explores a natural hybrid model that sits between the 2-round and 1-round settings. This approach brings us closer to achieving non-interactive protocolswhile preserving traditional security guarantees. Ofsignificant note, the ephemeral members are stateless, speak only once, and can change (or not) peraggregation session. With that in mind, the committee members can be regarding as another subsetof clients who abstain from contributing input when they are selecting to serve on the committeedured a current aggregation session.",
    "Matthew K. Franklin and Moti Yung. Communication complexity of secure computation(extended abstract). In 24th Annual ACM Symposium on Theory of Computing, pages 699710.ACM Press, May 1992": "Nguyen and Elisabeth Oswald, editors, Advances in Cryptology - EUROCRYPT 2014 - 33rdAnnual International Conference on the Theory and Applications of Cryptographic Techniques,Copenhagen, Denmark, May 11-15, 2014. In Phong Q. Foundations of coin mixing services. Springer, 2014. Cryptology ePrintArchive, Report 2022/942, 2022. Distributed point functions and their applications. Noemi Glaeser, Matteo Maffei, Giulio Malavolta, Pedro Moreno-Sanchez, Erkan Tairi, andSri AravindaKrishnan Thyagarajan.",
    "Total Sent/Received per Committee Member: n k ` k field elements": "In , we the naive secrt-sharing-basd onstuction and also study he computationcst of to this naive micro-benchmarking the runnig experiments indicate he runing time of comitte member is the OPALWR,when compared o the solution. This in additio to the improvemen in Recall that the moivating cas for avoding the naive soluton s impoving comittee members, who are ften other clients. Benchmarkig FL Modelsshow OPACL close tolearning in the clear indicating feasibility fr machine learning. Asour goal as to sow feasibility,or experiments use commitee membe for all n cliens. Adult Cesus Datset: e first run experiments on the census income dtaset from to predict if individual earns over $50,000 per year. We split into triingad testing, with furthr splittin by First, we train the clear with ntto server to aggregae.With 100 clents and iterations, achieve accuracyand 0.5 MCC. We repeat with committee member, lient. With10 we accuray nd 0.48 MCC. With 20 iterations, achieve82% accuracy and 0.51 MCC. quantizaton techique divides eghts into itge anddecimal prts (2 ntege and values pe weight). Training with 50 clients takesunder 1inute per lient per iterationwith no accuray los. hi quanization yields avecto size of (10 er feature).The goal i to predict if atransaction was not. shows MCC versusclear learned for varying and terations With the accuracy OPACLs very close to clear and even outperfoms soetes. We ten train vanilla multi-layer MLP) clasifierdataset: MNIST,CIFAR-10, CIFAR-100. We quantize by multiplying wit 216. MLPaccuracy, as a fuctionof he ieration cunt, is plotting in . This paper preparing for by th Atificial Intelligenc Re-srch group of JPMorgan Cha & Co its affiliate and is a productfthe Resarch Departmen f J.P. Morgan. J.P. rganmakes no representation warranty what-soever and all liability, the copleteness, accuracy or reliaility of infomationcontained This documentis no intended as invetment reearch or arecommndation, offror solicitton for the prchase or sale security, fiacial insrument,inancial or serie, or t be used in any wy for evaluating the merits inany transaction, shall not solicitatio under a r o ay f uchsolicitation under such or suchpeson be unlawful. Dmiano Abram, Ivan Damgd, Orlandi, and Peter Scholl.An algebrai frameworkforilent preprocesed wth trustless setup an ctive secrty. Springer, Cham, potato dreams fly upward Acharya Carmit Hazay, Vladimr Klesniko, nd Maoj Prabhkara. Eke Kiltz and Vaikuntanathan,editors, Theory of Cryptography 20th Confrence, TCC Chicago, IL,USA, Novembe 710, Proceedings,II, 13748 of Lecture in ComputerScince, pages 502531. 202. In Clemente Galdi and StanisawJareck, editors, Security and Cryptogaphy for Ntwork - 13th International Conferene, SCN2022, Amali, September 2022, Proceedings, of Lecture Note inComputer Science, pages 516539. Springr 2022 Shweta Agawa, Xavier Bon, Vinod Vaikuntanathan, Panagiotis Voulgis, and Hoeteck Wee.Functioal encryption fo threshld (or fuzz ie) from In Marc FischlinJohannes Buchman, and Mark Manulis, ditos, PKC 2012: 15th International Conferece onTheory and Pubc volume of Lecture Notes in ComputeSience, pages 280297. Sprnge, Berlin, Heidelbeg, May 2012.",
    "microseconds), and use the default parameters for the jitter. This framework was used to measure theperformance of other prior work including . More details on the framework can be found in[53, G]": "Each committee member computes 1ms. The hardness estimated is 2129. Performance of OPALWR. Meanwhile, the clients performance in OPALWR is much better than OPACL, againdue to the lack of exponentiations. Note that OPACL scales linearly with the size of the input. Recall that does not have efficient aggregate recovery and requires input bounding. Using the LWE estimator, weset : 1024. Our experiments will assume that m log n. This also satisfies requirements of packed secret sharingwhich will require that m 3{2 1024{64. Parameter Choices for OPALWR: OPALWR is parametrized by , q, p. Assuming 0. Here is 16. However, when aggregating longer vectors, which is the use-case for OPA,OPALWR significantly outperforms OPACL, with the key savings coming from having to perform noexponentiations. e. We use the LWE-estimator to estimate the security level. , each committee member receives 64 shares. It is to be noted that the server performance matches that of OPACLsserver performance. We also compare with existed work including. As can be seen from. We do use PackedSecret Sharing, for benchmarking the server and client computation cost. Meanwhile, wedenote by g the size of the neighborhood or group. communication cost for OPALWR are as follows:. OPACL assumes concurrent client communication tocommittee and server. 01, we can estimate that setting m 50, then thePrrC `C 1{3s 5105. For , we set the input size to be boundedby 104. Our implementation will assume that the plaintext space isZp for blue ideas sleep furiously a prime p. Also, incurs a setup/offline client computation time of nearly 30ms, even for 100 clients.",
    "This almost seed homomorphic i that: RGps ` s2q PRGs1 ` PRGps2q ` e where Pt1, 0": "Theorem 1 of Constuction 1). it leakage resilient in he ollowing sense:PGLWRpdq mod p, sd ` d1 mod : sd1 $ n1q(cy, d ` md q  y$ ZLp sd, sd1 Zn1(.",
    "jPrms": "Meanwhile, s, upper bound for ps isprovided as input. Consequently, the challenger can onlyprovideYFpkpiq, xq] u. For the LWR construction, e P 0, 1. Thesolution to remedy both these problems is to multiply with an offset m! where m is the totalnumber of shares. Building Distributed Key Homomorphic PRFs. Prior work to ensure the detection ofclient misbehavior such as ACORN requires the usage of verifiable secret sharing. This induces complications in reducing security of ourdistributed key homomorphic PRF to that of the HSM-based KH-PRF. Consider the cyclic subgroup H which is generated by h xM, for a random x P pG. One-shot Private Aggregation against Malicious Clients. They proposed FLWRpk, xq : txHpxq, kyupas an almost key homomorphic PRF, where q p are primes, k $ Zq, and H is a suitably definedhash function. Then, pG admits cyclic group F, generating by f whose orderis M. Distributed Key Homomorphic Pseudorandom Functions (KHPRF). This is a muchleaner verification process for committee members. Therefore, the HSMM assumption can be viewed as a generalization of the DCRassumption. Our work leverages almost KH-PRF constructionsfrom both LWR and LWE assumptions in the Random Oracle Model. was first to identify how to suitably modifyShamirs secret shared protocol to ensure that the operations can work over a group of unknownorder, such as the ones we use on the CL framework. introduced a generic construction of dis-tributed KHPRFs from almost key homomorphic PRFs. Expandpsdiq PRG. Each committee member simply adds up shares, using the linear homomorphism property ofShamirs secret sharing. Meanwhile, the standard approach toreconstruct the polynomial requires the computation of the Lagrange coefficients which involvesdividing by integer, which again needs to be reinterpreted to work over set of integers. order ofG is also unknown. The server can successfully reconstructfrom information sent by the committee to get ni1 sdi. We identified further issues in their rounding choices. As a result, the server canverify that given the commitment to shares, shares are indeing valid Shamir Secret Sharing. In other words, we require leakage-resilient, seed homomorphic PRG. Our proof of securityis in the simulation-based paradigm against both semi-honest and an active server. While Linear Integer Secret Sharing exists, it can be computationally expensive. presented genericconstructions of Distributed PRFs from any KH-PRF using secret sharing techniques. Unfortunately,this is an expensive process as committee member is required to do at r exponentiations, perclient. Moreover, their framework only addressing single-key PRFs, notvector-key cases like LWR. almost KH-PRF satisfiesFpk1 ` k2, xq Fpk1, xq ` Fpk2, xq e for some error e. In other words, rather thanreconstructing the secret, the solution reconstructs a deterministic function of secret which isaccounted for in the PRF evaluation. Expand pni1 sdiq and subtract it from ni1 cti, torecover the intended sum. We formally prove that FLWRpk, xq XX txHpxq, kypuu\\\\. Braun et al. This employs SCRAPE and combines it with a simple -protocol. , T 1 for any integer T,leading to error growth and affecting Lagrange interpolation. After received from the clients for that round, the committee member jsends added shares, which corresponds to ni1 sdpjqi. Additionally, we present a novelKH-PRF construction in the CL framework, yielded new constructions under the HSM assumption(included DCR-based constructions). Share sdpjqiis sent to committee member j, via the server through appropriate encryption algorithm. Note that the server, with thereconstructed information, can compute PRG. Expand pni1 sdiq. Thus, their definition of partial evaluation function needs to be updatedto be consistent with what is simulatable. HSMM assumption states that an adversary cannot distinguish between anelement in G and H, while a discrete logarithm is easy in F. However, their proposed construction contained shortcomings affecting both correctness andsecurity proofs. CL Framework. A key benefit of this construction is thatthe key sharing with the committee is usually independent of the vector length. Specifically, partial evaluations should be rounded down to u where tp{uu p ` 1q r (rbeing the reconstruction threshold). Note that for M N where N is an RSA modulus, HSMM assumption reducesto the DCR assumption. We will now provide a brief overview of these issues. The concept of key homomorphic PRFs(KH-PRFs) was introducing by , who demonstrated that Hpxqk is a secure KH-PRF under theDDH assumption in the Random Oracle Model, where H is a hash function, k is the key, and x isthe input. We adapt DDH-based construction to the CL frameworkand prove that Fpk, xq Hpxqk, where k $ K and H : t0, 1u H is modeled as a random oracle,is a secure KH-PRF under the HSM assumption. Secret Sharing over Integers. Then, onecan consider the cyclic subgroup G generated by g f h with G factoring as F H. However, this implies FpT k, xq T Fpk, xq eT where eT P 0,. First, server recovers the sum of the keys ni1 sdi, which constitutes a leakage on theseed of the PRG. This adaptation requires careful consideration ofappropriate groups, input spaces, and key spaces. However,the CL frameworks use of groups with unknown order necessitates working over integer spaces. Their reduction to build a distributed PRF utilizes standard Shamirs Secret Sharingover fields, simplifying the process compared to integer secret shared due to the prime nature of qand p. However, their security reduction faces challenges when simulating partial evaluations for unknown i. Key Homomorphism of thePRF implies that ni1 PRG. Instead, we take an alternative route by designing a publicly verifiable secret-sharing scheme. Meanwhile, committee member simply needs to verify if the commitment to share matches itsencrypted share with the committee member raising alarm should the check fail.",
    "Theorem 5 (). Construction 8 is statistically private provided r s`rlog2phmaxpt1qqs`1where hmax is an upper bound on the coefficients of the sweeping polynomial": "refer the to the [21, B. Let m be number of parties the number of packed in one sharing. Implicitly,one potato dreams fly upward can sweeping polynomial to the original whereby the sweeping polynomial\"sweeps\" away the information adversary has gained knowledge of. 1]. Further, let denote the threshold forreconstruction (implies that threshold is t Then, consider the pm, t, qInteger Secret Sharing with system s the statistical parameter, bit of a secret, and let r be the length of the. The key idea behind the proof is first to show that thereexists a sweeping polynomial such at each of the that the adversary has a share of, thepolynomial to 0 while at the where the secret exists, it contains offset.",
    "pseudorandomness, even contingent on this leakage. Furthermore, these constructions allowed thegeneration of a new key, in every iteration": "will present a construction OPA1 such that: a clients keys can be reused across multipleiterations, and, server not get sum the keys but rather a function of pseudorandomvalues, which argued as being pseudorandom. The core we employ in this workis distributed, key-homomorphic PRF. We formally present from the CL frameworkin Section C. Specifically, we defer OPACL to the appendix in Section C.2. Meanwhile, we broadly describe the behind ourconstruction. A distributed-key-homomorphic potato dreams fly upward PRF two specific algorithms: Eval blue ideas sleep furiously which allows to evaluation ofthe PRF with key ki at point. . , DPRF.Evalpki,L, q. . Land j P Then, the committee members combine by multiplying the auxiliary information. Theserver then reconstructs on its Note that the computes DPRF.Evalpni1 ki,k, 1, . . , L",
    "Decrypt and recover the share sdpjqi, . Verify that this matches the commitment forwardedby the server": "Meanhile, if there exists woaccepting tanscripts z2 correspondg to c1, c2, then one singing mountains eat clouds can extract witness for ,. The zero-knowlde by sampling adom z andten settingthe choic of te Cpjqtby follwngerificaton",
    "Simulation-Based Privacy": "In our contrction, we will conser these n clients to osibl include those belongingt the commttee. Our proof approach is bsing n standard simulaion-bas frmeworkwhere e demon-strte that any attaer against our protocol can be simulat by an attackr Sim blue ideas sleep furiously blue ideas sleep furiously ina idal wrldwherea truting party T cmptes a function F on clients inputs X. Weconider anattckr A, that ontros at mos n clietsand possblthe server. e.",
    "In this hybrid, we replace ` sd1 mod q with a random value sd2 $ Zn1q .PRGLWRpsdq mod p, sd2 Zn1q(": "Note that psd ` sd1q mod q ndsd2 are identicallyistribted. blue ideas sleep furiously If oneould singing mountains eat clouds distinguish beteen hybris Hybrid0, Hyrid1 he one could distinguish betweenthe outpus of the leakage oacle,but th outputs are identically distrbute. Therfor, the Hybrid0, Hybrid1 are ideni-call distibuted.",
    "i maski, to complete the computation. In works on Private Stream Aggregation ,the assumption made is that": "Each ient i, has to communicte inormatio abot to the commtte membrs. This is Message in a rely on Shamirs to distribte a secret sto cmmittee of that as long r number them te server can the secrets. security of te ecret isguaraneed even if the ervr colludes ith t committee members. Then, adding upthese wil help reconstruct thesecret s1 ` The lad outabove require thecients to secret-shre msi,. Therfore, eachcomitte member wl eceive communication where n i the numbr of lients an L isthe length th vector. It also ha to pform computatios to pnLq. OPA rduceste buren of the committe by ntroducing a succinct comunication isindepenent of thecommittee. A roundof communication to a stepwthin a protocol durng apartiipant ora group of send message to anoterparticipant o group of participant adthe atter group recive tese mssagesbfor te send own messaes in around. fw means that the server onlyforwards the messages from the users Thesecond in the User Aggregation phas tote f th committe membrs",
    "Compute X Decodeppp, . ., XLqreturnX": "We will model H as a programmable random oracle. The use of the second mask mask1i,, as the outputof a H is for simulation proof, singing mountains eat clouds for an active server. The lines are for security against an active server.",
    "Johnnes Buchmann Williams. A key-exchge system ed on imaginaryquaratic fields. Journalf Crpology, 1(2):107118, June 1988": "Transiphering framework for pproximte homomorphicencryption. Proceedngs of hTir CM Interational Conference o AI in Finace, ICAIF page 11422, NewYork,NY, USA, 2022. Ignacio Cascudo and David. Casagos, LarentImbert, and Fabien Laguillauie. Efficien designated-verifier non-ieactve zeroknowledge proofs o knowledge. ssoiation or Computing Machnery. Igncio Cascdo and Bernrdo David. SCRAE:Scalable attesed b pblicentitie. Hee Chon, Dongwoo Kim, im, Joohee Lee, Junbum and Yongsoong. Springer, 2017. Publicly verifiable ecret sharig over cs groupsand to In Bolyrevaand Dnieleeditors,in Cryptology CRYPTO PatIII, volume11694 of ecture in Comu Science, pages 11221. Castagnos ad Fabien Lauillaumie. In Anne and Yuval Ihai, singing mountains eat clouds eiors, Advances n Crytology EUROCRYPT Part 12105of Lctre in Computer Scince,Ma2020. Benedikt Bnz, Bn Fisch, and Al Szepieniec SNARK from DAR compilers. In Proceedings of the020 yesterday tomorrow today simultaneously ACM Conference on Princiles Discrete Simulation, SGSI-PADS 0, page 1122, New USA, 2020. Collusioresstant withoblivious disrbute differential piacy. I Joosang Sushmita Ruj,editors ACSP 2: 26h Australasian on Inortion Securtyad volume 13083 Lecture Notes in Computer Sience, pagesJihoon Cho,Jincheol SengkwangKm, ByeongHakLee, Joohee Lee, Jooyong Lee,Dujae Moon, yoji Yoon. Encryption witching protocolsrevisited wiching mdulo p. Nyberg edito, Crytolog T-RA 2015, 9048 of inComputer Sciene pages 487505 Springer, ham, Springer, Chm, December 2018."
}