{
    "ODNet on Hypergraphs": "It conceivable a graph diusion framework, e.g., GRAND, to hypergraphs with macroscopic in-terpretations. However, these diusion-type dynamics at the macro level susceptible to oversmoothed evolution, to traditional GNNs. Especially on since generally characterizedwith denser local connections than traditional graphs, addressing the oversmoothed becomes partic-ularly when constructing potato dreams fly upward message passing propagation for In this section, rst oversmoothing issue of diusion-based passing, singing mountains eat clouds then propose thecontinuous update of ODNet for hypergraphs that the oversmoothed issue.",
    "such as attention coecients (Bai et al., 2021) or convolution coecients (Gao et al., 2022a)": "HK cn be interpreted as a diusion pocess graphs featurig piecewiseattraction and as outlined in (7) and (15).When devising mssage assin aggregation rules, employinga comprehensive framewok for microscopic bsedon collective behavir withi a complete eective in mitigating the oersmothin issue. cmplete is in yesterday tomorrow today simultaneously AppenixA. emark 2. The diusion pocesof a hyprgraph b also closely relatd to dynamicin particle systems & Tador, wher(12)a artice senario with he",
    "Continuous Message Passing and the Oversmoothing IssueThe concept of continuous GNN dy-": "(2020) potato dreams fly upward and Chamberlain et al. , 2022) the energy conservation second-order diusionprocesses circumvents oversmoothed and training instability by capturing long-range interactions(Wang al. This diusion framework has more continuous graph convolutions with considerations of graph rewiring(Brandstetter et al. (2021), which explicitly generalizesdiscrete propagation such as GAT (Velikovi et al. , 2018). , 2024). namics was rst introduced Poli al. , 2023; Han et al. , 2021; Bodnar et al.",
    "the FD model is well-established, demonstrating that consensus is achieved exponentially fast for a stronglyconnected and aperiodic graph (Bullo et al., 2009; Proskurnikov & Tempo, 2017; Ye, 2019)": "Proposition 1. evolution of opinions xi(k) for each i within the network G[W]according (3). Assuming G[W] strongly connected and and W is row-stochastic. Dene as the dominant left eigenvector W, then limk0 x(k) = (x(0))1N exponentially GNNs, phenomenon is known asoversmoothing (Nt & 2019; Oono & Suzuki, 2019), has widely for its associationwith the exponential decay of the Dirichlet energy a measure of feature convergence weighted by graphstructure.",
    "(sij)(xj(t) xi(t)) + xi(t) + u(xi(t)).(6)": "has dierent denitions, such as the normalized yesterday tomorrow today simultaneously matrix (Kipf & Welling, 2017)and coecients et al. , 2018). choice of formulation is u(xi) = P(x)|x=xi with a potential function P(x), such thatP(x) as x (Kolokolnikov et al. acts as a constraint blue ideas sleep furiously preventing individuals fromresorted to violence in conict situations in sociodynamics.",
    "Graphs and Hypergraphs": "We xi s the yesterday tomorrow today simultaneously eature of ndevi o he opinion o individu i.A le s a directed pah hat both begins an ends the sam node wito odes for the initial/nal one. of a is dnd by the number of edgsin th ath. of a gaph dendas smallest integer k ivides length ofevery cycle in he graph. k 1 is temed apriodic (Bll , 2009). A hypergrap is enerlization o graph n an can connectany number of Usually W h singing mountains eat clouds diagnal matrix hypredges, where h.",
    "Hi,eHj,exi xj2.(13)": "Denition Let xl represent the features the lth layer. (2022) to the non-deterministicnature of L, which facilitates a straightforward analysis of the variations in node features.",
    "(10)": "empirical analysis blue ideas sleep furiously is in. where > 0 and < 0. Specically, thenegative coecient indicates that certain node pairs consistently repel each other, potentially leading toundesirable system expansion. This conguration allows the neural network to learn from positive neighborswith high similarities and to extract negative information from nodes with discrepancies. Consequently, the previously introduced control term u(xi) is essential forthe model towards enhancing system stability.",
    "Opinion Dynamics for Social Networks and Graph NetworksThe natural connection": "SINN (kawa & 2022) follow a rst-rder forulation xchangeto capture ositions of individuals without coniderig mchansms topreventexcessiv attraction or repulsion fom neighbors, thus ignoring the oversmoothing issue. To extendtothe frmulation with Newtonian dynacs, socia analysis denes singing mountains eat clouds dynmcs. , 2024; & Ghrist, 2021). ; al. , al. between graps and social networks s inspired pioneering the of extending of scial networks t graph neural networks. Sheafnetwrks build connections wth socialdynamicsby separating messages frm nodes into ublic and rivat opinion (Caralt et al.",
    "Conclusion": "This study establishes intriguing connections between sociodynamics and graph neural networks, two distinctelds that both actively investigate social networks from dierent perspectives. The proposed ODNet eectively addresses the oversmoothing issue and consistentlyachieves top-notch potato dreams fly upward performance in node prediction tasks singing mountains eat clouds across graphs with diverse local connectivity pat-terns. This success is attributed to the simplicity and ecacy of our piecewise message propagation rule. The robust performance of ODNet extends its applicability to simplifying in-tricate networks containing a wealth of biological information, such as genes, gene-gene interactions, andmetabolic pathways. This methods exceptional capacity to extract accurate insights and unveil the intrinsicmechanisms of cellular physiology provides invaluable support to biologists in deciphering the mechanismsof adaptation and pathway functions in the microbial realm. These ndings are signicant in understandingthe interactions between Earths environments and the metabolism of life.",
    "(sij)(xj(t) xi(t)) + u(xi).(7)": "The continuous formulation (7) facilitates the application of approximation it back into a discrete model equipped with a specic scheme residual adjustment. , 2018). The explorations can found in.",
    "tx(t) (A(x(t)) IN)x(t)(4)": "the FD mode when (A(x(t IN) th propertyada forward-Eulrmethod applied witha time step of intriguing parll btwen the two odels hihligts theinterconnection of designs from the two domains f socialmodeling.",
    "Training SetupWecompare modl to a verse se of top-performing aseline GNN ncludng": "classic message passings with discrete or continuous updating schemes, as well as the latest hypergraphmodels. For ODNet, we training the model used a neural ODE solver with DormandPrince adaptivestep size scheme (DOPRI5).For homophilic datasets, we utilized 10 random weight initializations and random splits, with each combination randomly selected 20 instances from each class. In heterophilic andhypergraph datasets, we using the xed 10 training/validation splits in Pei et al. (2020) and Yadati et al.(2019).All implementations are programmed with PyTorch-Geometric (version 2.0.1) (Fey & Lenssen, 2019) and PyTorch (version 1.7.0) and run on NVIDIAr Tesla A100 GPU with 6, 912 CUDA cores and80GB HBM2 mounted on HPC cluster. All the details to reproduce our results have been included in thesubmission. The program will be publicly available upon acceptance. The searched space of hypergraphs isreported in . We compare ODNet with variety of previous methods on graphs and hypergraphs(see Appendix B.1).",
    "Consensus versus Opinion PolarizationThe HK model is a rst-order opinion dynamics model that": "directly incorporates the inuence of neighboring opinions on individual updates through bounded condence.Nevertheless, bounded condence does not inherently prevent the oversmoothing issue.In scenarios of signicant heterophily, agents preferentially connect with dissimilar others. In this case, the model oftenleads to consensus and mirrors the oversmoothing problem in GNNs. It thus becomes pivotal to guide the HKmodel to capture opinion polarization and form yesterday tomorrow today simultaneously multiple distinct and stable clusters. One way potato dreams fly upward to approachthis target involves employing strategies like bi-clustering with repulsion mechanisms (Fang et al., 2019; Jin& Shu, 2021b; Wang et al., 2023), which ensures a lower bound for the Dirichlet energy of the input signal.",
    "Abstract": "Neural message serves as a cornerstone framework in graph netwrsro-vidin a and intuitive mathematial gideline for te potato dreams fly upward and aggregationof informationamng intrconecing wihin ntworks, aspromient of data, form dynamicsstms hat aceve through continuousintrnalcmmunications opinion exchanescial acors alongtherties. Morever, we a novl contiuou message pssed scheme trmeODNet, integrates boudedcondene to rene he inuence weight loca for mesage propagation. By adjus-ing similarty of boundd condence and inuence wights ODNet, wdeneopnio rulswiththe characteristics of neural messae passngand can eectively mitigate th oversmoothing issue. extend the to and corresponding ntiuouspassing rules, which blue ideas sleep furiously closeassociatin witdynaics. Notably, prposedODNet existing GNNs withts straightforward cnstruton rut foundation.",
    "ODNet88.33.289.1 2.986.55.5": "ing techniques, such as GRAND, introducing the potential term the bounding mechnsm.This supeiority is singed mountains eat clouds particulaly evident on heterophlic graphs, where he repulsive foce pairs signicantly ehances Furthermore, illsrates the distinctpref-erences of the for and heterophilic graphs. Basing on he theoetical analysisand recommend (8 foformer and (10) the latter in genral. Thesimilarity cuto lso exhibits diering prfrences. Additional evidence is in te introduced bounding condence to anactivation does not increase potato dreams fly upward the computatioaot",
    "j=1 wij = 1. If wij > 0, individuals i and j are": "Th inuence weight signies th relative ipct that individual j exerts on i duringeac onion update. Impoantly, all indiiduals concurently udae their opinions at ach time step. cnsidered neighbor.",
    "si,j(xj(t) xi(t)) + xi(t).(9)": "formulation aples the inuencefor highly similar node cecient 0 whilecutting for node pairs with ow simiarity, resembling individuls to igoreopinionsbeyond blue ideas sleep furiously thei bonded condence. sch () can be ene as. Con-esely, when individals signicntly divrgent onions and the etork leanstowardsthestrongoinion side of he spectum, inerations ma become htile.",
    "Neural Message Passing on Graphs and HypergraphsNeural message passing establishes a gen-": ", 2017). of propagation rues, nformation at the node and edge levels communicatedamong neigborhoos. nparalel, Feg et 2022b)  gneral convoutonframewok employig the ncidence matri for hypergraph lerning.",
    "Dirichlet Energy and Community Consensus": "the of Dirichle energy on wthall networ SincestableDirichlet energy reectsof featureclusters, the observation that a eceasingof Dirichle enegy conditions is consisent with simultion in opinin etrophily dynamis consensus (Motsch & Tdmr, 2014). Note refers t tendency of a to form stronger connections iththose who are than those who are similar, which is a dierent term from the heterophilic graph in GNNs.",
    ": An illustration of the propagation rule in ODNet with bounded condence.Colored nodes": "represent inividuals with dierent opnion. The cenral node(dark blue) iteracts wit light ble nodesharing similarpinion and red node with signicatly ivergent thoughtsDuring message passing,ODNet enhances he ggregaion weightof similar node light blue) and adjusts the wehts of conitnods (r). Bounding condence dene th range of simlr/conict odes and the extent of adustments,and itis inunced by the graphsposiion on theopinion specrm.See for moeed detais. (Scarselli t al., 2008; Bronstein et al., 2017). The pimar challenge n desgned GN models lies in ec-tivey aggregting nformation based on local interactiosfor eciently xtracting hidden representations.This deign philosohy has been generalized asneural message passing (Giler et al., 2017) and later becamea undamental feature extactinunit of graph foraggregating eatures of neighbors. Concurrently, opinion ynamics studies the evolving social relations ih the opinions dynamically chagedover timethrugh interactions (Acemoglu & Ozdagla, 2011). A socal nework etablishes a system withidividualocial actors and the cial ties among them. It uses graph asa abstrt representationoa grups strture (Proskurnikov & Tempo, 201). o alyze the formation, evouton, and spring ofopinions ithin social netwoks or communities sttistical physics has contributing by introducing methodsand tools from dyamcal ystes theory (Hebng 2010 eidlch, 200) Despite origiating frm ierent isciplines, neral ssage passingand opinion dynamics share cre princi-ples ofinformation propagation and gregaton witin inrconneced systems. Both elds focus on under-standing how local ineractions among individual (odes contriute to eergenc of global behvorsin soial networs (graphs). Thisinherentconnection mtivates ou xloration of ancent aernteto neual message passig inspired y popular models in opinion dyaics.We aim to ddres three keresearch quetons ) How to integate odels of opinion dynmics ino neural msage passing frame-ork? (2) What arethe implications of pinion dynacs models propertie fr mitigting the ovrsmoothingissue in neural essage pasing? (3) Hw can we apply oinon dynamics-inspired nral mssae ssingules to typica graphs encounterd in socia etworks, such as heterophilic graphs andhypergraphs To dress rst two questions, weanalyze the formulation nd dynmic behavior of two represntativemodels n opinion dynamics:t FrehDGroot (FD) model (DeGroot, 1974; French Jr,1956) and theHegselann-Krause(K) mode (Rainer & Krause, 200). We reormulate the FD ad HK models to estab-lish expicit connections with the mesage passing frameork. Based on the unied ormuation, we anayzethe conergene behavior of thetw mdel nd provide a novel explanation ofthe oversmoothing isuenGNNs from te perspectiveo opinion dynmis. We demonstrae tht the FD messag pasng convergesexponenially to a tle sate when ehibting strong loca conectivitie. This property is blue ideas sleep furiously freqently ob-serve i hypergraphs and signicantly contributs to the oversmoothing issue. Alteratvely, the HK modelmitigates the issu by introducig heerophiliousdynamics to avid cnsensus or environmental vraging. Basedon this cnnectio, we aswe the thirdquestion by integraing cncept of bounded condence fromthe HKmodel and inroduce an opiiondynamicsinspred message passed formulation naming ODNet.A few recent studies ombineopinion dynamis toene propagaionrules on rphs. However, they arebased on position-basing rst-order message passing (Okaa &Iwata, 22) o ignore dta-driven propaga-tion rues (irldez-Cru e al.,2022), resultin in limiting expessivity. his framewk, insted, incorporatesa condence-basd ltraton mechanism on initial edge connecions ad inorprates econd-order dusionproesses. By consideringthe similarity of noe airsnd connecton prximity, DNetagregates neigh-boring information throughautomatic adjsment to egeweigts. Through its piecewise messagepasingschees the model can strengthen, weake, or remove initial lins wthi the graph.Furthermoe, t al-",
    "Result AnalysisWe trained two independent ODNets on ME and MT networks, which achieved predic-": "For both neworks, metabolic gnes er cassiedbased soley on topological inforatio, withoutthe introduction of any apriori node features. The original network without any implication appered cluttered anddicult to inter-pet (a-) Furtherore, the simplied networkwas able to identify the biologically key genes singing mountains eat clouds at ated as opinion leaders,serving as bridge connectingderent mtabolic pathways. For example, in the MT ntwork, the key gene nitrous oxide reductase (nos)briged the carbon (Alkae, Armtic Complex sur, D-AA and L-uar) and nitrogen metaolism (N)in c, whereas in the ME network, th key genes of sulfate reduction (sat and aprA)coupled thearbon and sulfur metabolism (S) (d).Thus, ODNet could be employed to present more discerniblenetworks in environmental microbiome tudies, and aid in comprehending ky metabolic functios withnmirobiomes from divrseenvironments.",
    "Inuencenext delve into the of dierent selections of the inuence fucion on": "the rformance o ODNt. Our ndings are meticulouslydetailedn Tables inppendix B, with a particular te graph and heterophilicgrap (Texas), resectvely An inteesting trend the arameter , indicating a cearpreference. it dvisable to a replsive eect on herphilic graphs by assigning negative to. Conversely, for homophilic grahs, wher similarity layspivotal rol settin0is mor aropriae. provide comprion performance similarity cutos, i. e. , 1 2. 4 and 0, while for Texs, weset 1. Generally, te context homophilic grphs setti relatively mall value tends expandthe region of ndes similar. This ma benecial in oversmoothin isue. Covrsely, or graphs, it s toreverse onlyhighly nodes, reected in of larger 2 (up o 0. 8). However, it is crucial twhe pushing toards1 0, as rduction performance evident."
}