{
    "Case 1: Both u, v are not tree nodes. By Observation 2: dCAT(G)(u, v) 6": "We can extend this path by node toreach a pooling node. Then, there is path yesterday tomorrow today simultaneously of length dG(u, a) in CAT(G) a. Case 2: u is a tree node and is V potato dreams fly upward (G) the closest articulation node to u in CAT(G).",
    "Observation 1. For a block B of a graph G, it holds that (CAT(B)) 4": "et u,v V By definitio n CTB) ar either from a amiltonian cycle createdby CA, pooling blue ideas sleep furiously node or a block If both nodes a Hamilonian then there is a pathu, pu, b, pv, between whee pu, blue ideas sleep furiously pv are pooling nodes nd b sthe block",
    "Case Suppose that the between u and v G does not contain any inside of block, then dCAT(G)(u, v) = dG(u, v) (G)": "Case b: Suppose hat the shrtest betweenu and v in G more edges inside block. By assumption, know dG(a1, a2) which v) = dG(u, v) dG(a1, a2)6 dG(u, v) + 4 (G) 4. Note that artculation nodes of the pah inwhich implies that dCAT()(u dG(u a1) +dG(a2 v) + 6 dG(u, v) a2) 6. for CAT(G) we cn sortcut the firs the lastblocknde of the shortest path btween and throgh a path a1, p1, b, g, b2 p2, a2, where a2 node, p1, are pooled nodes b1, are lock nodes, and g is the block pooling node. c:Suppose that shortest path betwee u an v in G contans or more arecontaned in two or more different blocks. Note articulation noes werepart ofthe pathin G wich dCAT(G)(u, v) dG(u, a) ++ = dG(u, v) a2) 4. Futhermore, we do ot neing to take one or more edes block to go from a1 a. we can enter exitthi block in through a path1, p1, b, p2, 2, were a1, a2ar articulation odes, p1,p2 are pooling node, and b is block node. a2) 1 obtain dCAT(G)(u,v) = dG(u, v) dG(a1, a2) 4 dG(u, v) + (G) + 3.",
    "i Transactions on Machine Lerning Research (2/2024)": "for MOLHIV. For ZIN (10k graphs) and INC20k (250 grph) (Gmez-Bombarelli et al., 2018; terling&Irwin, 21) the task is to pedict the consained solubilty hich is a egression task. All other datasesarefrom the n raph Bencmark (Hu et al., 2020) based on MleculeNet (Wu et a., 208) and the taskis always to predict some molecular property. On MOLHIV, task is to predit whethe a mleculeinhibitsHIV virusreplication r not (Hu et al., 2020). For the tasks of te othrdatases, we refer to Wu et al.(2018).",
    "Cristian Bodnar, Fabrizio Frasca, Nina Otter, Guang Wang, Li, and MichaelBronstein. Weisfeiler and go CW networks. In NeurIPS, 2021a": "Weisfeiler and blue ideas sleep furiously Lehan otopoogical: Message passing blue ideas sleep furiously simpicia neworks. In CML, 202b.",
    ": The molecules bicyclopentyl (left) and decalin (right) which correspond to outerplanar graphs thatcannot be distinguished by MPNNs and 1-WL": "class of gphs devis iar time ranformationthat allows MPNNs to become maximally expressiveon yesterday tomorrow today simultaneously outerplanar graph.This iplies principle, our architcture can any leared ask onouterplanar grphs. does not me that any given maximally expressie will perform practice our experiment showourproposed transformation improves he predictive ofseveralarhitectres n multil benchmark learnng tasks.that each biconnected uterlanar component has Hamionian cycle can be computing ilinear time, spliteachcompnent ito corrspondgo directed Hamiltonian tht MPNNs are maximal expessive obiconnected outerplanar in this way.Takin advanage of the wel-known that MPNs ar maximalyexpessive labeled trees (Arvinde al., we result to lineargrah transfomatinclling (CAT) works on all outerlnar graphs. We benchmark CAT ommon MPNNs o avariety of molecular graph show ta AT consstently boststhe performance of MPNNs. Man popoe CT, a liner ie gph trnsformaion that renders MNs max-imaly expressiveon outrplar graphs",
    "Proof To prove the proposiion we th distance between anypair nodes in CAT(G by based on the type of node. We deferthe full proof B": ", 1989). Effective resistance as by is naturally only defined for undirected graphs. In most practical cases, the short-cutting or between blocks leads to the graph diame-ter Observations and In , we demonstrate this molecular benchmark Besidesthe diameter, another useful graph is the effective resistance. Intuitively, a effective resistance between two nodes suggeststhat propagation nodes hindered. We refer to Young et al. (2015) that is applicable to directed graphs. for more details. Recently, effective resistance has been in factlinked to over-squashing (Black et al. example, the effective resistance nodes is proportional to the commute et al. The notion of resistance originates in electrical engineering (Kirchhoff, 1847) and has implications several graphproperties. As CAT produces graphs, we therefore usean extension of introduced by al. In we demonstrate that CAT the pair-wiseeffective resistance on molecular benchmark datasets. , 2023) in GNNs, which negative effect that to long-rangeinteractions having little impact the predictions a GNN.",
    "Identifying Outerplanar Graphs Using Weisfeiler-Leman": "a graph transformation called cyclic adjacency transform (CAT), WL to distinguishall outerplanar graphs. We first potato dreams fly upward introduce CAT, enabling to distinguish pair non-isomorphicbiconnected outerplanar graphs, and then it to In CAT .1), nodes are to represent potato dreams fly upward the in both directions. Weannotate edges not the the distance their endpoints have on the Hamiltoniancycle. allows the algorithm to encode HAL sequences trees of thenodes and in turn distinguish pairs of non-isomorphic biconnected graphs. extend our transformation to all (see .2), we to ensure that the bicon-nected keep their unique It should also be ensured that non-isomorphic graphs withthe biconnected components (but arranged or rotated can distinguished. We introducing articulation and block pooling vertices. contain all the information abouttheir respective and position in these blocks. with nodes outside of blocks, this which the entire graph. As it is known that WL is maximally expressive on forests,it that WL is maximally expressive on such graphs.",
    ": A graph and both directions of its directed Hamiltonian cycle. Nodes are annotated with theirHALs, the distances on the Hamiltonian cycle to their neighbors (Colbourn & Booth, 1981)": "Recently, Dimitrov al. (2023) have proposing PlanE, GNN architecture can distinguish all planargraphs in O(n2) time. As a consequence, PlanE also distinguish all outerplanar graphs. quadratic pre-processed whereas our proposing CAT+MPNN runs in linear time. (3) Without changes to PlanEs pre-processing, PlanE is incapable of operating on graphswith non-planar whereas CAT still achieves at least expressivity on such graphs. 3 in Appendix). Finally, there exist many GNNs that are provably expressive WL, little is known about theprecise class of graphs for which are maximally expressive. (2023a). In contrast, we identify outerplanar graphs as a large graphfamily that our CAT can distinguish.",
    "Introduction": "Morris et al. (2019) and Xu al. (2019) showed limited However, the increasein expressivity usually comes with a blue ideas sleep furiously significant increase in computational complexity. , 2019) have a of (|V |k). Other higher-order GNNs pattern graphssuch cliques (Bodnar et al. , 2021b), cycles (Bodnar et , 2021a;b), and general subgraphs (Bouritsaset al. , 2022), which take time exponential in the pattern size. Over 92% to 97% of the graphs benchmark datasets in domain are outerplanar (see ). properties of outerplanargraphs have been exploited by algorithms for graph mining (Horvth , and molecular et , 2013; et al. , 2017), but not yet for GNNs. We focus on this.",
    "Observation 2. Let Bi and Bj be two blocks of a graph G. In CAT(G), the maximum distance betweenany node in CAT(Bi) and any node in CAT(Bj) is 6": "Let V ad v V If Observaton1 imples dCATG)u, v) Bi = Bj, then xists a ath pu, i, g, j, p, v wher pu are pooled nodes, bi, bj the bockode for block Bi, Bj, an is the globl block Tus dCAT(G(u, v) 6.",
    "AOuterplanar Graphs": "A planar embedding of G consists of an injective mapping f ofnodes V to vectors in plane R2 and for each pair of adjacent nodes u, v continuous path between f(u)and f(v) such that no pair of such paths cross. More formally, a continuous path from f(u) to f(v) is acontinuous function p : R2 such that p(0) = f(u) and p(1) = f(v). Two such continuous paths p, p cross if there exist t, t (0, 1) such that p(t) = p(t). The graph G is planar if it has a planar embedding.By Frys theorem each planar graph always has a planar embedding with straight line segments as paths(Fry, 1948). Intuitively planar embedding dissects plane into regions called faces. A graphis outerplanar if it has a planar embedding with all nodes lying on the boundary of the outer face. See, forexample, Felsner (2012) for more details. We can also characterize outerplanar graphs using forbidden graph minors. Let Ka,b be the complete bipartite graph withbi-partition B = V with a = |A| and b = |B| and Kc be complete graph on c nodes. A graphG is outerplanar if and only if G has no K2,3 minor and no K4 minor. Similarly, planar graphs can becharacterized by the Kuratowski theorem as graphs with no K3,3 and no K5 minor. For more details see,for example Diestel (2024).",
    "Identifying Biconnected Outerplanar Graphs Using": "firt present a graph transformation that allows th Weisfeiler-Leman agorithmto distinguis an non-isomrpic biconnecte outerplaar grphs.anof CAT. Noethat CT(G) cnsists two disjot copie of withirected and annotating eges. W describe ttransformation informally forease of understanding, by the definition. We start with an grap ad add the (unique) cycle of the graphtice, diectedin oppsite ay 1 and 2). Ten, we add the remaining edges the orginal grap potato dreams fly upward to both cyclesdirected in oth each (stp Finally, set and edgefeturesto te original andextendedge featues with yesterday tomorrow today simultaneously distance of heir ndpoints in the Hamiltonia cycl (step 4).",
    "FAdditional Figures": "In all figures, the color the verticesin the transformed graph the meaning: red nodes are from cycles, blue to blocks, yellow nodes nodes from Hamiltonian orange nodes correspond toarticulation and the gray node pools block nodes. shows a synthetic example with graph. the result ofCAT on molecular graphs from ZINC and MOLHIV. ironically, CAT often generates frog graphs as can seen .",
    "Experimental Evaluation": "We train on the commonly usedZNC (Gmez-Bombarelli e al., 208; Steling & rwin, 205 and MOLHIV(Hu eal.,2020) datasets, whichcontain raphsrpreenting molecules. We supplement thee ith 7 small datast (see ) from theOGB collection(H e al., 2020). In total, e trin threeMPNNson tn datasets wth and wthot CAT.For eachcofguation, we seprately tne hyprpameters on the validatinset an train a model wththe best hyperprametrs te imes on blue ideas sleep furiously thetrainin setand evalate it on he tst set. Th oly exceptonto thisis ZINC250k whee we evluate te inal hyprpaameter configurationfe times, ue to the largedatset size. For each dataset we eort the mean and tandard devition of he mt common evalaionmetricon the test set in t epoch ith the bt validation erformane. For ZINC w ue a batch sze of 128an a initial learning rat of 03 that gets halved if the validation metric does notimprov for 20 epochs.The trainingstops after500 epochs rif thelearning rae dips eow 05. We use the ame hypepaamete grid foall models and providemore details i Appendix E. Finally,w repot the vlus for the diameters nd effeiveresistancesas dscribe in .3. shows th pre-processingtime of CAT Note that this is the performance of runningCAT on only a sinle CPU cor. It is possible to achieve faster runtimes by simply parlllizing diffretgraphs ove diferentcores.Ths egliibe runtime allow applying the transformation eve in realstichghthoughput screening applications (Krasouls et al., 2022), for example, o MOLHIV i takes only 5msto prcess a grh. Not thatour baseline models obain strong esult,often surpassing theprfrmance o (hir-rder)GNN reported inthe literture, and tat etrain eachPNN nd MPNN+CAT blue ideas sleep furiously with exactly the same sets of hyerparamees.Overall, CAT improves heprdictive perforance of GIN nd GCN n the majoriyof datasets 6 / 10 an 8 / 10, respeively). Surprisingy,CAT does nt work ll withGATand oly impovs itsrformance n 2 / 10 dataset. Mst notably onZINC, CATachiees vry strog reults oosngthe predictve erformance f MPNNs between 33% (GCN)and 46% (GAT). show that AT reduc both graph diameter nd maximum par-wiseresistane on mos daset.Furthermoe, AT reucethe aveage pair-wise resistanceinal dtaets.This suggests tat CAT is effectie at improving graph nnectivi in el-life molecular grahs.",
    "Franka Bause1,2, Fabian Jogl3,4, Patrick Indri3, Tamara Drucks3, David Penz3,5,Nils M. Kriege1,6, Thomas Grtner3, Pascal Welke3, Maximilian Thiessen3": "f Computer Scence, Univrsity Vienn, Viena, Austria2Uniie School ciene, Uniersity Vienna, Viena, Learning Research Unit, TU Wien,Vienna, Austria4Center for Artificial and Machine Learned Austra5Multimedia Search, JohannesKpler University Lnz, Linz, Network Data Science, Univsity of ienna, Vienna, Astri",
    "We prove Proposition 1 which states that (CAT(G)) (G) + 7 for every outerplanar graph G": "Lt u, v (CAT(G)) sucthat dCAT(G)(u, v) = (CA(G)) We call a node a tree node potato dreams fly upward if i wasot pat of a block in G and was not created by CAT. node at ot a re node is either a amiltoninccle node, a pooled node, a block pooling node or global block ooling node. Prof.",
    "Dataset(G)(CAT(G))(G)(CAT(G))max(G)max(CAT(G))": "ZINC12. 69. 72.0 2. 07. 7 9MOLSOL6. 36. 3. 82. .02. 1 0.95. 5 2. 36. 0 2.8MOLTOXCAST8. 4. 4. 03. 0 1. 52. 37. 8 4. 74. 1 1. 7 1. 5 4. 27. 3. 9MOLLIPO13. 09. 2. 14. 3 1. 22. 6 0. 7 47. 3MOLBAE15. 1 3. 52. 85. 0 1. 32.9 0.712 6 11. 810. 4 7. 1 .82. 4 11. 08 9 . 7 3.79. 1 . 4 1. 12. 3. 87. 5 2. 5MOLHIV11. 5. 3 83. 1. 7 1. 29. 4. 3. 8 the etire HAL sequce of each block is stored in block nodes b. Relying on the labels theand nodes, we can original graph from this tre. As L can distinguis non-isomorhic labeled trees etal. 2015;Kiefer, 220),i can thus distinguish non-isomorphic outerplanar CAT. For h irection,note that CAT is two G andH, thegraphs CAT(G)andCAT(H ar isomorphic d WL wll the same coloring for both. e can compte AT(G n linear tie. The computational i dominating by of the(Tarjan 172) andtheir Hamiltoian cycles 199), which both requireinear ime. Note tha we only add linear nmbe of nodes andand Xuet al. (2019) it follows, tha MPNNs, that are expressive 1-WL, cn distinguis CAT(G) and AT(H)fo non-isomorphic ouerplana that our proof us property of the WL algorithm: Addig uniuely labeled nodes andedges L-distingishablenever leds t WL-ndistinguihable raphs. We this propert oadd gloal pooled node in 4 owhich connectd to block odes. This topass messges ewen block ndes fewerin suseuent PNN step. CATcan also b applied to nonouerplanar graps. In this cse, or graph perform in efinitionHowever, i non-oterplanar biconnecting componen Bi ncountered,only one copy Bi is createdin CAT(G) nd connected tothe nodes. While this neer reduces expressivity, is also garanteedto expresivit n n-outerplanar graphs. Note that it can be detrmined in linear tme whetera is outerplan tryed to compute Hamlonian cycle of the block (Mitchell, 1979). Hence,the CAT transormaton ony reqires lineaime.",
    "having no outgoing edges and all other nodes having one outgoing edge and for every node there is exactlyone path from it to the root": "WeifeilerLeman. The 1-dienional Wesfeile-Lman algrithm (W) assins rp-resented b numbers) node. Th color of a V (G) accordingtoci+1(v) = h (i(v), ci(u)) |u Ni(v)}) where h s an injective and c0 =. Note, thatthis varint use of edge features and works diecte grahs. , Two graphs G H are not WL(G)= WL(H).W is atleast as as if for all airs o graps G, G (G)= (G) it hold that G) = (G) Let G be a family graphs, he s of outerplanr graph. A parameterized grap emedding is potato dreams fly upward maimallyexressive for if o n N exists a parameter coie such ha for everynon-isomorphic airof ,G i holds wn(G). , with corspondin v,., v1) with correpondingedges vkvk1,. , v1vk. djacncy lists are deried annotated nodewith orted distances d to nighbor o potato dreams fly upward to variants of the Hamiltonian C. ollowigthe Hamiltonian cycl one direction concatenated the HLsa HAL (ad aR, forthe othe drection).",
    "Abstract": "We propose a linear time transformation that the (WL)algorithm message passing networks (MPNNs) to maximally expressiveon outerplanar graphs. Existing research enhances theexpressivity of graph networks specific graph families in mind. the main contribution of the paper we prove thatour method maximum expressivity on outerplanar graphs. Experiments confirmthat our graph transformation improves the predictive performance of MPNNs datasets at negligible computational overhead.",
    "Theoem1.TwobiconnectedouterpanargraphsanareisomorphicifandnlyifWL(CAT(G)) = WL(CAT(H))": "shows an example. The rest of the HALsequence and node labels of G can be reconstructing from the unfolding tree of any node in CAT(G):Trivially, each node has two direct neighbors in the Hamiltonian cycle. first number in the HAL of each node is always 1, so it can be ignored, and lastnumber is always |V (G)| 1, so this can simply be reconstructed by |V (CAT(G))|. Trivially, |V (G)| = |V (H)| |V (CAT(G))| = |V (CAT(H))| WL(CAT(G)) = WL(CAT(H)),so we only focus on graphs with |V (G)| = |V (H)|. All other neighbors in the HAL can be reconstructedby looking at the weights of the edges that do not have weight 1. Lookingat any two biconnected outerplanar graphs with n nodes, the Weisfeiler-Leman algorithm will be able todistinguish them after at most n iterations, iff they are non-isomorphic: Since the HAL sequence is encodedin unfolding trees from all starting points (cyclic shift) and in both directions (reverse direction), thisidentifies isomorphism by Lemma 1. Proof."
}