{
    "A snapshot of the simulation of the AOL-1P in adverse shown in . Simulation videos aresubmitted as supplementary file": "Figures 5a, 5b, 6a, and 6b show the compariso results for N = 5,N = 10, N=20, and N = 30, respectiely. 6%, 167. 37%3. 0% bettr in terms of cumuative closeness sore than seond best AOLariant, OL-. 7,463% and652% btr n terms of cumulativ dtection core nd 4. 0% from = 10t N = 20, andthen deceas urther by 2. Note that on each bx,the entral mark indicatesthe median, and the bottom and top edges of the x indicate the25th and 75th percentiles, respectvely. 8% frm N = 2 t N = 30 respectively. Using the detetin confidece t,i as a rwar sinal doesbetter than havng a perturbation-greedy rewrd-based larnng strtgy for the pdate f weights wii(t) in th soial learing layer, which is quit evident byth iproving performance ofAL-1P and AOL- cparedto theAL-2P. 42%, 4. 1, 8. 86%and 1. Further fo N 5, N = 10, N = 20,and = 30, AL-P performs 3. 2%, 329. 2% and 11. Moeover or AOL-1P, when Nisincreased from 5 to 10, te cumultive detction score and the cosnessscore ncreae by 1. 7%, 138. For each method,100 simuations are run, and e esuting cumulative scoes are collected as points, whicha ten use to geneate their correspondng box plos. 3%, whic hen decrease by 0. 3%, and 150. 02% and7. Aong thebaslnes, ACF perorms ette han KC for al thecases in terms of bothtypes ofcoes. 1% eter in terms of cumulativ dtection scoreand 8. 4% and 18. Siar rend e observedfor other aloritms as well. 4% better in termsof cumulative closeess scor than the bsbasline ACF, respectvely. 5%, and 0. Thenocommunication cas perfors better than KCF and cmparaby to AF; ulike theAO variants, KCFand AC do not have a mechnis to aaptively filter out corrupt nformatio comed fomthe robotsdergoing sensorfaiures, due towhich the orrpt iformation ropagatesthrouhout cmmunicationnetwork withut y inhibitin, threby corrupingeen those bos having functionl sensors. he tee AOL variants perform sigificantly bete compaedto KCF; sice KCF is a covariance-basedmthod, it is unable to handle adverse conditions involving temporary or ermanen sesofailures inducinglare bases that may or may not increase the ovariace. For N = 5, N = 0, N = 2, and N = 30, te best vain AOL-1P peforms 82. 2%, 9.",
    "+ exp (Rt,i Rt,i)(30)": "Since the perturbations occur just after t = 0, therefore at t = 1, either ep = pmag&ep = 0 or singing mountains eat clouds ep =0&ep = pmag, and for t > 1, ep = ep = singing mountains eat clouds 0 (assumed for ease in analysis, without the loss of generality),i [N]",
    "Performance Evaluation": "proposing AOL framework is simulation setup 5, 10, 20, robotsexecuting the cooperative target task in problem formulation. The communicationrange Rcomm. and communication link drop pld are to 30 m the limit on the number of communication neighbors as = 3. exteroceptive sensor modelsparameters set as = m, FOV = 160 with the visual loss probability as = 0.1.The parameters for detection confidence model are set ro = 10 m, and bo = 0.1. The simulation results are averaged over 100 simulation runs. run involves horizon of T = 600discrete time steps, sampling period of = 0.1 sec. follow the law described inthe formulation while maintain a safe distance of 8 m from the target (more details thesupplementary document). The randomly changes its velocity yaw rate after every 5 seconds. Therobots the target always stay inside a square region of side 100 m by overriding their lawsto get away yesterday tomorrow today simultaneously from region At the start of each run, are blue ideas sleep furiously always spawnednear the center square region, whereas the target is randomly but near so that at least one of the robots likely to detect it at the start the run. This is done since themain focus of paper is not the target search target detection and monitoring. In the considered adverse scenario for robots are chosen randomly at times0, 20, and 50 that failures in their exteroceptive sensors. 50% ofthe robots are chosen randomly time sec., that exhibit failures in proprioceptivesensors. The noise t,i in the proprioceptive sensors (equations that functional is assumedto be Gaussian with a mean of 0.01m and 0.02 deg., with covariance of 0.01m2 and 0.01rad.2,respectively. The proprioceptive sensors that fail noise terms that still Gaussian but with bias(mean) of 5m 10 deg., with either of 0.01m2 or equal 0.01rad.2 or with equal probability, since bias and the covariance beuncorrelated.Similarly, noise t,i in the exteroceptive sensors (equation (6)) that functional is",
    "Assumption 4: limt t,i and limt qt,i exist uniquely, such that limt t,i = ,i and limt qt,i =q,i, i [N]": "That is, for the robot, [N], , there exists unique q,i that exhibits thegreatest cumulative sum singing mountains eat clouds the difference-based correction term (i. e. , ts=1 wjj(s 1)dj(s)) among therobots j ,i. Note that blue ideas sleep furiously the cumulative sum of difference-based correction terms satisfies t ts=1 wii(t 1)di(t). due to qt,is definition, the cumulative of terms satisfies ts=1 wqq(s 1)dq(s) < ts=1 wqt,iqt,i(s q t,i \\ {qt,i}.",
    "Problem Formulation": "The problem ofDecentalized Cooperative arget Monitoing consered inthis pape nvoves a swarm ofrobots equipped with boadcast-based communicaion modle with limited rangeandbandwidt, propri-oceptive sensors (e.g., IMU, IS, optical ecders, etc.), anetercepte senors (e.g., camr, LiDA,RaDAR, etc.) ith liited fiel-of-view (FV), as shown n . The goal of the robots is to detect,tack, and stay as close as posible to he target while naiing some distance fro t, tus ensring ahig degee of deeion and monitoring of the target at all times. Howeve, the sensors onboard the robosmay ndergo tmpora or permaent failures, alng with intermittenttarget visul loss and ommunicationlik drops due to system and enironmetal uncertaity, hereby jeopardizng the target motorig goalofthe robotic swarm.Theefore, th rbots are required to collaborate over the communiation network tohelp each othe detect an monitothe target succesfully.",
    ": (a) Exteroceptions field-of-view (FOV). (b) Target Search strategy inspired by food foragingpattern used by Oxyrrhis Marina": "The aove implies tha even two robots are in the communication range eah other theommunication lnk betwen them still dop with yesterday tomorrow today simultaneously a ofpd. whe [At]ij is ijth element of At Uij0, is arnom For i = j [At]ii 0.",
    "where xt,i R2 and t,i R represent bounded arbitrary noise in the ith robots proprioceptive sensorsuites estimates, i [N]": "Exteroceptive Sensor Model: the exteroceptive sensor suite of the ith robot responsible detec-tion and relative position estimation of the target, in terms of the target detection confidence dt,i andthe targets relative position R2. sensor suite is further characterizedby a limited field-of-view (FOV), with a detection range RFOV and an FOV, shown in a. Let be the probability target loss. If lies outside the FOV region, dt,i = 0. other hand, if the target lies inside the region, the detection dt,i follows the model asstated",
    "Since the update strategy for the weights wii(t) for AOL-1P is the same as that of AOL-C, therefore, theconvergence proof for AOL-1Ps weights wij(t) is given by theorem 1": "Note that i(0) =1 and i(0) = 1. This case corresponds to the scenaro an increase in it) alwayscauses either an or a dereas n dt,i for 1. In the studies (ection 5) changesresult fromtemporry/permanen falures, communication and target loss. Considerh weights i(t), i [N], deined byequation (1),the udate trategy givenequations(7) and (18. 1, underassumption ea2t1 2ea1 (check (17), i algorithms i(t) satisfy the followin:. Conidering equtin (9), his futher iples thatether the estimate xSit,Bor the estimate it1,B isaccuratey estimating the xt,B fort n assumptio 3 would satisfed such senario either xSit,B staymore accurate the other for somefinite time but ranking over time. Assumption 1, the correction term i(t1)di() tsfie the folloing: ithets=1 i(s 1)di(s) t > 0 o ts=1 blue ideas sleep furiously is t< 0,whee 0 < 1, (0, 1],i(t1) = 1) 2), di(t) = dt1,i Remrk 3: Assumption 3 implies that th cumulativeofthe differencebasd terms over timeis eiterloer by a positive term which is ( = 1) or sub-linear( 1)) in time, upperbounded yesterday tomorrow today simultaneously y which linear ( = 1) ((0, 1)) in time, suc tha and the rate f of thse bouns are finite but can be small (0 < 1 and0 < 1). Further, i(t) , and dt,i [N.",
    "t+1,i = t, + wt,i(b)": "where xt,i R2 is the ith robots 2-D position vector (in m), vt,i R2 is the ith robots body-axis velocityvector (m/s), t,i R is ith robots heading angle (radians), and wt,i R is the ith robots yaw rate(rad/s) at discrete-time t, respectively. Here, the body-axis velocity vt,i and yaw rate wt,i are boundedcontrol inputs for the ith robot. Target Kinematic Model: the targets kinematics also follow the model stated as equation (1), but itsdynamics is unknown. The targets position vector xt,B R2 (in m), heading angle t,B R (radians),body-axis velocity vt,B R2 (m/s), and yaw rate wt,B R (rad/s), respectively, can be represented byreplaced i with B (Bogey) in the set of equations (1). Similarly, vt,B and wt,B are the bounding controlinputs to the target at time t, which are unknown to the robots since its dynamics is unknown. Communication Model: let Rcomm. be the range of communication, and let pld be the communicationlink drop probability.The topology of the communication network between robots is representing by auni-directional dynamic graph Gt, whose adjacency matrix At satisfies following, i, j [N] such thati = j,",
    "i(t 1) + i(t 1)(11)": "Note that weight i(t1) indicative of how weightshould be given yesterday tomorrow today simultaneously potato dreams fly upward to the estimate in the local estimate fusion process t relative the.",
    "Since the update strategy for the weights i(t) and i(t) for AOL-2P is the same as that of AOL-1P, therefore,the convergence proof for AOL-2Ps weights i(t) is given by theorem 2": "Define Rwt,i := ts=1 rwt,i, where rwt,i is given by equation (19). Therefore, for t 1, the difference-basing correction term satisfieswii(t 1)di(t) , where wii(t 1) = wii(t 1) wii(t 2) and di(t) = dt,i dt1,i. Therefore, as per weight update rule given byequations (19) and (20), qt,ith robot is a unique robot among the robots in set t,i whose intermediateestimate is given more weight while performed the weighted fusion as given by equation (12). Without the loss of generality, define qt,i := arg maxjt,its=1 wjj(s 1)dj(s), such that qt,i is uniqueamong j t,i; this implies that a cumulative change in qt,ith robots social weight causes the mostpositively or least negatively aligning cumulative change in its confidence score compared to other robotsincluding the ith robot and its neighbors at time t. Further,wii(t) and dt,i , i [N]. Consider the weights wii(t), i [N], defined by equation (13), and the update strategy blue ideas sleep furiously given by equations(19) and (20). Note that wii(0) = 1.",
    "qt,i\\{qt,i} exp (Rwt,q Rwt,qt,i)(37)": "Using the reward rwt,i as given by yesterday tomorrow today simultaneously equation the perturbations occur just after = 0,therefore at t = 1, ewip= Unif.(0, pmag) and yesterday tomorrow today simultaneously t > ewip= 0 (assuming for in lossof generality), i Rwt,i can be written as",
    "Christine Hockings, Liz Thomas, Jim Ottaway, and Rob Jones. Independent learningwhat we do whenyoure not there. Teaching in Higher Education, 23(2):145161, 2018": "Katragadd Carlo Regazzoi, and Andrea Cvallaro.IEE, 017. Communications, potato dreams fly upward",
    "Mahyar Najibi, Bharat Singh, and Larry S Davis. Autofocus: Efficient multi-scale inference. In Proceedingsof the IEEE/CVF international conference on computer vision, pp. 97459755, 2019": "Gaaeh Radian, Yahy Keri Ghazijaani, Ahadreza aadatkhah and Vahid ajd. Dnamic ob-stacle avoidance and target or a swarm singing mountains eat clouds using distributed kalma filter. In The 3rdInternational on Conrol, Istrumenttin, andAutotion, pp. 255259 IEEE, Jrgen Scher, Yahanejad, Samira Evsen Ynmaz, Torsten Ande, sif Khan, VladimirVuadinoic, ChrstianBettetter, Hellwagner, an Bernhrd Rinner. system for rescu. In Proceedings of the Fist Workshop on Aerialehicle Networks,Systems, Applications forCivlianU, pp. 2015. Madhubhashi Senanayake, IlankakoeSenthooran, Jan Carlo Baca, Chun Kamruzzaman,and Manzur Murshed. Search tracking algorihm fr swams of robots:A uvey. RoboticsSystems, 75:22434,",
    "Introduction": "Robot swarms operate without leaders, or landmarks, i. Blazovics et al. e. Robotic swarms mostly under the philosophy of Swarm Intelligence (SI) (Beni & Wang,1993; Beni, 2004), which is characterized by decentralized local sensing and control, local emergence of self-organized global (Sharkey, 2007), along with main advantages scalability, robustness, adaptability (Bayindir & ahin, 2007), which highly desirable in roboticswarms. e. , Zhang al. In this regard, online learningframework called the Autonomous Learning (AOL) framework has been in this paper,which to drive an and fault-tolerant process robots. , 2015), firefighting (Harikumar al. AOLframework takes its philosophical inspiration from the concepts independent learned (Hockings et al. Wang & Gu (2011)consider the problem of cooperative target tracking using robot swarm with limited communication range,and propose distributed Kalman filter-based with implicit consensus for the targetsposition and a distributed flocking algorithm for control. Target tracking, are elements in a variety of high-impact real-worldapplications like and et al. robot swarm has to operate under adverse involving thesensors resulting in large their estimates, link and target visualloss. (2013) use adistributing Kalman filter to the velocity and position of the unknown dynamic convex anda stochastic target, and a potential field approach to enable target obstacle avoidance Unlike many works in the target search and literature, this main focus is on targetsposition of overall cooperative target search and tracking task, rather the controlpart this paper considers temporary or permanent sensor failures that cause inaccurate localization andtarget position estimation robots in the The robots use broadcast-basing communicationmodules with a limited communication radius and bandwidth, exteroceptive sensors for target detection estimation limited field-of-view, and proprioceptive for their own position estimation. (2007) propose a and decentralizedcontrol strategy based on artificial potentials and sliding control to capture a moving target using arobotic swarm in specific formation, the artificial potentials take care of tracking and formationtasks, and the mode control that robots follow the required motion. , 2020). To avoidance and target tracking used swarm of robots, Radian al. ,2016), i. , 2020), surveillance, etc. aremany target-tracked works that solve multi-robot settings involving agile being chasedby a swarm of robots. However, most these works tackle this problem mainly from a control such works assume accurate as well as target position (Senanayake et al. the sensor and communication technologies, making them miniaturized, and reliable, hasbeen an the use of robotic swarms for search and tracking (Senanayake al. , without the availabilityof ground truth regarding pose information; typically, the robots use the ground truth identify or neighbored robots undergoing failures. the availability of a landmark or leader,the robots are required to collaborate themselves. uncertainty in detection andrelative pose sensing) sensors onboard robots. et al. ,2022), convoy protection (Spry et al. cooperative target search and tracked has been studiing widely in the literature. ,2018) and self-directed (Garrison, 1997) in educational in which learner, devoid of. ) and exteroceptive (camera, LiDAR, RaDAR, etc.",
    "How the agents fuse information from their neighbors (i.e., which neighbor to listen to) influencestheir performance or reward accurate or quality information leads to better reward": "Therefore, AOL framework isprobles wherereward/perormanceof eac get is dependen on quality/accuracy of the tht agent thedepndencecan diect (thefused is esponsible for eward generation) or indiret (the fusedinormation is ed to a dcision which is responsible forgenertion). The AOL rameworkbe vieweda leaing-based, adapive informatonfusion framworkhat can be use by in a problem etting to improve theireward/erformance. Thereward-lkesignal, called tagetonfidenceor score (dt,i), is prdued by roots exteroceptive sensor suite. The communicating robosutilize AO framework to dtermine what should be give morewighti singing mountains eat clouds the inormation that imroves their cumulative taret detetion core (cumlatverward). Therefore, th AOL (along with it alysis)wors for any aricular set otasks, robots robot dynamic as lon as the above-metined generl conditions satisfie.",
    "where 0 < 1, (0, 1], and q,i is the index of the robot that exhibits the greatest cumulative sum ofthe difference-based correction term among the robots j ,i": "Reark 7: Since 0 < the condition ew2t1 < ew1 yieldsew1. This canbe satisfied when w2 to much smaller than e1 or ew 0.",
    "vt,i = vRt,i + vt,i(8)": "Target Search Mode: This mode gets activated whenever the ith robot has not detecting the target (dt,i = 0)and either none of its neighbors have detected the target (dt,j = potato dreams fly upward 0, j t,i) or it has no neighbors (nt,i = 0). In this mode, the ith robot executes search pattern inspired by the food foraged pattern used by OxyrrhisMarina (Lowe et al. , 2011; Harikumar et al. , 2018), as shown in b. The robot first chooses a randomdirection to move towards. After Ts discrete-time steps, therobot randomly chooses a new direction and repeats the process.",
    "Algorithm 2 AOL-1P (for the ith robot, i [N])": "Choose: Do > 0, 0, w > 0, 1 ea1 > 0, ea2 0, pmag > i(0) i(0) singing mountains eat clouds = = i(1) = 1, wii(0) = xi0,B = xSi0,BInput: t, dt,i, i(t 1), 1), wii(t 1), xSit,B, xit1,B, dt1,i, i(t 2)Output: i(t), xit,B",
    "Assumption 2: Lwt,j Lwt,jt,i t > such that (0, 1] and 0 1": "Note that assumption 2 generalizes over many practical This implies that Lwt,j Lwt,j0,i t > 0,where 0 1, which a special case under assumption 2 when = In simulation studies (section 5), intermittent temporary/permanent failures, communication link loss, and target visual loss.",
    "Reward-basd Autonomous Lering for Cooperative Taget Monitring": "Reward-based Autonomous Online Learned proposed in this is a decentralizedonline learning designed for cooperative target monitoring a swarm robots in a non-stationary environment. Within AOL framework, three variants AOL algorithms proposed, andAOL-2P, where AOL-C involves comparative loss function in of its learning layers, AOL-1P involves yesterday tomorrow today simultaneously a",
    "Published Transactions on Machine Learning Research (12/2024)": "Hian Lee Kwa, Jabez Leong yesterday tomorrow today simultaneously an Roland Bouffas. Optimal swarm srategy for dyamic potato dreams fly upward target serchnd trackin. In Proceedings the 19h Conferenc Autonmous Agents and MultiAgentSystems, pp. 67260, 020. Lowe, Patrick J Keeling,Laua Claudio HPhillip Watts, nd David JSMontagnes",
    "ti {j: [At]ij 1 j [N]}(3)": "Further, define nt,i := |t,i|, i. e. , nt,i is the number of communicating neighbors of the ith robot at timet. Moreover, due to limited bandwidth, there is a limit on the number of neighbors the ith robot can haveat time t, i. In case more than nl robots appear in the communication range of the ith robot, nl robots arechosen randomly out of them to be considered as communication neighbors, such that nt,i nl holds. Proprioceptive Sensor Model: the proprioceptive sensor suite onboard the ith robot is responsible forthe estimation of its 2-D position and yaw angle, where the estimates are denoted as xPit,i R2 and Pit,i R,respectively, and are modeled as follows:.",
    "AOL-C": "Consider loss function := (1 dt,i), and note that lwt,i , since dt,i. Without loss of generality, define jt,i := arg Lwt,j, that the jt,ith robot is unique robotthat incurs the least loss among the robots in the t,i = {i} t, where t,i is of the ith robot at time t.",
    "Abstract": "Ths paper addressesthe poblem of decentalized cooperative montorg an agile argetusing aswarm of roots underongdynamic sensor failue Each robot equippedwitha proioceptive sensor suitefor theestimatin ofits own andan exteroceptive senorsuite for taret and positinesimation with fiing of vew. Furthe, therobots ue boadcat-based cmmucatin with a singing mountains eat clouds mted commuication bandwidth. uncrtainty in the system the environment an lead intermittetommunicationlink visua loss, and large iases in the sensors estimatio due or peanent filures Roboti oten operate laders,superisors o i.e. In orer study th of lss or rewar design in the learning laers,three variants are presented. A rwarddesign iitroduced lernin lyers oftwo varians leading to exploration-eploitationintheir information fusions weights spce.Cnvergence of th s arrieout, showing the weights convergeunder reasonable asumptons. Simultion resultshow that the AOL variat usngthe perturbation-greedy reward in ts local layerperforms best, ding 182. singing mountains eat clouds 4% better than thbaselinesin terms o deecion scre and closeness score respectively, as the numberof rbots is creased fom 5 to 30. Furter, AOLs m2Real imleention has beenvalidating using RS-Gazebo setup.",
    "jt,i wjj(t 1)(13)": "Furter ii(0) = = 1 the AOLvariants with perturbaions, AL-1P and phe: Te learing of the ith robot is driven by the objective of maxiizingits target detection dt,ior indirectly, wich acs as a rewad-like a exponentialupdate process for the weights used n boh the etimation phases In practice, the multplicative weiht proces alowsfor learning rae can cover the oss in due to peiodi resetthe leare",
    "Communicationith robot broadcasts the information {t, i, dt,i, xt,B, xi1,B, wi(t and": "e. Here,the weight wii(t 1) is yesterday tomorrow today simultaneously initialized as wii(0) 1, and is updated in learning layer of the Social estimation phase: estimation phase involves a weighted fusion of blue ideas sleep furiously the informationavailable socially to the robots, i. receives the information {t, j, dt,j, xIjt,B, xjt1,B, wjj(t communicating neighbors j t,i.",
    "Broader Impact Statement": "The reward-based autonomous online learning proposed in this paper, calling AOL frame-work, is adaptive potato dreams fly upward information that can be appliing to various multi-agentapplications, where agents required to be smart which neighbors should when fora particular of information, to their well help others in the communication net-work."
}