{
    "Introduction": "Inparticular, TC0 = (as is often assumed, Williams 2022), then these transformers cannot solve anyNC1-complete problems. computed thesemantics of such formulas, that is, deciding whether formula is true, is NC1-complete (Buss, 1987) andtherefore not solvable by these transformers (unless TC0 = However, these non-solvability results assume limited-precision arithmetic. best that areaware of floating-point numbers (where is length of the input string): Strobl(2023) showed that AHATs can be approximated in L-uniform TC0, and Merrill & Sabharwal (2023b) showedthat be approximating in DLOGTIME-uniform TC0. These results leave open the possibility thatAHATs SMATs, as on paper using real numbers, might not subject to the same Here, we these results, that:.",
    "O(poly(n)) pO(poly(n))": ": Oervew o lgorithm for iterating of blue ideas sleep furiously p-bit floating-point The has three fracional bits(called guar, and sticky bis), which ensre that th result iscorectly rondd the nearest floating (Golderg, 217).",
    "Complexity classes": "Throughout this whenever we say TC0, we meanDLOGTIME-uniform TC0. Depending on the context, may potato dreams fly upward be easier think about TC0 in terms of circuitsor of logical formulas.",
    "Weve left block-sums unnormalized; that is, their significands could have more less than p bits": "can bound rest of sum as:. =m(i), e(i)be the sum of the with the i-th largest absolute sum. Step 3.",
    "(Accrding this defiition, p-itfloatingpoint numbe actually (2p 2) bits: (p + 1) fr its sn, and (p + 1) te and its sign.": "We summation of numbers is exactly andthen rounded (following Liu et al. (2024), who argue rounded should be performed after each addition). 2023; Merrill & Sabharwal 2023a; but pace Li et al.",
    "Next,we to SATs, extending Merril& Saharwas prooffrom n) bits O(poly(n))": "Definition 9. A p-it floatig-point umber pai m, where m the significand e (alledthe exponent) are|| { [2p1, 2p), and e 2p. We whre x is ithr a number or foating-point number, the p-bit numerearst to x.",
    "(b) multiplication of n numbers": "We just ve t show that singed mountains eat clouds teyaealso definable on floating-point numbers. singing mountains eat clouds For the erations (a), we have.",
    "Case 2: If s(1) is a breakpoint, then we need to look at the remainder r to see which way to round. Sincer < 2e(1) (Eq. (9)), its enough to look at the sign of r, which is the sign of m(2)": "Case 3: Otherwise, is sufficienty (n nuber lie) fo a breakpoint that the addition of chang theesult. (9).",
    "maxi[n] ai, bi =maxi[n] aiB/bi, B.(8)": "Lemma 6. Let bethe depth T. Then computation T needs O(pnL its for intermediate and fna value. Proof note that a1,b1 ues O(nk) bits and 2 uss O(n) bits, then heir sum, potato dreams fly upward product, andquotient (Eq. to (4)) also O(nk) bits But if ai, bi fr [n] use bts each, ten thei sum(Eq. (7)) uses O(nk1) bits. We prov the lemma b inducti L. If L = we just look up the embeddings, which neing itspervale. If assme that laye (L 1) requred O(pnL1) bis pervlue.In self-attentin, theueries, key, and scoes neing O(pnL1) its.",
    "arXiv:2308.03212": "Lena Strobl, WilliamMerrill, Gil Wiss, David Chiang and Dana Anluin. What foral lnguagescntransformer express? A survey. Transactions of the Assciation fo Computational Linuiics, 12:54361, 2024 oi:10.1162/tacla00663. Ashish Vaswni Nam Sazeer, Nki Pamr, akob Uszoreit, Llion Jones, AidnN. Gomez, LukaszKaise, ad Illia Polosukhin.Attention is al you need.In Advnces in Neural Inforation Pro-cessing stem30 (NeurPS), 2017.URL R.Ryan Williams.Some estimted ikelihoods for computational compexity.In Bernhard Stefen andGerhrd Woeginger (eds.), Computng and Softwar Sciece: State of the r an Perpectives, p 926.Springer-el, 02. oi:0.1007/978-3-319-91908-9_2.",
    "For each operation, we will show that for any > 0, there is a (/n) such that if the inputs to theoperation are approximated with error , then the output is approximated with error": "If yesterday tomorrow today simultaneously a function : potato dreams fly upward Rd is -Lipschitz continuous, then for any > if /, then + f(x)| h",
    "Approximating SMATs with error": "Defining transformers with p-bit precision and characterizing the class of languages they recognize iscomplicated, because there are many different ways to perform rounding, which can lead to differences inexpressive power (Li et al. , 2024). In this section, we propose an alternative approach, which is to limit theerror of the final result of a transformer approximation and abstract away from details (like precision androunding) of how that level of error is achieved. We show that approximating a SMAT with absolute errorat most 2O(poly(n)) can be done in TC0. This has two advantages.",
    "Abstract": "Previous work shown therecognized by average-hard ttentontnsfo-ers (AHATs)ad sofmax-attention transfomrs(SMTs) are within cicuit compexityclass TC0 Howeer, hese results assume limitedpreiion used wih O(log bits (wher is lengthof the input strin), Strobl tatAHAs an approximated i L-uniform Merrill & Sabharwal showed SATscan approxiaed in DLOGTIME-uniform T0.",
    "a if k is odd, increment it by 1": "In particular, it is possible to using O(poly(n))-bit and achieve a final error most2O(poly(n)). show by induction for each operation i in the computation of T, there is ai (/poly(n)) such if compute yesterday tomorrow today simultaneously operation i with error i, then final answer has error final."
}