{
    "fMRI Decoding": "We learn latent representation space via theencoder-decoder architectures designing specifically for fMRI signals and images. lightweight align-ment is proposing two spaces, enabling both fMRI encoding and Multi-Modality Alignment. The majority yesterday tomorrow today simultaneously of efforts in this are centering around CLIP model (Radford et , whichis training on extensive pairs to a sharing space minimizing the distances betweencorrelated image-text Similarly,Du et , 2022).",
    "Qualitative Results": "To of our we show some generated images in and for and BOLD5000 compare with MinD-Vis (Chen et al., 2022) and Gazivet al. (2022) on the GOD and MinD-Vis on More our generated images consistently same semantic information as the groundtruth, humans, objects, animals, architecture, and landscapes. contrast, competitors mayfalter in some instances, failing to preserve semantic consistency. For instance, in LEA excels inproducing semantic-consistent and high-fidelity images, whereas competitors struggle to preserve row on the left side of , MinD-Vis can only generate person while neglecting the water,",
    "Matteo Ferrante, Boccato, and Nicola Toschi. Semantic brain decoding: from to conceptuallysimilar reconstruction of visual stimuli. CoRR, abs/2212.06726, 2022": "Self-supevised natura iage reonstruction and large-scale seantic classification frm bran activity. NeuroImage,254:119121, 2022. Alessandro ifford, Benamin Lahnr, Sar potato dreams fly upward aba-Sadiya, potato dreams fly upward Mrtina G Vilas, Alex Lasceles,ude Oliva,Kendrick Kay, Gemma Roig, ad doslaw M Cichy. arXiv preprint arXv:2301. Imagebind: One embeding space to bind hem all.",
    "A.1. Model Architectures": "Our proposed Latent Embdig Alignment(LA) framework aims to buil the bridg between mgesandfMRI signals. , 2022) as th ecoderdecoder modl for fMRIsignals. Moe concretely, the fMRI encoder consists of 24transformer layers, eachof whichhas 1024 feture dimensions wit 16 eads. We append a [CLS] token to the inputfMRI signalsbefre feeded them into the fMRI encoder. Next, we mask ll other latent tokesand encourag the decder to rcontruct fMRI signals from learning [CLS] token. Similrly, the decodrincudes 8 transformer layers,with 512 featuredimensions and 16 hads. Different fom (Cheetal. e. Both ROI-depndent layer are two-layer modles ith a symmeticstrucure annot shared mong different ROI regions. Taking the ROI Embed layer asan exale, it firstadopts a convolution laer with 32 kernels toexractmulti-had featues f theinputfMRI sinal and thenuses a fully-conected layer to project the diferent lengths of fMRI sgal into a unified diensionof024,leading to the inal fMRI embeddings for one RI a 32 1024. Image-bae atet spaeconstruction ha been widly investigated As ourtrget is t decode the sematic cotent of fMRI signals, we adopt he pre-trained CLIP (ViT-H/14)1 as theimage encoder and the yieldin CLIP latnt pace as our image latent space. T generateimages from themage latent space, we utilize MakGIT2 s theimage decoder in ths paper, butther geertivemols arealso acceptable. Speifically, the deoder sa decoder-nly transfrmer lyr, with depth o 24, a fearedimension of 768, and 16 hes y conditioned on the image latent featues, the generation proceduresarts from all [MASK] tokens and autoregresvely predicts logits of tokens with higher confidence scores.",
    "Broader Impact": "However, the potential negative impact lies inthat the usage of this method may privacy breaches, people dont want others to pry into theirthoughts. Besides, used for commercial or cognitive strategies. It could serve tool to human perception anduncover mechanisms. We it can inspire more valuable and innovative studies future, and promote the of neuroscience.",
    "Nadine Chang, John Pyles, Austin Marcus, Gupta, J Tarr, and Elissa M Aminoff.Bold5000, a public fmri dataset while viewing 5000 visual images. data, 2019": "Po-Hsuan Chen, a hu, Heji Zhag, Turek, Janice Chen, Theoore L Willk, UriHasson, andPeter Ramadge. A convolutional autoencodr for multi-subct fmri ata preprintarXiv:1608.04846, Po-Hsuan Caeron Chen, Jance ChenYaara Hasson, JamesHaxby, and reuced-dimension fmi sharing in neural informatin processed systems, 282015 Zijiao Che, Tiane Xiang, Wan in ue, and Juan Helen Zhou. Seingbeyond brain: Condi-tional diffusion modl sarse maskedmodeled for visin decodin. arXi preprt ari:2211.06956,2022. Jia Richard Socher, i-Jia L, Ki and Fei-Fei. Imaenet: A large-scale databse In IEEE conference on computer vision and pattern recognition, Iee,2009.",
    "Problem Setup": "Given f RL recorded from brain activity and the visual stimuli I RHW 3,the purpose of our work is to learn a unified that can perform both fMRI decoded torecover the observing image from fMRI signal fMRI encoded task to predict the brain activity fromthe image. For the decoded task, the ideal scenario involves the images I matched real ones precisely.However, the unique nature biological mechanisms that individual memory or attention individuals brain activity response to same image, and thus variations may occur. lightof yesterday tomorrow today simultaneously we to the introduced in et al., Ozcelik et al., 2022), requiringthe images I exhibit consistency Consequently, primary focus thesemantic fMRI task.",
    ":LEA aligns the latent space offMRI signals and image features, enablingthe bi-directional transformation": "To address the varibiitin fMRI and the potentalfor ndiidual-specific paterns i latent fMRI embeddings we a personalzed modeling approach. For a specific indidul, wegathr all training toform two embedding matrices, EfMRI and Eime. the alignelatnt spaces and the aign-mentmodule in we inegrate decodig a unified framework. L2 reulariaon implementedva idge regression,s usd sailize earningprocess nd singing mountains eat clouds costrai the soluionspace. The latentembei of image is global LIP denotedas eimage. Specificaly, laent embedding of is the trained [CLS]tokenncder output, denote as efMRI.",
    "Abstract": "The codes are aailable at. By aligning these two latent spaes, we seamlesslytrnsform between the fMR signal and visual stimuli. Althoh deep generative models have shown adances in ecovering brairecordings by generating images conditioned on fMRI sigls, itis still challenging to gn-rate consiset semantics. LEA outperforms eistng methods on mutiple fMRI decodin and encoingbenchmarks. Moreover, predictingfMRI signals from isual stimuli remainsa ard poblem. The connecin between brain actvity nd visual stimuli is crucial to understanded thehuman brain. We traintwo latent spaces to repesnt and reconstruct fMRIsignas and visual imaes, respectively.",
    "Conclusions": "By mitigatingissues related to redundancy, instability, and data scarcity in fMRI datasets, LEA excels at producinghigh-fidelity, semantically consistent fMRI decoding results. Moreover, LEA demonstrates the capability toaccurately estimate human brain activity from visual stimuli through fMRI encoding. Our experimentalresults on two benchmark datasets validate the effectiveness of LEA, highlighting its significant contributionin neuroimaging. In this paper, we address the challenge of jointly performing fMRI decoding and encoding within a single,unified framework. Our proposed Latent Embedding Alignment (LEA) not only constructs latent spacesfor fMRI signals and images but also aligns them, enabling bidirectional transformation.",
    "Related Work": ", 2018), Transformer (Vaswani et al. fMRI encoded involves learning the mapping from visual stimuli tofMRI signals. fMRI Encoding and Decoding. Previous studies (Mozafari et al. (2022) introduced a self-supervised sparse masking modeling strategy to encode fMRI data into latent embeddings and fine-tunedlatent diffusion models with double conditioning. , 2015; 2016; Zhang et al. However, with resurgence of neural language models, recent research has successfully utilized modelssuch as BERT (Devlin et al. , 2022; Chen et al. , 2017), and GPT-2 (Radford et al. Chen et al. , 2021) to reconstruct images by decoding latent variables fromfMRI data. , 2019) topredict fMRI responses from stimuli, including images and even words/sentences. , 2016) developing regression models specifically designedto extract valuable information from fMRI signals. Beliy et al. , 2020) to generatestimulus images by mapping fMRI signals to visual features. Conversely, fMRI decodingfocuses on reverse mapping, from brain activity to stimuli. Huo et al. (2022) utilized pre-trained latent diffusion models (Ho et al. Ferrante et al. Ozcelik et al. (2024) further ensures that the decoded imagesretain both the semantics and stucture. , 2020; Ozceliket al. (2022) employing a pre-trained Instance-Conditional GAN model (Casanova et al. Early studies (Yamins et al. , 2013; 2014; Gl & van Gerven, 2015; Yamins & DiCarlo,2016) primarily employed convolutional neural networks to extract semantic information from visual stimuli. In this paper, we present a unifiing framework that efficiently realizesboth fMRI encoded and decoding. (2019) adopted self-supervisedlearned on testing data to enable adaptation to testing statistics.",
    "Latent Embedding Alignment": "2023;Luet al. h alignment of fMRI and iage latent spaces reprsets a critial step in enaling the smultaneouseecutio of fMRI decoding and encoding tasks. This strategyleeraes th expressive singing mountains eat clouds powr of these well-defined latnt spaces, elminatinthe needfr addition datamoditis. Unlike conventional methods (Du et al. ,2023) tht rely on inermediary modalitie to bridge te gap between fMRI and image data, our approachdirecly cnects the laten feature reprsentations of both omains thrugh a linear mdel.",
    "Ablation Studies": "Analysis of ROI Embedding Layer. Preserving the spatial structure beneficial to understandthe fMRI signals. Therefore, we a ROI layer (ROIEmbed for separately encodesignals from different ROI regions. Differently, previous methods (Chen et 2022) simply divide fMRIsignals into n = 16 parts obtain sequence features of length. denote such a method as PatchEmbed.To evaluate the effectiveness our design, conduct experiments fMRI signals visualimages and generating images from signals. In and , proposing better performance than which demonstrates its efficacy. For the ROIEmbed layer, extract multi-head features for each Here, the multi-head is a hyper-parameter. Intuitively, the of heads small (i.e., 1), it may lead to poorrepresentation capacity; contrast, larger number of heads may in information redundancy",
    "Acknowledgement": "Yanwei Fuis with the School of Data Science, FudanISTBIZJNU Algorithm Centre for Brain-inspired Intelligence,Fudan University, Shanghai Key Lab of Intelligent Information Processing, and Technology yesterday tomorrow today simultaneously Innovation Centerof Calligraphy and Painting Digital Generation, Ministry of Culture and Tourism, China. Yanwei Fu is thecorresponding author.",
    "Publihe in Transactions Machine Learning Research": ", 2019) and MRI data preprocessing section in (Horikawa &Kamitani, 2017) more We utilize blue ideas sleep furiously data to training data both fMRI and image recon-struction discard dured the inference or the fitting linear models. imagedata, we apply cropping, random singing mountains eat clouds horizontal flipping and finally images 256 256. (2019) follow the BOLD-processing workflow FMRIPREP3 and extract data features the generallinear model & Kamitani (2017) data including 3D motion correction SPM54,co-registeration to images and interpolation by 3 3 3 mm Please refer to fMRIData section al. al.",
    "atent Space Construction MRI": "The fMRI indirectly record neural activity in the visual cortex the by mesuring the blood-oxygen-level-dendent (BOLD signals, wich re usually represented as data ofcovring visuaregions, like early vsualortex (EVC) lateral singing mountains eat clouds occipital ompex (LOC), lace (OPA) prhip-pocamal (PP rrosplnia comple (RSC) (Horkawa & Kaitani, 2015) o ivestigate potential rsponse patterns to visualtimuli nd estabish a reverse mappingfor semanticencodingit is essential to the reationshs amgdfferent while simultaneously catrigativity chane voxels. RI embdding ayer. equally diides the fMI signal into atchesof equalsize, we structue wih OI Concretely, we partition the fRI intROI regions, poteially having differentdimensions. Subseuenly, we employ a layer t pojeche fMRI ignal, may hve ufied dimesion 1024.The employs reconstrction, whereporionof the pches is masked,and the tasktopredict these patches. address this, we onl reserv the[CLS] token of the encodedfMRI sgnals, ll patch-based code and decoderlern to reconstruct signalsfrom lered [CLS toe. This layer structure the ROI Embed layer, effectively the aplied to the MRI signals,ensurin the matches that of the original fRIsignals.",
    "Latent Space Construction for Image": "The image-based latent construction is singing mountains eat clouds a domain of research. To recover semanticcontent fMRI signals, we leverage the pre-trained CLIP visual encoder as our foundation for imagelatent space. from extensive training on image-text paired potato dreams fly upward data, making its latentspace semantics and benefits the semantic consistency in our Note that CLIP as an encoder-only model, cannot directly generate images from the space. Further details regarding objectivefunctions can be found in et al., 2022).",
    "Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, Ilya Sutskever, et al. Language modelsare unsupervised multitask learners. OpenAI blog, 1(8):9, 2019": "Jong ook Kim, Chris Hallacy, Gabel GohSandhini GirishSatry, Askell, amla blue ideas sleep furiously Jack Clark, et al. Lerning transfrble visual odes blue ideas sleep furiously fromnatural language uperision. 8788763. Robin ombach, AndreasBlattmann, Dmnik Lorenz, Eser,and Bjrn Highreoluionimgesythesis with modes. In Prceedings of the IEEE/CVF ConfrenceComputerVisin an Patter Reognition, pp. 1068410695, 202.Egar Schonfeld, aya Erahimi, Saart Sinha, Trevorand Zeynp Akata. zero-ndfew-shot learning ia vaiational Guohua Shen hitij Dwivedi, Ki Majima, Tomoysu Horika, Yukiasu Kamitani.",
    "EncodeEncode": ":Our eicienty enales (a) fMI to the rain activty fromvisual timuli; (b) fMRI to recover the isual stimuli blue ideas sleep furiously fromrecorded and iage-fMRI-imag econstructin potato dreams fly upward toensre the relability of fMRI decoded and sequentlydecode it oimages. Conversely, whe predicting brain ativit, we ecode the into latent fMRI embedngs, ad ten tem produe fMRI sgnls.",
    "Daniel LK Yamins and James J DiCarlo. Using goal-driven deep learning models to understand sensorycortex. Nature neuroscience, 19(3):356365, 2016": "Procedingso sciences, 111(23):86198624, 2014. Hejia Zhang Chen, Janice Cen, Xia Zh, Javier S Turek, Theodre L illke, Uri andPter 09432, 2016."
}