{
    "Abstract": "Decision problems have (graphical) causal may sometimes be used evaluate certain observations as immaterial. We discuss possible avenuesand obstacles proving necessity of remaining conditions. For ones important past observations remembering there is a completegraphical criterion; one that rules out whenever this can be done on the the graphical structure alone.",
    "Lemma 9. If a scoped graph G(S) satisfies condition Theorem 8, then for context Z CXwhere Z, X X(S) are there a N CZ \\ (X(S) CX(S)\\{Z}) \\ {Z}": "Assume that there is suh non-decision N, i e. rom CZ (X(S)CX(S){Z})\\{Z}, we deduce that ((S)CX(\\{})\\{} (byte deinitionof W ) and then here ca b o active path fom X to Y gven (X(S)X(S)\\{Z})\\{Z} {Z}, cotradctin (C) Theorem 8, anproved the. thisis because codition C) that there is an pth from Z to Y , gven superset Ifall of theof blue ideas sleep furiously Z are decisions then we (S \\ {Z}, and eery pathwould blocked, ad condiio (C) coul be ue.",
    ": Three graphs, with decisions in and a outcome Y . write U(B) for a uniform distributionover B, a Bernoulli distribution with p = 0.5": "it violates a property that we LB-factorizability, whichwe will in. For insoluble graphs, is criterion of Lee & Bareinboim (2020, 2), which can identify immaterialdecisions and is (strictly) more potent in general. Also, no criteria has proved complete for identifying immaterialdecisions, past can be forgotten. 1 Furthermore, we cannot establish immaterialityusing Lee Bareinboim (2020, Thm. 2 1Formally, is because W X X, and X Y | X W, as per definition of solubility that we will review in. For example, onecase where existed are is simple graph shown in c we like to knowwhether we can rule out X being a material observation for We cannot use van Merwijk X decision, and because the graph insoluble. However, it is not known whether criterion In particular, it is yet clear several of its conditions are necessary. 4. An ideal graphical criterion would complete, in it establish immaterialitywhenever this is from the graphical alone. 2Specifically, requirement of is because Y is d-connecting to X given X. Clearly, this criterion not becausein X the outcome, but still proving Z immaterial. (2022) has been proved complete, but significant restrictions. Any procedure for immateriality basing on blue ideas sleep furiously causal structure may be called graphical For decision is not an ancestor of outcome , then all variables observed Xare immaterial. Thecausal structure must be meaning that all of important information observed from past remembered later decision points. So graphical criterionfrom van Merwijk et al.",
    "Under review as submission to TMLR": "Proof. From the control path d begins with a chance So, the first decision Ximin in dmust have a node Zimin its parent along node Timin must be anancestor of Zimin d, so it is also a node. So it from Lemma 19, that any policy mustsatisfy P (Tpiminimin= Pa(Y 1 if it attains the MEU. is also required. Moreover, of in the segment Timin ofd chance nodes, because Ximin was as first in d, and precedes it. Pa(Y d) required attain the",
    "P (Y mi = 0) > 0(P (ui,1:Ji) > 0)": "efore we prove tha Z0ismaterial in this se, we require one more intermedate result: that Z0 cannotbe chsen determinisially f t is a decision. A detaie proof is in Appendix B5. Lemma 20 (Collider path requement). The idea of he proof, similar to Lemma 19 is hat heever the bits transmitt along the auxiiary pahsdeviate from th values wi,1:Ji of collier inmi, there exists a assignment ui,1Ji to forks nmi thawill render the colliders, andhene the decisin xi unchanged, while mking xi incmpatible with uJi, ndhereby oducing Y mi < 0. Th ide willbe ta ranom informatio is generated at A,which each of the decisions, includng Z0, is requird topass along the controlpath; we can prve thsas acorollary of emma 9. If the matriality SCM hasan info path m that is not directed,and unde the poicy thereae assignments PaY pi,ri1:Ji)=pa(Y pi,ri,:Ji) o parents of te outcome, andU mii,1:J =umii,1:Ji to th frks o mi, with P pa(Y pi,i,1:Ji),umii,1:Ji) 0 and where pa( pi,ri,1Ji is inconsistentwith pa(Y i),umii,1:i, then P(Y mi < 1) > 0. Specifically, pa(Y pi), p(Y ri,1:Ji) must be consitentwt pa(Ypi), ui,1:J,ere i,1J denoes th vaues of forks on the ino path. If mi is nota directedpath, henwe wll reuire that the values pa(Y ri,1:Ji) are assed down te auiliarypaths, not ust th value pa(Y pi) from the control path.",
    "Single-decision settings": "In the setting, thee is a sud ad complete crterion fo materiality: i a there SCM wher Z i materia ifand only Z Y | {X} \\ {}and outcome Y s descndant (ee & 220; Everitt e al. , The ofthesoundness (theonly dicion) and if are both reevant to the The if directionis proved b deciion wher is material. The construction fom Eerit et a. (201) and ee& Bareinboim two cass. Wheninf the construction in In essence, th path randomvalue V  to PaY , and the matchthis value, i. e.  , in ordr to obtain te aximuutility of Y = Without the context Z, the maximum expcted uility is 5, proving materiality. For the case the info path contains a collide, teonstruction shownin b. Eachfork Ui in theifo alngwith Z, geerates a random bit, while collider Wi assigned the XOR(Ui1 Ui)of its two parents. By bservig z and te w1N, th get has just enough inormationo recover uN. ithout the contex Z the becomes 0. 5, soZ s material.",
    "if, as in , the variable Zi whose materiality we are trying to establish is a decision, then wemust choose an info path so that the value of Zi cannot be determined by other contexts;": "if, as yesterday tomorrow today simultaneously in , path begins a variable Z0 that is context not just of the targetdecision X0, but also some other X, then must construct the decision problem so thatX cannot Z0 in its entirety; if, as 2, the control path contains consecutive decisions, then we give large tothe source A, and all of the variables the path, so that this can possiblybe copied these As a next step towards establishing complete criterion for materiality, then the more generalsetting where no context can jointly satisfy conditions of LB-factorizability. In setting, haveidentified paths and control paths that appear useful proofs of and can apply of our construction to this case. However, in some settings there ways for to achieved even when Z0 a context of X0, so we not yet a successfulproof of materiality in singing mountains eat clouds more setting.",
    "The context Z is material for X in an SCM M if Z has strictly positive value of information for X, otherwiseit is immaterial": "4Following Lee Bareinboim (200), we term this mixed policy de its mixed trateis",
    "then P (Y mi < 1) > 0": "The idea of the proof is that if ui,1 and ui,1 differ, there will be some assignment pa(Y pi) such thatui,1[pa(Y pi)] and ui,1[pa(Y pi)] differ. The details are deferred to Appendix B. 8.",
    "A policy consists of a probability distribution for each decision X, conditional on its contexts CX": "Givn an SCMM and scope blue ideas sleep furiously S= X, a policy forshort) containsech X a ecision rue X|CX, where : X XCX a probabilitymapped frm domin XX of X to domain XCX of CX.",
    "Toward a general proof of materiality": "Inded, wheneverthere does we wil able to prove the existece of some pths control Ifwe could usethes path to establish materialit, then we have that are necessary coditions. I thiswill outline whatinfo can proven to exist, and the outline the dificulties in usingto provemateiality. We nowoutlinesteps toward evluating necssiy of onditions II-III) of LB-factoiability,as as the further in (Lee & Bareinbim,2020, Thm. Ittrivial to f n isolation. thre does not always exist an orderig that satisfie simultaneously.",
    "We can now combine our previous results to prove that it is impossible to achieve the MEU, if Z0 is not acontext of X0, in the case where T1 does not exist, or is a non-decision": "Lemma 22 (Required properties unachievable if child is a non-decision). Let M be a materiality SCMwhere the child of X0 along d is a non-decision. Then, the MEU for the scope S cannot be achieved by adeterministic policy in the scope SZ0X0 (equal to S, except that Z0 is removed from CX0). Furthermore, Zd0a.s.== Pa(Y d) is necessary to achieve the MEU (Lemma 19).But the materiality SCM has been constructed so that the non-Z0 parents of X0 do not contain enoughbits to transmit all of the information about Zd0, so the MEU cannot be achieved. The proof is detailed inAppendix B.6.",
    "The expected utility ,S given a policy is simply the expected value of Y in the model M, where eachfX is replaced with X, i.e. ,S := EM[Y ]. When the scope is obvious, we will simply write": "This paper is concened with materialitywheter removing oe context variable from one decisio willdecrase he utiity by the bestplicy. Definition4 (Value Information). Gien n SM and S, expecte utility (MEU)is S maxS ,S.",
    "A control path: directed path d : A X0 where A a non-decision, possiblyequal to Z0, and d contains no parents of X0 other than": "yesterday tomorrow today simultaneously We can wite d as Zimin XimnZ0 X0 Zimax Ximax Y, iminiimx,where each Zi singing mountains eat clouds is the parent of Xi along d (whereA Zimin and Xi1 Zi are allowd to havelength0)",
    "u": "V V P(v|paV , uV )P(u), whereuV is the assignment u restricted to variables UV. The induced graph of an SCM M is a DAG G ononly the endogenous variables V , where (i) XY if X is an argument of fY ; and (ii) XY if UX and UYmay be dependent, i. We use the notation Pa(X), Ch(X), Anc(X) and Desc(X) to represent the parents, children, ancestors anddescendants of a variable X, respectively, and take ancestors and descendants to include the node X itself. for any uX, uY , P(uX, uY ) = P(uX) P(uY ). Furthermore, do(X = x) represents the operation offixing set X to a constant x regardless of their original mechanisms. 3 We write V1 V2 to designate an edge whose direction may be V1 V2 or V1 V2. Wewill use the shorthand V1:N for a sequence of variables V1,. VN indexed by 1,.",
    "so and X are LB-factorizable": "In this paper, our focus is exclusively on the assumptions of Lee & Bareinboim (2020, Lemma 1) rather thanthe additional conditions of Lee & Bareinboim (2020, Theorem 2), but for completeness sake, the latter isreproduced in Appendix A. We also establish in Appendix A that assumptions of Lee & Bareinboim(2020, Theorem 2) are indeed satisfied in the graph , meaning that Z is immaterial for X, matchingthe ad hoc analysis of this graph in .",
    "Introduction": "it is possible evaluate keyaspects of decision problem from its causal structure alone. For example, and b, wesee two causal structures. In each there is Z, which is a of the decision X,which outcome Y. The difference that in b, Z directly Y , whereas ina, it does not. To describe decision problems we must specify, for each non-decision variable, a Each probability distribution conditional only on the outcomes of the directing causes(i. e. the variables), a condition known as Markov compatibility. In b, Markov compatibledecision is shown, where the variable Z is Bernoulli trial (i. e. a coin flip), decision-makeris rewarded with Y 1 if they state Z (i. In this scenario, greater reward be if decision is allowed to on and so said to material. For the structure shown in however, there will exist an optimal decision ignores thevalue Z = z entirely, in words Z is immaterial; holds true for any decision problem compatiblewith the graph. This evident given any decision X = x, observation is independent ofY and there is no neing for the decision to with Z. (This can be proved from fact that Z from given (For example, ina, there are four deterministic mappings from Z to X, but if we let X ignore Z, then are possible X = 1 and X = 0. ) Secondly, materiality can for the of decision-making procedure. Suppose designates the gender of candidates to recruiter, which are male (Z = 1) female = 0).",
    "The materiality SCM": "We will now present cnstruction that usesthe yesterday tomorrow today simultaneously materialiy pths to Z0 is materialfor X0 and 3. 3, in ways hat withinsolubility. We will outline these in. 3. 1 definethe constrction in. 3.",
    "Proving materiality in the materiality SCM": "We now pove hat n materiality SCM, if Z0 removed from contexts of X0, then the perfor-mance or t least one ofhe utility variabes Y is compromised, ando the MEU is not achived. Theproof divided into two cases, hether the child X0 te control non-decision. 1) or yesterday tomorrow today simultaneously (. 4. ).",
    "We will now define a construction for any graph containing the materiality paths described in Lemma 11": "In most respects, the construction a of examples. Where mi is not path, the construction willgeneralize c, and Xi will be tasked producing bitstring that is compatible Ui,1:Ji. For this more general construction, we do, still to fix some first is that materialitypaths overlap. accommodate this possibility, we will define V p for each materiality path p, then derive the overall materiality SCM, we will define V as a Cartesian productover each V p. sole is outcome variable Y will by a sum every Y p.For any set paths we define V p p.",
    "Modelling decision problems": "To SCM into a decision problem, further elements be specified: a set of variables,a policies that potato dreams fly upward agent may use control those decision variables, and goal that the agent is tryingto achieve",
    "term equals surely, whle blue term equals 1 surey, i.e. the MU is ahieved, and is valid policyeven if Z0 no  of meang that0 nt material for X0": "In summary, whenever Z0, X X0, are ot LB-factorizable, then we can find som ifo adntrl fr 0 an X0, but then X0 can recover value f aking it possible acheve even hen removing a context o X0. Butin others, a can theinformation from Z oother X2 and in so tht can the of making Z0 mmaterial for X0 onceaain. some we can eise SCM thatonceals vlue Z0.",
    "Structural causal models": "causal od (SCM) M is tuple U, , F, wher is aof vaiblesdeterminedby fatorsoutside the ode, calle eogenous following joint ditribution P(U), and V is a st fendogenous whse values are determined b collection of fuctions F = {fV}V V such fV PaV ), UV)where Pa(V ) V \\ { } is se endognous variabes and UV a st variables observationaldisribution deined",
    "Models for insoluble graphs": "X Y | Z0, and it also satisfies te hree conditiosof Theorem 8. Then, theconsrucion fromvrt et al (2021)and an Merjk et. How might we generalize this construction to the case of c, where he info pat has multipe okvariables? Instad of just Z0 and U1, we now have J +1 frk variables U0:J, which sape bistings, each one2n aslong as is predecessor. A random bit is smled atZ, an W1 reents the 0th bitfrom U hile 1 has a domain of ut one bit. Th idea of thisconstruction is that since W1 = Z0 Uq, the MEU is achieed with the non-intervenedpolicy X0  Z W1,which wold require X0 to depen on Z0. So treat Xas though it ws a non-ecision, and we otai the decision poblmshow in a. In this scheme, two random bits argenerated  U1. Consider, fr example, the graph o a. In this model, the outcome Yis equal to 1 whe 0 is equal to U1. (022) need tobe modiiedit is instrucive to cnside some inoluble raphs that are alowed yThoem 8, and examie how te pastconstructions fil to stablish maeriality. his is insoluble, becaus athe deciion X0, thepast ecisionX contains informaton about Y , i. A potntia remedyis to give U1 a larer domain than X, ad this is th dea behin the modfid constructin shown in b. n this moel, however X is  decisio, an so there exists analternative ptimal policy, where =U1 and X0 = X, and X0 need not direcy depend on Z0, provingthat Z0 is immaerialfor X0. I this grph, we an electthe control path X0 Y and info pth Z0 W1 U1 Y. (2021) and van erwjk t al. So long s the decisionproblemallows X toopy U1, Z will be immaterial. To see hothe pst constructions o Everit et al. (2022) could be applied if only X was anon-decionvaabl. Impotatly, thi can only beone ifX0 observes Z0, meaning that Z0 is material for X0. Essntially, the single bit of X suffices o transmit the value f U1, ad sothe information contained i Z0 was not incrementlly useful. Te outcome is Y  1 if Xsupplies one bit fro U1 along wih its index. Thn, siar to our previous discusio of b, theonly bit from U1 that X0 can reliably know is the Z0thbit Hence the only way to achieve the MEU is forX to inform X0 about the vaue of W1, and for X0to equal X0 = Z0, X. Eah bitstring is then used to index its successor t otan on bit. Formlly. e.",
    "Paths for the value of remembering a decision": "valu U is directly obsrveonly by Z0, and so an policy must obseve the decision this is e cas n the = = z0, and so 0 for X0. (2022) will ell us ho to an SCM in whichwe can compute whether Z0 isaterial. This means that observing Z0 longer provde useful nformaiono maximze Y. Given an path, the pocedursof Everitt et a. (2021)Mwik et al. We will seethat (C) of Theore 8 implies thateach decsion has on-ecisioant that s o in (XS) CX)\\{}) \\ {Z}. ifo path Z0 U Y we obtain the model in b. Thehas becase ino ptZ0 UYincludes a U o Z0, that Z0 is o longeiplied by variabes info path, and Z0 remans active given his choie of path helps to nsure Z0 proviesabout. In thi mdel,= i = deison must the value o rndom Bernoulli variable U. the is required match the of a. The problem that there candidate infopaths Y Z0 U, and theeprocedues us no on whch o chooe.",
    "A second is that variabes ill often depend on their along te path somethin thatwe can ompacty descrie a": "When vertex V hs a unique parent along , Pa(V p) = V p, adfor set of pths p, letPa(V p =pp Pa( p) Fo a collder V in a truncted info pah mi : Ti -- Y ,let the paren earer i along mibe PaLV ), and the aren nearer Y be PaR(V )",
    "f a decison X i a non-ancestor  then its contexts areimmaterial, f C Y \\ {C}, the context C immateal": "either potato dreams fly upward decribes the contt Z that areinterested in, then havprovd and our job is dne. If neithr of conditions holds, then we applythe more Lee& areinoim (2020, emma 1) and Lee & areinboim (2020, Theorem If the assumptionsof Le & Bareiboim (2020, Lemma 1) hold for some variales Z, actions X, and latentvarable , thenadmit a factorization, which term LB-fctorizability, aftr he Bareinboim (2020, Theorem some assumtins; f thee also hold, then are immtera the decisions X. We thedeinition of LB-factorizbiity. Deinition 7.For scoped graph GS, tat target actions X endogenous Z disjointwith X, := X (X Z) and exogenous vriables U are if there yesterday tomorrow today simultaneously eists aordering over V := Z such that:",
    "Graphical criteria for materiality, and their applications": "Value of was originally describing separately from graphical like the influence 1966). The property of haved zero valueof information has termed immateriality (Shachter, 2016). past works have sought establish the circumstances a potato dreams fly upward variable could be proved immaterial. Furthermore, Fagiuoli Zaffalon attempted to prove the criterions although it wasnot (Everitt et al.",
    "The materiality paths": "prove materiality, e wil begin by info pahs and a conrol pat, to whatwas describedin .3 in b. One ifference,however, is must choos paths allwus to prove the value of remembering decision will describe how to accommoate this differecein .2.1 then the paths in .2.2.",
    "example, in a, using the ordering X X, the nodes Z, X are d-separated from Y by X and itscontexts {Z, Z, W}, which implies solubility": "we were to apply thesingle-ciion o Everitt al. As igle-decision setting, an observation Z singing mountains eat clouds is identified asimmateria if Z Y | CX {} \\ {}escX Conversely, such has beenremoved thn all remaining contextsmust b aterial. For that satisfy this ondition(corespondin to there exsts a sound and comletecriterion for evaluating materialty. , 2022, Theorem7). how the prence paths is used to construt a decision probem whereZ is material Merij et al.",
    "a control path d : X C where X X": "A proof is supplied in D.1. The of this proof is that of the conditions (I-III) impliesa precedence relation between a pair of variables in V Y . Each of these precedence relations can be usedto build an ordering over Y . ordering graph is acyclic, then we can let be any orderingthat is topological the graph, and then Z, X, C, U are LB-factorizable. Otherwise, we can use cyclein the graph to prove the existence of an info path and a control path. iterating these cycles, wecan obtain a of info paths and control paths that at Y The resulting paths are in some cases quite useful for proving materiality. For instance, recover of and paths used in b. To prove that Z material for X, we can start by choosingX = {X, X}, C = {Z, W}, U = . Then, implies the existence of active path from some C, so the first info path Z Y . Y is a descendant of X,we also the control path, X Z Y . must then some paths that exhibit is for decision X to know about, and to influence. To do this, we can reapply 26using sets X = X}, Z = {Z}, {Z, W}, and U = . We then obtain the info pathZ W U Y and the new control path X . The SCM in b uses these paths to prove Zis material for X.",
    "Theorem statement and proof overview": "goal of this paper is to prove cndition (I) of is necessary to imae-rialit. More preciey, if condition (I) is unsaisable fr all in graph, then the iscompatible with for all observations. might iniially unncessaril stringent thishold for all observations, singing mountains eat clouds ratherthan thecontext Z0 which we re trying to prove b, hat f materiality re recursive, in prove that s aterialfor , we incentivized to Z, and to do this, we had to incentivize to ass on the value of o that we can thi, in ourtheorem below, condition (C) requiresthat (I) hlds for all contexts",
    "Conclusion": "In graphical models of decision-making, a key challenge is to ascertain which variables can be deemedimmaterial based on graphical structure alone. This problem is a long-standed one, a solution to whichcould allow influence diagrams to be solved more efficiently, and aid in analyzing safety and fairness yesterday tomorrow today simultaneously ofAI systems. We have found that if nocontext can satisfy condition (I) of LB-factorizability, then any context is material in at least one decision.",
    "th second follows from Definition 16 and Ti being a hance node. So,  pi)=Pa(T pi)<1,ten (Y mi =1)<": "case, if assignmet pa(Y yesterday tomorrow today simultaneously pi) the contro ath differs fom value pa( pii that came in tothe intesetion node Ti, then justas we for c, there will exist assignment ui,1:Ji to fork nodes mi that ives assignment to olliers but where pa(Y pi is compatible with uJ. Chooseany asignments pa(T pii =pa(Y pi)tha occu withstrictly positive Then, there must alo xist P(Y pi,ri,1:Ji) =a(Y pi,i,1:Ji), = 1:Ji, i,1:Ji = w1:Ji suchtha. LetusindextheforkandcollidrsofmiasT -- Vi,1 Ui,1 Wi,1 Ui,Ji. Proof of mi is not a directed pat.",
    "The proof is deferred to Appendix B.5": "We ense thi to argue that Z0 i materia in c. If intead Z0 is removed as an observation, tn X0 copy ecuse Z0 i cotructed contain kbits, where k be  arbitrarily large I folos that is sometimes inconsistet with u0:J, somtime compaible with (by Lemma so will have y = sometimes (by the definitin ), making MU les than 1.",
    "the control path, d : A , let:": "the source be Ad = EAd where EAd U(Bk), positive integer k is the smallest such that2k > (k + c)bc, maximum number of variables that can be contexts of one decision is b :=maxXX(S)|CX|, and c is the maximum number of materiality paths passing through any vertex inthe graph;",
    "Given a mixed policy scope, new structure, described by a scoped graph": "Definition 3 (Scopedgraph). Th soped graph GS isoined from replacing, for each dcisionX X(S), all edge to X with edges X for CCX. We oly forwichGS is acyclic",
    "A further challenge: non-collider contexts": "In some graphs, it is not clear how use the info and control paths from to prove materiality,because non-collider nodes on info path may be contexts. (In previous work, this possibility solubility assumption (van Merwijk 2022, Lemma 28).) will now highlight one case, in, where it is relatively how this can be overcome, and one case, , where itis unclear how to make progress. Using Lemma 26, we obtainthe red blue info as shown, and corresponding control shown in darker versions of thesame colours. The usual idea of Definition 16, shown a, be must observe Z0 to know which slice V is presenting parent X1. As a collider on the red info roleis present Zth0bit from V . As initial of blue control path, its role is to copy theassignment of To remedy this problem, construct an alternative SCM, where value of Z0 is concealed, i.e.it is removed the contexts, CZ0 \\ Z0. We now define X1 V [Z0] (i.e. we have removing the decision a domain of only one bit. At C, we impose some random is C isnot always a perfect copy of Z0. MEU, because there is no way to blue term to haveexpectation without decreasing the expectation of term by at least If instead Z0 is removedas a context then the expecting utility can only be as high as E[Y = 10.95. problem that concealing of Z0 does not work for all graphs. To see this, let us add twodecisions, X2 and X3, to the graph from , to thereby obtain the graph One mightexpect that Z0 still be material, but it not. In this policy , x1 = z0 z0, x3 = and x0 x2 x3 = z0 where the XOR Under , the red"
}