{
  "Abstract": "Representational analysis explores how input data of a neural system are encoded in high-dimensional spaces of its distributed neural activations, and how we can compare differentsystems, for instance, artificial neural networks and brains, on those grounds. While ex-isting methods offer important insights, they typically do not account for local intrinsicgeometrical properties within the high-dimensional representation spaces. To go beyondthese limitations, we explore Ollivier-Ricci curvature and Ricci flow as tools to study thealignment of representations between humans and artificial neural systems on a geomet-ric level. As a proof-of-principle study, we compared the representations of face stimulibetween VGG-Face, a human-aligned version of VGG-Face, and corresponding human sim-ilarity judgments from a large online study. Using this discrete geometric framework, wewere able to identify local structural similarities and differences by examining the distribu-tions of node and edge curvature and higher-level properties by detecting and comparingcommunity structure in the representational graphs.Keywords: Representational alignment, Ollivier-Ricci curvature, Ricci flow, Graph-basedrepresentation",
  ". Introduction": "Artificial neural networks (ANNs) can match human performance in image recognition andclassification tasks, among others (Mohsenzadeh et al., 2020). This led to the investigationof how ANNs encode, transform, and generalize information, and if and how these pro-cesses can be related to brains (representational alignment) (Richards et al., 2019). Onekey direction is to study how the geometry of internal representations reflects item simi-larity, categorical divisions, or latent variation within the input data(Chung and Abbott,2021). The similarity between vectors in representational space is commonly measured us-ing a kernel or a Representational Dissimilarity Matrix (RDM); RDMs are then commonly",
  "Torbati Gaebler Hofmann* Scherf*": ": Detected communities (different symbols) by Ricci flow in the three experimentsand the corresponding edge curvature value distribution. For each community,we show a random sample of faces drawn from it. The edge colors in graphsindicate curvature values, with red shades representing negative curvature andblue shades indicating positive values. Modularity measurement as a communitymetric is attributed to each graph representation. of the Aligned VGG-Face have very similar properties in terms of community structure. Incontrast, the Original VGG-Face, despite being trained on face images, does not show asimilarly high degree of structure.Next, we wanted to visually assess the community structure and its relation to edge cur-vatures. As shown in , the Human Judgment graph and the Aligned VGG-Faceexhibited similar community patterns overall, and both show similar tendencies to cluster,e.g., male and female face images (as indicated by the three randomly chosen samples percommunity). However, the cluster structure in the Aligned VGG-Face is less clearly definedcompared to the Human Judgment graph. In line with our other findings, the VGG-Facegraph does not show a clear and coherent structure that we could relate to the HumanJudgment graph. : Comparison of graph structure based on KL-divergence (KLD) between edge cur-vature distributions and community metrics derived from Ricc flow: Conductance,Internal edge density (IED), Modularity, and Average embeddedness (AE).",
  ". Results": "A comparative analysis of node and edge curvatures across models.In ourgraphs, nodes represented faces, and an edge between two nodes indicated that the cor-responding images were considered similar by human participants or in terms of the vec-tor representation within the two ANNs (details on graph constructions are given in Ap-pendix A). We first computed ORC on the graphs edge level and then derived the nodecurvature by averaging the curvature values across all edges connected to each node.We observed a notable difference in ORC between models, with the Aligned VGG-Facematching the curvature structure in the Human Judgment graph more closely than theoriginal VGG-Face as shown in Figure A2 in the Appendix. The distribution of edge cur-vature values for both the Human Judgment graph and Aligned VGG-Face showed similarvalue ranges with a mean shifted towards positive curvatures and a left-skewed shape, indi-cating a higher proportion of positive curvature with a sub-population of edges with stronglynegative curvature. In contrast, the original VGG-Face displays a more symmetrical pat-tern distributed around zero. This implies that the data in the aligned network and thehuman similarity judgments both form local clusters connected by fewer (negatively curved)edges, indicating distinct structural characteristics compared to the original VGG-Face. Toquantify the similarity between the distributions, we computed the Kullback-Leibler (KL)divergence between each VGG-Face version and the Human Judgment graph. Indeed, wefound a low KL divergence between the Human Judgment graph and the Aligned VGG-Face, but a higher divergence with the Original VGG-Face ().This distinction between the VGG-Face and Aligned VGG-Face structure was also reflectedin the node curvature level. VGG-Face qualitatively shows no strong correlation with hu-man judgments (Figure A2b), consistent with the differences in edge curvature distribution(Figure A2c, e). Interestingly, while the edge curvatures between the Human Judgmentgraph and the Aligned VGG-Face were similar on the distribution level, their agreementfluctuated at individual nodes. That is, the node curvature shows a similar tendency (neg-ative vs. positive) for most nodes; however, the node curvature values diverge for somenodes, indicating that these nodes belong to different local neighborhoods and thus, theirinterpretation in terms of cluster membership seemed to differ between humans and ANNs(sample images are shown in Figure A2a and b). Ricci Flow analysis provides insights into structural properties of representa-tional geometries.To detect and compare community structures based on our curvaturemeasurements, we computed the discrete Ricci flow (Ni et al., 2019) in each representationalgraph. Ricci flow carves out the community structure of a graph by deforming space simi-larly to heat diffusion: regions with large positive curvature contract, while those with strongnegative curvature expand (see Appendix A for details). We then analyzed the structuralproperties of the processed graphs, as summarised in . In particular, we computedconductance (community separation by between-and-within edge ratio), internal edge den-sity (edges within community vs. maximum possible), modularity (community strengthby comparing edge densities to a random graph), and average embeddedness (number ofshared neighbors for pairs of nodes within a community (see also Appendix A). These re-sults () clearly show that the Human Judgment graph and the graph representation",
  ". Discussion": "By employing Ollivier Ricci curvature as a tool for studying the similarity between theintrinsic geometries of neural representations independent of the ambient space, we aimedto go beyond the limitations of distance-based approaches, such as in classical RSA. An-alyzing node and edge curvature yields insights into the local geometric properties of theunderlying manifold. Additionally, we can refine this information using Ricci flow to obtaina broader perspective of the graph structure and detect communities within the representa-tional spaces. With these methods, we could show how the alignment of an ANN to humanbehavior shifts its representational structure toward its target. We hope that this approachcan motivate new avenues for understanding and analyzing the geometry of representationsacross neural systems. N.S., N.T, and S.H. are supported by BMBF (Federal Ministry of Education and Research)through ACONITE (01IS22065) and the Center for Scalable Data Analytics and ArtificialIntelligence (ScaDS.AI.) Dresden/Leipzig. N.T. is also supported by the Max Planck IM-PRS CoNI Doctoral Program.M.G. and S.H. were funded by a cooperation between the Max Planck Society and theFraunhofer-Gesellschaft (project NEUROHUM).",
  "Omkar Parkhi, Andrea Vedaldi, and Andrew Zisserman. Deep face recognition. 2015": "Blake A Richards, Timothy P Lillicrap, Philippe Beaudoin, Yoshua Bengio, Rafal Bogacz,Amelia Christensen, Claudia Clopath, Rui Ponte Costa, Archy de Berker, Surya Ganguli,et al. A deep learning framework for neuroscience. Nature neuroscience, 22(11):17611770, 2019. Areejit Samal, RP Sreejith, Jiao Gu, Shiping Liu, Emil Saucan, and Jurgen Jost. Compar-ative analysis of two discretizations of ricci curvature for complex networks. Scientificreports, 8(1):8650, 2018.",
  "A.1. Graph Construction": "We generated a reference graph from the human judgment matrix by applying a threshold toits values, which range from 0 to 1, with higher values indicating greater similarity. Since thematrix directly reflects similarity measurements between images, thresholding is an effectivemethod for graph construction. We set the threshold at 0.55 to ensure a connected graph,meaning that images with a similarity score above 0.55 are considered similar, while thosebelow are not. This approach resulted in the creation of an unweighted graph. The neuralnetwork projects the data into a high-dimensional space, forming distinct data manifoldsthat fundamentally differ from the original input. Given the heterogeneity of the humanjudgment graph, including variations in edge distribution and node degrees, we utilized thenearest neighbor method to develop graphs, selecting the ten nearest neighbors for eachnode.",
  "A.2. Ricci Curvature": "In Riemannian geometry, curvature measures how a manifold deviates from being locallyEuclidean, with Ricci curvature specifically quantifying this deviation in tangent directionsSamal et al. (2018). It influences the average spread of geodesics in those directions andthe rate at which the volume of distance balls and spheres expands. Geometrically, Riccicurvature determines the rate at which a balls volume increases with its radius and thevolume of overlap between two balls based on their radii and the distance between theircenters. These properties are interconnected, as demonstrated by the following formula:",
  "A.3. Ollivier Ricci Curvature": "In Riemannian geometry, curvature describes how a manifold deviates from being locallysimilar to Euclidean space, with Ricci curvature specifically measuring this deviation invarious tangent directions Samal et al. (2018). Geometrically, Ricci curvature influencesthe rate at which the volume of a ball expands as its radius increases, as well as thevolume of the overlap between two balls, depending on their radii and the distance betweentheir centers.Moreover, the overlap volume between two balls is directly connected tothe transportation cost needed to move one ball to the othera greater overlap volumeimplies a lower transportation cost. This relationship highlights a connection between Riccicurvature and optimal transportation. Using this concept, Ollivier introduced a generalizedform of Ricci curvature on metric measure spaces based on optimal transportation Ollivier(2007). For a metric space (X, d) equipped with a probability measure mx for each x X,Olliviers Ricci curvature (OR) along a path xy is defined as follows",
  "A.4. Ricci Flow": "The Ricci flow method, based on the geometric concept of curvature introduced by F.Gauss and B. Riemann, describes how space bends at each point. Areas with high positivecurvature are denser, while regions with negative curvature are less so. Hamilton developedthe Ricci flow, a curvature-driven diffusion process, which deforms space similarly to heatdiffusion, regions with large positive curvature contract, while those with strong negativecurvature expand. Ni et al. (2019) adapted Ricci flow from Riemannian geometry to discretenetworks, using it to detect community structures within graphs. The discrete Ricci flowalgorithm on a network is an evolving process. In each iteration, all edge weights updatesimultaneously by the following flow process:",
  "A.5. Community Metrics": "Conductance:It measures the ratio of the number of edges that cross the communities(external edges) to the total number of edges within the communities and external edgesof the communities. Low conductance indicates that the community is well separated withfew connections to other communities and high conductance suggests that the communityis not well identified.",
  "B.2. Human-aligned VGG-Face": "We adopted the pre-trained VGG-Face architecture (Parkhi et al., 2015) to predict humanface similarity judgments in the experiment (Figure A1).First, we froze all layers up to the fully connected layer FC7, making their weightsnon-trainable (VGG core). Second, we replaced subsequent layers with one FC layer (VGGbridge), which converts a 4,096-dimensional input to a 300-dimensional vector. We addeda decision block consisting of convolutional layers. This block receives stacked activationmaps from the bridge for each input image in a triplet (xi, xj, xk), resulting in a 6x300matrix [ai, aj, ai, ak, aj, ak]. The first convolutional layer in the decision block has 2 filtersof size (2, 50) and stride (2, 1), producing an output of size (batch size, 2, 3, 251). Afterapplying a ReLU activation, another convolutional layer with one filter of size (3, 100)and stride (1, 1) is applied, followed by another ReLU. This results in a (batch size, 2, 1,152) output. Then, we down-sampled the signal to (batch size, 1, 1, 3) using two moreconvolutional layers (one filter each, kernel sizes: (1, 100) and (1, 51)) with an intermediateReLU. The resulting 3-length output vector indicates the models choice, where the highestvalue identifies the odd-one-out.We trained the architecture using cross-entropy loss with the Adam optimizer, a learningrate of 5e-4, and a batch size of 16. The data (X: triplet images, Y: human choices) wassplit into training (70%; ntrain = 135, 982), validation (15%; nval = 29, 139), and test sets(15%; ntest = 29, 140). For more details see Hofmann et al. (2024).",
  "C. Supplementary Figure": "Figure A2: The node curvature distribution (a and b) and edge curvature distribution (c,d, and e) across different graphs. We compare the individual node curvatures ofthe Human Judgment graph (yellow dots) with that of the Aligned VGG-Face(red dots) in (a) and the Original VGG-Face (blue dots) in (b). The x-axisrepresents the nodes (images), while the y-axis shows the corresponding nodecurvature values. Two examples where node curvature diverges between modelsare highlighted in (a) and (b). The edge curvature distributions are displayedfor the Human Judgment graph (c), Aligned VGG-Face (d), and Original VGG-Face (e)."
}