{
  "Abstract": "Accurate energy price forecasting is crucial for participants in day-ahead energymarkets, as it significantly influences their decision-making processes. Whilemachine learning-based approaches have shown promise in enhancing these fore-casts, they often remain confined to the specific markets on which they are trained,thereby limiting their adaptability to new or unseen markets. In this paper, weintroduce a cross-domain adaptation model designed to forecast energy pricesby learning market-invariant representations across different markets during thetraining phase. We propose a doubly residual N-BEATS network with KolmogorovArnold networks at its core for time series forecasting. These networks, groundedin the Kolmogorov-Arnold representation theorem, offer a powerful way to approx-imate multivariate continuous functions. The cross domain adaptation model wasgenerated with an adversarial framework. The models effectiveness was tested inpredicting day-ahead electricity prices in a zero shot fashion. In comparison withbaseline models, our proposed framework shows promising results. By leveragingthe Kolmogorov-Arnold networks, our model can potentially enhance its ability tocapture complex patterns in energy price data, thus improving forecast accuracyacross diverse market conditions. This addition not only enriches the models rep-resentational capacity but also contributes to a more robust and flexible forecastingtool adaptable to various energy markets.",
  "Introduction": "The increasing competitiveness of electricity markets has driven significant advancements in electricityprice forecasting. Accuracy of the forecasts drive the bids for buying and selling electricity in theday-ahead market and hence reliable price forecasts are essential for market participants such assuppliers and traders. In markets where data is scarce or training could be costly, domain adaptationbased machine learning techniques could offer solutions to generate forecasts for electricity prices ina zero-shot fashion without the requirement of training the model on the target market. While domainadaptation has seen successful applications in the field of computer vision, applying these methods totime series forecasting requires considerations to the temporal dynamics and local patterns inherentto time series . In the past years, several different time series specific models have emerged that focuses on learningthe temporal patterns for forecasting. The Neural Basis Expansion Analysis model, N-BEATS is one such model that has shown superior performance for domain-specific forecasting tasks. N-BEATS model architecture comprises of two main Multi-Layer Perceptron (MLP) based components:the backcast stack which processes historical data, and the forecast stack which predicts futurevalues. In this paper, we propose an adversarial domain adaptation based framework for zeroshot forecasting of electricity prices with an architecture based on N-BEATS model. Inspired bythe Kolmogorov-Arnold representation theorem , we propose integrating Kolmogorov-Arnold",
  ": Line Schematic showing the model architecture consisting of KAN layers stacked togetherusing residual connections inspired by the N-BEATS architecture": "Networks (KANs) within the doubly residual architecture of the N-BEATS model for generalizedfeature extraction. KANs have emerged as a promising alternative to MLPs, which, unlike MLPs,utilize learnable activation functions on the edges by replacing the linear weights with univariatefunctions parametrized as splines. This architecture enables KANs to outperform MLPs in termsof accuracy and interpretability, achieving better results with fewer parameters and providing moreintuitive visualizations. Our proposed model, built by integrating KANs with an N-BEATS-likearchitecture and trained with adversarial technique using a gradient reversal layer , ensures thatthe initial stack captures generalizable features useful for extracting domain-invariant representations,while deeper stacks focus on domain-specific features. The key contributions of this paper are two-fold. This is the first work that leverages a combination ofKolmogorov Arnold networks and doubly residual connection networks like N-BEATS for time seriesforecasting. Building on this, we further propose an adversarial domain adaptation based frameworkfor zero shot forecasting of energy prices by creating a generalized representation.",
  "Model Architecture": "In this work, we use a deep stack of Kolmogorov Arnold networks (KANs) with doubly residualconnections. The network decomposes the time series into local projections by using univariatefunction parameters along the edge of the network. The Kolmogorov-Arnold representation theoremstates that any multivariate continuous function can be decomposed into a finite sum of compositionsof univariate functions. This allows KAN to model complex interactions in high-dimensional datathrough compositions of simpler univariate functions. KAN applies adaptive, learnable activationfunctions on the edges between nodes. These functions are parameterized as B-spline curves, whichadjust dynamically during training to better capture the underlying data patterns. Since the univariate functions are piecewise polynomials with specific degrees and global smoothness,they exhibit excellent approximation behavior relative to their degrees of freedom. The doublyresidual principle, inspired by the N-BEATS architecture , is used between stacks. The timeseries is sequentially decomposed by subtracting the predicted backcast ybi,j from the original seriesto obtain the next series ybi,j+1. The output of each forecast y is obtained through hierarchicalaggregation of each blocks forecast and the last backcast derived by a residual sequence of blockswhich serves as an input to the next stack. shows the proposed model architecture wherethe model is composed of three sequential stacks to generate the overall forecasts. Each stack hasthree sequential blocks of neural networks, and each block consists of KAN layers that generate thebackcast and forecast estimates, which are then fed onto the next block. This model architecture is used as the backbone for creating a generalized representation using adomain adaptation approach. We take day ahead prices from two established markets with significanthistorical data to generate the domain generalized model, and learn the generalized representation",
  "FR3.06492.74162.5056 0.100.10690.09320.0854 0.003PJM3.19423.25452.5697 0.120.11100.10440.0862 0.002BE3.14092.59042.5144 0.090.10940.08690.0857 0.004": ": The next day forecast presents a comparison between the KAN, N-BEATS and Proposedmodel for the NP Market. As indicated, the N-BEATS model produces a smooth forecast while theproposed model uses the flexibility of the B-Spline along with the power of N-BEATS model toproduce the best forecast. by using the supervised forecasting error on the primary market and a notion of feature distancebetween the primary and secondary market prices. This setup enables the model to learn the domaininvariant features, which if given to a classifier, the classifier should not be able to predict whichdomain or market the features are originating from. In addition to the domain invariant features,we use the supervised training approach to learn domain or market specific features. To implementthe adversarial training between the forecasting model and the domain classifier, we use a gradientreversal layer proposed by Ganin et.al. .",
  "Dataset": "We train and evaluate our models forecasting capabilities using day ahead electricity prices frommajor power markets. Day ahead hourly electricity prices from the Nord Pool electricity market(NP), which corresponds to the Nordic countries exchange was taken as the target or unseen marketfor our experiments. The test period was from 1st January, 2018 to 24th December, 2018. One fullyear of test data was used to capture errors across all seasons. Hourly electricity price data fromthree different markets were considered when training the domain-generalized models. The first traindataset is from the Pennsylvania-New Jersey-Maryland (PJM) market in the United States, whichcontains data from 1st January, 2013 to 24th December, 2018. The remaining two market prices areobtained from the integrated European Power Exchange (EPEX). The Belgium (BE) and French (FR)market data spans from 9th January, 2011 to 31st December, 2016.",
  "Results": "To present a comprehensive set of results, we conduct a series of experiments considering the NordPool market as the test market. The dataset is split into training and test subsets as per the methoddefined earlier. The hyperparameters for the proposed model and the optimization settings areoptimized using a Bayesian optimization method. This method uses a tree-structured Parzen estimatorto explore the hyperparameter space . All the results are reported on the NP market as the unknownor new market in a zero-shot manner. For comparison, we also repeated the experiments with standard : This representative example shows some of the functions learned by the KAN networkwhen we do zero shot forecasting on the Nord Pool market, using France and Belgium as the primaryand secondary markets repsectively. N-BEATS architecture and the standard KAN architecture . presents a comparisonbetween the KAN, N-BEATS and the proposed model. For each set of experiments, we consider eachof the markets from the train set (FR, PJM and BE) as the primary market, and use the remainingmarkets from the train set as secondary. The values are averaged over different models, each timewith a different market as the secondary market. For all the cases, zero-shot forecasts were generatedfor the NP market prices. We observe an improvement of around 13% and 24% in accuracy for theproposed model compared to the N-BEATS and KAN model respectively. The performance of ourproposed model, in terms of forecasting errors, is within the same order of magnitude as reported inliterature . Furthermore, shows 24-hour ahead multi step forecast generated by our proposedmodel, where it can be observed that the N-BEATS model tends to produce a smoother forecast whilethe proposed model can leverage the flexibility of the spline curve to align with the shape of thedistribution. In a lot of real world applications, it is important that the model used for forecasting time seriesdata has a low inference time and is easy to scale on low resource environments. Moreover, it isimportant that the model is easy to understand. Since KAN uses smooth functions to approximate thetime series data, KAN based architectures make it easier for the users to interpret the forecast as opposed to the large foundation models whose inner workings are difficult to understand. shows a sample representation of the learned functions for our proposed multi layer KAN architecturewith Nord Pool as the test market.",
  "Conclusion": "In this paper, we present a domain adaptation framework which uses the Kolmogorov Arnold Networkwith a doubly residual structure as the backbone for forecasting electricity prices for new markets. Itbuilds on the N-BEATS like architecture with KAN at its core. Mainly composed of KAN layersthe architecture is relatively light weight and fast to optimize, and has better interpretability than theMLP based models. We propose an adversarial training with two market data to generate a domain-generalized model that can then be applied to forecast prices from unseen markets in a zero-shotmanner. We show the performance of the proposed method using a set of benchmark datasets fromthe electricity price forecasting domain and demonstrate that the proposed model outperforms thebaseline model for zero shot forecasting. Although, the current model can be directly applied forseveral domain adaptation tasks across markets we believe that there is scope to further improve themodel by incorporating external factors like weather parameters to augment the univariate features. Itwould be also interesting to extend the framework to allow multiple secondary markets to create amore generalized feature representation. Yuan Li, Jingwei Li, Chengbao Liu, and Jie Tan. Time series forecasting model based on domain adaptationand shared attention. In International Conference on Industrial, Engineering and Other Applications ofApplied Intelligent Systems, pages 215225. Springer, 2023.",
  "Ziming Liu, Yixuan Wang, Sachin Vaidya, Fabian Ruehle, James Halverson, Marin Soljacic, Thomas YHou, and Max Tegmark. KAN: Kolmogorov-Arnold Networks. arXiv preprint arXiv:2404.19756, 2024": "Yaroslav Ganin, Evgeniya Ustinova, Hana Ajakan, Pascal Germain, Hugo Larochelle, Franois Laviolette,Mario Marchand, and Victor Lempitsky. Domain-adversarial training of neural networks. The journal ofmachine learning research, 17(1):20962030, 2016. James Bergstra, Dan Yamins, David D Cox, et al. Hyperopt: A python library for optimizing the hyperparam-eters of machine learning algorithms. In Proceedings of the 12th Python in science conference, volume 13,page 20. Citeseer, 2013."
}