{
  "Abstract": "High-resolution gridded climate data are readily available from multiple sources,yet climate research and decision-making increasingly require country and region-specific climate information weighted by socio-economic factors. Moreover, thecurrent landscape of disparate data sources and inconsistent weighting method-ologies exacerbates the reproducibility crisis and undermines scientific integrity.To address these issues, we have developed a globally comprehensive dataset atboth country (GADM0) and region (GADM1) levels, encompassing various cli-mate indicators (precipitation, temperature, SPEI, wind gust). Our methodologyinvolves weighting gridded climate data by population density, night-time lightintensity, cropland area, and concurrent population count all proxies for socio-economic activity before aggregation. We process data from multiple sources,offering daily, monthly, and annual climate variables spanning from 1900 to 2023.A unified framework streamlines our preprocessing steps, and rigorous valida-tion against leading climate impact studies ensures data reliability. The resultingWeighted Climate Dataset is publicly accessible through an online dashboard at",
  "Background & Motivation": "Climate change is a major driver of economic and social challenges . Although research hasdocumented its impacts on agriculture , economic production , conflict , income inequality, mortality , and energy consumption , a critical data gap persists. Climate data are oftenavailable at high resolutions (daily or hourly) and gridded formats, while socio-economic data aretypically collected annually and associated with administrative units like regions or countries. To bridge this gap, researchers typically aggregate weather data to match the lower resolution of socio-economic data. However, this aggregation can be misleading if not done with care. Simply averagingweather data across a region can mask important spatial heterogeneity. For example, average summertemperatures in the Mojave Desert may be much higher than Los Angeles, but socio-economicactivity is concentrated in Los Angeles. So, labor productivity in California is likely more affected bytemperatures in Los Angeles than in the desert. Therefore, researchers are increasingly using spatiallyweighted climate data to account for the varying distribution of socio-economic activities within a",
  "region. Weighting schemes such as population density can be used to prioritize areas with highersocio-economic activity when averaging weather data": "Despite the benefits, replicating studies using weighted climate data can be difficult. The specificweighting procedures used are often poorly documented or absent entirely in existing research. Thislack of a transparent, standardized, documented, and open access source for spatially weighted climatedata can lead to biased results, as the choice of weighting methodology can significantly impactanalysis, hindering accurate and robust estimation of climate impacts . This paper, by extendinga previously published version , addresses this gap by introducing the Weighted Climate Dataset,a unified source of data that preprocesses and weights gridded climate data. We also provide auser-friendly interface at in order to exploreand download ready-to-use, spatially weighted climate variables at national and sub-national levelsfor the period 1900-2023. This promotes: Replicability: Improved documentation and transparency in data processing; Efficiency: Saves researchers time and resources by providing pre-processed data; Robustness: Encourages testing the sensitivity of estimates to weighting choices.",
  "Climate Data. We incorporate raw gridded climate data from four established datasets commonlyemployed in climate impact research: Climate Research Unit Time-Series (CRU TS v4.07),": "available from 1901 to 2022; Consejo Superior de Investigaciones Cientficas (CSIC v2.7),spanning 1901 to 2020; ECMWF Reanalysis v5 (ERA5), covering 1940 to 2023; and Universityof Delaware (UDEL v5.01), ranging from 1900 to 2017. CRU TS, UDEL, and CSIC offermonthly data at a spatial resolution of 0.5 0.5, whereas ERA5 provides data at a higher resolutionof 0.25 0.25. All sources provide monthly records of average temperature (in Celsius degrees,C) and total precipitation (in millimeters, mm), with the exception of CSIC, which uniquely offersan additional monthly climate variable: the Standardized Precipitation-Evapotranspiration Index, also known as SPEI (unit free). In addition to monthly data, ERA5 also provides records atthe temporal resolution of hours. We aggregate these hourly data into daily values. Specifically, wecalculate daily total precipitation (by taking the sum of hourly measurements), and average, minimum,and maximum temperature. Finally, ERA5 also provides 10-meter hourly wind speed measurements(measured in meters per second, m/s), which we aggregate into daily maximum wind gust. Socio-economic Data. To capture the spatial distribution of economic and human activity, weincorporate five weighting schemes based on socio-economic variables. First, population density dataare available from Columbia Universitys Gridded Population of the World v4 (GPWv4) , andmeasured at 0.25 and 0.5 spatial resolutions. To accurately represent population size, we multiplypopulation density by grid area. Second, night-time light data , measured in digital number values(DN) and originally available at a 30 arc-second spatial resolution (0.0083), are incorporated afteraveraging to 0.25 and 0.5 resolutions. Third, cropland data are available from the History Databaseof the Global Environment (HYDE) , version 3.2, and are measured in square kilometers. Thesedata are recorded at a spatial resolution of 5 arc-minutes (0.083), and are incorporated after averagingto 0.25 and 0.5 resolutions. Users can select population density, night-time light, or cropland asweighting factors, with base years of 2000, 2005, 2010, or 2015. Fourth, climate data can be weightedsolely by grid cell area, an option referred to as unweighted. Finally, for a dynamic approach, weprovide a concurrent weighting strategy where climate variables are weighted by population countsfrom the beginning of the respective decade. For instance, temperatures in 1907 are weighted usingpopulation data from 1900. Population counts are derived from HYDE v3.2 for 1900-2010 andGPW for 2020. Administrative Boundaries. We utilize two administrative levels from the Global AdministrativeAreas Database (GADM v4.1, released July 16, 2022) . The coarser GADM0 level correspondsto country boundaries, while the finer GADM1 level represents the largest subnational administrativeunits (e.g., states for the US).",
  "jJi ajfi,jwj,T xj,tjJi ajfi,jwj,T,(1)": "where Ji represents the set of grid cells intersecting unit i, fi,j is the fraction of grid j within unit i,aj is the area of grid j, and xj,t is the raw gridded climate value. Typically, the base year T is fixed,aligning with common practices in the literature . However, the concurrent weighting schemeuses a dynamic base year, setting T as the start of the decade containing t. In the unweighted case,wj,T equals 1 for all j and T. For cropland and concurrent weighting, the grid area term aj is set to 1. As an example of the aggregation strategy, shows three panels. The left and center panelsdisplay raw gridded data for night-time light intensity in 2015, and ERA5 average annual temperaturesin 2015 for the contiguous US, respectively. Night-time lights are chosen as the weighting variablein this example. , right panel, displays the resulting aggregation at GADM1 resolution andillustrates the output that users can retrieve from our dataset. In the Supplementary Material, aiming to support the reliability and effectiveness of our approach,we validate the quality of our dataset by comparing it with those employed in two influential climateeconometric exercises . Gridded night-light data Gridded temperature dataAggregated data Night-light intensity Temperature (C) Temperature (C) : Climate data weighting example for the US in 2015. The left panel shows raw griddednight-time light data. The middle panel displays raw gridded average temperature. The right panelpresents average temperature aggregated to the GADM1 level, weighted by night-time light intensity.",
  "Customization": "The Weighted Climate Dataset dashboard provides several ways to customize the aggregated data.Users can select specific time intervals and choose between daily, monthly, or annual frequencies.Notice that annual data are derived by aggregating daily or monthly values (e.g., summing monthlytotal precipitation). The SPEI is an exception, available only monthly due to its complex calculation. To analyze extreme weather events, users can also define absolute, relative, and cumulative thresholds.The dashboard, by exploiting daily data provided by ERA5, then calculates the frequency of daysexceeding these thresholds for each geographic unit, month, or year. For relative thresholds, per-centiles are calculated based on the historical distribution for each region or country. For cumulativethresholds, instead of computing the frequency, the dashboard provides the sum of the residual valuesthat exceed the threshold. Data can be downloaded from the dashboard in two different formats: the wide format has geographi-cal units as keys and values of a climate variable in different years as attributes; the long format hasgeographical units and years as keys, and the value of a climate variable as only attribute. Data canalso be downloaded in three different extensions (csv, json, and parquet).",
  "Discussion": "The Weighted Climate Dataset offers a valuable resource for the climate impact assessment com-munity, providing a standardized framework for evaluating and refining models and methodologies.By democratizing access to a comprehensive suite of datasets, we aim to propel research on thecomplex interplay between climate change and socio-economic dynamics. This resource allowsresearchers to further investigate the mechanisms through which climate variability and extremesinfluence economic growth, inequality, and other critical social factors. Ultimately, by enhancing ourunderstanding of these relationships, the Weighted Climate Dataset can contribute to more informeddecision-making, effective policy development, and public engagement in addressing the challengesposed by climate change.",
  "Guy J Abel, Michael Brottrager, Jesus Crespo Cuaresma, and Raya Muttarak. Climate, conflictand forced migration. Global environmental change, 54:239249, 2019": "Elisa Palagi, Matteo Coronese, Francesco Lamperti, and Andrea Roventini. Climate changeand the nonlinear impact of precipitation anomalies on income inequality. Proceedings of theNational Academy of Sciences, 119(43):e2203595119, 2022. Tamma Carleton, Amir Jina, Michael Delgado, Michael Greenstone, Trevor Houser, SolomonHsiang, Andrew Hultgren, Robert E Kopp, Kelly E McCusker, Ishan Nath, James Rising,Ashwin Rode, Hee Kwon Seo, Arvid Viaene, Jiacan Yuan, and Alice Tianbo Zhang. Valuing theglobal mortality consequences of climate change accounting for adaptation costs and benefits.The Quarterly Journal of Economics, 137(4):20372105, 04 2022.",
  "Ian Harris, Timothy J Osborn, Phil Jones, and David Lister. Version 4 of the CRU TS monthlyhigh-resolution gridded multivariate climate dataset. Scientific data, 7(1):109, 2020": "Sergio M Vicente-Serrano, Santiago Beguera, Juan I Lpez-Moreno, Marta Angulo, and AhmedEl Kenawy. A new global 0.5 gridded dataset (19012006) of a multiscalar drought index:Comparison with current drought index datasets based on the Palmer drought severity index.Journal of Hydrometeorology, 11(4):10331043, 2010. Hans Hersbach, Bill Bell, Paul Berrisford, Shoji Hirahara, Andrs Hornyi, Joaqun Muoz-Sabater, Julien Nicolas, Carole Peubey, Raluca Radu, Dinand Schepers, et al. The ERA5 globalreanalysis. Quarterly Journal of the Royal Meteorological Society, 146(730):19992049, 2020.",
  "Cort J Willmott and Kenji Matsuura. Terrestrial air temperature and precipitation: Monthly andannual time series (1950-1996). 2000": "Sergio M Vicente-Serrano, Santiago Beguera, and Juan I Lpez-Moreno. A multiscalar droughtindex sensitive to global warming: The standardized precipitation evapotranspiration index.Journal of Climate, 23(7):16961718, 2010. Erin Doxsey-Whitfield, Kytt MacManus, Susana B Adamo, Linda Pistolesi, John Squires, OlenaBorkovska, and Sandra R Baptista. Taking advantage of the improved availability of census data:A first look at the gridded population of the world, version 4. Papers in Applied Geography,1(3):226234, 2015.",
  "Thomas C Peterson and Russell S Vose. An overview of the global historical climatologynetwork temperature database. Bulletin of the American Meteorological Society, 78(12):28372850, 1997": "Jay H Lawrimore, Matthew J Menne, Byron E Gleason, Claude N Williams, David B Wuertz,Russell S Vose, and Jared Rennie. An overview of the global historical climatology networkmonthly mean temperature data set, version 3. Journal of Geophysical Research: Atmospheres,116(D19), 2011. Matthew J Menne, Imke Durre, Russell S Vose, Byron E Gleason, and Tamara G Houston. Anoverview of the global historical climatology network-daily database. Journal of atmosphericand oceanic technology, 29(7):897910, 2012.",
  "A.1Climate data": "CRU TS utilizes raw meteorological data collected from a vast network of weather stations. Monthlydeviations from average climatic conditions, known as anomalies, are calculated and subsequentlyinterpolated using a method called Angular-Distance Weighting (ADW) . ADW is employedto account for the varying size of grid cells on the spherical Earth, specifically by considering thecosine of the latitude for each grid cell. This cosine value serves as a proxy for the change in grid cellarea with respect to latitude. It is recognized that grid cells near the equator encompass larger areascompared to those closer to the poles. CSIC leverages the CRU TS dataset to generate the Standardized Precipitation EvapotranspirationIndex (SPEI), a drought index that comprehensively assesses both the severity and duration ofdrought conditions by incorporating information on precipitation and evapotranspiration. This indexrepresents a standardized adaptation of the widely used Palmer Drought Severity Index (PDSI), whichconsiders the combined influences of precipitation and temperature on water availability. Due to itsmulti-scalar nature, the SPEI can distinguish between different types of drought; for the present study,we concentrate on the one-month timescale to examine fluctuations in headwater levels. ERA5 is a climate dataset that incorporates data collected by radiosondes, battery-powered instru-ments carried aloft by weather balloons to measure atmospheric parameters such as temperature, windspeed, and humidity. The data transmitted from these radiosondes to ground stations are integratedinto the ERA5 dataset alongside observations from satellites and surface-based instruments throughthe utilization of numerical weather models, resulting in a comprehensive representation of the Earthsclimate system . As a unique reanalysis product, ERA5 combines climate models with historicalobservations to deliver (i) consistent data over time and (ii) enhanced accuracy in grid areas withoutmeasurement stations.",
  "Finally, UDEL provides gridded climate estimates primarily based on station records obtainedfrom various publicly accessible sources (e.g., Global Historical Climatology Network dataset ,": "Before correction After correction Night-light intensity : Correction of auroras and other noise sources in the night-time light data for the year 2015.The left plot shows night-time light data before correction; the right plot shows the same data aftercorrection, which consists of setting to 0 the values in the grids whose digital number values are lessthan 30. Global Historical Climatology Network Monthly dataset , Daily Global Historical ClimatologyNetwork archive ). The interpolation process is carried out using the Shepard spatial interpolationalgorithm , modified to accommodate the near-spherical shape of the Earth.",
  "A.2Socio-economic data": "Night-time light and cropland data require preprocessing prior to analysis. Night-time light dataconsists of digital number (DN) values, a standardized measure of pixel brightness ranging from 0 to63. Initially available at a high-resolution of 30 arc-seconds (0.0083), these data were aggregated tomatch the coarser resolutions of our gridded climate data (0.25 and 0.5). This was accomplishedby calculating the mean DN value for blocks of 900 (3030) and 3600 (6060) most upper-left cellsin our coordinate system. We then iterate this procedure with the adjacent blocks of cells to obtainall gridded values of the night-light data for the coarser resolution. It is important to note that theharmonized VIIRS-DMSP dataset, particularly for the year 2015, contained noise from sources suchas auroras and transient phenomena (e.g., boat lights, fires) as illustrated in (left panel). Toaddress this, following the approach of , DN values below 30 were set to zero prior to aggregation.The impact of this correction is visualized in (right panel) for the year 2015. Cropland data quantify the area, in square kilometers, dedicated to arable land and permanent cropswithin each grid cell. Originally recorded at a spatial resolution of 5 arc-minutes (0.083), these datawere aligned with the coarser resolutions of our climate datasets through an aggregation processidentical to that applied to the night-time light data.",
  "BFurther details on aggregation": "We observed inconsistencies in grid resolution across different datasets. ERA5 data are providedin a NetCDF file with a 7211440 grid, spanning from 180.125W to 179.875E and 90.125S to90.125N, at a 15 arc-minute resolution. In contrast, socio-economic data at 0.25 utilize a 7201440grid, extending from 180W to 180E and 90S to 90N. To align ERA5 data with socio-economicvariables for weighting and analysis, we employed bilinear interpolation to resample the ERA5weight grids. This process is visually illustrated in , which compares the grid structures ofthe two data sources. This resampling procedure was applied consistently when combining ERA5climate variables with population density, night-time light, cropland, and concurrent population countdata.",
  "+ + +": ": Stylized illustration of the resampling process applied to align weighting grids (populationdensity, night-time light, cropland, and concurrent population count) with ERA5 climate variablegrids. A slight spatial mismatch of 0.125 exists between the grids in both longitude and latitude. Toensure accurate weighting, the weighting grids were resampled using a simple averaging method ofoverlapping grid cell values. Burke et al. (2015)Kotz et al. (2022)Burke et al. (2015)Kotz et al. (2022) 010 20 30 Our estimates (C) Previous estimates (C) 15 015 30 Our estimates (C) 0.0 1.5 3.0 4.5Our estimates (m) 0.0 1.5 3.0 4.5 Previous estimates (m) Our estimates (m) : Comparison of weighted and/or aggregated average yearly temperature (degrees Celsius)and annual total precipitation (meters) variables in our datasets against data used in (countries)and (sub-national regions). Data points falling on the main diagonal indicate strong agreementbetween the estimates. Both climate and socioeconomic datasets exhibited sporadic missing values. To maintain data integrity,we adopted a conservative approach. When accurate climate variable weighting was hindered dueto factors such as zero-valued weights or missing climate data within specific geographic units, weopted to retain the missing values (NAs) rather than imputing estimates.",
  "CValidation": "This section validates our dataset against those used in influential climate econometric studies .By comparing our weighting procedures to theirs, we assess the reliability and effectiveness of ourapproach. To ensure a rigorous validation, we replicated the exact data sources used in these studies, includingolder versions of climate and economic data. This enables us to verify the accuracy and robustness ofour data processing pipeline and to objectively evaluate the quality and consistency of our estimates. utilized UDEL v3.01 for precipitation and temperature data, and GPW v3 at 0.50 griddedpopulation data for the year 2000. While the specific source and version of administrative boundariesare unspecified, their shapefiles are publicly accessible. In contrast, employed 0.25 griddedERA5 precipitation and temperature data without applying any weighting, using GADM1 v3.6 forspatial aggregation in their primary analysis. presents scatterplots comparing our average temperature and rainfall estimates with thosefrom the original studies by and (SPEI, wind gust, and other summary statistics of temperaturedata were not used in either study). Data points aligned along the main diagonal of these plots indicatestrong agreement between the estimates. Our analysis reveals a high degree of concordance betweenour estimates and the weighted or aggregated data used by previous researchers across all studyyears. This supports the quality and reliability of our dataset and methodologies. However, minordiscrepancies were observed. The first panel in highlights two key differences between ourestimates and those of . Lower-left quadrant points represent negative temperatures in Greenland,where our estimates are exceeded by the ones of . Conversely, Bhutan exhibits slightly higherestimates in our data compared to . These discrepancies primarily stem from the weighting scheme,particularly the concentrated population density in specific regions of Greenland and Bhutan."
}