{
  "Abstract": "We present a study that explores the role of user-centred design in developingGenerative AI (GenAI) tools for music composition. Through semi-structured in-terviews with professional composers, we gathered insights on a novel generativemodel for creating variations, highlighting concerns around trust, transparency,and ethical design. The ndings helped form a feedback loop, guiding improve-ments to the model that emphasised traceability, transparency and explainability.They also revealed new areas for innovation, including novel features for controlla-bility and research questions on the ethical and practical implementation of GenAImodels.",
  "Introduction": "Generative AI (GenAI) in creative elds faces challenges due to a divide between human-centric andmodel-centric research approaches, reecting a broader disconnect between AI researchers and cre-ative professionals overall, which we highlight in the music domain . Concerns about trust,ethics, and usability stress a need for interdisciplinary dialogue, which can be used to help guide thedevelopment of GenAI tools that meet real-world needs. To address this in the music domain, weconducted a qualitative study with professional composers, exploring how generative music modelscan serve as creative aids in music composition. Through semi-structured interviews, composers in-teracted with a baseline transformer model designed to create musical variations , providingfeedback on outputs, evaluation metrics, transparency, and ethical concerns. This approach estab-lished a feedback loop that helps to inform GenAI tool design and foundational research questions,aligning AI development with the practical and ethical needs of end-users. Although centred onmusic, our ndings offer valuable insights for broader applications of GenAI in creative contexts.",
  "Methodology": "Our methodology employed a User-Centred and Participatory Design-based approach . Four professional composers participated in semi-structured interviews, where they were intro-duced to a novel music task, Music Overpainting, using a transformer model designed to generatejazz piano variations from basic melodies and chords . Adapted from the music transformerarchitecture proposed by Huang et al. , this model serves as a task-specic baseline for MusicOverpainting. Composers could listen to the models inputs and outputs as much as needed to fa-miliarise themselves with its capabilities. We asked targeted questions for their opinions on how todene a variation, the success of the model, trust and ethical concerns, user integration and control-lability aspects as detailed in Appendix A.1. These questions helped to address critical aspects of",
  "Creativity & Generative AI Workshop, 38th Conference on Neural Information Processing Systems (NeurIPS2024)": "the models development that were not fully covered by existing literature, aiming to ll knowledgegaps and reduce researcher bias, particularly given the novelty of the generative task. Responseswere analysed by one coder, using a reexive thematic analysis-inspired approach . To min-imise biases, the coder engaged in regular reexive practices, including keeping a reective journaland self-reecting on biases that they brought in as a researcher. Additionally, we asked the com-posers to complete a short questionnaire based on , collecting demographics and informationon their musical education and experience as seen in Appendix A.5. While the small sample sizeand focus on a specic generative task lead to context-specic ndings that may not generalise tobroader creative communities or demographics, this study serves as an initial exploration that un-derscores the value of engaging directly with end-users to identify potential sources of researcherbias and enrich GenAI model development, with insights that may otherwise be overlooked. Asa preliminary qualitative study, future research could build upon these ndings to enhance gener-alisability by expanding the outputs to additional musical genres and involving a larger and morediverse participant pool.",
  "Findings and Discussion": "The key ndings from engaging with professional composers, along with the considerations thatinuenced the models development, are summarised in . This table highlights the mainthemes identied during the study, the specic feedback from composers (see example transcriptsin Appendix A.2), and the resulting design decisions and adjustments made to the model.",
  "Denition of VariationComposers dened variations as main-taining a recognisable connection to thesource, regardless of transformation": "Helped to further dene the novel gen-erative task. Reframed evaluation met-rics to focus on traceability, emphasis-ing practical relevance over objectivity.Traceability and Trans-parencyComposers valued transparency in howvariations evolve from the source mate-rial. Changes made to the sampling tech-nique,enabling adjustments to themodel and user interface (UI) to visu-ally represent transformation steps.Ethical and Trust Con-cernsConcerns over usable data i.e. trainedwith consent and sources were trace-able.",
  "Inuenced decisions on model architec-ture and parameter size, sampling tech-niques, and UI considerations for an ini-tially simple design that later advances": "We used composer feedback to improve the same generative variation model introduced in the study.Key concerns around trust, transparency, and ethical design were raised. The ndings helped to clar-ify the generative task which had been dened through researcher bias, and exposed gaps in existingevaluation metrics for new creative tasks, revealing a need for subjective and objective criteria thatreect real-world creative practices. Feedback also emphasised traceability around data collectionand model outputs, and explainability as essential for building trust and aligning AI outputs withartistic intentions . While many of the themes identied in align with domain-general principles from elds likeHuman-Centred AI (HCAI) such as interpretability, explainability, and data transparency the direct feedback from composers added a complementary, application-specic perspective, andhelped to reveal how the straightforward application of domain-general principles may overlook sub-tle requirements unique to certain creative tasks. For instance, composers expressed a strong desirefor traceability, viewing it not only as a means to track how variations related to, and evolved fromthe source material but also as a way to support their creative choices. Some suggested that having the ability to visually and interactively follow how the model transforms the output, as a transparenttraceable process, could help them better understand and select variations that align with their artis-tic intentions, providing them with greater control over their creative decisions. Likewise, the callfor controllable and lightweight models reected not only a general design preference but a specicneed for adaptable tools that t seamlessly into the composers iterative workows. Additionally,the study identied new areas to innovate, including the need for novel controllable features. Re-search questions on how features could be implemented emerged, including approaches to modelsampling and tuning. Our collaboration helped reduce researcher bias and revealed previously unconsidered user assump-tions about creativity and AIs role as a collaborative partner. It highlighted the need for adapt-able, user-responsive AI systems, and encouraged researchers to shift from model-centric to human-centric approaches that prioritise real-world applicability. By incorporating these insights, we canrene model features and interface elements to align AI capabilities with artistic workows, em-phasising a balanced approach where technical functionality is grounded in practical relevance forcreative end-users. This in turn fostered interdisciplinary mutual learning by involving composersdirectly in the development process. Maintaining a continuous feedback loop with creative profes-sionals is crucial, ensuring that AI evolves to meet user needs rather than requiring users to adapt tothe AI.",
  "Conclusion and Future Work": "Looking ahead, extending this approach to other GenAI domains can lay the groundwork for inter-disciplinary collaborations that prioritise user-centred AI design. We urge the research communityto adopt continuous engagement with end-users, explore innovative features, and focus on designingAI systems that genuinely support and enhance artistic workows, striking a balance between AI asa creative agent, the needs of the creative community, and the evolving technical landscape of AIdevelopment.",
  "H. Beyer and K. Holtzblatt. Contextual design: dening customer-centered systems. MorganKaufmann, San Francisco, Calif, 1998. ISBN 978-1-55860-411-7": "V. Braun and V. Clarke. (Mis)conceptualising themes, thematic analysis, and other problemswith Fugard and Potts (2015) sample-size tool for thematic analysis. International Journalof Social Research Methodology, 19(6), June 2016. ISSN 1364-5579, 1464-5300. doi: 10.1080/13645579.2016.1195588. URL Publisher: Taylor& Francis (Routledge). V. Braun, V. Clarke, and D. Gray, editors.Collecting Qualitative Data:A Prac-tical Guide to Textual, Media and Virtual Techniques.Cambridge University Press,Cambridge, 2017.ISBN 978-1-107-05497-4.doi:10.1017/9781107295094.URL N. Bryan-Kinns, B. Banar, C. Ford, C. Reed, Y. Zhang, S. Colton, J. Armitage, and N. .-e. A.A. f. D. a. D. Workshop. Exploring XAI for the Arts: Explaining Latent Space in GenerativeMusic, Dec. 2022. URL",
  "R. Fiebrink and B. Caramiaux. The Machine Learning Algorithm as Creative Musical Tool.In The Oxford Handbook of Algorithmic Music. Oxford Handbooks, online edition, Feb. 2018.URL": "C.-Z. A. Huang, A. Vaswani,J. Uszkoreit, I. Simon, C. Hawthorne, N. Shazeer,A.M.Dai,M.D.Hoffman,M.Dinculescu,andD.Eck.Musictrans-former.In International Conference on Learning Representations,2019.URL T. Hunter, P. Worthy, B. Matthews, and S. Viller. Using Participatory Design in the Devel-opment of a New Musical Interface: Understanding Musicians Needs beyond Usability. InProceedings of the 14th International Audio Mostly Conference: A Journey in Sound, pages268271, Nottingham United Kingdom, Sept. 2019. ACM. ISBN 978-1-4503-7297-8. doi: 10.1145/3356590.3356635. URL",
  "M. J. Muller and S. Kuhn.Participatory Design.Communications of the ACM,36(6):2428, June 1993.ISSN 0001-0782.doi:10.1145/153571.255960.URL": "D. Mllensiefen, B. Gingras, J. Musil, and L. Stewart.Measuring the facets of musical-ity: The Goldsmiths Musical Sophistication Index (Gold-MSI). Personality and IndividualDifferences, 60:S35, Apr. 2014. ISSN 0191-8869. doi: 10.1016/j.paid.2013.07.081. URL M. Newman, L. Morris, and J. H. Lee.HUMAN-AI Music Creation: Understanding theperceptions and experiences of music creators for ethical and productive collaboration. InProceedings of the 24th International Society for Music Information Retrieval Conference,Nov. 2023. URL",
  "A.1Questions": "Participants were asked fteen semi-structured questions designed to encourage open dialogue andfacilitate in-depth discussions. The semi-structured format allowed participants to freely expresstheir thoughts and opinions, fostering a conversational environment. The questions focused on theparticipants understanding of variations in music, their perceptions of AI-generated outputs, andpotential improvements for AI tools in creative workows.",
  "A.2Transcripts": "This section provides a selection of transcripts of verbatim responses to questions from interviewsconducted with participants. Each participant is labelled anonymously (P01, P02, etc.). The discus-sions focused on the denition of variations, their impressions of the AI model, and its potential usein music composition. Q: How would you dene a variation in the context of music?P01: I dont really know. I dont really know how to describe what a variation of some-thing would be. Like if something is a certain way... I dont know how youd... Howwould you describe like what the variation is? Variation... something that exists and isrecognisably the same from the same thing but... or has a recognisable idiom or stylisticsimilarity to something else. Because the thing is a variation can be anything from onenote changing to something almost completely absent from the original idea.Interviewer: So there are many different aspects that could be considered varied?P01: Yes. So its not just the notes not just the harmonies not just the rhythm. Yeah avariation... How close to the original idea it can be... Its a really tricky denition I think.What is a variation? Because it doesnt even necessarily have to be recognisably similarto the original. It can be something completely absent. And then you can say \"Well its a variation of this because theres one tiny thing about it which has a connection to theoriginal.\"Interviewer: So do you think as long as it has a connection to the original?P01: But I mean theres denitely an argument that even something that doesnt have anyconnection to the original... You could say its a variation because you can trace back tendifferent transformations youve gone through to get to this point. But you started at anoriginal position but youve gone through ten different iterations to get to the variation.But then when you look at the variation it might be completely different to the original.P02: I think I would say a variation in the context of music is something that has somesort of core elements of the thing that it is varying but changes it in a way that retainssome reference to it but introduces some new ideas. I understand that some people mightbe like \"Oh thats... it just needs to be a variation and is entirely derived from it.\" But Ithink theres nothing wrong with introducing new ideas in a variation so long as there isa degree of reference to the original one.P04: Oh! Well, I mean... its just... A repetition. The same thing, but with somethingthats different.P03: Thats a good question. Its quite... I feel... like a jazzy technical term I shouldreally know and I dont. No no just in your own words as a composer. Like adapt somedenition for it but I suppose... yeah I guess like an alternative way of playing somethingor like a different... A reinterpretation or like... Yeah I dont know. My denitions like...everything thats springing to mind is about like kind of interpretation or about havingsome sort of individual like import or transmutation of something. Does that make sense? Q: Can you explain what you found successful or unsuccessful about the variations?P01: I mean if were using this as a kind of context the point is can we trace whatsactually been done to create these examples? If we cant then I would say theyre notsuccessful variations of the original idea. If there is a path in which they have beenforged... If you know what I mean from the original... then I would say...P01: Like I couldnt necessarily say how the model infers to create those variations. Butin terms of if you were to just listen to it... yeah maybe without the traceability aspect...I dont know. Yeah without the traceability you could sort of infer theres some kind ofsimilarity. But I think possibly this is an area where... I dont know whether its all AImodels but I think there needs to be a kind of rigour put back into analysing where anidea has come from. And I dont know how possible that is to do with AI models. Itcomes down to the same thing of... Theres a certain randomness to the output that youdont necessarily have control over. That worries me slightly because I could not tell youthat those are good variations or bad variations because I cant say whether they are...Other then you know a eeting resemblance that you might slightly hear. But theyrecompletely rhythmically harmonically melodically... melodically completely removedfrom the original ideas as far as I can hear myself.Interviewer: So theres no sort of relation at all?P01: Not that I can hear myself but I would be interested if there was some kind ofbreakdown of how it got to those ideas. But I dont know how possible that would be toget.P02: Even though the rst variation was slower I think that harmonically it felt closer tothe original. The chords were sort of closer and it had a similar tonality to it. The secondone started to introduce a lot of leading notes and chromatic transitions between themwhich were very much not present in the rst one. I can understand why some might saythat ts a variation but maybe that was a bit too much of a variation in my mind.P03: Like... I suppose... they felt... I suppose rst what I found about them is they feltkind of... like a little bit less intentional or like a bit less... But maybe this is my humanbias but they felt less intentional like with less sort of direction or something. But thenthe ip side of that was what I kind of enjoyed about them was that they were... they werekind of rogue. Like I dont think they would have been... you know I dont know muchlike the variations I would have come up with and that is kind of interesting and a goodthing you know what I mean?",
  "Q: Would you consider using a model like this in your music creation process?": "P01: I think... It would need to be more predictable and more... You know you had thecontrol over it to actually be related to the original idea. So at the very basic level if itwas at the same tempo and time signature that would be one step towards getting closer.If it had fragments of the original melody that would be another step to being closer. Ican see theres like a eeting harmonic resemblance but even the harmony seemed verynon-functional in the examples. If it had all those things if it was just honed enough thatyou could have control over those factors I think it could be potentially useful.P02: Yeah denitely. I think that particularly because a lot of what we do is... the kind ofmodel that my music tends to take is very much ABA. So if Ive written the A sectionand then Im like \"Play me a B section\" or \"Help me write a B section\" I think thatwould be really helpful.P03: Yeah I mean Im not sure what the application would be for me. But Id be intriguedto try something that was kind of similar and work with it. Yeah because I suppose... Imlike... Again its kind of like this wrongness thing or something that always seems tocome back a lot in this chat. Like the... Ive generally leaned towards... Cause this modelis dealing with MIDI data rather than audio data. From the examples Ive heard in termsof applicability to my own work I felt like models that deal with audio Ive generallyfound more interesting because they produced weirder and kind of shittier results. Q: What specic features or controls would be most important to you in a user interface forthis model?P01: Well I dont really know how its functioning. Maybe a slider of how far away fromthe original idea it gets and then you could vary the metric variability the tempo variabilitythe rhythmic variability... Yeah maybe those are sliders. Like very basic that you couldmess around with a little bit and see how far away from it you could get.P04: Well hmm. I think my favourite plugins kind of have a multi-tier thing that itslike... were gonna show you just like macros rst so you dont lose your brains and thenonce you come to grips with whats happening here then well show you whats under thehood.P03: Yeah I mean I would denitely be into having lots of sliders to slide around andgure out whats... I like the idea of being able to tweak your weights inside the modeland being able to turn... I think being able to mess with the weights and produce... I wouldreally want that to have enough range that you could pull it into the state of wrongness orextremes. I love the idea of being able to pull it really dissonant or really consonant orreally far or close from the original. Theyre quite nebulous ideas even...",
  "Predictability and FamiliarityMaintaining a degree of predictability in outputs to ensure theyalign with the users expectations and creative intent.4": "A.4Consent and Risk FormsParticipants were informed about the study, its purpose, and their rights, including voluntary partic-ipation, the ability to withdraw at any time, and the secure, anonymous handling of their data. Theconsent form outlined the scope of data collection, including screen, audio, and video recordings,and highlighted the data protection measures in place. Participants were required to acknowledgeeach statement before agreeing to take part in the study. A section from the participant informationform on risks is also included below.",
  "Principal Investigator: Eleanor Row": "Thank you for your interest in this research. Should you wish to participate in the study, pleaseconsider the following statements. Before signing the consent form, you should initial all or any ofthe statements that you agree with. Your signature conrms that you are willing to participate in thisresearch, however, you are reminded that you are free to withdraw your participation at any time.",
  "Ethics of Research Committee Ref: QMERC20.565.DSEECS23.058": "Risk assessment: Both the observation and interview sessions will require your dedicated time.While we prioritise your privacy and anonymity, sharing your screen and photographs of workspaceinvolves some level of exposure. Precautions will be taken to ensure your anonymity. Remember,you always have the choice to opt-out or restrict any part of the process if it makes you feel uneasy.Possible technical issues with Zoom or other tools used during the study might affect the studyexperience.",
  "StatementInitials": "1. I conrm that I have read the Participant Information Sheet dated (retracted) version 1.01for the above study; or it has been read to me. I have had the opportunity to consider theinformation, ask questions and have had these answered satisfactorily.2. I understand that my participation is voluntary and that I am free to stop taking part in thestudy at any time without giving any reason and without my rights being affected.3. I understand that my data will be accessed by the principal investigator Eleanor Row.4. I understand that collected data is completely anonymous and information that I have pro-vided cannot be withdrawn after submission.5. I understand that my data will be securely stored in the United Kingdom, and in accordancewith the data protection guidelines of Queen Mary University of London for 5 years in fullyanonymous form.6. I understand that the information collected about me will be used to support other researchin the future, and it may be shared in anonymous form with other researchers.7. I understand that my shared screen will be recorded and that my audio and video will also berecorded via Zoom.8. I agree to take part in the above study. Participants should read the QMUL privacy notice for research participants, which contains impor-tant information about your personal data and your rights in this respect. If you have any questionsrelating to data protection, please contact the Data Protection Ofcer. A.5Questionnaire ResponsesThis appendix provides a detailed summary of the responses collected from the participant ques-tionnaire. The questionnaire was designed to gather demographic information, and information oncomposers musical backgrounds and experiences with questions stemming from Goldsmiths Mu-sical Sophistication Index (Gold MSI) .",
  "QuestionResponsesDetails": "Age25-34All participants were in the 25-34age range.EthnicityWhite, Mixed/Multiple Ethnic GroupsMajority identied as White, withone identifying as Mixed/MultipleEthnic Groups.Sexual OrientationHeterosexual (straight), Prefer not to an-swer, Queer, Homosexual (lesbian orgay) Participants expressed varied sexualorientations, including Queer andHeterosexual.Gender IdentityMan,Genderqueer/genderuid,WomanParticipantsidentiedprimarilyas men, with one identifying asa woman andanotheras gen-derqueer/gender uid.Disability StatusNo, YesOne participant reported having adisability.OccupationComposer, AV Technician, Tutor, PhDStudentMajority were composers,withother roles including AV Technicianand Tutor.HighestEducationalQualicationPostgraduate degree, Undergraduate de-greeMost participants had postgraduatequalications, with one still pursu-ing education.HighestQualicationExpected(ifstillineducation)",
  "QuestionResponseDetails": "Complimented for mu-sical talentsNeither Agree nor Disagree, Disagree,Completely DisagreeParticipants mostly did not feelrecognised for their musical talents.Consider as a musicianStrongly Disagree, Neither Agree norDisagree, Disagree, Completely Dis-agree Most participants did not considerthemselves musicians, with varyingdegrees of disagreement.Years of regular prac-tice4-5, 2, 0Ranged from no regular practice toup to 5 years of daily practice.Hours practised daily5 or more, 1, 3-4, 1Practice ranged from an hour a dayto over 5 hours at peak interest.Instruments played3, 2, 3, 4Participants played multiple instru-ments, reecting diverse musicalbackgrounds.Listening time1-2 hrs, 15-30 min, 4 hrs or more, 15-30minVaried listening habits from mini-mal to extensive daily music listen-ing.Best instrumentPiano, Voice, Violin, Piano/KeysMain instruments varied widelyamong participants, showing differ-ent primary musical skills.Years of formal training(Music Theory)0, 4-6, 2, 0Experience in music theory rangedfrom none to several years.Years of formal training(Instrument)7 or more, 4-6, 1, 4-6Participants had varying lengths offormal instrument training, somewith extensive experience.Years of formal training(Composition)4-6, 4-6, 4-6, 0Most had some composition train-ing, with one participant havingnone.Engagement frequencyEverydayAll participants reported daily en-gagement in musical activities.Main musical genreClassical, Other, Rock/Pop, Rock/PopParticipants musical preferencesspanned all the genres listed.",
  "NeurIPS Paper Checklist": "1. ClaimsQuestion: Do the main claims made in the abstract and introduction accurately reect thepapers contributions and scope?Answer: [Yes]Justication: The abstract and introduction reect the main contributions of the paper - astudy on user-centred design that emphasises the importance of composer feedback and thebroader implications for AI in the creative elds.Guidelines: The answer NA means that the abstract and introduction do not include the claimsmade in the paper. The abstract and/or introduction should clearly state the claims made, including thecontributions made in the paper and important assumptions and limitations. A No orNA answer to this question will not be perceived well by the reviewers. The claims made should match theoretical and experimental results, and reect howmuch the results can be expected to generalise to other settings. It is ne to include aspirational goals as motivation as long as it is clear that thesegoals are not attained by the paper.2. LimitationsQuestion: Does the paper discuss the limitations of the work performed by the authors?Answer: [No]Justication: Yes and No. The paper tries to address some of the limitations of the workwithin the methodology section (including the sample size and context-specic ndings),but due to restrictions of the page limit, it is not able to include all of the limitations of thepaper.Guidelines: The answer NA means that the paper has no limitation while the answer No meansthat the paper has limitations, but those are not discussed in the paper. The authors are encouraged to create a separate \"Limitations\" section in their paper. The paper should point out any strong assumptions and how robust the results are toviolations of these assumptions (e.g., independence assumptions, noiseless settings,model well-specication, asymptotic approximations only holding locally). The au-thors should reect on how these assumptions might be violated in practice and whatthe implications would be. The authors should reect on the scope of the claims made, e.g., if the approach wasonly tested on a few datasets or with a few runs. In general, empirical results oftendepend on implicit assumptions, which should be articulated. The authors should reect on the factors that inuence the performance of the ap-proach. For example, a facial recognition algorithm may perform poorly when imageresolution is low or images are taken in low lighting. Or a speech-to-text system mightnot be used reliably to provide closed captions for online lectures because it fails tohandle technical jargon. The authors should discuss the computational efciency of the proposed algorithmsand how they scale with dataset size. If applicable, the authors should discuss possible limitations of their approach to ad-dress problems of privacy and fairness. While the authors might fear that complete honesty about limitations might be used byreviewers as grounds for rejection, a worse outcome might be that reviewers discoverlimitations that arent acknowledged in the paper. The authors should use their bestjudgment and recognize that individual actions in favor of transparency play an impor-tant role in developing norms that preserve the integrity of the community. Reviewerswill be specically instructed to not penalize honesty concerning limitations.3. Theory Assumptions and Proofs Question: For each theoretical result, does the paper provide the full set of assumptions anda complete (and correct) proof?Answer: [NA]Justication: The paper does not include theoretical results.Guidelines: The answer NA means that the paper does not include theoretical results. All the theorems, formulas, and proofs in the paper should be numbered and cross-referenced. All assumptions should be clearly stated or referenced in the statement of any theo-rems. The proofs can either appear in the main paper or the supplemental material, but ifthey appear in the supplemental material, the authors are encouraged to provide ashort proof sketch to provide intuition. Inversely, any informal proof provided in the core of the paper should be comple-mented by formal proofs provided in appendix or supplemental material. Theorems and Lemmas that the proof relies upon should be properly referenced.4. Experimental Result ReproducibilityQuestion: Does the paper fully disclose all the information needed to reproduce the mainexperimental results of the paper to the extent that it affects the main claims and/or conclu-sions of the paper (regardless of whether the code and data are provided or not)?Answer: [NA]Justication: The paper does not include experiments.Guidelines: The answer NA means that the paper does not include experiments. If the paper includes experiments, a No answer to this question will not be perceivedwell by the reviewers: Making the paper reproducible is important, regardless ofwhether the code and data are provided or not. If the contribution is a dataset and/or model, the authors should describe the stepstaken to make their results reproducible or veriable. Depending on the contribution, reproducibility can be accomplished in various ways.For example, if the contribution is a novel architecture, describing the architecturefully might sufce, or if the contribution is a specic model and empirical evaluation,it may be necessary to either make it possible for others to replicate the model withthe same dataset, or provide access to the model. In general. releasing code and datais often one good way to accomplish this, but reproducibility can also be provided viadetailed instructions for how to replicate the results, access to a hosted model (e.g., inthe case of a large language model), releasing of a model checkpoint, or other meansthat are appropriate to the research performed. While NeurIPS does not require releasing code, the conference does require all sub-missions to provide some reasonable avenue for reproducibility, which may dependon the nature of the contribution. For example(a) If the contribution is primarily a new algorithm, the paper should make it clearhow to reproduce that algorithm.(b) If the contribution is primarily a new model architecture, the paper should describethe architecture clearly and fully.(c) If the contribution is a new model (e.g., a large language model), then there shouldeither be a way to access this model for reproducing the results or a way to re-produce the model (e.g., with an open-source dataset or instructions for how toconstruct the dataset).(d) We recognize that reproducibility may be tricky in some cases, in which case au-thors are welcome to describe the particular way they provide for reproducibility.In the case of closed-source models, it may be that access to the model is limited insome way (e.g., to registered users), but it should be possible for other researchersto have some path to reproducing or verifying the results.",
  "Guidelines:": "The answer NA means that the paper poses no such risks. Released models that have a high risk for misuse or dual-use should be released withnecessary safeguards to allow for controlled use of the model, for example by re-quiring that users adhere to usage guidelines or restrictions to access the model orimplementing safety lters. Datasets that have been scraped from the Internet could pose safety risks. The authorsshould describe how they avoided releasing unsafe images. We recognize that providing effective safeguards is challenging, and many papers donot require this, but we encourage authors to take this into account and make a bestfaith effort.",
  "Answer: [Yes]": "Justication: This research conforms to the NeurIPS Code of Ethics. The study underwentan institutional ethics review process, ensuring adherence to ethical standards for researchinvolving human participants. All data collected was anonymised, securely stored on anencrypted disk, and will be deleted after ve years. Informed consent was obtained fromall participants, with clear communication regarding data usage and privacy protections.Further information on the ethics review process can be found in the Appendix section.",
  "The answer NA means that the paper does not use existing assets. The authors should cite the original paper that produced the code package or dataset": "The authors should state which version of the asset is used and, if possible, include aURL. The name of the license (e.g., CC-BY 4.0) should be included for each asset. For scraped data from a particular source (e.g., website), the copyright and terms ofservice of that source should be provided. If assets are released, the license, copyright information, and terms of use in the pack-age should be provided. For popular datasets, paperswithcode.com/datasets hascurated licenses for some datasets. Their licensing guide can help determine the li-cense of a dataset. For existing datasets that are re-packaged, both the original license and the license ofthe derived asset (if it has changed) should be provided. If this information is not available online, the authors are encouraged to reach out tothe assets creators.13. New AssetsQuestion: Are new assets introduced in the paper well documented and is the documenta-tion provided alongside the assets?Answer: [NA]Justication: The paper does not release new assets.Guidelines: The answer NA means that the paper does not release new assets. Researchers should communicate the details of the dataset/code/model as part of theirsubmissions via structured templates. This includes details about training, license,limitations, etc. The paper should discuss whether and how consent was obtained from people whoseasset is used. At submission time, remember to anonymize your assets (if applicable). You caneither create an anonymized URL or include an anonymized zip le.14. Crowdsourcing and Research with Human SubjectsQuestion: For crowdsourcing experiments and research with human subjects, does the pa-per include the full text of instructions given to participants and screenshots, if applicable,as well as details about compensation (if any)?Answer: [Yes]Justication: Participant instructions are included in the supplemental material.Guidelines: The answer NA means that the paper does not involve crowdsourcing nor researchwith human subjects. Including this information in the supplemental material is ne, but if the main contri-bution of the paper involves human subjects, then as much detail as possible shouldbe included in the main paper. According to the NeurIPS Code of Ethics, workers involved in data collection, cura-tion, or other labor should be paid at least the minimum wage in the country of thedata collector.15. Institutional Review Board (IRB) Approvals or Equivalent for Research with HumanSubjectsQuestion: Does the paper describe potential risks incurred by study participants, whethersuch risks were disclosed to the subjects, and whether Institutional Review Board (IRB)approvals (or an equivalent approval/review based on the requirements of your country orinstitution) were obtained?Answer: [Yes]Justication: Ethics approval was received for the study, and potential risks were laid outto applicants in the call for participants (provided in the supplemental material). However,due to space constraints, this was not explicitly mentioned in the paper but in the appendixsection. Guidelines: The answer NA means that the paper does not involve crowdsourcing nor researchwith human subjects. Depending on the country in which research is conducted, IRB approval (or equiva-lent) may be required for any human subjects research. If you obtained IRB approval,you should clearly state this in the paper. We recognize that the procedures for this may vary signicantly between institutionsand locations, and we expect authors to adhere to the NeurIPS Code of Ethics and theguidelines for their institution. For initial submissions, do not include any information that would break anonymity(if applicable), such as the institution conducting the review."
}