{
  "Abstract": "Ptychography is a scanning coherent diffractive imaging technique that enablesimaging nanometer-scale features in extended samples. One main challenge isthat widely used iterative image reconstruction methods often require significantamount of overlap between adjacent scan locations, leading to large data volumesand prolonged acquisition times. To address this key limitation, this paper pro-poses a Bayesian inversion method for ptychography that performs effectively evenwith less overlap between neighboring scan locations. Furthermore, the proposedmethod can quantify the inherent uncertainty on the ptychographic object, whichis created by the ill-posed nature of the ptychographic inverse problem. At a highlevel, the proposed method first utilizes a deep generative model to learn the priordistribution of the object and then generates samples from the posterior distribu-tion of the object by using a Markov Chain Monte Carlo algorithm. Our resultsfrom simulated ptychography experiments show that the proposed framework canconsistently outperform a widely used iterative reconstruction algorithm in casesof reduced overlap. Moreover, the proposed framework can provide uncertaintyestimates that closely correlate with the true error, which is not available in practice.The project website is available here.",
  "arXiv:2412.10882v1 [eess.IV] 14 Dec 2024": "scanned by a coherent light beam that follows a trajectory consisting of multiple scan locations,and the resulting diffraction patterns are collected by a far-field detector. At the inversion stage, aniterative reconstruction algorithm such as estimates the underlying ptychographic object fromthe observed diffraction patterns. Unfortunately, in practice, iterative ptychographic reconstructionmethods often require significant amount of overlap between the adjacent scan locations , leadingto prolonged acquisition periods and large data volumes. One may aim to overcome this major challenge by reducing the overlap between neighboring scanlocations. However, this results in a more challenging ill-posed inverse problem, leading to a degradedreconstruction performance or to an unstable inversion process when iterative methods involvingexisting analytical regularizers are used. Motivated by these challenges, several works, e.g., ,have aimed to design deep learning-based ptychographic reconstruction methods that can performwell with sparsely acquired diffraction patterns. Although these methods are capable of achievingstate-of-the-art performance in ptychographic inversion, they do not have the ability to provide anyinformation about the inherent uncertainty hidden in the ptychographic inverse problem caused byits ill-posed nature. An attempt to quantify this uncertainty was made by Dasgupta and Di in .However, their approach does not enforce any physical data consistency at the inference stage andassumes a total variation -based prior on the ptychographic object, which may not capture thecomplex structure of real-world ptychographic objects. In this paper, we propose a scalable Bayesian inversion method for ptychography that can performwell with sparsely acquired diffraction patterns while providing uncertainty estimates about theunderlying image, capturing the inherent uncertainty in the ill-posed inverse problem. The proposedmethod achieves high reconstruction quality under sparse data conditions by incorporating priorknowledge about the underlying object into the inversion process with the help of a deep generativemodel. Next, it leverages the unadjusted Langevin algorithm to quantify the uncertainty onthe ptychographic object given the observed diffraction patterns. Throughout the iterations of theLangevin algorithm, the proposed method employs a statistical observation model for ptychography,introducing a physical inductive bias and enforcing data consistency at the inference time. Weevaluate the proposed method on simulated ptychography experiments. Our results show that theproposed method offers strong reconstruction performance even when the neighboring scan locationshave small amount of overlap. Furthermore, we observe that there exists a positive correlationbetween the uncertainty estimates provided by the proposed method and the true error maps.",
  "Proposed Framework": "Forward and Inverse ProblemsLet u CN be the object of interest in vectorized form andfj ZM+ be the diffraction pattern collected at the jth scan location by the far-field detector. Underthe Poisson measurement noise assumption, the relationship between the object and the measureddiffraction patterns is modeled by the following forward problem (observation model):",
  "fj P|Fdiag(wj)Sju|2forj = 1, . . . , J,(1)": "where P() denotes a Poisson process with the rate > 0; the matrix F CMM represents thetwo-dimensional discrete Fourier transform; the operator diag : CM CMM maps a given vectorto a diagonal matrix whose diagonal entries are given by the input vector; the vector wj CM isthe complex probe illuminating the object at the jth scan location; Sj RMN is a binary matrixextracting the",
  "M": "M patch located at the jth scan location; and J Z++ is the number ofscan locations in the trajectory. For this forward problem, the inverse problem refers to the task ofestimating the underlying object from the measured diffraction patterns f f 1 , . . . , f J. Bayesian Inversion with Generative Models for PtychographyBayesian inversion aims tosolve the inverse problem by calculating the posterior distribution of the underlying object giventhe observed diffraction patterns, pu|f(|f). This requires defining a likelihood model pf|u(f|)and specifying a prior distribution pu that represents our a priori knowledge about the object.Unfortunately, specifying the prior distribution is challenging in practice since it is hard to expressour a priori knowledge about the object mathematically while ensuring mathematical tractability.This often results in overly simplified prior distributions, leading to priors that may not capture thecomplex structure of real-world objects (see for an illustrative example). Inspired by a common approach presented in the literature (e.g., ), we aim to circumventthis problem by representing the prior distribution of the underlying object through a deep latentgenerative model. In the rest of this paper, we assume that we have access to a trained deep latentgenerative model G : RZ CN, which is trained using a dataset containing many object samples,and that the generative model G is capable of generating the type of objects we would like toreconstruct, i.e., u = G(z) where z pz is the latent variable of the generator. Under this assumption, we substitute the surrogate expression G(z) in lieu of the object u in theforward problem in (1) and aim to perform Bayesian inversion over the latent variable z by generatingsamples from the posterior distribution of the latent variable given the diffraction patterns, pz|f(|f).By leveraging the Bayes theorem, we can decompose the posterior distribution as follows:",
  "j=1AHj(AjG(z)) fj |AjG(z)|2 1 ,(5)": "where calculates the element-wise real part of a given complex vector; JG(z) is the Jacobian matrixof the generator G evaluated at z; ()H denotes the Hermitian conjugate; and the symbols and denote the element-wise multiplication and division operations, respectively. It is worth noting thateach iteration of (4) utilizes the generative model to represent the prior on the object while utilizingthe likelihood function pf|z(f|) to enforce data consistency and introduce a physical inductive bias. After executing this iterative algorithm for K iterations, while calculating the intermediate vector-Jacobian multiplications using automatic differentiation , the resulting variables {z(1), . . . , z(K)}are used as inputs to the generator to obtain our samples from the posterior distribution of the object.Then, these samples can be used to obtain a reconstructed image, which can be the arithmetic mean ofthe samples, and an uncertainty map, which can be the pixel-wise standard deviation of the samples.",
  "Experiments and Results": "Experimental SetupWe utilized the MNIST dataset to create synthetic ptychographic objects.Initially, we resized each image in the dataset to a 64 64 resolution. Subsequently, we addeda constant offset of 0.2 to each image and normalized the images so that the pixel intensities fellwithin the range (0, 1]. Finally, each ptychographic object is constructed by using one of theseimages for the magnitude and another for the phase. Since the magnitude and phase images of theptychographic objects were constructed using identical procedures, we trained a single WassersteinGAN model (see for its desirable theoretical properties relevant to the posterior samplingproblem) on both types of images and used the resulting generator twice to obtain the complex-valuedgenerator G. To simulate the forward problem in (1), we utilized the Tike software package . We used adisk probe for the simulations, where the probe size was set to 16 16, and the radius was fixedto 8 pixels. The scan locations were created by following a raster scan pattern, where random Ground Truth (Magnitude) Probe (Magnitude) rPIE (Magnitude) Proposed Mean (Magnitude) Ground Truth (Phase) Probe (Phase) rPIE (Phase) Proposed Mean (Phase) 0.2 0.4 0.6 0.8 0.5 1.0 1.5 2.0 2.5 3.0 0.2 0.4 0.6 0.8 0.2 0.4 0.6 0.8 0.0 0.2 0.4 0.6 0.8 1.0 1.2 1.4 0.2 0.4 0.6 0.8",
  ": Correlation between theerror and the uncertainty estimatesprovided by the proposed method": "perturbations to the scan locations were added. To simulate different data acquisition conditions,we repeated these simulations for different overlap ratios and different probe amplitude values. Weran the proposed method for 1000 iterations, discarding the first 500 iterations as the burn-in period.We fixed the step size to 105 and initialized the latent variable such that G(z(0)) was close tofree space in mean-squared error sense. We compared our method with the state-of-the-art iterativereconstruction method rPIE , which is frequently used in synchrotron facilities. Reconstruction Performance presents the reconstructed images obtained by the proposedmethod (see the supplementary material for samples generated from the posterior distribution) andrPIE for a test example, where the overlap ratio is 5%, and the probe amplitude is 100. We observethat both the magnitude and phase images reconstructed by the proposed method exhibit a high degreeof visual similarity to those of the ground truth object while the reconstructed images offered by therPIE algorithm contain severe artifacts. To assess the reconstructions quantitatively, we calculated the2error between the ground truth object and the mean provided by the proposed method over100 test samples. displays the results. From the figure, we observe that the proposed methodconsistently outperforms rPIE across all experimental conditions. Moreover, as the overlap ratio andthe probe amplitude decrease, the reconstruction performance of rPIE deteriorates significantly, whilethe proposed framework maintains stable performance, highlighting the advantage of using complexlearning-based priors within the reconstruction process. Uncertainty Estimates shows the uncertainty map obtained by the proposed frameworkand the true error map for a test example, where the overlap ratio is 20%, and the probe amplitudeis 100. We observe that the regions with high uncertainty may be used to predict the locationsof the potential errors in the reconstructed image without having access to the true ptychographicobject. To further evaluate the correlation between the uncertainty maps and the true error maps, wecalculated the Pearson and Spearman correlation coefficients for 100 test samples. showsthe bar plot of correlation coefficients as a function of the experimental conditions. We observethat Spearman and Pearson correlations are positive across all experimental conditions, indicating apositive relationship between the uncertainty estimates and the actual error. Additionally, we observe",
  "Conclusion": "In this paper, we proposed a Bayesian inversion framework for ptychography based on deep generativepriors and Markov Chain Monte Carlo sampling. Our simulated ptychography experiments showedthat the proposed framework is capable of achieving state-of-the-art reconstruction quality even whenthe adjacent scan locations have small amount of overlap, where traditional image reconstructionmethods often provide erroneous or unstable results. Moreover, we observed that the proposed methodis capable of capturing the inherent uncertainty arising in the ptychographic inverse problem, and theprovided uncertainty estimates correlate positively with the true error. The main limitation of theproposed method is that it requires training a generative model on the class of ptychographic objectsone would like to reconstruct, which may be data intensive for certain experiments conducted atsynchrotron radiation facilities. We plan to address this issue in the future by exploring a patch-basedadaptation of the proposed method.",
  "and Disclosure of Funding": "This work is partially supported by the U.S. Department of Energy (DOE) under Contract No. DE-AC02-06CH11357, including funding from the Office of Advanced Scientific Computing Research(ASCR)s XSCOPE project and the Laboratory Directed Research and Development Program (ProjectNumber: 2023-0104) at Argonne National Laboratory (ANL). This research used resources of theArgonne Leadership Computing Facility, a U.S. DOE Office of Science user facility at ANL, and isbased on research supported by the U.S. DOE Office of Science ASCR Program under Contract No.DE-AC02-06CH11357. K. Giewekemeyer, P. Thibault, S. Kalbfleisch, A. Beerlink, C. M. Kewish, M. Dierolf, F. Pfeiffer, andT. Salditt, Quantitative biological imaging by ptychographic X-ray diffraction microscopy, Proceedingsof the National Academy of Sciences, vol. 107, no. 2, pp. 529534, 2010. R. N. Wilke, M. Priebe, M. Bartels, K. Giewekemeyer, A. Diaz, P. Karvinen, and T. Salditt, Hard x-rayimaging of bacterial cells: nano-diffraction and ptychographic reconstruction, Opt. Express, vol. 20,no. 17, pp. 19 23219 254, 2012. A. Diaz, B. Malkova, M. Holler, M. Guizar-Sicairos, E. Lima, V. Panneels, G. Pigino, A. G. Bittermann,L. Wettstein, T. Tomizaki, O. Bunk, G. Schertler, T. Ishikawa, R. Wepf, and A. Menzel, Three-dimensionalmass density mapping of cellular ultrastructure by ptychographic X-ray nanotomography, Journal ofStructural Biology, vol. 192, no. 3, pp. 461469, 2015. J. Deng, D. J. Vine, S. Chen, Y. S. G. Nashed, Q. Jin, N. W. Phillips, T. Peterka, R. Ross, S. Vogt, andC. J. Jacobsen, Simultaneous cryo X-ray ptychographic and fluorescence microscopy of green algae,Proceedings of the National Academy of Sciences, vol. 112, no. 8, pp. 23142319, 2015. E. Lima, A. Diaz, M. Guizar-Sicairos, S. Gorelick, P. Pernot, T. Schleier, and A. Menzel, Cryo-scanningX-ray diffraction microscopy of frozen-hydrated yeast, Journal of Microscopy, vol. 249, no. 1, pp. 17,2013. T. Sun, G. Sun, F. Yu, Y. Mao, R. Tai, X. Zhang, G. Shao, Z. Wang, J. Wang, and J. Zhou, Soft X-rayptychography chemical imaging of degradation in a composite surface-reconstructed Li-rich cathode, ACSNano, vol. 15, no. 1, pp. 14751485, 2021. C. Zhao, C. Wang, X. Liu, I. Hwang, T. Li, X. Zhou, J. Diao, J. Deng, Y. Qin, Z. Yang et al., Suppressingstrain propagation in ultrahigh-ni cathodes during fast charging via epitaxial entropy-assisted coating,Nature Energy, pp. 112, 2024. M. Holler, M. Guizar-Sicairos, E. H. Tsai, R. Dinapoli, E. Mller, O. Bunk, J. Raabe, and G. Aeppli,High-resolution non-destructive three-dimensional imaging of integrated circuits, Nature, vol. 543, no.7645, pp. 402406, 2017. A. Schropp, P. Boye, A. Goldschmidt, S. Hnig, R. Hoppe, J. Patommel, C. Rakete, D. Samberg, S. Stephan,S. Schder et al., Non-destructive and quantitative imaging of a nano-structured microchip by ptycho-graphic hard X-ray scanning microscopy, Journal of microscopy, vol. 241, no. 1, pp. 912, 2011. J. Deng, Y. P. Hong, S. Chen, Y. S. Nashed, T. Peterka, A. J. Levi, J. Damoulakis, S. Saha, T. Eiles, andC. Jacobsen, Nanoscale X-ray imaging of circuit features without wafer etching, Physical Review B,vol. 95, no. 10, p. 104111, 2017. M. Esmaeili, J. B. Floystad, A. Diaz, K. Hoydalsvik, M. Guizar-Sicairos, J. W. Andreasen, and D. W.Breiby, Ptychographic X-ray tomography of silk fiber hydration, Macromolecules, vol. 46, no. 2, pp.434439, 2013. P. Trtik, A. Diaz, M. Guizar-Sicairos, A. Menzel, and O. Bunk, Density mapping of hardened cementpaste using ptychographic X-ray computed tomography, Cement and Concrete Composites, vol. 36, pp.7177, 2013, special issue: Nanotechnology in Construction. B. Chen, M. Guizar-Sicairos, G. Xiong, L. Shemilt, A. Diaz, J. Nutter, N. Burdet, S. Huo, J. Mancuso,A. Monteith et al., Three-dimensional structure analysis and percolation properties of a barrier marinecoating, Scientific reports, vol. 3, no. 1, p. 1177, 2013.",
  "P. Bohra, T.-a. Pham, J. Dong, and M. Unser, Bayesian inversion for nonlinear imaging models usingdeep generative priors, IEEE Transactions on Computational Imaging, vol. 8, pp. 12371249, 2022": "D. V. Patel, D. Ray, and A. A. Oberai, Solution of physics-based Bayesian inverse problems with deepgenerative priors, Computer Methods in Applied Mechanics and Engineering, vol. 400, p. 115428, 2022. A. Dasgupta, D. V. Patel, D. Ray, E. A. Johnson, and A. A. Oberai, A dimension-reduced variationalapproach for solving physics-based inverse problems using generative adversarial network priors andnormalizing flows, Computer Methods in Applied Mechanics and Engineering, vol. 420, p. 116682, 2024.",
  "D. Gursoy and D. J. Ching, Tike, [Computer Software] 2022.[Online]. Available:": "X. Yu, T. Bicer, R. Kettimuthu, and I. Foster, Topology-aware optimizations for multi-gpu ptychographicimage reconstruction, in Proceedings of the ACM International Conference on Supercomputing, 2021, pp.354366. X. Yu, V. Nikitin, D. J. Ching, S. Aslan, D. Grsoy, and T. Bier, Scalable and accurate multi-gpu-basedimage reconstruction of large-scale ptychography data, Scientific reports, vol. 12, no. 1, p. 5334, 2022."
}