{
  "ABSTRACT": "This study addresses the challenge of predicting electric vehicle (EV) charging profiles in urbanlocations with limited data. Utilizing a neural network architecture, we aim to uncover latentcharging profiles influenced by spatio-temporal factors. Our model focuses on peak power demandand daily load shapes, providing insights into charging behavior. Our results indicate significantimpacts from the type of Basic Administrative Units on predicted load curves, which contributesto the understanding and optimization of EV charging infrastructure in urban settings and allowsDistribution System Operators (DSO) to more efficiently plan EV charging infrastructure expansion.",
  "Introduction and motivation": "One of the major pushes to fight climate change is the decarbonization of energy and mobility, which are closelyrelated and together significantly contribute to global carbon emissions. Within this intersection, the electrificationof mobility via large-scale deployment of electric vehicles (EVs) is one of the potential tools to decarbonize mobility inthe coming decades. This push, however, requires significant investment in power infrastructure, mainly on the distribution level operated bydistribution system operators (DSOs). This is due to the need to expand the availability of not only private but alsopublic charging infrastructure, which can help better distribute loads across space and time. Since power engineering infrastructure expansion is an effort requiring significant time and financial resources, acritical challenge in this area is how to optimize grid expansion for efficiency to cover anticipated EV charging demandin various areas while not overloading the current network and not overspending on areas where demand is not ashigh. This is especially difficult for DSOs since there has been a general lack of studies demonstrating analysisof real-world EV charging data in different geographies, mainly due to the data being vendor-locked and treated asconfidential.",
  "Towards Using Machine Learning to Generatively Simulate EV Charging in Urban AreasA PREPRINT": "In , the monthly relative total shares of each ZSJ area type are visualized for two key elements in our dataset:charging instances and installed charging points. Note that for the charging instances dataset, no datapoints are currentlyavailable to us between December 2020 and December 2021, as highlighted in the figure by a red-bordered gray fill-inwith interpolated data. We can see that the number of charging sessions in Compact residential areas rose between theyears 2019 and 2022. Simultaneously, a modest increase in the relative share of charging instances can be observed inAgricultural and Industrial areas. Conversely, a decline in charging instances share is evident in Civic amenities, Urbanand suburban mixed, and Recreational areas. This decrease could be attributed to various factors, such as changes inusage patterns or the availability of charging stations. However, combined with the analysis of the share of installed charging stations on the lower plot, we can see that thechange in charging sessions relative shares for individual ZSJ area types described above are not directly explainable bydevelopments in the number of available chargers in the respective ZSJ types. Indeed, we can see that while the twomost dominant ZSJ types (residential areas and civic amenities areas, respectively) are overrepresented in the numberof charging instances, the suburban, recreational, transportation, and reserve areas are greatly underrepresented in thecharging instances relative to the number of available chargers. This observed behavior may be caused by severalcharacteristics of chargers in the dataset, such as accessibility, geographic location, charging point alternatives, andothers. Still, this discrepancy clearly implies a different behavioral pattern for chargers in different ZSJ area types,which is examined next. : Temporal relative share development analysis for charging instances and installed chargers in Prague, classifiedper ZSJ type. Note that the red-bordered gray fill area in the upper chart of charging instances corresponds to theinterpolated region of unavailable data, and the lower chart of the number of installed chargers includes chargers putinto operation before the span of the chart timeline, December 2019.",
  "Generative modeling of public charging demand": "In order to solve the challenge of predicting charging profiles for selected locations with limited information, we firstanalyzed the information about the landscape of public chargers in Prague. Our study is based on data sourced frompublic EV chargers operated by PREdistribuce, the DSO in the Prague area. We have gotten access to full logs of all charging sessions, including precise start and end times, power consumption,type and power output of each charger, and their location. State of charge or identification of individual vehicles wasnot available to us. We have paired this information with other geographic and demographic data to complement ourunderstanding of the individual charger locations, based around the basic administrative units the chargers are locatedin. The public EV charging landscape is further explored in Appendix A.",
  "Model inputs": "For the generative predictions of load curves, we have assessed several factors that might come into play to affectcharging loads. In connection to the basic administrative units, we were able to include several attributes that, in ouropinion, are able to increase the performance of our model, including the area character and the amounts of local andlong-haul commuters. Firstly, to reflect the character of the surrounding area, we include the basic administrative unittype, which includes 12 distinct categories ranging from residential to industrial. Secondly, to reflect local commuting,we include population density per the administrative unit and the local number of addresses, including industrial andcommercial buildings, per the corresponding basic administrative unit. Thirdly, we have further enhanced this datato include information on vehicles commuting to the wider area of town to reflect long-haul commuting factors. Inconnection to the charging data, we have performed additional analysis of charging load data, uncovering insights thatmay be found in Appendix B.",
  "Model architecture": "There are two distinct, yet related components that DSOs are interested in, the first being peak power demand and thesecond being the actual load shape during the day . Moreover, our hypothesis is that, in general, there exist Kunderlying archetypal charging profiles, which are mixed by factors depending on the spatiotemporal properties of acharging station. Once enough data flows into the model given by a neural network, our aim is to interpret and examinethose profiles and how the mixture factors depend on particular spatiotemporal settings.",
  "Results": "Using the described experimental setup, we can examine the generated load profiles in . It was our hypothesisthat the model would be able to decompose the input parameter influences and assign them to latent load curvesrepresenting archetypal behavior. After some experimenting, we have chosen K = 4 latent profiles in this initial study.Since the generated load curves differ from each other starkly, it appears the model works as intended. A basic interpretation of the generated latent load profiles is that latent curve 1 shows a gradual charging curve with apeak during the day, typical for public charging. The latent curve 2 shows a single morning peak demand, and the latentcurve 3 shows a single evening demand, which is generally more typical for private charging. Lastly, latent curve 4shows a residual demand with multiple peaks. What are the causes of these archetypal behaviors is a topic of furtherresearch, however, if we follow our hypothesis more in-depth, we may also relate the emergent load curves in thecontext of observed area charging specificity described in Appendix B.1. When comparing to the generated load profiles observed here, we can see similar load profiles coming out of theoriginal charging data matched to types of basic administrative units. If we were to make this connection speculatively,it creates an implication that the latent curve 1 might represent the local, residential charging archetypal behavior, latentcurve 2 might represent recreational commute, latent curve 3 suburban and long-range commute, and latent curve4 might correspond to irregular industrial and commercial commute. Based on this connection, it appears that outof the assembled input data, the strongest impact on the predicted load curves is held by the type of the local basicadministrative unit.",
  "Conclusion and further work": "In this study, we have introduced a novel approach to creating a machine learning based model which allows forgenerative creation of public EV charging load profiles in various urban geographies given a wide range of input data.Our method is designed to create internal latent charging profiles, which have the potential to better explain the sourcesof charging demand if interpreted in connection with archetypal behaviors. In our results, we have offered such aninterpretation based on available data analysis. Our proposed model has the potential to assist DSOs and the wider research community in better modelling publiccharging demand, model different potential future scenarios, and in the case of DSOs, create more efficient strategies toexpand EV charging grid infrastructure and support the EV number increase and its wider accessibility while keepingunexpected grid impacts to a minimum. Our model is still undergoing further refinement and there are some limitationsto acknowledge. Firstly, we aim to include more data in our future iteration, as our current data has a cutoff in 2022 asdescribed in Appendix A.2. Connected to this, further investigation is needed to understand what effect the COVIDpandemic lockdowns had on our input data, since as shown in Appendix B.5, the decrease in total load was significant.We are also continuing our research in the interpretability of the charging load profile sources, facilitated in our modelvia the latent archetypal load shapes, with the interpretation being speculative. An alternative approach might be tostrictly separate types of inputs to be used for each latent load shape. Lastly, we invite the broader community to applysimilar approaches to different geographies to cross-reference our findings.",
  "Acknowledgements": "The authors would like to thank and acknowledge PREdistribuce, the Prague Distribution System Operator(DSO), for thecharging data used in this study, and the Czech Statistical Office for data on demography and geography classification inCzechia. This work was supported by grants number SGS24/093/OHK5/2T/13 and SGS23/117/OHK5/2T/13 providedby CTU Prague, and number TS01020030 provided by the Technology Agency of the Czech Republic. Authors declareno conflict of interest. Saidi Kais and Hammami Sami. An econometric study of the impact of economic growth and energy use oncarbon emissions: panel data evidence from fifty eight countries. Renewable and Sustainable Energy Reviews,59:11011110, 2016.",
  "Pouria Ahmadi. Environmental impacts and behavioral drivers of deep decarbonization for transportation throughelectric vehicles. Journal of cleaner production, 225:12091219, 2019": "Runsen Zhang, Junyi Zhang, Yin Long, Wenchao Wu, Jingyu Liu, and Ying Jiang. Long-term implications ofelectric vehicle penetration in urban decarbonization scenarios: An integrated land usetransportenergy model.Sustainable Cities and Society, 68:102800, 2021. Alexandre Dias, Pedro MS Carvalho, Pedro Almeida, and Stphane Rapoport. Multi-objective distributionplanning approach for optimal network investment with ev charging control. In 2015 IEEE Eindhoven PowerTech,pages 15. IEEE, 2015.",
  "A.1Prague area classification per basic administrative unit": "In order to analyse the potential factors affecting charging demand, we have to understand the environment in whichindividual charging points are located. For this aim, we have utilized the enhanced \"multi\" layer of Basic AdministrativeUnits (Zkladn sdeln jednotka, ZSJ), as provided by the Czech Statistical Office. The ZSJ is the smallestadministrative unit available, and there are 948 individual units in Prague. Using this data, we have been able to classifyindividual ZSJ areas in Prague into 12 categories, as seen in .",
  ": Heatmap of public charging point locations per ZSJ in Prague based on the available data": "We can see the broad distribution of public chargers across the city of Prague, with the largest concentration inpopulation centres, most notably the one at Cern most in the top right of the map, with 12 chargers present in one ZSJ.In , we can see that most chargers in the dataset are placed in residential areas (70 chargers), followed by civicamenities areas (34 chargers) and urban and suburban mixed areas (16 chargers). The other categories of ZSJ areashave 3 or fewer chargers present.",
  "B.1Load-curve analysis based on basic administrative unit type": "We have investigated the specificity of ZSJ area types by plotting demand curves of EV charging split per individualtype. provides a visualization of the normalized average number of charging instances per hour of day, whichapproximates load curve behavior patterns across different ZSJ area types. The analysis clearly shows that demandpatterns between different ZSJ types are heterogeneous. We see four distinct groups emerge: Group 1: Sustained single peak areas demonstrate a sustained demand in charging instances with a gradualsingle peak throughout the day, suggesting a consistent demand for charging facilities in these areas. Thefollowing ZSJ types fall within this category:",
  ": Normalized demand curves for ZSJ types with n defined as number of charge points present in the dataset foreach ZSJ type": "In the figure we compare data within time series or categories of inherently different volume, in categories of locationswith varying numbers of charging points, we have therefore utilized max normalization feature scaling. It rescalesall values of a non-negative data series to a maximal value of one, while retaining the relative distance from zero.Normalized series and their characteristics are then directly comparable. The i-th element of the series is rescaled asfollows:",
  "Charging Profile Granularity: Set to 24, this parameter defines the granularity of the charging profile,corresponding to the daily granularity of a 24 hour cycle in our case": "Hidden Size: The size of the hidden layers in the f module, set to 128. Hidden Size (g): The size of the hidden layers in the g module, set to 64. Latent Profiles Count: The number of latent profiles, set to 4 in our experiment run. Loss Function: Mean Squared Error (MSE) loss function, specified as nn.MSELoss(reduction=\"mean\"). Optimizer: Adam optimizer, used for updating the model parameters. Learning Rate: Set to 0.0004, this controls the step size during optimization. Number of Epochs: The model is trained for 150 epochs. These hyperparameters were chosen to optimize the performance of the ChargingProfileModel on the given dataset.The model was trained using the Adam optimizer with a learning rate of 0.0004 and the MSE loss function. The trainingprocess was carried out for 150 epochs to ensure adequate learning."
}