{
  "Abstract": "In the era of precision cosmology, the ability to generate accurate and large-scalegalaxy catalogs is crucial for advancing our understanding of the universe. With theflood of cosmological data from current and upcoming missions, generating theoret-ical predictions to compare with these observations is essential for constraining keycosmological parameters. While traditional methods, such as the Halo-OccupationDistribution (HOD), have provided foundational insights, they struggle to balancethe need for both accuracy and computational efficiency. High-fidelity hydrody-namic simulations offer improved precision but are computationally expensive andresource-intensive. In this work, we introduce a novel machine learning approachthat harnesses Convolutional Neural Networks (CNNs) and Diffusion Models,trained on the CAMELS simulation suite, to bridge the gap between computa-tionally inexpensive dark matter simulations and the galaxy distributions of morecostly hydrodynamic simulations. Our method not only outperforms traditionalHOD techniques in accuracy but also significantly accelerates the simulation pro-cess, offering a scalable solution for next-generation cosmological surveys. Thisadvancement has the potential to revolutionize galaxy catalog generation, enablingmore precise, data-driven cosmological analyses.",
  "Introduction": "Understanding the formation and evolution of galaxies is a fundamental goal in astrophysics andcosmology. Upcoming large-scale surveys (LSS), such as Euclid [Scaramella and the Euclid col-laboration, 2022] and LSST [Schwamb et al., 2023], will provide unprecedented data, offering newopportunities to constrain key astrophysical and cosmological parameters. Extracting maximuminformation from these surveys requires comparisons with simulations, particularly hydrodynamicsimulations, which are computationally expensive and limit the exploration of parameter space.Simplified models like the Halo-Occupation Distribution (HOD) [Berlind et al., 2003] improveefficiency but sacrifice accuracy. Recent advances in machine learning, particularly convolutionalneural networks (CNNs), have demonstrated superior performance in both speed and precision overHOD; see for example [Villaescusa-Navarro et al., 2021] [Zhang et al., 2019]. In this work, we propose a novel deep learning framework that leverages variational diffusion models(VDMs) [Kingma et al., 2023] [Ono et al., 2024] to map dark matter fields from N-body simulationsto galaxy fields derived from high-fidelity hydrodynamic simulations. By combining the robustness",
  "Data": "In this work, we use data from the CAMELS project [Villaescusa-Navarro et al., 2021], which includes5,324 hydrodynamic simulations and 5,097 corresponding N-body simulations. These simulationsshare consistent cosmological and initial conditions and were generated using different subgridmodels, such as SIMBA [Dav et al., 2019] and IllustrisTNG [Nelson et al., 2018]. Each simulationevolves 2563 cold dark matter (CDM) particles, with hydrodynamic simulations also evolving 2563gas particles. The evolution spans from redshift z = 127 to z = 0 in a periodic co-moving volumeof (25, Mpc/h)3. Subhalos are identified using the SUBFIND algorithm [Springel et al., 2001], andgalaxies are defined as subhalos with a stellar mass greater than zero [Villaescusa-Navarro et al.,2021]. To enhance model performance, 15 2D maps were generated from each simulation by slicingthe 3D outputs into five layers along each dimension and averaging over the thickness of each slice.This approach ensures a robust representation of the galaxy distribution. The training, validation, and testing data for our model are derived from the IllustrisTNG suite ofCAMELS. The dataset includes simulations from the Latin Hypercube set, which consists of 1,000simulations with six varied cosmological and astrophysical parameters. Additionally, we use theCosmic Variance set, which contains 27 simulations where the parameters remain fixed, but the initialseeds are varied to capture stochastic effects. Example 2D maps of the target fields and correspondingmodel predictions are shown in .",
  "CNN Model Architecture": "The input data for the model consists of the dark matter density fields from N-body simulations,while the target data is the galaxy density fields from hydrodynamic simulations, both evaluated atz = 0. Due to the sparsity of galaxy distributions compared to dark matter, accurately capturingthe small-scale dynamics of galaxy formation presents a significant challenge. These dynamics arecritical, as they encode the complex physical processes driving galaxy clustering. To address this, weadopt a two-phase architecture following [Zhang et al., 2019]. In the first phase, a neural network istrained as a binary classifier to predict the probability of galaxy presence in each voxel. In the secondphase, the model is optimized further by focusing on voxels with a high probability of containinggalaxies, refining the galaxy density predictions. This two-phase architecture is flexible, supporting various network configurations for both theclassification and regression phases. In the classification phase, the primary objective is to maximizerecall while maintaining high accuracy, which is essential for handling the sparsity of the target data.For the regression phase, model performance is evaluated using multiple metrics. Mean squared error(MSE) directly quantifies the accuracy of predictions, while comparisons of the power spectrum assesshow well the model reproduces the statistical properties of large-scale structures, particularly on smallscales where galaxy clustering is most sensitive. For the classification phase, we experimented withseveral architectures, including Inception, UNet, and R2UNet [Szegedy et al., 2014] [Ronnebergeret al., 2015] [Alom et al., 2018]. In the regression phase, R2UNet was compared to a VariationalDiffusion Model (VDM) [Kingma et al., 2023], highlighting the differences between deterministic(CNN) and probabilistic (VDM) approaches to galaxy field reconstruction, see .",
  "Variational Diffusion Model": "The Variational Diffusion Model (VDM) reconstructs galaxy distributions from dark matter fieldswithin a probabilistic framework. The model operates by progressively adding noise to the galaxyfields during a forward diffusion process and then learning to reverse this process step-by-step usinga UNet architecture, as illustrated schematically in . The forward diffusion process systematically introduces noise to the galaxy field, progressivelydegrading its structure in a controlled and predictable way. The reverse diffusion process, conditionedon the dark matter field, reconstructs the original galaxy field by modeling a sequence of conditional : Illustration of the diffusion process employed in the Variational Diffusion Model. Theconditional noise schedule is denoted by q, and the learned conditional probability estimated by theUNet is represented as p. Figure adapted and modified from Ono et al. . distributions. At each step, the UNet estimates the conditional distribution of the noiseless galaxyfield given its noisy counterpart and the dark matter field as input. This probabilistic frameworkallows the model to approximate the posterior distribution of galaxy fields conditioned on dark matterinputs. Training the VDM involves minimizing a variational bound on the likelihood of the data.Through this optimization, the UNet learns the parameters required to reverse the diffusion processand accurately denoise the galaxy field. This framework not only provides a robust reconstruction ofgalaxy distributions but also facilitates uncertainty quantification by modeling the variability inherentin galaxy formation.",
  "Benchmark Models": "To evaluate the performance of our model, we compared it against two established methods. Thefirst benchmark is a Halo Occupation Distribution (HOD) model, a widely used parameter-basedapproach for populating dark matter halos with galaxies [Berlind et al., 2003]. The HOD relies onthree free parameters: Mmin; the minimum mass for a halo to contain a galaxy, M1; the mass ofhalos that contain one galaxy on average, and ; the power law index. Only halos with masses greaterthan Mmin host a central galaxy placed at the halo center. The number of satellite galaxies follows aPoisson distribution with a mean of (M/M1), and these satellites are distributed randomly withinthe dark matter halo. Given a specific set of M1 and , we optimize Mmin, then fine-tune M1 and to minimize the mean squared error (MSE) on the power spectrum. The HOD model is utilizedas a benchmark because it represents the standard classical approach for efficiently populating darkmatter simulations with galaxies. However, this model does not include assembly bias, as we rely onCDM-only snapshots at z = 0, making it a simplified but practical comparison. The second benchmark is the CNN model, which employs the two-phase architecture described in.2. The CNN captures multiscale information to generate accurate galaxy distributions andserves as a strong deep-learning-based comparison. However, it operates deterministically, unlikeour Variational Diffusion Model (VDM), which leverages a probabilistic framework to model theposterior distribution of galaxy fields. This distinction allows the VDM to capture variability andprovide uncertainty quantification, setting it apart from traditional benchmarks.",
  "Results": "In this section, we evaluate the performance of the models across both the classification and regressiontasks and provide a detailed analysis of the Variational Diffusion Model (VDM). The Inceptionnetwork demonstrated superior performance in the classification phase, achieving the highest recall,as shown in . This highlights its capability to handle the sparsity of galaxy distributions",
  "Inception97.34%95.38%3.537%6 minR2Unet98.24%94.16%5.196%90 min": ": Figure displays six maps from the model: the input CDM field (top left), the true galaxyfield (top middle), a single VDM-generated field (top right), the posterior mean (bottom left), theposterior standard deviation (bottom middle), and the Z-score map (bottom right). effectively, a critical aspect of the classification task. Conversely, while the R2UNet achieved slightlyhigher accuracy, it underperformed in terms of recall, indicating potential challenges in identifyingall galaxy-present regions. The VDM excelled in the regression phase, achieving the lowest meansquared error (MSE) among all tested models. Specifically, it demonstrated a 60% reduction in MSEcompared to the HOD model and a 20% improvement over the CNN. Notably, the VDM performedexceptionally well at small scales, capturing fine-grained, nonlinear features of galaxy formationmore accurately than its benchmarks. provides a visual representation of the VDMs outputs, including the input CDM map,the true galaxy field, a single VDM-generated sample, and posterior statistics derived from 100samples The mean map closely aligns with the true galaxy field, with minimal visual discrepancies.The standard deviation map indicates small uncertainty in most regions, with higher uncertainty insparse areas, reflecting the models challenges in low-density regions. The Z-score map quantifiesthese biases: red regions (positive Z-scores) in voids denote overpredicted densities, while blueregions (negative Z-scores) in massive halos indicate underpredicted galaxy concentrations. Greyregions show no significant deviation from the true distribution. These patterns are consistent withthe power spectrum results, where the VDM slightly overestimates galaxy density at large scales andunderestimates it at small scales (see ). The left plot of compares the power spectra (top) and the transfer function (bottom) of theVDM model (blue line) with the true galaxy field (black line), the HOD model (green line), and theCNN (red line). The VDM outperforms the HOD and CNN, particularly at large scale (k < 5 h/Mpc)and intermediate-scale (5 h/Mpc < k < 10 h/Mpc), replicating clustering patterns with improvedaccuracy. At k = 20 h/Mpc, the VDM achieves a significant improvement, outperforming the HODby approximately 50% and the CNN by 30%. However, the VDM underperforms at smaller scales(k > 10 h/Mpc), reflecting the challenges in modeling nonlinear galaxy formation dynamics in denseenvironments. This trend aligns with observations from the Z-score map in . The right plot of ) highlights the cross-power spectrum, showing the correlation betweenthe predicted galaxy density field and the true field across scales. The VDM consistently exhibitshigher cross-power values than the true field, indicating systematic overcorrelation. At large scales : The left plot shows the galaxy power spectra (top) and residuals (bottom) for the target(black line) and the outputs of the models used in this work. Uncertainties are represented by the25th and 75th percentiles across the test set. The VDM (red line) outperforms the CNN (blueline) and HOD (green line), particularly at small scales, where differences in galaxy formation aremost significant. The right plot shows the cross-power spectra, comparing the models to the truedistribution. (k < 5 h/Mpc), the model captures general clustering trends but amplifies the galaxy-dark matterrelationship, potentially overestimating their connection. At intermediate scales (5 h/Mpc < k <10 h/Mpc), the overcorrelation persists but moderates slightly. At small scales (k > 10 h/Mpc),the cross-power spectrum declines, reflecting challenges in modeling nonlinear dynamics, such asbaryonic feedback and dense environmental interactions. While the VDM effectively captures largeand intermediate scale clustering, its overcorrelation across all scales highlights a limitation in itsmodeling of galaxy-halo connections and the absence of explicit baryonic effects. Future work couldaddress these issues by incorporating additional physical priors or expanding the training dataset withsimulations that include baryonic processes. The VDM requires 3 to 5 times longer training compared to a CNN but can generate 100 samples inapproximately 3 minutes, vastly outperforming the HOD model and making it a practical alternativeto computationally intensive hydrodynamic simulations [Villaescusa-Navarro et al., 2021].",
  "Conclusions": "Our results demonstrate the VDMs significant advancements over traditional HOD and CNNbenchmarks, particularly in capturing large and intermediate-scale galaxy clustering with improvedaccuracy. While challenges remain in modeling small-scale nonlinear dynamics, the probabilisticframework of VDM provides a robust tool for uncertainty quantification and Bayesian parameterinference. By modeling the posterior distribution of galaxy fields, VDM captures the inherentstochasticity of galaxy formation, enabling more reliable predictions and bridging the gap betweencomputational efficiency and physical fidelity. Future work will focus on addressing the limitations observed at small scales by incorporatingadditional physical priors, such as baryonic effects, into the model architecture. Improving thetraining process through the inclusion of more diverse datasets, including simulations with variedastrophysical models, such as SIMBA and ASTRID [Dav et al., 2019] [Bird et al., 2022], couldenhance the models generalizability and accuracy. Furthermore, integrating the VDM frameworkwith observational data will provide opportunities to refine its predictions and evaluate its performancein real-world applications. By continuing to refine its capabilities, the VDM can serve as a cornerstonefor future cosmological analyses.",
  "Acknowledgements": "We thank Francisco Villaescusa-Navarro for valuable discussions. TS, EG, and MR acknowledge theIT department at Michigan Technological University for their assistance in managing the computingcluster. The GPU cluster used for this work was funded by the NSF Major Research Instrumentation(MRI) Grant Award No. 221734, titled MRI: Acquisition of a GPU-accelerated cluster for research,training, and outreach. Research reported in this publication was supported in part by fundingprovided by the National Aeronautics and Space Administration (NASA), under award number80NSSC20M0124, Michigan Space Grant Consortium (MSGC).",
  "Astrophys., 662:A112, 2022. doi: 10.1051/0004-6361/202141938": "M. E. Schwamb, R. L. Jones, P. Yoachim, et al. Tuning the legacy survey of space and time (LSST)observing strategy for solar system science. The Astrophysical Journal Supplement Series, 266(2):22, May 2023. doi: 10.3847/1538-4365/acc173. V. Springel, S. D. M. White, G. Tormen, and G. Kauffmann. Populating a cluster of galaxies - i.results at z=0. Monthly Notices of the Royal Astronomical Society, 328(3):726750, December2001. doi: 10.1046/j.1365-8711.2001.04912.x."
}