{
  "Abstract": "Design exploration or optimization using computational fluid dynamics (CFD) iscommonly used in the industry. Geometric variation is a key component of suchdesign problems, especially in turbulent flow scenarios, which involves runningcostly simulations at every design iteration. While parametric RANS-PINN typeapproaches have been proven to make effective turbulent surrogates, as a means ofpredicting unknown Reynolds number flows for a given geometry at near real-time,geometry aware physics informed surrogates with the ability to predict varyinggeometries are a relatively less studied topic. A novel geometry aware parametricPINN surrogate model has been created, which can predict flow fields for NACA4 digit airfoils in turbulent conditions, for unseen shapes as well as inlet flowconditions. A local+global approach for embedding has been proposed, whereknown global design parameters for an airfoil as well as local SDF values canbe used as inputs to the model along with velocity inlet/Reynolds number (Re)to predict the flow fields. A RANS formulation of the Navier-Stokes equationswith a 2-equation k-epsilon turbulence model has been used for the PDE losses,in addition to limited CFD data from 8 different NACA airfoils for training. Themodels have then been validated with unknown NACA airfoils at unseen Reynoldsnumbers.",
  "Introduction": "Over the last decade, deep learning has emerged as a vital tool for accelerating CFD simulations,particularly in applications where traditional solvers are computationally expensive or time-intensive[Vinuesa and Brunton, 2022, Warey et al., 2020, Zhang et al., 2022]. Several approaches havebeen developed, with some integrating neural networks to predict residuals or refine turbulencemodels within the framework of conventional solvers, effectively merging data-driven techniqueswith established numerical methods [Hsieh et al., 2019, Kochkov et al., 2021]. Other strategiesaim to replace the CFD solvers entirely by learning the flow fields directly through models thatutilize convolutional neural networks (CNNs) or graph neural networks (GNNs). CNNs effectivelycapture the spatial features of the flow on regular grids [Hennigh, 2017, Chen and Thuerey, 2023],whereas GNNs excel at handling complex geometries and mesh representations, providing flexibleand mesh-independent predictions [Jiang et al., 2020, Wang et al., 2020]. Additionally, Physics-Informed Neural Networks (PINNs) have been introduced to embed governing partial differentialequations (PDEs) into the loss function, ensuring that the models comply with the fundamentalphysical laws, such as the Navier-Stokes equations [Raissi et al., 2019, Dwivedi et al., 2019, Luet al., 2019, Nabian and Meidani, 2019, Zhang et al., 2020]. This physics-based regularization allowsPINNs to predict the spatiotemporal evolution of flow variables while maintaining consistency withthe underlying conservation laws, making them especially useful when dealing with sparse or noisydata. By incorporating physical constraints, PINNs maintain a balance between data-driven modelaccuracy and the theoretical rigor of traditional approaches.",
  "arXiv:2412.01954v1 [cs.LG] 2 Dec 2024": "Despite advances in Physics-Informed Neural Networks (PINNs), their use in RANS-based turbulencemodeling, particularly for predicting flow at unseen Reynolds numbers, remains underexplored[Majchrzak et al., 2023]. Previous studies often rely on the Reynolds-stress formulation, whichdemands high-fidelity data from costly simulations such as Direct Numerical Simulations, LargeEddy Simulations, or high-resolution flow measurements [Eivazi et al., 2022, Hanrahan et al., 2023].While this ensures accuracy, it limits scalability to practical applications. Recent efforts, such as Patelet al. s work with the Spalart-Allmaras (SA) model, have combined physics and data to offer amore computationally feasible approach. Similarly, Pioch et al. evaluated models like k- andReynolds-stress, using hybrid training strategies to reconstruct flow fields for fixed Reynolds numbers.Ghosh et al. applied the k model with PINNs to predict turbulent flow for previouslyunseen Reynolds numbers, but their work did not address the influence of geometry which plays acritical role in design exploration and optimization. In this work, we bridge this gap by using SignedDistance Functions (SDFs) to incorporate geometry into PINN-based RANS modeling. SDFs arewidely used in fields such as computer vision, graphics, and surrogate modeling [Guo et al., 2016,Li et al., 2023]. By embedding SDFs into the PINN framework, we aim to enhance the predictionaccuracy over complex geometries and generalize flow reconstruction to novel geometries of thesolution domain. While a small body of work has investigated PINNs capable of accommodating geometry variationsOldenburg et al. , the use of PINNs to predict flow in novel geometries remains a less exploredarea. In this work, expand the scope of RANS-PINNs that combines PINN-based surrogates withRANS based turbulent modeling approaches and enable it predict flow and turbulent variablesover new geometries. In particular, we use an SDF based geometric embedding along with a setof physically interpretable shape parameters to predict flow fields over any NACA 4-digit airfoilgeometry and for any value of the inlet velocity. Key contributions can be listed as: Accurate prediction of velocity and pressure fields for any Reynolds number(Re) (within the rangeof prediction) over any given shape of a NACA 4-digit airfoil.",
  "RANS-PINN Architecture and Training": "The constant density fluid flow is governed by the continuity equation (to conserve mass) and Navier-Stokes equation (to conserve momentum). A 2-equation eddy viscosity model describes the closureterms associated with the RANS formulation that is needed to capture the effect of turbulence. Inthis work, a standard k- turbulence mode is used. Symbols U and p denote the flow velocity (xcomponent u and y component v) and pressure, respectively. continuity and Navier-Stokes equations,at a density of 1 kg/m3 can be expressed as:",
  ": Architecture Diagram": "A CFD model with wake refinement and prism layers, with all wall y+ has been created in STAR-CCM+ for each NACA airfoil. A velocity inlet boundary condition along with pressure outlets,no-slip walls and free stream side walls have been considered. A data set comprising of 8 NACAairfoils with, six inlet velocities(|U|in) randomly generated have been selected from the range of 2m/s to 7 m/s, which corresponds to a Reynolds number (Re = |U|inL/, where L=airfoil chordlength) range of 200k to 700k to make a training set. For the first model (L), an SDF field has beencalculated to embed the distance of each domain point from the geometry, there creating an invariantfor each shape (). In addition to this, the 4 digits from each NACA airfoil have been used as a design input for a secondmodel (L+G). By using the inlet velocity as an additional input to the PINN, the surrogate has beenparameterized to Re variation. However, in case of a lack of knowledge of such design parametersfor an unknown geometry, it has been shown that flow prediction is still possible with only the SDFfields. The performances have been compared against an ablation model (G) which has only thedesign parameters as an input in addition to the inlet velocity. A warm start approach is employed,where only the data losses are used to pre-train the PINN before introducing the PDE losses, similarto Ghosh et al. , in order to avoid convergence issues with a set of complex governing PDEs.",
  "Results and Discussions": "Various turbulent flow features can be observed in a flow over an airfoil case. Due to acceleration offlow over the top surface, a pressure differential is formed between surfaces, which then results in lift.There is a stagnation zone formed at the nose, and a separation wake at the tail region. These featuresare well captured by the L model for all 3 unseen NACA airfoil geometries (). The pressureplots () show a peak at the nose, representing stagnation and a large low magnitude zone on theupper surface representing flow acceleration and pressure differential between the two surfaces. Amultitude of shapes and inlet velocities have been studied in table 1, with an additional deeper diveinto details in table 2. shows the mean and median for velocity and pressure, which givesan idea about the overall distribution of errors inside the computational domain. As a high error isobserved in near-wall regions, the overall mean can be skewed.",
  ": Pressure predictions for various NACA airfoils at different Re": "better at the outer zone. This can be attributed to lack of local information which the SDF providesin embedding the knowledge of geometric boundaries. shows the formation of phantomairfoil like shapes from the G model predictions. It is clear that this affects the performance in thenear flow-field region (seen in the small rectangle on ). A third model (L+G) has then beencreated where both the SDF and the design parameters have been provided as input, to obtain alocal and global understanding of the flow. It can be seen that the L+G model improves upon theperformance of the G model, with slightly inferior performance in the near-field zone compared tothe L model,and performs better in the far field. Overall, the L+G model comes close to the metricsof the L model and even betters it in one instance(NACA-6414). This suggests, further investigationwith more complex architectures accounting for local and global geometric information can possiblyimprove prediction further. NACA-1412, Re=290k",
  "NACA 4 digit airfoils and geometry embedding": "The NACA 4-digit airfoils are represented by the 3 parameters, which feature in the surface definingequations. Each unique value of a parameter can create a new airfoil. The naming convention can bedefined by:NACA-MPXX, where M = max camber, P = position of max camber and XX= thickness. The G model uses these parameters as an addition to the inputs of a standard PINN, in order to embedgeometry into the parametric RANS-PINN from previous literature [Ghosh et al., 2023]. The L modelignores the parameters and ingests the computational domain in form of an SDF field in addition tothe coordinates. The SDF in combination with the coordinates can help store information about therelative position of the point cloud points wrt the airfoil surface. The L+G model, however uses thecombined information of the local SDF parameter in addition to the design parameters of the 4-digitairfoil to combine the best features of both approaches.",
  "Conclusions": "A parametric PINN is developed to predict flow fields at unseen Re and unseen airfoil geometriesfor incompressible turbulent flows. The RANS formulation, commonly used in industrial appli-cations due to its computational efficiency, can become expensive for repeated simulations in thecase of design exploration. The proposed PINN surrogate leverages an SDF embedding of airfoilgeometries, in addition to physics losses from RANS formulation with 2-equation turbulent models.Parameterized with respect to varying geometries and inlet velocities, the current PINN surrogateis able to predict flows over unknown for various NACA airfoils at different Re and geometries.",
  "H. Eivazi, M. Tahani, P. Schlatter, and R. Vinuesa. Physics-informed neural networks for solving reynolds-averaged navierstokes equations. Physics of Fluids, 34(7):075117, 2022": "S. Ghosh, A. Chakraborty, G. O. Brikis, and B. Dey. RANS-PINN based Simulation Surrogates for PredictingTurbulent Flows. ICML Workshop on Synergy of Scientific and Machine Learning Modeling Workshop (SynS& ML), 2023. X. Guo, W. Li, and F. Iorio. Convolutional neural networks for steady flow approximation. In Proceedings of the22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD 16, page481490, New York, NY, USA, 2016. Association for Computing Machinery.",
  "J.-T. Hsieh, S. Zhao, S. Eismann, L. Mirabella, and S. Ermon. Learning Neural PDE Solvers with ConvergenceGuarantees, 2019": "C. M. Jiang, S. Esmaeilzadeh, K. Azizzadenesheli, K. Kashinath, M. Mustafa, H. A. Tchelepi, P. Marcus,A. Anandkumar, et al. MeshfreeFlowNet: A Physics-Constrained Deep Continuous Space-Time Super-Resolution Framework. arXiv preprint arXiv:2005.01463, 2020. D. Kochkov, J. A. Smith, A. Alieva, Q. Wang, M. P. Brenner, and S. Hoyer. Machine learningacceleratedcomputational fluid dynamics. Proceedings of the National Academy of Sciences, 118(21):e2101784118,2021. Z. Li, N. Kovachki, C. Choy, B. Li, J. Kossaifi, S. Otta, M. A. Nabian, M. Stadler, C. Hundt, K. Azizzadenesheli,and A. Anandkumar. Geometry-informed neural operator for large-scale 3d pdes. In A. Oh, T. Naumann,A. Globerson, K. Saenko, M. Hardt, and S. Levine, editors, Advances in Neural Information ProcessingSystems, volume 36, pages 3583635854. Curran Associates, Inc., 2023.",
  "M. A. Nabian and H. Meidani. A deep learning solution approach for high-dimensional random differentialequations. Probabilistic Engineering Mechanics, 57:1425, 2019": "J. Oldenburg, F. Borowski, A. ner, K.-P. Schmitz, and M. Stiehm. Geometry aware physics informed neuralnetwork surrogate for solving navierstokes equation (gapinn). Advanced Modeling and Simulation inEngineering Sciences, 9(1):8, 2022. Y. Patel, V. Mons, O. Marquet, and G. Rigas. Turbulence model augmented physics-informed neural networksfor mean-flow reconstruction. Phys. Rev. Fluids, 9:034605, Mar 2024. doi: 10.1103/PhysRevFluids.9.034605. F. Pioch, J. H. Harmening, A. M. Mller, F.-J. Peitzmann, D. Schramm, and O. el Moctar. Turbulence Modelingfor Physics-Informed Neural Networks: Comparison of Different RANS Models for the Backward-FacingStep Flow. Fluids, 8(2), 2023. ISSN 2311-5521. doi: 10.3390/fluids8020043. M. Raissi, P. Perdikaris, and G. E. Karniadakis. Physics-informed neural networks: A deep learning frameworkfor solving forward and inverse problems involving nonlinear partial differential equations. Journal ofComputational physics, 378:686707, 2019.",
  "R. Vinuesa and S. L. Brunton. Enhancing computational fluid dynamics with machine learning. NatureComputational Science, 2(6):358366, 2022": "R. Wang, K. Kashinath, M. Mustafa, A. Albert, and R. Yu. Towards physics-informed deep learning for turbulentflow prediction. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery& Data Mining, pages 14571466, 2020. A. Warey, S. Kaushik, B. Khalighi, M. Cruse, and G. Venkatesan. Data-driven prediction of vehicle cabinthermal comfort: using machine learning and high-fidelity simulation results. International Journal of Heatand Mass Transfer, 148:119083, 2020. T. Zhang, B. Dey, P. Kakkar, A. Dasgupta, and A. Chakraborty. Frequency-compensated PINNs for Fluid-dynamic Design Problems. NeurIPS Workshop on Machine Learning for Engineering Modeling, Simulation,and Design, arXiv:2011.01456, 2020. T. Zhang, B. Dey, K. Veeraraghavan, H. Kulkarni, and A. Chakraborty. Demystifying the Data Need ofML-surrogates for CFD Simulations.AAAI Workshop on AI to Accelerate Science and Engineering,arXiv:2205.08355, 2022."
}