{
  "Abstract": "Modeling strong gravitational lenses is computationally expensive for the complexdata from modern and next-generation cosmic surveys. Deep learning has emergedas a promising approach for finding lenses and predicting lensing parameters,such as the Einstein radius. Mean-variance Estimators (MVEs) are a commonapproach for obtaining aleatoric (data) uncertainties from a neural network predic-tion. However, neural networks have not been demonstrated to perform well onout-of-domain target data successfully e.g., when trained on simulated data andapplied to real, observational data. In this work, we perform the first study of theefficacy of MVEs in combination with unsupervised domain adaptation (UDA) onstrong lensing data. The source domain data is noiseless, and the target domaindata has noise mimicking modern cosmology surveys. We find that adding UDAto MVE increases the accuracy on the target data by a factor of about two over anMVE model without UDA. Including UDA also permits much more well-calibratedaleatoric uncertainty predictions. Advancements in this approach may enable futureapplications of MVE models to real observational data.",
  "Introduction and Related Work": "Strong gravitational lensing provides critical insights into galaxy evolution, dark matter, and darkenergy . Modern cosmological surveys are expected to contain 103 - 105 lensing systems . Traditionallens finding techniques have relied heavily on human-intensive image reviewing ,and modeling has relied on computationally-intensive analytic likelihood-fitting .This has motivated supervised deep learning-based techniques like neural network classification andregression to be applied to strong lensing in addition to a wide variety of cosmology topics . Obtaining uncertainties is important for these areas of study . They can be obtained innetwork regression through a variety of methods e.g., MC Dropout , BayesianNeural Networks [BNNs; 19, 18, 8, 114, 43], mean-variance estimation , DeepEnsembles , Deep Evidential Regression , and Simulation-Based Inference . Once trained, these methods are typically very fast comparedto traditional parametric modeling methods . However, all of these models face the challengethat there is insufficient observational data for training and instead rely on realistic simulations.",
  "arXiv:2411.03334v3 [astro-ph.IM] 7 Jan 2025": "Despite the realism, simulated data can differ from real, observational data e.g., the imagenoise parameters, the range of astrophysics parameters, or the range of cosmology parameters.Sometimes, real data is used directly in training or is combined with simulated data .The differences between the training data (source domain data) and the real observational data(target domain data) constitute domain shifts between data distributions that cause models to favorthe source (training) data . Typically, this problem arises when there are few orno labels for the target data for the model to train on . Domain adaptation (DA) is aclass of deep learning techniques that help neural networks adapt to domain shifts so that thefeature spaces of the source and target data domains align when the domain-adapted model isapplied . Unsupervised domain adaptation (UDA) is a subclass of techniquesthat use unlabeled target data . Studies have explored DA in many fields, includingcosmology and strong lensing . In this work, wecombine MVE and UDA and compare the performance of MVE-UDA and MVE-only models onstrong lensing data in two domains that are distinguished by the noise in the images.",
  "Methods: Lensing, Mean-variance Networks, and Domain Adaptation": "Physics of strong lensing: Galaxy-scale strong lensing occurs when a foreground lens galaxy deflectslight from a background galaxy, creating a magnified and warped image of the background object.This distorted image is the primary observable ((a)) for predicting physics parameters. Multiplekinds of noise sources e.g., atmosphere, sky brightness, CCD readout, and photon counting canfurther distort the image. The Einstein radius E indicates the spatial scale of the lensing system anddepends on the lens galaxy mass distribution, which is complex but can often be modeled with a5-parameter singular isothermal ellipsoid (SIE), including the Einstein radius . We predict E. Mean-variance Estimation Networks: Mean-variance Estimators (MVEs) estimate the mean andvariance of data labels, where the variance is the square of the aleatoric uncertainty al .The MVE loss function is set to the -negative log-likelihood: LMVE = LNLL(NLL), whereNLL is a hyperparameter. For the NLL loss, the gradient becomes small for high-variance datapoints, causing them to be undersampled. The -NLL approach resolves this by multiplying avariance-re-weighting term 2NLL . For NLL = 1, the gradient is equivalent to that for themean-squared error (MSE) loss. For NLL = 0, the original NLL loss is recovered. Unsupervised Domain Adaptation (UDA): In UDA, the source data have labels, while the targetdata do not have labels. Common UDA approaches include adversarial methods and distance-based methods . We use the distance-based method, MaximumMean Discrepancy (MMD), wherein the loss LUDA is a multi-dimensional distance between latentembeddings of the source and target data sets . In minimizing the MMD loss, theseembeddings of the source and target data become aligned and include domain-invariant features,which allows the model to perform well on domain-shifted data. : (a): Example lensing images in the source domain (top) and the target domain (bottom) inbands g, r, and z. (b): Isomaps of the latent space embeddings when the MVE-only model (left) andthe MVE-UDA model (right) are applied to the source (triplet) and target (circle) domain data. Combining MVE and UDA: We combine these two methods via their loss functions. First, thesource and target data are both passed through convolutional layers. UDA loss is then calculated onthe source and target domain latent embedding i.e., the layer where extracted features are flattenedinto one dimension. Then, the source domain embedding is passed into dense layers, and the MVE",
  "Experiments": "Data: We use the deeplenstronomy to simulate ground-based telescope images ofgalaxy-scale strong lenses. Images have a pixel scale 0.263/pixel, matching the Dark Energy Survey(DES) . The lens galaxy light profile (Srsic) is assumed to be centered on the lensing mass.We use theoretically and empirically inspired uniform priors for typical strong lensing parameterdistributions. For the lens mass, we use SIE profile, Einstein radius E, eccentricity {el,1, el,2}, andexternal shear {1, 2} . Two-dimensional source eccentricity is {es,1, es,2}. For the lens andsource light profiles, we use Srsic profiles with distribution index n, and scale radius R. The relativeangular positions between the background and lens galaxies are {x, y}. Prior ranges for all simulationparameters can be found in . We use three photometric bands (g, r, z) to get rich image morphologies during training. To generaterealistic galaxy colors, each simulated lens galaxy is assigned a redshift in the range zl < 0.7, andeach background galaxy a redshift in the range 1.27 < zs < 2 according to the DES Y3 GoldCatalog . Each galaxy is randomly assigned a color from a real galaxy according to theassigned redshift . So that each lens galaxy is visible but not saturated, we use a lower limit on theapparent magnitude for all bands ({mg, mr, mz} > 17.5) and an upper limit for any one of the bands({mg, mr, mz} < 21). For the background galaxy, we use the limits {mg, mr, mz} > 17.5 andmg < 22 . Redshifts are used solely for colors and are independent of the lensing configuration. We induce a domain shift between the source and the target domains in terms of image noise. Thesource data has noise characteristics that represent a nearly noiseless image: read noise is 0 e; nosky brightness is added; the exposure time is 1000 seconds (set high to minimize Poisson/shot noise);the number of exposures is 10; the zero-point magnitude is 30; the CCD gain is 6.083 e/count;seeing is 0.9 (moderate for modern optical cosmic surveys) . In contrast, the target datahas noise that mimics DES: the read noise is 7.0 e, the exposure time is 90 seconds (typical ofmodern optical cosmic surveys) , and the number of exposures, the magnitude zero point, thesky brightness, and the seeing are sampled from empirical distributions . Our dataset has 100,000objects each for the source and target data. We use a 70/10/20 (training/validation/test) split for alldata. The test set is used for all results in this paper. All images have a shape of 4040 pixels. Thedataset uses 9 GB. Project data can be found on Zenodo. An example image is shown in (a). Model Optimization: We build our models using PyTorch . The network has three convolutionblocks (each with a convolution, maxpooling, and batch normalization layer) followed by three denselayers with 128, 32, and two nodes, respectively. MVE techniques present challenges for training e.g., highly fluctuating loss functions . We found that a batch size of 128, a learning rate of 0.001,and default settings for AdamW provided optimal model performance . We considered schedulingof the hyperparameters for the UDA and MVE losses. We found the best results with NLL = 0.5 and UDA = 1.4. Over 150 epochs of training, we selected the best model as the one that minimizedthe MVE loss on source data. For some seeds, the MVE-UDA model pathologically predicts a mean",
  "(b)": ": (a): The four left plots show the residuals of the Einstein radius inference for the MVE-onlymodel on the source data (purple, solid), the MVE-only model on the target data (pink, dashed),the MVE-UDA model on the source data (orange, solid), and the MVE-UDA model on the targetdata (cyan, dashed). The points and error bars are the residuals from the means and the aleatoricuncertainties for randomly selected objects from the test set in each domain. The sample standarddeviation is shaded with the corresponding color for each plot. The fifth (right) plot shows the binnedaverage aleatoric uncertainty al. (b): Uncertainty coverage on the Einstein radius for the MVE-onlyand MVE-UDA models applied to source and target data for five randomly seeded models. The boldlines highlight the Selected model. Panels (a) and (b) share the same colors and line styles. : Mean residual E and mean aleatoric uncertainty al of the for the Selected Model;the Median Emed and almed across five MVE-only and five MVE-UDA model fits. Theunits are arcsec (). Calculations are described in 4. Appendix E briefly discusses quantities for thefour other models.",
  "Results: UDA improves MVE performance on the target domain": "We trained five models that differed in their weight initialization. The median results across ini-tializations are consistent with the Selected model (). Therefore, unless otherwise stated,we refer only to results of the Selected model for clarity of presentation. For the mean residualE = E,pred E,true and aleatoric uncertainty al, we take the mean over all the datafor a single model. Ideally, the successful combination of MVE and UDA (MVE-UDA) wouldperform comparably to the MVE-only model on the source data. When applied to source data, theMVE-UDA model has a higher mean residual E by 0.015 compared to the MVE-only model((a), (a; four left plots)). The mean uncertainty of the MVE-UDA model is approximatelytwice that of the MVE-only model ((b), (a; fifth, right plot)). At the same time, theMVE-UDA model is better calibrated (less underconfident) than the MVE-only model ((b)).For target data, however, the MVE-only model has a high mean residual E = 0.0818, twicethe MVE-UDA models mean residual E = 0.0425 ((a)). In contrast, the MVE-onlymodel has a low mean uncertainty al = 0.0253, half the MVE-UDA models mean uncertaintyal = 0.0503 ((b)). Commensurately, the MVE-only model is significantly overconfident,while the MVE-UDA model is only slightly overconfident ((b)) on target data. The MVE-UDA model uncertainty is higher at both low and high values of E ((a) and (a;fifth, right plot))). The high uncertainty for the MVE-UDA model at low E may be due to low imageresolution or high seeing, such that smaller lensing arcs could be obscured. The high uncertaintyat high E may be caused by the image being too small to contain the lensing arcs. The residualsand uncertainties for both models are slightly larger than uncertainties assumed in some studies 0.01 but comparable to those from traditional modeling techniques 1-5% . In(b), we find that the target and source embeddings do not overlap for the MVE-only model. Incontrast, the embeddings overlap almost completely for the MVE-UDA model, and the points exhibit agradient in the Einstein radius. These items indicate that the embedding vectors of both are correlatedwith E, but only the MVE-UDA embedding has accurate alignment across domains. Lastly, thecoverage of the MVE-only model varies significantly on the target data across initializations, butperformance is stable for MVE-UDA ((b)). We find DA is essential to MVE for better calibrated,consistent, and accurate performance on domain-shifted datasets.",
  "Summary and Outlook": "In this work, we provide the first demonstration that unsupervised domain adaptation (UDA) signifi-cantly improves the performance of mean-variance estimator (MVE) models on unlabeled target data.We predicted the Einstein radius of strong gravitational lenses with MVEs (2). We incurred a domainshift between the source and target domains so that the source images are approximately noiseless,and the target images have noise characteristics similar to DES (3). When applied to the noisytarget data, the MVE-UDA model is significantly better calibrated, more consistent across weightinitialization, and more accurate than the MVE-only model ((a) and (c,d)). Similarapproaches may improve neural network model performance when applied to real, observational data. T. M. C. Abbott, F. B. Abdalla, S. Allam, A. Amara, J. Annis, J. Asorey, S. Avila, O. Ballester,M. Banerji, W. Barkhouse, L. Baruah, M. Baumer, K. Bechtol, M. R. Becker, A. Benoit-Lvy, G. M. Bernstein, E. Bertin, J. Blazek, S. Bocquet, D. Brooks, D. Brout, E. Buckley-Geer, D. L. Burke, V. Busti, R. Campisano, L. Cardiel-Sas, A. Carnero Rosell, M. CarrascoKind, J. Carretero, F. J. Castander, R. Cawthon, C. Chang, X. Chen, C. Conselice, G. Costa,M. Crocce, C. E. Cunha, C. B. DAndrea, L. N. da Costa, R. Das, G. Daues, T. M. Davis,C. Davis, J. De Vicente, D. L. DePoy, J. DeRose, S. Desai, H. T. Diehl, J. P. Dietrich,S. Dodelson, P. Doel, A. Drlica-Wagner, T. F. Eifler, A. E. Elliott, A. E. Evrard, A. Farahi,A. Fausti Neto, E. Fernandez, D. A. Finley, B. Flaugher, R. J. Foley, P. Fosalba, D. N. Friedel,J. Frieman, J. Garca-Bellido, E. Gaztanaga, D. W. Gerdes, T. Giannantonio, M. S. S. Gill,K. Glazebrook, D. A. Goldstein, M. Gower, D. Gruen, R. A. Gruendl, J. Gschwend, R. R.Gupta, G. Gutierrez, S. Hamilton, W. G. Hartley, S. R. Hinton, J. M. Hislop, D. Hollowood,K. Honscheid, B. Hoyle, D. Huterer, B. Jain, D. J. James, T. Jeltema, M. W. G. Johnson, M. D.Johnson, T. Kacprzak, S. Kent, G. Khullar, M. Klein, A. Kovacs, A. M. G. Koziol, E. Krause,A. Kremin, R. Kron, K. Kuehn, S. Kuhlmann, N. Kuropatkin, O. Lahav, J. Lasker, T. S. Li,R. T. Li, A. R. Liddle, M. Lima, H. Lin, P. Lpez-Reyes, N. MacCrann, M. A. G. Maia,J. D. Maloney, M. Manera, M. March, J. Marriner, J. L. Marshall, P. Martini, T. McClintock,T. McKay, R. G. McMahon, P. Melchior, F. Menanteau, C. J. Miller, R. Miquel, J. J. Mohr,E. Morganson, J. Mould, E. Neilsen, R. C. Nichol, F. Nogueira, B. Nord, P. Nugent, L. Nunes,R. L. C. Ogando, L. Old, A. B. Pace, A. Palmese, F. Paz-Chinchn, H. V. Peiris, W. J. Percival,D. Petravick, A. A. Plazas, J. Poh, C. Pond, A. Porredon, A. Pujol, A. Refregier, K. Reil,P. M. Ricker, R. P. Rollins, A. K. Romer, A. Roodman, P. Rooney, A. J. Ross, E. S. Rykoff,M. Sako, M. L. Sanchez, E. Sanchez, B. Santiago, A. Saro, V. Scarpine, D. Scolnic, S. Serrano,I. Sevilla-Noarbe, E. Sheldon, N. Shipp, M. L. Silveira, M. Smith, R. C. Smith, J. A. Smith,M. Soares-Santos, F. Sobreira, J. Song, A. Stebbins, E. Suchyta, M. Sullivan, M. E. C. Swanson,G. Tarle, J. Thaler, D. Thomas, R. C. Thomas, M. A. Troxel, D. L. Tucker, V. Vikram, A. K.Vivas, A. R. Walker, R. H. Wechsler, J. Weller, W. Wester, R. C. Wolf, H. Wu, B. Yanny,A. Zenteno, Y. Zhang, J. Zuntz, DES Collaboration, S. Juneau, M. Fitzpatrick, R. Nikutta,D. Nidever, K. Olsen, A. Scott, and NOAO Data Lab. The Dark Energy Survey: Data Release1. ApJS, 239(2):18, December 2018.",
  "Taiga Abe, E. Kelly Buchanan, Geoff Pleiss, Richard Zemel, and John P. Cunningham. DeepEnsembles Work, But Are They Necessary? arXiv e-prints, page arXiv:2202.06985, February2022": "Hiroaki Aihara, Yusra AlSayyad, Makoto Ando, Robert Armstrong, James Bosch, EiichiEgami, Hisanori Furusawa, Junko Furusawa, Sumiko Harasawa, Yuichi Harikane, Bau-ChingHsieh, Hiroyuki Ikeda, Kei Ito, Ikuru Iwata, Tadayuki Kodama, Michitaro Koike, MitsuruKokubo, Yutaka Komiyama, Xiangchong Li, Yongming Liang, Yen-Ting Lin, Robert H.Lupton, Nate B. Lust, Lauren A. MacArthur, Ken Mawatari, Sogo Mineo, Hironao Miyatake,Satoshi Miyazaki, Surhud More, Takahiro Morishima, Hitoshi Murayama, Kimihiko Nakajima,Fumiaki Nakata, Atsushi J. Nishizawa, Masamune Oguri, Nobuhiro Okabe, Yuki Okura,Yoshiaki Ono, Ken Osato, Masami Ouchi, Yen-Chen Pan, Andrs A. Plazas Malagn, Paul A.Price, Sophie L. Reed, Eli S. Rykoff, Takatoshi Shibuya, Mirko Simunovic, Michael A. Strauss,Kanako Sugimori, Yasushi Suto, Nao Suzuki, Masahiro Takada, Yuhei Takagi, TadafumiTakata, Satoshi Takita, Masayuki Tanaka, Shenli Tang, Dan S. Taranu, Tsuyoshi Terai, YoshikiToba, Edwin L. Turner, Hisakazu Uchiyama, Bovornpratch Vijarnwannaluk, Christopher Z.Waters, Yoshihiko Yamada, Naoaki Yamamoto, and Takuji Yamashita. Third data release ofthe Hyper Suprime-Cam Subaru Strategic Program. PASJ, 74(2):247272, April 2022. Andreas Albrecht, Gary Bernstein, Robert Cahn, Wendy L. Freedman, Jacqueline Hewitt,Wayne Hu, John Huth, Marc Kamionkowski, Edward W. Kolb, Lloyd Knox, John C. Mather,Suzanne Staggs, and Nicholas B. Suntzeff. Report of the Dark Energy Task Force, September2006. arXiv:astro-ph/0609591.",
  "Julyan Arbel, Konstantinos Pitas, Mariia Vladimirova, and Vincent Fortuin. A Primer onBayesian Neural Networks: Review and Debates. arXiv e-prints, page arXiv:2309.16314,September 2023": "Astropy Collaboration, A. M. Price-Whelan, B. M. Sipocz, H. M. Gnther, P. L. Lim, S. M.Crawford, S. Conseil, D. L. Shupe, M. W. Craig, N. Dencheva, A. Ginsburg, J. T. VanderPlas, L. D. Bradley, D. Prez-Surez, M. de Val-Borro, T. L. Aldcroft, K. L. Cruz, T. P.Robitaille, E. J. Tollerud, C. Ardelean, T. Babej, Y. P. Bach, M. Bachetti, A. V. Bakanov,S. P. Bamford, G. Barentsen, P. Barmby, A. Baumbach, K. L. Berry, F. Biscani, M. Boquien,K. A. Bostroem, L. G. Bouma, G. B. Brammer, E. M. Bray, H. Breytenbach, H. Buddelmeijer,D. J. Burke, G. Calderone, J. L. Cano Rodrguez, M. Cara, J. V. M. Cardoso, S. Cheedella,Y. Copin, L. Corrales, D. Crichton, D. DAvella, C. Deil, . Depagne, J. P. Dietrich, A. Donath,M. Droettboom, N. Earl, T. Erben, S. Fabbro, L. A. Ferreira, T. Finethy, R. T. Fox, L. H.Garrison, S. L. J. Gibbons, D. A. Goldstein, R. Gommers, J. P. Greco, P. Greenfield, A. M.Groener, F. Grollier, A. Hagen, P. Hirst, D. Homeier, A. J. Horton, G. Hosseinzadeh, L. Hu,J. S. Hunkeler, . Ivezic, A. Jain, T. Jenness, G. Kanarek, S. Kendrew, N. S. Kern, W. E.Kerzendorf, A. Khvalko, J. King, D. Kirkby, A. M. Kulkarni, A. Kumar, A. Lee, D. Lenz, S. P.Littlefair, Z. Ma, D. M. Macleod, M. Mastropietro, C. McCully, S. Montagnac, B. M. Morris,M. Mueller, S. J. Mumford, D. Muna, N. A. Murphy, S. Nelson, G. H. Nguyen, J. P. Ninan,M. Nthe, S. Ogaz, S. Oh, J. K. Parejko, N. Parley, S. Pascual, R. Patil, A. A. Patil, A. L.Plunkett, J. X. Prochaska, T. Rastogi, V. Reddy Janga, J. Sabater, P. Sakurikar, M. Seifert,L. E. Sherbert, H. Sherwood-Taylor, A. Y. Shih, J. Sick, M. T. Silbiger, S. Singanamalla, L. P.Singer, P. H. Sladen, K. A. Sooley, S. Sornarajah, O. Streicher, P. Teuben, S. W. Thomas,G. R. Tremblay, J. E. H. Turner, V. Terrn, M. H. van Kerkwijk, A. de la Vega, L. L. Watkins,B. A. Weaver, J. B. Whitmore, J. Woillez, V. Zabalza, and Astropy Contributors. The AstropyProject: Building an Open-science Project and Status of the v2.0 Core Package. AJ, 156(3):123,September 2018. Astropy Collaboration, Adrian M. Price-Whelan, Pey Lian Lim, Nicholas Earl, NathanielStarkman, Larry Bradley, David L. Shupe, Aarya A. Patil, Lia Corrales, C. E. Brasseur,Maximilian N\"othe, Axel Donath, Erik Tollerud, Brett M. Morris, Adam Ginsburg, Eero Vaher,Benjamin A. Weaver, James Tocknell, William Jamieson, Marten H. van Kerkwijk, Thomas P.Robitaille, Bruce Merry, Matteo Bachetti, H. Moritz G\"unther, Thomas L. Aldcroft, Jaime A.Alvarado-Montes, Anne M. Archibald, Attila Bodi, Shreyas Bapat, Geert Barentsen, JuanjoBazan, Manish Biswas, Mederic Boquien, D. J. Burke, Daria Cara, Mihai Cara, Kyle E.Conroy, Simon Conseil, Matthew W. Craig, Robert M. Cross, Kelle L. Cruz, FrancescoDEugenio, Nadia Dencheva, Hadrien A. R. Devillepoix, J\"org P. Dietrich, Arthur DavisEigenbrot, Thomas Erben, Leonardo Ferreira, Daniel Foreman-Mackey, Ryan Fox, NabilFreij, Suyog Garg, Robel Geda, Lauren Glattly, Yash Gondhalekar, Karl D. Gordon, DavidGrant, Perry Greenfield, Austen M. Groener, Steve Guest, Sebastian Gurovich, RasmusHandberg, Akeem Hart, Zac Hatfield-Dodds, Derek Homeier, Griffin Hosseinzadeh, TimJenness, Craig K. Jones, Prajwel Joseph, J. Bryce Kalmbach, Emir Karamehmetoglu, MikolajKaluszynski, Michael S. P. Kelley, Nicholas Kern, Wolfgang E. Kerzendorf, Eric W. Koch,Shankar Kulumani, Antony Lee, Chun Ly, Zhiyuan Ma, Conor MacBride, Jakob M. Maljaars,Demitri Muna, N. A. Murphy, Henrik Norman, Richard OSteen, Kyle A. Oman, CamillaPacifici, Sergio Pascual, J. Pascual-Granado, Rohit R. Patil, Gabriel I. Perren, Timothy E.Pickering, Tanuj Rastogi, Benjamin R. Roulston, Daniel F. Ryan, Eli S. Rykoff, Jose Sabater,Parikshit Sakurikar, Jesus Salgado, Aniket Sanghi, Nicholas Saunders, Volodymyr Savchenko,Ludwig Schwardt, Michael Seifert-Eckert, Albert Y. Shih, Anany Shrey Jain, GyanendraShukla, Jonathan Sick, Chris Simpson, Sudheesh Singanamalla, Leo P. Singer, Jaladh Singhal,Manodeep Sinha, Brigitta M. SipHocz, Lee R. Spitler, David Stansby, Ole Streicher, JaniSumak, John D. Swinbank, Dan S. Taranu, Nikita Tewary, Grant R. Tremblay, Miguel deVal-Borro, Samuel J. Van Kooten, Zlatan Vasovic, Shresth Verma, Jose Vinicius de MirandaCardoso, Peter K. G. Williams, Tom J. Wilson, Benjamin Winkel, W. M. Wood-Vasey, RuiXue, Peter Yoachim, Chen Zhang, Andrea Zonca, and Astropy Project Contributors. TheAstropy Project: Sustaining and Growing a Community-oriented Open-source Project and theLatest Major Release (v5.0) of the Core Package. ApJ, 935(2):167, August 2022. Astropy Collaboration, T. P. Robitaille, E. J. Tollerud, P. Greenfield, M. Droettboom, E. Bray,T. Aldcroft, M. Davis, A. Ginsburg, A. M. Price-Whelan, W. E. Kerzendorf, A. Conley,N. Crighton, K. Barbary, D. Muna, H. Ferguson, F. Grollier, M. M. Parikh, P. H. Nair, H. M.Unther, C. Deil, J. Woillez, S. Conseil, R. Kramer, J. E. H. Turner, L. Singer, R. Fox, B. A.Weaver, V. Zabalza, Z. I. Edwards, K. Azalee Bostroem, D. J. Burke, A. R. Casey, S. M.Crawford, N. Dencheva, J. Ely, T. Jenness, K. Labrie, P. L. Lim, F. Pierfederici, A. Pontzen,A. Ptak, B. Refsdal, M. Servillat, and O. Streicher. Astropy: A community Python packagefor astronomy. A&A, 558:A33, October 2013.",
  "Simon Birrer, Adam Amara, and Alexandre Refregier. Gravitational lens modeling with basissets. The Astrophysical Journal, 813(2):102, nov 2015": "Simon Birrer, Anowar J. Shajib, Daniel Gilman, Aymeric Galan, Jelle Aalbers, Martin Millon,Robert Morgan, Giulia Pagano, Ji Won Park, Luca Teodori, Nicolas Tessore, Madison Ueland,Lyne Van de Vyvere, Sebastian Wagner-Carena, Ewoud Wempe, Lilan Yang, Xuheng Ding,Thomas Schmidt, Dominique Sluse, Ming Zhang, and Adam Amara. lenstronomy ii: Agravitational lensing software ecosystem. Journal of Open Source Software, 6(62):3283, 2021. Corey Brummel-Smith, Danielle Skinner, Snigdaa S. Sethuram, John H. Wise, Bin Xia, andKhushi Taori. Inferred galaxy properties during Cosmic Dawn from early JWST photometryresults, August 2023. arXiv:2302.04882 [astro-ph]. Lars Buitinck, Gilles Louppe, Mathieu Blondel, Fabian Pedregosa, Andreas Mueller, OlivierGrisel, Vlad Niculae, Peter Prettenhofer, Alexandre Gramfort, Jaques Grobler, Robert Layton,Jake VanderPlas, Arnaud Joly, Brian Holt, and Gal Varoquaux. API design for machinelearning software: experiences from the scikit-learn project. In ECML PKDD Workshop:Languages for Data Mining and Machine Learning, pages 108122, 2013. Jess Carrete, Hadrin Montes-Campos, Ralf Wanzenbck, Esther Heid, and Georg K. H.Madsen. Deep ensembles vs committees for uncertainty estimation in neural-network forcefields: Comparison and application to active learning. The Journal of Chemical Physics,158(20):204801, May 2023.",
  "Nicki S. Detlefsen, Martin Jrgensen, and Sren Hauberg. Reliable training and estimation ofvariance networks. arXiv e-prints, page arXiv:1906.03260, June 2019": "Arjun Dey, David J. Schlegel, Dustin Lang, Robert Blum, Kaylan Burleigh, Xiaohui Fan,Joseph R. Findlay, Doug Finkbeiner, David Herrera, Stphanie Juneau, Martin Landriau,Michael Levi, Ian McGreer, Aaron Meisner, Adam D. Myers, John Moustakas, Peter Nugent, Anna Patej, Edward F. Schlafly, Alistair R. Walker, Francisco Valdes, Benjamin A. Weaver,Christophe Yche, Hu Zou, Xu Zhou, Behzad Abareshi, T. M. C. Abbott, Bela Abolfathi,C. Aguilera, Shadab Alam, Lori Allen, A. Alvarez, James Annis, Behzad Ansarinejad, MarieAubert, Jacqueline Beechert, Eric F. Bell, Segev Y. BenZvi, Florian Beutler, Richard M. Bielby,Adam S. Bolton, Csar Briceo, Elizabeth J. Buckley-Geer, Karen Butler, Annalisa Calamida,Raymond G. Carlberg, Paul Carter, Ricard Casas, Francisco J. Castander, Yumi Choi, JohanComparat, Elena Cukanovaite, Timothe Delubac, Kaitlin DeVries, Sharmila Dey, GovindaDhungana, Mark Dickinson, Zhejie Ding, John B. Donaldson, Yutong Duan, Christopher J.Duckworth, Sarah Eftekharzadeh, Daniel J. Eisenstein, Thomas Etourneau, Parker A. Fagrelius,Jay Farihi, Mike Fitzpatrick, Andreu Font-Ribera, Leah Fulmer, Boris T. Gnsicke, EnriqueGaztanaga, Koshy George, David W. Gerdes, Satya Gontcho A. Gontcho, Claudio Gorgoni,Gregory Green, Julien Guy, Diane Harmer, M. Hernandez, Klaus Honscheid, Lijuan WendyHuang, David J. James, Buell T. Jannuzi, Linhua Jiang, Richard Joyce, Armin Karcher, SoniaKarkar, Robert Kehoe, Jean-Paul Kneib, Andrea Kueter-Young, Ting-Wen Lan, Tod R. Lauer,Laurent Le Guillou, Auguste Le Van Suu, Jae Hyeon Lee, Michael Lesser, Laurence PerreaultLevasseur, Ting S. Li, Justin L. Mann, Robert Marshall, C. E. Martnez-Vzquez, Paul Martini,Hlion du Mas des Bourboux, Sean McManus, Tobias Gabriel Meier, Brice Mnard, NigelMetcalfe, Andrea Muoz-Gutirrez, Joan Najita, Kevin Napier, Gautham Narayan, Jeffrey A.Newman, Jundan Nie, Brian Nord, Dara J. Norman, Knut A. G. Olsen, Anthony Paat, NathaliePalanque-Delabrouille, Xiyan Peng, Claire L. Poppett, Megan R. Poremba, Abhishek Prakash,David Rabinowitz, Anand Raichoor, Mehdi Rezaie, A. N. Robertson, Natalie A. Roe, Ashley J.Ross, Nicholas P. Ross, Gregory Rudnick, Sasha Safonova, Abhijit Saha, F. Javier Snchez,Elodie Savary, Heidi Schweiker, Adam Scott, Hee-Jong Seo, Huanyuan Shan, David R. Silva,Zachary Slepian, Christian Soto, David Sprayberry, Ryan Staten, Coley M. Stillman, Robert J.Stupak, David L. Summers, Suk Sien Tie, H. Tirado, Mariana Vargas-Magaa, A. KatherinaVivas, Risa H. Wechsler, Doug Williams, Jinyi Yang, Qian Yang, Tolga Yapici, Dennis Zaritsky,A. Zenteno, Kai Zhang, Tianmeng Zhang, Rongpu Zhou, and Zhimin Zhou. Overview of theDESI Legacy Imaging Surveys. AJ, 157(5):168, May 2019.",
  "Wei Du, Liping Fu, Yiping Shu, Ran Li, Zuhui Fan, and Chenggang Shu. Mass Reconstruc-tion of Galaxy-scale Strong Gravitational Lenses Using a Broken Power-law Model. ApJ,953(2):189, August 2023": "Romain Egele, Romit Maulik, Krishnan Raghavan, Bethany Lusch, Isabelle Guyon, andPrasanna Balaprakash. AutoDEUQ: Automated Deep Ensemble with Uncertainty Quantifica-tion. arXiv e-prints, page arXiv:2110.13511, October 2021. Tim Eifler, Hironao Miyatake, Elisabeth Krause, Chen Heinrich, Vivian Miranda, ChristopherHirata, Jiachuan Xu, Shoubaneh Hemmati, Melanie Simet, Peter Capak, Ami Choi, OlivierDor, Cyrille Doux, Xiao Fang, Rebekah Hounsell, Eric Huff, Hung-Jin Huang, Mike Jarvis,Jeffrey Kruk, Dan Masters, Eduardo Rozo, Dan Scolnic, David N. Spergel, Michael Troxel,Anja von der Linden, Yun Wang, David H. Weinberg, Lukas Wenzl, and Hao-Yi Wu. Cos-mology with the Roman Space Telescope - multiprobe strategies. Monthly Notices of theRoyal Astronomical Society, 507:17461761, October 2021. Publisher: OUP ADS Bibcode:2021MNRAS.507.1746E.",
  "Linus Ericsson, Da Li, and Timothy M. Hospedales. Better Practices for Domain Adaptation.arXiv e-prints, page arXiv:2309.03879, September 2023": "Amy Etherington, James W. Nightingale, Richard Massey, XiaoYue Cao, Andrew Robertson,Nicola C. Amorisco, Aristeidis Amvrosiadis, Shaun Cole, Carlos S. Frenk, Qiuhan He, RanLi, and Sut-Ieng Tam. Automated galaxy-galaxy strong lens modelling: No lens left behind.MNRAS, 517(3):32753302, December 2022. Euclid Collaboration, Y. Mellier, Abdurrouf, J. A. Acevedo Barroso, A. Achcarro, J. Adamek,R. Adam, G. E. Addison, N. Aghanim, M. Aguena, V. Ajani, Y. Akrami, A. Al-Bahlawan,A. Alavi, I. S. Albuquerque, G. Alestas, G. Alguero, A. Allaoui, S. W. Allen, V. Allevato, A. V.Alonso-Tetilla, B. Altieri, A. Alvarez-Candal, A. Amara, L. Amendola, J. Amiaux, I. T. Andika,S. Andreon, A. Andrews, G. Angora, R. E. Angulo, F. Annibali, A. Anselmi, S. Anselmi,S. Arcari, M. Archidiacono, G. Aric, M. Arnaud, S. Arnouts, M. Asgari, J. Asorey, L. Atayde,H. Atek, F. Atrio-Barandela, M. Aubert, E. Aubourg, T. Auphan, N. Auricchio, B. Aussel, H. Aussel, P. P. Avelino, A. Avgoustidis, S. Avila, S. Awan, R. Azzollini, C. Baccigalupi,E. Bachelet, D. Bacon, M. Baes, M. B. Bagley, B. Bahr-Kalus, A. Balaguera-Antolinez,E. Balbinot, M. Balcells, M. Baldi, I. Baldry, A. Balestra, M. Ballardini, O. Ballester,M. Balogh, E. Baados, R. Barbier, S. Bardelli, T. Barreiro, J. C. Barriere, B. J. Barros,A. Barthelemy, N. Bartolo, A. Basset, P. Battaglia, A. J. Battisti, C. M. Baugh, L. Baumont,L. Bazzanini, J. P. Beaulieu, V. Beckmann, A. N. Belikov, J. Bel, F. Bellagamba, M. Bella,E. Bellini, K. Benabed, R. Bender, G. Benevento, C. L. Bennett, K. Benson, P. Bergamini, J. R.Bermejo-Climent, F. Bernardeau, D. Bertacca, M. Berthe, J. Berthier, M. Bethermin, F. Beutler,C. Bevillon, S. Bhargava, R. Bhatawdekar, L. Bisigello, A. Biviano, R. P. Blake, A. Blan-chard, J. Blazek, L. Blot, A. Bosco, C. Bodendorf, T. Boenke, H. Bhringer, M. Bolzonella,A. Bonchi, M. Bonici, D. Bonino, L. Bonino, C. Bonvin, W. Bon, J. T. Booth, S. Borgani,A. S. Borlaff, E. Borsato, A. Bosco, B. Bose, M. T. Botticella, A. Boucaud, F. Bouche, J. S.Boucher, D. Boutigny, T. Bouvard, H. Bouy, R. A. A. Bowler, V. Bozza, E. Bozzo, E. Bran-chini, S. Brau-Nogue, P. Brekke, M. N. Bremer, M. Brescia, M. A. Breton, J. Brinchmann,T. Brinckmann, C. Brockley-Blatt, M. Brodwin, L. Brouard, M. L. Brown, S. Bruton, J. Bucko,H. Buddelmeijer, G. Buenadicha, F. Buitrago, P. Burger, C. Burigana, V. Busillo, D. Busonero,R. Cabanac, L. Cabayol-Garcia, M. S. Cagliari, A. Caillat, L. Caillat, M. Calabrese, A. Calabro,G. Calderone, F. Calura, B. Camacho Quevedo, S. Camera, L. Campos, G. Canas-Herrera,G. P. Candini, M. Cantiello, V. Capobianco, E. Cappellaro, N. Cappelluti, A. Cappi, K. I.Caputi, C. Cara, C. Carbone, V. F. Cardone, E. Carella, R. G. Carlberg, M. Carle, L. Carminati,F. Caro, J. M. Carrasco, J. Carretero, P. Carrilho, J. Carron Duque, B. Carry, A. Carvalho,C. S. Carvalho, R. Casas, S. Casas, P. Casenove, C. M. Casey, P. Cassata, F. J. Castander,D. Castelao, M. Castellano, L. Castiblanco, G. Castignani, T. Castro, C. Cavet, S. Cavuoti,P. Y. Chabaud, K. C. Chambers, Y. Charles, S. Charlot, N. Chartab, R. Chary, F. Chaumeil,H. Cho, G. Chon, E. Ciancetta, P. Ciliegi, A. Cimatti, M. Cimino, M. R. L. Cioni, R. Claydon,C. Cleland, B. Clment, D. L. Clements, N. Clerc, S. Clesse, S. Codis, F. Cogato, J. Colbert,R. E. Cole, P. Coles, T. E. Collett, R. S. Collins, C. Colodro-Conde, C. Colombo, F. Combes,V. Conforti, G. Congedo, S. Conseil, C. J. Conselice, S. Contarini, T. Contini, L. Conversi, A. R.Cooray, Y. Copin, P. S. Corasaniti, P. Corcho-Caballero, L. Corcione, O. Cordes, O. Corpace,M. Correnti, M. Costanzi, A. Costille, F. Courbin, L. Courcoult Mifsud, H. M. Courtois, M. C.Cousinou, G. Covone, T. Cowell, C. Cragg, G. Cresci, S. Cristiani, M. Crocce, M. Cropper,P. E Crouzet, B. Csizi, J. G. Cuby, E. Cucchetti, O. Cucciati, J. C. Cuillandre, P. A. C. Cunha,V. Cuozzo, E. Daddi, M. DAddona, C. Dafonte, N. Dagoneau, E. Dalessandro, G. B. Dalton,G. DAmico, H. Dannerbauer, P. Danto, I. Das, A. Da Silva, R. da Silva, G. Daste, J. E. Davies,S. Davini, T. de Boer, R. Decarli, B. De Caro, H. Degaudenzi, G. Degni, J. T. A. de Jong, L. F.de la Bella, S. de la Torre, F. Delhaise, D. Delley, G. Delucchi, G. De Lucia, J. Denniston,F. De Paolis, M. De Petris, A. Derosa, S. Desai, V. Desjacques, G. Despali, G. Desprez, J. DeVicente-Albendea, Y. Deville, J. D. F. Dias, A. Daz-Snchez, J. J. Diaz, S. Di Domizio, J. M.Diego, D. Di Ferdinando, A. M. Di Giorgio, P. Dimauro, J. Dinis, K. Dolag, C. Dolding,H. Dole, H. Domnguez Snchez, O. Dor, F. Dournac, M. Douspis, H. Dreihahn, B. Droge,B. Dryer, F. Dubath, P. A. Duc, F. Ducret, C. Duffy, F. Dufresne, C. A. J. Duncan, X. Dupac,V. Duret, R. Durrer, F. Durret, S. Dusini, A. Ealet, A. Eggemeier, P. R. M. Eisenhardt, D. Elbaz,M. Y. Elkhashab, A. Ellien, J. Endicott, A. Enia, T. Erben, J. A. Escartin Vigo, S. Escoffier,I. Escudero Sanz, J. Essert, S. Ettori, M. Ezziati, G. Fabbian, M. Fabricius, Y. Fang, A. Farina,M. Farina, R. Farinelli, S. Farrens, F. Faustini, A. Feltre, A. M. N. Ferguson, P. Ferrando,A. G. Ferrari, A. Ferr-Mateu, P. G. Ferreira, I. Ferreras, I. Ferrero, S. Ferriol, P. Ferruit,D. Filleul, F. Finelli, S. L. Finkelstein, A. Finoguenov, B. Fiorini, F. Flentge, P. Focardi, J. Fon-seca, A. Fontana, F. Fontanot, F. Fornari, P. Fosalba, M. Fossati, S. Fotopoulou, D. Fouchez,N. Fourmanoit, M. Frailis, D. Fraix-Burnet, E. Franceschi, A. Franco, P. Franzetti, J. Frei-hoefer, G. Frittoli, P. A. Frugier, N. Frusciante, A. Fumagalli, M. Fumagalli, M. Fumana,Y. Fu, L. Gabarra, S. Galeotta, L. Galluccio, K. Ganga, H. Gao, J. Garca-Bellido, K. Garcia,J. P. Gardner, B. Garilli, L. M. Gaspar-Venancio, T. Gasparetto, V. Gautard, R. Gavazzi,E. Gaztanaga, L. Genolet, R. Genova Santos, F. Gentile, K. George, Z. Ghaffari, F. Giacomini,F. Gianotti, G. P. S. Gibb, W. Gillard, B. Gillis, M. Ginolfi, C. Giocoli, M. Girardi, S. K.Giri, L. W. K. Goh, P. Gmez-Alvarez, A. H. Gonzalez, E. J. Gonzalez, J. C. Gonzalez,S. Gouyou Beauchamps, G. Gozaliasl, J. Gracia-Carpio, S. Grandis, B. R. Granett, M. Granvik,A. Grazian, A. Gregorio, C. Grenet, C. Grillo, F. Grupp, C. Gruppioni, A. Gruppuso, C. Guer-buez, S. Guerrini, M. Guidi, P. Guillard, C. M. Gutierrez, P. Guttridge, L. Guzzo, S. Gwyn,J. Haapala, J. Haase, C. R. Haddow, M. Hailey, A. Hall, D. Hall, N. Hamaus, B. S. Haridasu, J. Harnois-Draps, C. Harper, W. G. Hartley, G. Hasinger, F. Hassani, N. A. Hatch, S. V. H.Haugan, B. Huler, A. Heavens, L. Heisenberg, A. Helmi, G. Helou, S. Hemmati, K. Henares,O. Herent, C. Hernndez-Monteagudo, T. Heuberger, P. C. Hewett, S. Heydenreich, H. Hilde-brandt, M. Hirschmann, J. Hjorth, J. Hoar, H. Hoekstra, A. D. Holland, M. S. Holliman,W. Holmes, I. Hook, B. Horeau, F. Hormuth, A. Hornstrup, S. Hosseini, D. Hu, P. Hudelot,M. J. Hudson, M. Huertas-Company, E. M. Huff, A. C. N. Hughes, A. Humphrey, L. K.Hunt, D. D. Huynh, R. Ibata, K. Ichikawa, S. Iglesias-Groth, O. Ilbert, S. Ilic, L. Ingoglia,E. Iodice, H. Israel, U. E. Israelsson, L. Izzo, P. Jablonka, N. Jackson, J. Jacobson, M. Ja-fariyazani, K. Jahnke, H. Jansen, M. J. Jarvis, J. Jasche, M. Jauzac, N. Jeffrey, M. Jhabvala,Y. Jimenez-Teja, A. Jimenez Muoz, B. Joachimi, P. H. Johansson, S. Joudaki, E. Jullo, J. J. E.Kajava, Y. Kang, A. Kannawadi, V. Kansal, D. Karagiannis, M. Krcher, A. Kashlinsky, M. V.Kazandjian, F. Keck, E. Keihnen, E. Kerins, S. Kermiche, A. Khalil, A. Kiessling, K. Kiiveri,M. Kilbinger, J. Kim, R. King, C. C. Kirkpatrick, T. Kitching, M. Kluge, M. Knabenhans, J. H.Knapen, A. Knebe, J. P. Kneib, R. Kohley, L. V. E. Koopmans, H. Koskinen, E. Koulouridis,R. Kou, A. Kovcs, I. Kova{c}ic, A. Kowalczyk, K. Koyama, K. Kraljic, O. Krause, S. Kruk,B. Kubik, U. Kuchner, K. Kuijken, M. Kmmel, M. Kunz, H. Kurki-Suonio, F. Lacasa, C. G.Lacey, F. La Franca, N. Lagarde, O. Lahav, C. Laigle, A. La Marca, O. La Marle, B. Lamine,M. C. Lam, A. Lanon, H. Landt, M. Langer, A. Lapi, C. Larcheveque, S. S. Larsen, M. Lat-tanzi, F. Laudisio, D. Laugier, R. Laureijs, G. Lavaux, A. Lawrenson, A. Lazanu, T. Lazeyras,Q. Le Boulch, A. M. C. Le Brun, V. Le Brun, F. Leclercq, S. Lee, J. Le Graet, L. Legrand,K. N. Leirvik, M. Le Jeune, M. Lembo, D. Le Mignant, M. D. Lepinzan, F. Lepori, G. F.Lesci, J. Lesgourgues, L. Leuzzi, M. E. Levi, T. I. Liaudat, G. Libet, P. Liebing, S. Ligori,P. B. Lilje, C. C. Lin, D. Linde, E. Linder, V. Lindholm, L. Linke, S. S. Li, S. J. Liu, I. Lloro,F. S. N. Lobo, N. Lodieu, M. Lombardi, L. Lombriser, P. Lonare, G. Longo, M. Lpez-Caniego,X. Lopez Lopez, J. Lorenzo Alvarez, A. Loureiro, J. Loveday, E. Lusso, J. Macias-Perez,T. Maciaszek, M. Magliocchetti, F. Magnard, E. A. Magnier, A. Magro, G. Mahler, G. Mainetti,D. Maino, E. Maiorano, E. Maiorano, N. Malavasi, G. A. Mamon, C. Mancini, R. Mandelbaum,M. Manera, A. Manjn-Garca, F. Mannucci, O. Mansutti, M. Manteiga Outeiro, R. Maoli,C. Maraston, S. Marcin, P. Marcos-Arenal, B. Margalef-Bentabol, O. Marggraf, D. Marin-ucci, M. Marinucci, K. Markovic, F. R. Marleau, J. Marpaud, J. Martignac, J. Martn-Fleitas,P. Martin-Moruno, E. L. Martin, M. Martinelli, N. Martinet, H. Martin, C. J. A. P. Martins,F. Marulli, D. Massari, R. Massey, D. C. Masters, S. Matarrese, Y. Matsuoka, S. Matthew,B. J. Maughan, N. Mauri, L. Maurin, S. Maurogordato, K. McCarthy, A. W. McConnachie,H. J. McCracken, I. McDonald, J. D. McEwen, C. J. R. McPartland, E. Medinaceli, V. Mehta,S. Mei, M. Melchior, J. B. Melin, B. Mnard, J. Mendes, J. Mendez-Abreu, M. Meneghetti,A. Mercurio, E. Merlin, R. B. Metcalf, G. Meylan, M. Migliaccio, M. Mignoli, L. Miller,M. Miluzio, B. Milvang-Jensen, J. P. Mimoso, R. Miquel, H. Miyatake, B. Mobasher, J. J.Mohr, P. Monaco, M. Mongui, A. Montoro, A. Mora, A. Moradinezhad Dizgah, M. Moresco,C. Moretti, G. Morgante, N. Morisset, T. J. Moriya, P. W. Morris, D. J. Mortlock, L. Moscar-dini, D. F. Mota, L. A. Moustakas, T. Moutard, T. Mller, E. Munari, G. Murphree, C. Murray,N. Murray, P. Musi, S. Nadathur, B. C. Nagam, T. Nagao, K. Naidoo, R. Nakajima, C. Nally,P. Natoli, A. Navarro-Alsina, D. Navarro Girones, C. Neissner, A. Nersesian, S. Nesseris,H. N. Nguyen-Kim, L. Nicastro, R. C. Nichol, M. Nielbock, S. M. Niemi, S. Nieto, K. Nils-son, J. Noller, P. Norberg, A. Nourizonoz, P. Ntelis, A. A. Nucita, P. Nugent, N. J. Nunes,T. Nutma, I. Ocampo, J. Odier, P. A. Oesch, M. Oguri, D. Magalhaes Oliveira, M. Onoue,T. Oosterbroek, F. Oppizzi, C. Ordenovic, K. Osato, F. Pacaud, F. Pace, C. Padilla, K. Paech,L. Pagano, M. J. Page, E. Palazzi, S. Paltani, S. Pamuk, S. Pandolfi, D. Paoletti, M. Paolillo,P. Papaderos, K. Pardede, G. Parimbelli, A. Parmar, C. Partmann, F. Pasian, F. Passalac-qua, K. Paterson, L. Patrizii, C. Pattison, A. Paulino-Afonso, R. Paviot, J. A. Peacock, F. R.Pearce, K. Pedersen, A. Peel, R. F. Peletier, M. Pellejero Ibanez, R. Pello, M. T. Penny, W. J.Percival, A. Perez-Garrido, L. Perotto, V. Pettorino, A. Pezzotta, S. Pezzuto, A. Philippon,O. Piersanti, M. Pietroni, L. Piga, L. Pilo, S. Pires, A. Pisani, A. Pizzella, L. Pizzuti, C. Plana,G. Polenta, J. E. Pollack, M. Poncet, M. Pntinen, P. Pool, L. A. Popa, V. Popa, J. Popp,C. Porciani, L. Porth, D. Potter, M. Poulain, A. Pourtsidou, L. Pozzetti, I. Prandoni, G. W.Pratt, S. Prezelus, E. Prieto, A. Pugno, S. Quai, L. Quilley, G. D. Racca, A. Raccanelli,G. Rcz, S. Radinovic, M. Radovich, A. Ragagnin, U. Ragnit, F. Raison, N. Ramos-Chernenko,C. Ranc, N. Raylet, R. Rebolo, A. Refregier, P. Reimberg, T. H. Reiprich, F. Renk, A. Renzi,J. Retre, Y. Revaz, C. Reyl, L. Reynolds, J. Rhodes, F. Ricci, M. Ricci, G. Riccio, S. O.Ricken, S. Rissanen, I. Risso, H. W. Rix, A. C. Robin, B. Rocca-Volmerange, P. F. Rocci, M. Rodenhuis, G. Rodighiero, M. Rodriguez Monroy, R. P. Rollins, M. Romanello, J. Roman,E. Romelli, M. Romero-Gomez, M. Roncarelli, P. Rosati, C. Rosset, E. Rossetti, W. Ros-ter, H. J. A. Rottgering, A. Rozas-Fernndez, K. Ruane, J. A. Rubino-Martin, A. Rudolph,F. Ruppin, B. Rusholme, S. Sacquegna, I. Sez-Casares, S. Saga, R. Saglia, M. Sahln,T. Saifollahi, Z. Sakr, J. Salvalaggio, R. Salvaterra, L. Salvati, M. Salvato, J. C. Salvignol,A. G. Snchez, E. Sanchez, D. B. Sanders, D. Sapone, M. Saponara, E. Sarpa, F. Sarron,S. Sartori, B. Sassolas, L. Sauniere, M. Sauvage, M. Sawicki, R. Scaramella, C. Scarlata,L. Scharr, J. Schaye, J. A. Schewtschenko, J. T. Schindler, E. Schinnerer, M. Schirmer,F. Schmidt, F. Schmidt, M. Schmidt, A. Schneider, M. Schneider, P. Schneider, N. Schneberg,T. Schrabback, M. Schultheis, S. Schulz, J. Schwartz, D. Sciotti, M. Scodeggio, D. Scog-namiglio, D. Scott, V. Scottez, A. Secroun, E. Sefusatti, G. Seidel, M. Seiffert, E. Sellentin,M. Selwood, E. Semboloni, M. Sereno, S. Serjeant, S. Serrano, F. Shankar, R. M. Sharples,A. Short, A. Shulevski, M. Shuntov, M. Sias, G. Sikkema, A. Silvestri, P. Simon, C. Sirignano,G. Sirri, J. Skottfelt, E. Slezak, D. Sluse, G. P. Smith, L. C. Smith, R. E. Smith, S. J. A. Smit,F. Soldano, B. G. B. Solheim, J. G. Sorce, F. Sorrenti, E. Soubrie, L. Spinoglio, A. SpurioMancini, J. Stadel, L. Stagnaro, L. Stanco, S. A. Stanford, J. L. Starck, P. Stassi, J. Steinwagner,D. Stern, C. Stone, P. Strada, F. Strafella, D. Stramaccioni, C. Surace, F. Sureau, S. H. Suyu,I. Swindells, M. Szafraniec, I. Szapudi, S. Taamoli, M. Talia, P. Tallada-Cresp, K. Tanidis,C. Tao, P. Tarro, D. Tavagnacco, A. N. Taylor, J. E. Taylor, P. L. Taylor, E. M. Teixeira,M. Tenti, P. Teodoro Idiago, H. I. Teplitz, I. Tereno, N. Tessore, V. Testa, G. Testera, M. Tewes,R. Teyssier, N. Theret, C. Thizy, P. D. Thomas, Y. Toba, S. Toft, R. Toledo-Moreo, E. Tolstoy,E. Tommasi, O. Torbaniuk, F. Torradeflot, C. Tortora, S. Tosi, S. Tosti, M. Trifoglio, A. Troja,T. Trombetti, A. Tronconi, M. Tsedrik, A. Tsyganov, M. Tucci, I. Tutusaus, C. Uhlemann,L. Ulivi, M. Urbano, L. Vacher, L. Vaillon, I. Valdes, E. A. Valentijn, L. Valenziano, C. Valieri,J. Valiviita, M. Van den Broeck, T. Vassallo, R. Vavrek, B. Venemans, A. Venhola, S. Ventura,G. Verdoes Kleijn, D. Vergani, A. Verma, F. Vernizzi, A. Veropalumbo, G. Verza, C. Vescovi,D. Vibert, M. Viel, P. Vielzeuf, C. Viglione, A. Viitanen, F. Villaescusa-Navarro, S. Vinciguerra,F. Visticot, K. Voggel, M. von Wietersheim-Kramsta, W. J. Vriend, S. Wachter, M. Walmsley,G. Walth, D. M. Walton, N. A. Walton, M. Wander, L. Wang, Y. Wang, J. R. Weaver, J. Weller,D. J. Whalen, M. Wiesmann, J. Wilde, O. R. Williams, H. A. Winther, A. Wittje, J. H. W.Wong, A. H. Wright, V. Yankelevich, H. W. Yeung, S. Youles, L. Y. A. Yung, A. Zacchei,L. Zalesky, G. Zamorani, A. Zamorano Vitorelli, M. Zanoni Marc, M. Zennaro, F. M. Zerbi,I. A. Zinchenko, J. Zoubian, E. Zucca, and M. Zumalacarregui. Euclid. I. Overview of theEuclid mission. arXiv e-prints, page arXiv:2405.13491, May 2024.",
  "Abolfazl Farahani, Sahar Voghoei, Khaled Rasheed, and Hamid R. Arabnia. A Brief Reviewof Domain Adaptation. arXiv e-prints, page arXiv:2010.03978, October 2020": "B. Flaugher, H. T. Diehl, K. Honscheid, T. M. C. Abbott, O. Alvarez, R. Angstadt, J. T.Annis, M. Antonik, O. Ballester, L. Beaufore, G. M. Bernstein, R. A. Bernstein, B. Bigelow,M. Bonati, D. Boprie, D. Brooks, E. J. Buckley-Geer, J. Campa, L. Cardiel-Sas, F. J. Castander,J. Castilla, H. Cease, J. M. Cela-Ruiz, S. Chappa, E. Chi, C. Cooper, L. N. da Costa, E. Dede,G. Derylo, D. L. DePoy, J. de Vicente, P. Doel, A. Drlica-Wagner, J. Eiting, A. E. Elliott,J. Emes, J. Estrada, A. Fausti Neto, D. A. Finley, R. Flores, J. Frieman, D. Gerdes, M. D.Gladders, B. Gregory, G. R. Gutierrez, J. Hao, S. E. Holland, S. Holm, D. Huffman, C. Jackson,D. J. James, M. Jonas, A. Karcher, I. Karliner, S. Kent, R. Kessler, M. Kozlovsky, R. G. Kron,D. Kubik, K. Kuehn, S. Kuhlmann, K. Kuk, O. Lahav, A. Lathrop, J. Lee, M. E. Levi, P. Lewis,T. S. Li, I. Mandrichenko, J. L. Marshall, G. Martinez, K. W. Merritt, R. Miquel, F. Munoz,E. H. Neilsen, R. C. Nichol, B. Nord, R. Ogando, J. Olsen, N. Palio, K. Patton, J. Peoples,A. A. Plazas, J. Rauch, K. Reil, J.-P. Rheault, N. A. Roe, H. Rogers, A. Roodman, E. Sanchez,V. Scarpine, R. H. Schindler, R. Schmidt, R. Schmitt, M. Schubnell, K. Schultz, P. Schurter,L. Scott, S. Serrano, T. M. Shaw, R. C. Smith, M. Soares-Santos, A. Stefanik, W. Stuermer,E. Suchyta, A. Sypniewski, G. Tarle, J. Thaler, R. Tighe, C. Tran, D. Tucker, A. R. Walker,G. Wang, M. Watson, C. Weaverdyck, W. Wester, R. Woods, and B. Yanny. The Dark EnergyCamera. The Astronomical Journal, 150(5):150, October 2015. arXiv:1504.02900 [astro-ph].",
  "M. A. Ganaie, Minghui Hu, A. K. Malik, M. Tanveer, and P. N. Suganthan. Ensemble deeplearning: A review. arXiv e-prints, page arXiv:2104.02395, April 2021": "Yaroslav Ganin and Victor Lempitsky. Unsupervised domain adaptation by backpropagation.In Francis Bach and David Blei, editors, Proceedings of the 32nd International Conferenceon Machine Learning, volume 37 of Proceedings of Machine Learning Research, pages11801189, Lille, France, 0709 Jul 2015. PMLR. Yaroslav Ganin, Evgeniya Ustinova, Hana Ajakan, Pascal Germain, Hugo Larochelle, FranoisLaviolette, Mario Marchand, and Victor Lempitsky. Domain-adversarial training of neuralnetworks. J. Mach. Learn. Res., 17(1):20962030, jan 2016. Jakob Gawlikowski, Cedrique Rovile Njieutcheu Tassi, Mohsin Ali, Jongseok Lee, MatthiasHumt, Jianxiang Feng, Anna Kruspe, Rudolph Triebel, Peter Jung, Ribana Roscher, Muham-mad Shahzad, Wen Yang, Richard Bamler, and Xiao Xiang Zhu. A survey of uncertainty indeep neural networks. Artificial Intelligence Review, 56(1):15131589, October 2023. Daniel Gilman, Simon Birrer, Anna Nierenberg, and Maverick S. H. Oh. Turbochargingconstraints on dark matter substructure through a synthesis of strong lensing flux ratios andextended lensed arcs. MNRAS, July 2024. Xavier Glorot, Antoine Bordes, and Yoshua Bengio. Domain adaptation for large-scalesentiment classification: a deep learning approach. In Proceedings of the 28th InternationalConference on International Conference on Machine Learning, ICML11, page 513520,Madison, WI, USA, 2011. Omnipress.",
  "Arthur Gretton, Karsten M. Borgwardt, Malte J. Rasch, Bernhard Schlkopf, and AlexanderSmola. A kernel two-sample test. Journal of Machine Learning Research, 13(25):723773,2012": "D. Gruen, G. M. Bernstein, M. Jarvis, B. Rowe, V. Vikram, A. A. Plazas, and S. Seitz. Charac-terization and correction of charge-induced pixel shifts in DECam. Journal of Instrumentation,10(5):C05032, May 2015. Charles R. Harris, K. Jarrod Millman, Stfan J. van der Walt, Ralf Gommers, Pauli Virtanen,David Cournapeau, Eric Wieser, Julian Taylor, Sebastian Berg, Nathaniel J. Smith, RobertKern, Matti Picus, Stephan Hoyer, Marten H. van Kerkwijk, Matthew Brett, Allan Haldane,Jaime Fernndez del Ro, Mark Wiebe, Pearu Peterson, Pierre Grard-Marchant, KevinSheppard, Tyler Reddy, Warren Weckesser, Hameer Abbasi, Christoph Gohlke, and Travis E.Oliphant. Array programming with NumPy. Nature, 585(7825):357362, September 2020.",
  "Mehedi Hasan, Abbas Khosravi, Ibrahim Hossain, Ashikur Rahman, and Saeid Nahavandi.Controlled Dropout for Uncertainty Estimation, May 2022. arXiv:2205.03109 [cs]": "Huan He, Owen Queen, Teddy Koker, Consuelo Cuevas, Theodoros Tsiligkaridis, and MarinkaZitnik. Domain Adaptation for Time Series Under Feature and Label Shifts. arXiv e-prints,page arXiv:2302.03133, February 2023. Yashar D. Hezaveh, Laurence Perreault Levasseur, and Philip J. Marshall. Fast automated anal-ysis of strong gravitational lenses with convolutional neural networks. Nature, 548(7669):555557, August 2017.",
  "Burt Holzman. Welcome to the Fermilab EAF documentation, 2024": "Feng Hou, Jin Yuan, Ying Yang, Yang Liu, Yang Zhang, Cheng Zhong, Zhongchao Shi,Jianping Fan, Yong Rui, and Zhiqiang He. DomainVerse: A Benchmark Towards Real-WorldDistribution Shifts For Tuning-Free Adaptive Domain Generalization. arXiv e-prints, pagearXiv:2403.02714, March 2024. X. Huang, M. Domingo, A. Pilon, V. Ravi, C. Storfer, D. J. Schlegel, S. Bailey, A. Dey,D. Herrera, S. Juneau, M. Landriau, D. Lang, A. Meisner, J. Moustakas, A. D. Myers, E. F.Schlafly, F. Valdes, B. A. Weaver, J. Yang, and C. Yeche. Finding Strong GravitationalLenses in the DESI DECam Legacy Survey. The Astrophysical Journal, 894(1):78, May 2020.arXiv:1906.00970 [astro-ph]. X. Huang, C. Storfer, A. Gu, V. Ravi, A. Pilon, W. Sheu, R. Venguswamy, S. Banka, A. Dey,M. Landriau, D. Lang, A. Meisner, J. Moustakas, A. D. Myers, R. Sajith, E. F. Schlafly, and D. J.Schlegel. Discovering New Strong Gravitational Lenses in the DESI Legacy Imaging Surveys.The Astrophysical Journal, 909:27, March 2021. ADS Bibcode: 2021ApJ...909...27H.",
  "J. D. Hunter. Matplotlib: A 2d graphics environment. Computing in Science & Engineering,9(3):9095, 2007": "eljko Ivezic, Steven M. Kahn, J. Anthony Tyson, Bob Abel, Emily Acosta, Robyn Allsman,David Alonso, Yusra AlSayyad, Scott F. Anderson, John Andrew, James Roger P. Angel,George Z. Angeli, Reza Ansari, Pierre Antilogus, Constanza Araujo, Robert Armstrong,Kirk T. Arndt, Pierre Astier, ric Aubourg, Nicole Auza, Tim S. Axelrod, Deborah J. Bard,Jeff D. Barr, Aurelian Barrau, James G. Bartlett, Amanda E. Bauer, Brian J. Bauman, SylvainBaumont, Ellen Bechtol, Keith Bechtol, Andrew C. Becker, Jacek Becla, Cristina Beldica,Steve Bellavia, Federica B. Bianco, Rahul Biswas, Guillaume Blanc, Jonathan Blazek, Roger D.Blandford, Josh S. Bloom, Joanne Bogart, Tim W. Bond, Michael T. Booth, Anders W.Borgland, Kirk Borne, James F. Bosch, Dominique Boutigny, Craig A. Brackett, AndrewBradshaw, William Nielsen Brandt, Michael E. Brown, James S. Bullock, Patricia Burchat,David L. Burke, Gianpietro Cagnoli, Daniel Calabrese, Shawn Callahan, Alice L. Callen,Jeffrey L. Carlin, Erin L. Carlson, Srinivasan Chandrasekharan, Glenaver Charles-Emerson,Steve Chesley, Elliott C. Cheu, Hsin-Fang Chiang, James Chiang, Carol Chirino, Derek Chow,David R. Ciardi, Charles F. Claver, Johann Cohen-Tanugi, Joseph J. Cockrum, Rebecca Coles,Andrew J. Connolly, Kem H. Cook, Asantha Cooray, Kevin R. Covey, Chris Cribbs, Wei Cui,Roc Cutri, Philip N. Daly, Scott F. Daniel, Felipe Daruich, Guillaume Daubard, Greg Daues,William Dawson, Francisco Delgado, Alfred Dellapenna, Robert De Peyster, Miguel DeVal-Borro, Seth W. Digel, Peter Doherty, Richard Dubois, Gregory P. Dubois-Felsmann,Josef Durech, Frossie Economou, Tim Eifler, Michael Eracleous, Benjamin L. Emmons,Angelo Fausti Neto, Henry Ferguson, Enrique Figueroa, Merlin Fisher-Levine, Warren Focke,Michael D. Foss, James Frank, Michael D. Freemon, Emmanuel Gangler, Eric Gawiser,John C. Geary, Perry Gee, Marla Geha, Charles J. B. Gessner, Robert R. Gibson, D. KirkGilmore, Thomas Glanzman, William Glick, Tatiana Goldina, Daniel A. Goldstein, IainGoodenow, Melissa L. Graham, William J. Gressler, Philippe Gris, Leanne P. Guy, AugustinGuyonnet, Gunther Haller, Ron Harris, Patrick A. Hascall, Justine Haupt, Fabio Hernandez,Sven Herrmann, Edward Hileman, Joshua Hoblitt, John A. Hodgson, Craig Hogan, James D.Howard, Dajun Huang, Michael E. Huffer, Patrick Ingraham, Walter R. Innes, Suzanne H.Jacoby, Bhuvnesh Jain, Fabrice Jammes, M. James Jee, Tim Jenness, Garrett Jernigan, DarkoJevremovic, Kenneth Johns, Anthony S. Johnson, Margaret W. G. Johnson, R. Lynne Jones,Claire Juramy-Gilles, Mario Juric, Jason S. Kalirai, Nitya J. Kallivayalil, Bryce Kalmbach,Jeffrey P. Kantor, Pierre Karst, Mansi M. Kasliwal, Heather Kelly, Richard Kessler, VeronicaKinnison, David Kirkby, Lloyd Knox, Ivan V. Kotov, Victor L. Krabbendam, K. SimonKrughoff, Petr Kubnek, John Kuczewski, Shri Kulkarni, John Ku, Nadine R. Kurita, Craig S.Lage, Ron Lambert, Travis Lange, J. Brian Langton, Laurent Le Guillou, Deborah Levine,Ming Liang, Kian-Tat Lim, Chris J. Lintott, Kevin E. Long, Margaux Lopez, Paul J. Lotz,Robert H. Lupton, Nate B. Lust, Lauren A. MacArthur, Ashish Mahabal, Rachel Mandelbaum,Thomas W. Markiewicz, Darren S. Marsh, Philip J. Marshall, Stuart Marshall, Morgan May,Robert McKercher, Michelle McQueen, Joshua Meyers, Myriam Migliore, Michelle Miller,David J. Mills, Connor Miraval, Joachim Moeyens, Fred E. Moolekamp, David G. Monet,Marc Moniez, Serge Monkewitz, Christopher Montgomery, Christopher B. Morrison, FritzMueller, Gary P. Muller, Freddy Muoz Arancibia, Douglas R. Neill, Scott P. Newbry, Jean-Yves Nief, Andrei Nomerotski, Martin Nordby, Paul OConnor, John Oliver, Scot S. Olivier,Knut Olsen, William OMullane, Sandra Ortiz, Shawn Osier, Russell E. Owen, Reynald Pain,Paul E. Palecek, John K. Parejko, James B. Parsons, Nathan M. Pease, J. Matt Peterson,John R. Peterson, Donald L. Petravick, M. E. Libby Petrick, Cathy E. Petry, FrancescoPierfederici, Stephen Pietrowicz, Rob Pike, Philip A. Pinto, Raymond Plante, Stephen Plate, Joel P. Plutchak, Paul A. Price, Michael Prouza, Veljko Radeka, Jayadev Rajagopal, Andrew P.Rasmussen, Nicolas Regnault, Kevin A. Reil, David J. Reiss, Michael A. Reuter, Stephen T.Ridgway, Vincent J. Riot, Steve Ritz, Sean Robinson, William Roby, Aaron Roodman, WayneRosing, Cecille Roucelle, Matthew R. Rumore, Stefano Russo, Abhijit Saha, Benoit Sassolas,Terry L. Schalk, Pim Schellart, Rafe H. Schindler, Samuel Schmidt, Donald P. Schneider,Michael D. Schneider, William Schoening, German Schumacher, Megan E. Schwamb, JacquesSebag, Brian Selvy, Glenn H. Sembroski, Lynn G. Seppala, Andrew Serio, Eduardo Serrano,Richard A. Shaw, Ian Shipsey, Jonathan Sick, Nicole Silvestri, Colin T. Slater, J. AllynSmith, R. Chris Smith, Shahram Sobhani, Christine Soldahl, Lisa Storrie-Lombardi, EdwardStover, Michael A. Strauss, Rachel A. Street, Christopher W. Stubbs, Ian S. Sullivan, DonaldSweeney, John D. Swinbank, Alexander Szalay, Peter Takacs, Stephen A. Tether, Jon J. Thaler,John Gregg Thayer, Sandrine Thomas, Adam J. Thornton, Vaikunth Thukral, Jeffrey Tice,David E. Trilling, Max Turri, Richard Van Berg, Daniel Vanden Berk, Kurt Vetter, FrancoiseVirieux, Tomislav Vucina, William Wahl, Lucianne Walkowicz, Brian Walsh, Christopher W.Walter, Daniel L. Wang, Shin-Yawn Wang, Michael Warner, Oliver Wiecha, Beth Willman,Scott E. Winters, David Wittman, Sidney C. Wolff, W. Michael Wood-Vasey, Xiuqin Wu,Bo Xin, Peter Yoachim, and Hu Zhan. LSST: From Science Drivers to Reference Design andAnticipated Data Products. The Astrophysical Journal, 873(2):111, March 2019.",
  "Wouter M. Kouw and Marco Loog. A review of domain adaptation without target labels. arXive-prints, page arXiv:1901.05335, January 2019": "K. Kuijken, C. Heymans, A. Dvornik, H. Hildebrandt, J. T. A. de Jong, A. H. Wright, T. Erben,M. Bilicki, B. Giblin, H. Y. Shan, F. Getman, A. Grado, H. Hoekstra, L. Miller, N. Napolitano,M. Paolilo, M. Radovich, P. Schneider, W. Sutherland, M. Tewes, C. Tortora, E. A. Valentijn,and G. A. Verdoes Kleijn. The fourth data release of the Kilo-Degree Survey: ugri imagingand nine-band optical-IR photometry over 1000 square degrees. A&A, 625:A2, May 2019.",
  "Alan T. Lefor, Toshifumi Futamase, and Mohammad Akhlaghi. A systematic review of stronggravitational lens modeling software. New Astronomy Reviews, 57(12):113, July 2013": "Ronan Legin, Yashar Hezaveh, Laurence Perreault Levasseur, and Benjamin Wandelt.Simulation-Based Inference of Strong Gravitational Lensing Parameters. arXiv e-prints,page arXiv:2112.05278, December 2021. Ronan Legin, Yashar Hezaveh, Laurence Perreault-Levasseur, and Benjamin Wandelt. AFramework for Obtaining Accurate Posteriors of Strong Gravitational Lensing Parameters withFlexible Priors and Implicit Likelihoods Using Density Estimation. ApJ, 943(1):4, January2023. Laurence Perreault Levasseur, Yashar D. Hezaveh, and Risa H. Wechsler. Uncertainties inParameters Estimated with Neural Networks: Application to Strong Gravitational Lensing.The Astrophysical Journal Letters, 850(1):L7, November 2017. Publisher: The AmericanAstronomical Society. Jeng-Lin Li, Chih-Fan Hsu, Ming-Ching Chang, and Wei-Chao Chen. A ComprehensiveReview of Machine Learning Advances on Data Change: A Cross-Field Perspective. arXive-prints, page arXiv:2402.12627, February 2024. Nan Li, Michael D. Gladders, Esteban M. Rangel, Michael K. Florian, Lindsey E. Bleem,Katrin Heitmann, Salman Habib, and Patricia Fasel. PICS: Simulations of Strong GravitationalLensing in Galaxy Clusters. ApJ, 828(1):54, September 2016. Tian Li, Thomas E Collett, Coleman M Krawczyk, and Wolfgang Enzi. Cosmology fromlarge populations of galaxygalaxy strong gravitational lenses. Monthly Notices of the RoyalAstronomical Society, 527(3):53115323, 11 2023.",
  "Eric V. Linder. Strong gravitational lensing and dark energy complementarity. Phys. Rev. D,70(4):043534, August 2004": "Xiaofeng Liu, Chaehwa Yoo, Fangxu Xing, Hyejin Oh, Georges El Fakhri, Je-Won Kang, andJonghye Woo. Deep Unsupervised Domain Adaptation: A Review of Recent Advances andPerspectives. arXiv e-prints, page arXiv:2208.07422, August 2022. Mingsheng Long, Yue Cao, Jianmin Wang, and Michael Jordan. Learning transferable featureswith deep adaptation networks. In Francis Bach and David Blei, editors, Proceedings of the32nd International Conference on Machine Learning, volume 37 of Proceedings of MachineLearning Research, pages 97105, Lille, France, 0709 Jul 2015. PMLR.",
  "Nis Meinert and Alexander Lavin. Multivariate Deep Evidential Regression. arXiv e-prints,page arXiv:2104.06135, April 2021": "R. B. Metcalf, M. Meneghetti, C. Avestruz, F. Bellagamba, C. R. Bom, E. Bertin, R. Ca-banac, F. Courbin, A. Davies, E. Decencire, R. Flamary, R. Gavazzi, M. Geiger, P. Hartley,M. Huertas-Company, N. Jackson, C. Jacobs, E. Jullo, J. P. Kneib, L. V. E. Koopmans,F. Lanusse, C. L. Li, Q. Ma, M. Makler, N. Li, M. Lightman, C. E. Petrillo, S. Serjeant,C. Schfer, A. Sonnenfeld, A. Tagore, C. Tortora, D. Tuccillo, M. B. Valentn, S. Velasco-Forero, G. A. Verdoes Kleijn, and G. Vernardos. The strong gravitational lens finding challenge.A&A, 625:A119, May 2019. Surhud More, Sunao Sugiyama, Hironao Miyatake, Markus Michael Rau, Masato Shirasaki,Xiangchong Li, Atsushi J. Nishizawa, Ken Osato, Tianqing Zhang, Masahiro Takada, TakashiHamana, Ryuichi Takahashi, Roohi Dalal, Rachel Mandelbaum, Michael A. Strauss, YosukeKobayashi, Takahiro Nishimichi, Masamune Oguri, Wentao Luo, Arun Kannawadi, Bau-ChingHsieh, Robert Armstrong, James Bosch, Yutaka Komiyama, Robert H. Lupton, Nate B. Lust,Lauren A. MacArthur, Satoshi Miyazaki, Hitoshi Murayama, Yuki Okura, Paul A. Price,Philip J. Tait, Masayuki Tanaka, and Shiang-Yu Wang. Hyper Suprime-Cam Year 3 results:Measurements of clustering of SDSS-BOSS galaxies, galaxy-galaxy lensing, and cosmic shear.Phys. Rev. D, 108(12):123520, December 2023. Robert Morgan, Brian Nord, Simon Birrer, Joshua Lin, and Jason Poh. deeplenstronomy: Adataset simulation package for strong gravitational lensing. Journal of Open Source Software,6(58):2854, February 2021.",
  "Ramesh Narayan and Matthias Bartelmann. Lectures on Gravitational Lensing. arXiv e-prints,pages astroph/9606001, June 1996": "B. Nord, E. Buckley-Geer, H. Lin, H. T. Diehl, J. Helsby, N. Kuropatkin, A. Amara, T. Collett,S. Allam, G. B. Caminha, C. De Bom, S. Desai, H. Dmet-Montoya, M. Elidaiana da S.Pereira, D. A. Finley, B. Flaugher, C. Furlanetto, H. Gaitsch, M. Gill, K. W. Merritt, A. More,D. Tucker, A. Saro, E. S. Rykoff, E. Rozo, S. Birrer, F. B. Abdalla, A. Agnello, M. Auger, R. J.Brunner, M. Carrasco Kind, F. J. Castander, C. E. Cunha, L. N. da Costa, R. J. Foley, D. W.Gerdes, K. Glazebrook, J. Gschwend, W. Hartley, R. Kessler, D. Lagattuta, G. Lewis, M. A. G.Maia, M. Makler, F. Menanteau, A. Niernberg, D. Scolnic, J. D. Vieira, R. Gramillano, T. M. C.Abbott, M. Banerji, A. Benoit-Lvy, D. Brooks, D. L. Burke, D. Capozzi, A. Carnero Rosell,J. Carretero, C. B. DAndrea, J. P. Dietrich, P. Doel, A. E. Evrard, J. Frieman, E. Gaztanaga,D. Gruen, K. Honscheid, D. J. James, K. Kuehn, T. S. Li, M. Lima, J. L. Marshall, P. Martini,P. Melchior, R. Miquel, E. Neilsen, R. C. Nichol, R. Ogando, A. A. Plazas, A. K. Romer,M. Sako, E. Sanchez, V. Scarpine, M. Schubnell, I. Sevilla-Noarbe, R. C. Smith, M. Soares-Santos, F. Sobreira, E. Suchyta, M. E. C. Swanson, G. Tarle, J. Thaler, A. R. Walker, W. Wester,Y. Zhang, and DES Collaboration. Observation and Confirmation of Six Strong-lensingSystems in the Dark Energy Survey Science Verification Data. ApJ, 827(1):51, August 2016. B. Nord, E. Buckley-Geer, H. Lin, N. Kuropatkin, T. Collett, D. L. Tucker, H. T. Diehl,A. Agnello, A. Amara, T. M. C. Abbott, S. Allam, J. Annis, S. Avila, K. Bechtol, D. Brooks,D. L. Burke, A. Carnero Rosell, M. Carrasco Kind, J. Carretero, C. E. Cunha, L. N. da Costa,C. Davis, J. De Vicente, P. Doel, T. F. Eifler, A. E. Evrard, E. Fernandez, B. Flaugher, P. Fosalba,J. Frieman, J. Garca-Bellido, E. Gaztanaga, D. Gruen, R. A. Gruendl, G. Gutierrez, W. G.Hartley, D. L. Hollowood, K. Honscheid, B. Hoyle, D. J. James, K. Kuehn, O. Lahav, M. Lima,M. A. G. Maia, M. March, J. L. Marshall, P. Melchior, F. Menanteau, R. Miquel, A. A. Plazas,A. K. Romer, A. Roodman, E. S. Rykoff, E. Sanchez, V. Scarpine, R. Schindler, M. Schubnell,I. Sevilla-Noarbe, M. Smith, M. Soares-Santos, F. Sobreira, E. Suchyta, M. E. C. Swanson,G. Tarle, D. Thomas, Y. Zhang, and DES Collaboration. Observation and confirmation of ninestrong-lensing systems in Dark Energy Survey Year 1 data. MNRAS, 494(1):13081322, May2020. J. H. ODonnell, R. D. Wilkinson, H. T. Diehl, C. Aros-Bunster, K. Bechtol, S. Birrer, E. J.Buckley-Geer, A. Carnero Rosell, M. Carrasco Kind, L. N. da Costa, S. J. Gonzalez Lozano,R. A. Gruendl, M. Hilton, H. Lin, K. A. Lindgren, J. Martin, A. Pieres, E. S. Rykoff, I. Sevilla-Noarbe, E. Sheldon, C. Sifn, D. L. Tucker, B. Yanny, T. M. C. Abbott, M. Aguena, S. Allam,F. Andrade-Oliveira, J. Annis, E. Bertin, D. Brooks, D. L. Burke, J. Carretero, M. Costanzi,J. De Vicente, S. Desai, J. P. Dietrich, K. Eckert, S. Everett, I. Ferrero, B. Flaugher, P. Fosalba,J. Frieman, J. Garca-Bellido, E. Gaztanaga, D. W. Gerdes, D. Gruen, J. Gschwend, M. S. S.Gill, G. Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, D. J. James, T. Jeltema,K. Kuehn, O. Lahav, M. Lima, M. A. G. Maia, J. L. Marshall, P. Melchior, F. Menanteau,R. Miquel, R. Morgan, B. Nord, R. L. C. Ogando, F. Paz-Chinchn, M. E. S. Pereira, A. A.Plazas Malagn, M. Rodriguez-Monroy, A. K. Romer, A. Roodman, E. Sanchez, V. Scarpine,M. Schubnell, S. Serrano, M. Smith, E. Suchyta, M. E. C. Swanson, G. Tarle, D. Thomas,C. To, and T. N. Varga. The Dark Energy Survey Bright Arcs Survey: Candidate StronglyLensed Galaxy Systems from the Dark Energy Survey 5000 Square Degree Footprint. ApJS,259(1):27, March 2022.",
  "Jack Richings, Carlos Frenk, Adrian Jenkins, Andrew Robertson, and Matthieu Schaller. Ahigh-resolution cosmological simulation of a strong gravitational lens. MNRAS, 501(3):46574668, March 2021": "K. Rojas, E. Savary, B. Clment, M. Maus, F. Courbin, C. Lemon, J. H. H. Chan, G. Vernardos,R. Joseph, R. Caameras, and A. Galan. Search of strong lens systems in the Dark EnergySurvey using convolutional neural networks. A&A, 668:A73, December 2022. Karina Rojas, Thomas E. Collett, Daniel Ballard, Mark R. Magee, Simon Birrer, ElizabethBuckley-Geer, James H. H. Chan, Benjamin Clment, Jos M. Diego, Fabrizio Gentile, JimenaGonzlez, Rmy Joseph, Jorge Mastache, Stefan Schuldt, Crescenzo Tortora, Toms Verdugo,Aprajita Verma, Tansu Daylan, Martin Millon, Neal Jackson, Simon Dye, Alejandra Melo,Guillaume Mahler, Ricardo L. C. Ogando, Frdric Courbin, Alexander Fritz, AniruddhHerle, Javier A. Acevedo Barroso, Raoul Caameras, Claude Cornen, Birendra Dhanasingham,Karl Glazebrook, Michael N. Martinez, Dan Ryczanowski, Elodie Savary, Filipe Gis-Silva,L. Arturo Urea-Lpez, Matthew P. Wiesner, Joshua Wilde, Gabriel Valim Calada, RmiCabanac, Yue Pan, Isaac Sierra, Giulia Despali, Micaele V. Cavalcante-Gomes, ChristineMacmillan, Jacob Maresca, Aleksandra Grudskaia, Jackson H. ODonnell, Eric Paic, AnnaNiemiec, Lucia F. de la Bella, Jane Bromley, Devon M. Williams, Anupreeta More, andBenjamin C. Levine. The impact of human expert visual inspection on the discovery of stronggravitational lenses. MNRAS, 523(3):44134430, August 2023. Andrea Roncoli, Aleksandra Ciprijanovic, Maggie Voetberg, Francisco Villaescusa-Navarro,and Brian Nord. Domain Adaptive Graph Neural Networks for Constraining CosmologicalParameters Across Multiple Data Sets, April 2024. arXiv:2311.01588 [astro-ph]. Andrea J. Ruff, Raphal Gavazzi, Philip J. Marshall, Tommaso Treu, Matthew W. Auger, andFlorence Brault. The SL2S Galaxy-scale Lens Sample. II. Cosmic Evolution of Dark andLuminous Mass in Early-type Galaxies. ApJ, 727(2):96, February 2011. D. Schaerer, R. Marques-Chaves, L. Barrufet, P. Oesch, Y. I. Izotov, R. Naidu, N. G. Guseva,and G. Brammer. First look with JWST spectroscopy: $z \\sim 8$ galaxies resemble localanalogues. Astronomy & Astrophysics, 665:L4, September 2022. arXiv:2207.10034 [astro-ph]. Maximilian Seitzer, Arash Tavakoli, Dimitrije Antic, and Georg Martius. On the pitfalls ofheteroscedastic uncertainty estimation with probabilistic neural networks. In InternationalConference on Learning Representations, 2022. S. Serjeant. Synergies between SALT and Herschel, Euclid and the SKA: strong gravitationallensing and galaxy evolution. In David Buckley and Anja Schroeder, editors, SALT ScienceConference 2015 (SSC2015), page 16, June 2015. I. Sevilla-Noarbe, K. Bechtol, M. Carrasco Kind, A. Carnero Rosell, M. R. Becker, A. Drlica-Wagner, R. A. Gruendl, E. S. Rykoff, E. Sheldon, B. Yanny, A. Alarcon, S. Allam, A. Amon,A. Benoit-Lvy, G. M. Bernstein, E. Bertin, D. L. Burke, J. Carretero, A. Choi, H. T. Diehl,S. Everett, B. Flaugher, E. Gaztanaga, J. Gschwend, I. Harrison, W. G. Hartley, B. Hoyle,M. Jarvis, M. D. Johnson, R. Kessler, R. Kron, N. Kuropatkin, B. Leistedt, T. S. Li, F. Menan-teau, E. Morganson, R. L. C. Ogando, A. Palmese, F. Paz-Chinchn, A. Pieres, C. Pond, M. Rodriguez-Monroy, J. Allyn Smith, K. M. Stringer, M. A. Troxel, D. L. Tucker, J. deVicente, W. Wester, Y. Zhang, T. M. C. Abbott, M. Aguena, J. Annis, S. Avila, S. Bhargava,S. L. Bridle, D. Brooks, D. Brout, F. J. Castander, R. Cawthon, C. Chang, C. Conselice,M. Costanzi, M. Crocce, L. N. da Costa, M. E. S. Pereira, T. M. Davis, S. Desai, J. P. Dietrich,P. Doel, K. Eckert, A. E. Evrard, I. Ferrero, P. Fosalba, J. Garca-Bellido, D. W. Gerdes,T. Giannantonio, D. Gruen, G. Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, E. M.Huff, D. Huterer, D. J. James, T. Jeltema, K. Kuehn, O. Lahav, C. Lidman, M. Lima, H. Lin,M. A. G. Maia, J. L. Marshall, P. Martini, P. Melchior, R. Miquel, J. J. Mohr, R. Morgan,E. Neilsen, A. A. Plazas, A. K. Romer, A. Roodman, E. Sanchez, V. Scarpine, M. Schubnell,S. Serrano, M. Smith, E. Suchyta, G. Tarle, D. Thomas, C. To, T. N. Varga, R. H. Wechsler,J. Weller, R. D. Wilkinson, and DES Collaboration. Dark Energy Survey Year 3 Results:Photometric Data Set for Cosmology. ApJS, 254(2):24, June 2021. Anowar J. Shajib, Graham P. Smith, Simon Birrer, Aprajita Verma, Nikki Arendse, andThomas E. Collett. Strong gravitational lenses from the Vera C. Rubin Observatory. arXive-prints, page arXiv:2406.08919, June 2024.",
  "George Stein, Jacqueline Blaum, Peter Harrington, Tomislav Medan, and Zarija Lukic. Miningfor Strong Gravitational Lenses with Self-supervised Learning. ApJ, 932(2):107, June 2022": "F. Stoppa, R. Ruiz de Austri, P. Vreeswijk, S. Bhattacharyya, S. Caron, S. Bloemen, G. Za-harijas, G. Principe, V. Vodeb, P. J. Groot, E. Cator, and G. Nelemans. AutoSourceID-FeatureExtractor. Optical image analysis using a two-step mean variance estimation networkfor feature estimation and uncertainty characterisation. Astronomy & Astrophysics, 680:A108,December 2023. arXiv:2305.14495 [astro-ph, physics:hep-ph].",
  "Baochen Sun, Jiashi Feng, and Kate Saenko. Correlation alignment for unsupervised domainadaptation, 2016": "Paxson Swierc, Megan Zhao, Aleksandra Ciprijanovic, and Brian Nord. Domain Adaptationfor Measurements of Strong Gravitational Lenses, November 2023. Publication Title: arXive-prints ADS Bibcode: 2023arXiv231117238S. Aik Rui Tan, Shingo Urata, Samuel Goldman, Johannes C. B. Dietschreit, and Rafael Gmez-Bombarelli. Single-model uncertainty quantification in neural network potentials does notconsistently outperform model ensembles. npj Computational Mathematics, 9:225, January2023. Yarone M. Tokayer, Isaque Dutra, Priyamvada Natarajan, Guillaume Mahler, Mathilde Jauzac,and Massimo Meneghetti. The GalaxyGalaxy Strong Lensing Cross Section and the InternalDistribution of Matter in CDM Substructure. ApJ, 970(2):143, August 2024.",
  "Tommaso Treu and Anowar J. Shajib.Strong Lensing and H0.arXiv e-prints, pagearXiv:2307.05714, July 2023": "Larissa T. Triess, Mariella Dreissig, Christoph B. Rist, and J. Marius Zllner. A Survey onDeep Domain Adaptation for LiDAR Perception. In 2021 IEEE Intelligent Vehicles SymposiumWorkshops (IV Workshops), pages 350357, July 2021. arXiv:2106.02377 [cs]. Laurent Valentin Jospin, Wray Buntine, Farid Boussaid, Hamid Laga, and Mohammed Ben-namoun. Hands-on Bayesian Neural Networks a Tutorial for Deep Learning Users. arXive-prints, page arXiv:2007.06823, July 2020.",
  "Francesco Verdoja and Ville Kyrki. Notes on the Behavior of MC Dropout. arXiv e-prints,page arXiv:2008.02627, August 2020": "Sebastian Wagner-Carena, Jelle Aalbers, Simon Birrer, Ethan O. Nadler, Elise Darragh-Ford,Philip J. Marshall, and Risa H. Wechsler. From Images to Dark Matter: End-to-end Inferenceof Substructure from Hundreds of Strong Gravitational Lenses. ApJ, 942(2):75, January 2023. Mike Walmsley, Micah Bowles, Anna M. M. Scaife, Jason Shingirai Makechemu, Alexander J.Gordon, Annette M. N. Ferguson, Robert G. Mann, James Pearson, Jrgen J. Popp, Jo Bovy,Josh Speagle, Hugh Dickinson, Lucy Fortson, Tobias Gron, Sandor Kruk, Chris J. Lintott,Kameswara Mantha, Devina Mohan, David ORyan, and Inigo V. Slijepevic. Scaling Laws forGalaxy Images. arXiv e-prints, page arXiv:2404.02973, April 2024. Yun Wang, Zhongxu Zhai, Anahita Alavi, Elena Massara, Alice Pisani, Andrew Benson,Christopher M. Hirata, Lado Samushia, David H. Weinberg, James Colbert, Olivier Dor, TimEifler, Chen Heinrich, Shirley Ho, Elisabeth Krause, Nikhil Padmanabhan, David Spergel, andHarry I. Teplitz. The High Latitude Spectroscopic Survey on the Nancy Grace Roman SpaceTelescope. The Astrophysical Journal, 928:1, March 2022. Publisher: IOP ADS Bibcode:2022ApJ...928....1W.",
  "Kai Ye, Tiejin Chen, Hua Wei, and Liang Zhan. Uncertainty Regularized Evidential Regression.arXiv e-prints, page arXiv:2401.01484, January 2024": "E. A. Zaborowski, A. Drlica-Wagner, F. Ashmead, J. F. Wu, R. Morgan, C. R. Bom, A. J.Shajib, S. Birrer, W. Cerny, E. J. Buckley-Geer, B. Mutlu-Pakdil, P. S. Ferguson, K. Glazebrook,S. J. Gonzalez Lozano, Y. Gordon, M. Martinez, V. Manwadkar, J. ODonnell, J. Poh, A. Riley,J. D. Sakowska, L. Santana-Silva, B. X. Santiago, D. Sluse, C. Y. Tan, E. J. Tollerud, A. Verma,J. A. Carballo-Bello, Y. Choi, D. J. James, N. Kuropatkin, C. E. Martnez-Vzquez, D. L.Nidever, J. L. Nilo Castellon, N. E. D. Nol, K. A. G. Olsen, A. B. Pace, S. Mau, B. Yanny,A. Zenteno, T. M. C. Abbott, M. Aguena, O. Alves, F. Andrade-Oliveira, S. Bocquet, D. Brooks,D. L. Burke, A. Carnero Rosell, M. Carrasco Kind, J. Carretero, F. J. Castander, C. J. Conselice,M. Costanzi, M. E. S. Pereira, J. De Vicente, S. Desai, J. P. Dietrich, P. Doel, S. Everett,I. Ferrero, B. Flaugher, D. Friedel, J. Frieman, J. Garca-Bellido, D. Gruen, R. A. Gruendl,G. Gutierrez, S. R. Hinton, D. L. Hollowood, K. Honscheid, K. Kuehn, H. Lin, J. L. Marshall,P. Melchior, J. Mena-Fernndez, F. Menanteau, R. Miquel, A. Palmese, F. Paz-Chinchn,A. Pieres, A. A. Plazas Malagn, J. Prat, M. Rodriguez-Monroy, A. K. Romer, E. Sanchez,V. Scarpine, I. Sevilla-Noarbe, M. Smith, E. Suchyta, C. To, N. Weaverdyck, (DELVE, andDES Collaborations). Identification of galaxygalaxy strong lens candidates in the decam localvolume exploration survey using machine learning. The Astrophysical Journal, 954(1):68, aug2023.",
  "Fuzhen Zhuang, Zhiyuan Qi, Keyu Duan, Dongbo Xi, Yongchun Zhu, Hengshu Zhu,Hui Xiong, and Qing He.A Comprehensive Survey on Transfer Learning, June 2020.arXiv:1911.02685 [cs, stat]": "A. Ciprijanovic, D. Kafkes, K. Downey, S. Jenkins, G. N. Perdue, S. Madireddy, T. Johnston,G. F. Snyder, and B. Nord. DeepMerge - II. Building robust deep learning algorithms for merg-ing galaxy identification across domains. Monthly Notices of the Royal Astronomical Society,506:677691, September 2021. Publisher: OUP ADS Bibcode: 2021MNRAS.506..677C. A. Ciprijanovic, D. Kafkes, S. Jenkins, K. Downey, G. N. Perdue, S. Madireddy, T. Johnston,and B. Nord. Domain adaptation techniques for improved cross-domain study of galaxy merg-ers, November 2020. Publication Title: arXiv e-prints ADS Bibcode: 2020arXiv201103591C. A. Ciprijanovic, D. Kafkes, G. N. Perdue, K. Pedro, G. Snyder, F. J. Snchez, S. Madireddy,S. M. Wild, and B. Nord. Robustness of deep learning algorithms in astronomy galaxy mor-phology studies. arxiv, 2021. Publisher: arXiv tex.copyright: Creative Commons Attribution4.0 International. A Ciprijanovic, A Lewis, K Pedro, S Madireddy, B Nord, G N Perdue, and S M Wild.DeepAstroUDA: Semi-Supervised Universal Domain Adaptation for Cross-Survey GalaxyMorphology Classification and Anomaly Detection. Machine Learning: Science and Technol-ogy, 4(2):025013, June 2023. Aleksandra Ciprijanovic, Diana Kafkes, Gregory Snyder, F Javier Snchez, Gabriel NathanPerdue, Kevin Pedro, Brian Nord, Sandeep Madireddy, and Stefan M Wild. DeepAdversaries:Examining the Robustness of Deep Learning Models for Galaxy Morphology Classification.Machine Learning: Science and Technology, 3(3):035007, September 2022. Aleksandra Ciprijanovic, Ashia Lewis, Kevin Pedro, Sandeep Madireddy, Brian Nord,Gabriel N. Perdue, and Stefan M. Wild.Semi-Supervised Domain Adaptation forCross-Survey Galaxy Morphology Classification and Anomaly Detection, November 2022.arXiv:2211.00677 [astro-ph].",
  "AFunding": "We acknowledge the Deep Skies Lab as a community of multi-domain experts and collaboratorswhove facilitated an environment of open discussion, idea generation, and collaboration. Thiscommunity was important for the development of this project. Work supported by the Fermi National Accelerator Laboratory, managed and operated byFermi Research Alliance, LLC under Contract No. DE-AC02-07CH11359 with the U.S. Departmentof Energy. The U.S. Government retains and the publisher, by accepting the article for publication,acknowledges that the U.S. Government retains a non-exclusive, paid-up, irrevocable, world-widelicense to publish or reproduce the published form of this manuscript, or allow others to do so, forU.S. Government purposes.",
  "DMVE Network Architecture": "See for the detailed MVE network architecture. There are 112,866 trainable parameters. Wenote that the activation function for the final dense layers is chosen to be sigmoid rather than ReLU,since ReLU predicts a value of zero for any negative input, encouraging predictions of zero mean orvariance. This issue can also be solved by alternative approaches, such as the use of Leaky ReLU orother activation functions that disincentivize a prediction of zero.",
  "EModel inference with varied weight initializations": "We performed experiments five times, each with a different random seed for the network weightinitialization. All models received the same optimization procedure (3). The performance ofMVE-only model on the target data sets is inconsistent across the seed choices. In contrast, theMVE-UDA model performs consistently slightly worse than the MVE-only model on the source data : The architecture of the MVE network. The first column lists the layer type, the second liststhe dimensionality of the output from that layer, and the third column lists the parameters of thatlayer; k is the kernel size, and s is the stride. The final layer outputs the mean and variance.",
  "Linear-": "across varied weight initialization. However, unlike the MVE-only model, it consistently performsequally well on the target data as on the source data. This indicates UDA adds stability against thedomain shift and is necessary for the application of MVE to datasets with a domain shift. For someinitializations, the MVE-UDA model training starts with predictions of zero for the mean or variance,which is erroneous. Further training does not improve the performance. Investigating this pattern indetail is outside the scope of this work. We chose seeds where this pathological behavior does notoccur in the first epoch of training."
}