{
  "Abstract": "Obtaining effective representations of DNA sequences is crucial for genome anal-ysis. Metagenomic binning, for instance, relies on genome representations to clus-ter complex mixtures of DNA fragments from biological samples with the aim ofdetermining their microbial compositions. In this paper, we revisit k-mer-basedrepresentations of genomes and provide a theoretical analysis of their use in repre-sentation learning. Based on the analysis, we propose a lightweight and scalablemodel for performing metagenomic binning at the genome read level, relying onlyon the k-mer compositions of the DNA fragments. We compare the model to re-cent genome foundation models and demonstrate that while the models are compa-rable in performance, the proposed model is signicantly more effective in termsof scalability, a crucial aspect for performing metagenomic binning of real-worlddatasets.",
  "Introduction": "Microbes inuence all aspects of our environment, including human health and the natural environ-ment surrounding us. However, understanding the full impact of the microbes through the complexmicrobial communities in which they exist, requires insight into the composition and diversity ofthese communities . Metagenomics involves the study of microbial communities at the DNA level. However, sequencinga complex microbial sample using current DNA sequencing technologies rarely produces fullDNA sequences, but rather a mixture of DNA fragments (called reads) of the microbes present inthe sample. In order to recover the full microbial genomes, a subsequent binning/clustering stepis performed, where individual DNA fragments are clustered together according to their genomicorigins. This process is also referred to as metagenomic binning . The fragments beingclustered during the binning process consist of contiguous DNA sequences (contigs) obtained fromthe reads through a so-called assembly process (contigs are generally longer and less error-prone than the reads). Metagenomic binning typically involves comparing and clustering DNA fragments using a distancemetric in a suitable genome representation space. State-of-the-art methods for metagenomic bin-ning typically rely on representations that include or build on top of the k-mer proles of the contigs. These representations have mostly been studied from an empirical perspective ,although general theoretical analyses into their representational properties have also been consid-ered . With k = 4 (i.e., tetra-nucleotides) a 256-dimensional vector is used to describe thegenome, each entry in the vector encoding the frequency of a specic k-mer (e.g., ACTG, ATTT)in the genome sequence. The k-mer representation of a sequence thus has a xed size and is inde-pendent of sequence length and downstream analysis tasks, providing a computationally efcientrepresentation.",
  ": Number of parameters of thedifferent evaluated models (log10-scale)": "A more recent and popular line of research focuses onusing approaches inspired by modern Large LanguageModels (LLMs) to derive more powerful representationsof genome fragments. The goal is to replicate the suc-cess of LLMs used in natural language processing forgenomic data. These models, known as genome foun-dation models, have seen numerous versions proposedrecently . Similarly to popular LLMs, existing genome founda-tion models utilize next-token prediction or masked-prediction approaches within transformer-based archi-tectures, where the tokens to be predicted are the nu-cleotides composing the genome fragments. These mod-els, akin to LLMs, enable trainable and contextualizedrepresentations that can be dened either in a task-dependent or task-independent manner .Accord-ing to standardized benchmarks, the embeddings derivedfrom these foundation models have the potential to of-fer substantial improvements over those based on k-mers. However, these embeddings are also computation-ally far more intensive, reducing their scalability in lightof the massive amounts of data generated by modern se-quencing technologies. For instance, conducted k-mer-based metagenomic binning on samples from wastewater treatment plants, encompassing approximately 1.9 1012 base pairsand resulting in the recovery of over 3700 high to medium quality clusters/metagenome-assembledgenomes (MAGs). In this paper, we demonstrate how k-mer-based embeddings of genome fragments provide a scalableand lightweight alternative to genome foundation models. We revisit the theoretical basis of k-mersand offer a theoretical characterization of the identiability of DNA fragments based on their k-merproles. For non-identiable fragments, we establish lower and upper bounds on their edit distanceusing the l1 distance between their respective k-mer proles. These ndings offer theoretical justi-cations for k-mer-based genome representations and hold potential signicance beyond the scopeof this study. Building on these theoretical insights, we propose a simple and lightweight model forlearning embeddings of genome fragments using their k-mer representations. We empirically assess the proposed embeddings on metagenomic binning tasks and compare theirperformance with large state-of-the-art genome foundation models. Our ndings indicate that, whileboth sets of models produce comparable quality in terms of the MAGs recovered, the proposedmodels require signicantly fewer computational resources. demonstrates this by showingthe number of parameters in our k-mer embedding methods compared to those in the state-of-the-artgenome foundation models. The k-mer-based embedding approaches involve models with severalorders of magnitude fewer parameters.",
  "The main contributions of the paper can be summarized as follows:": "We provide a theoretical analysis of the k-mer space, offering insights into why k-mersserve as powerful and informative features for genomic tasks. We demonstrate that models based on k-mers remain viable alternatives to large-scalegenome foundation models. We show that scalable, lightweight models can provide competitive performance in themetagenomic binning task, highlighting their efciency in handling complex datasets.",
  "When analyzing the microbial content of biological samples (e.g., soil samples or samples fromthe intestine), we deal with genomic material originating from multiple different species. For such": "analyses, the general workow consists of sequencing the DNA fragments in the sample, producingelectrical signals that are subsequently converted into sequences of letters corresponding to the fourDNA bases (A, C, T, G). During the sequencing process, the full DNA sequences are fragmented intosmaller subsequences (called reads), resulting in millions or even billions of reads for each sample.Depending on the sequencing technology being used, reads are typically either classied as shortreads (100-150 bases) or long reads (2k-30k bases), and while long reads are generally preferable,they are also more prone to translation errors. Identifying the microbial composition of a sample involves clustering the DNA fragments accord-ing to their genomic origin (a process referred to as metagenmoic binning).1 Clustering the DNAfragments relies not only on a representation of the genome fragments, but typically also includes in-formation about the read coverages in the sample, reecting the relative abundances of the individualspecies that make up the sample. For the current paper, the focus is on representations of DNA fragments. Existing works on metage-nomic binning typically either rely on predened features (e.g., ) or, more recently, ongenome foundation models (e.g., ) for representing the DNA fragments. Predened fea-tures for metagenomic binning include the k-mer frequencies of the genome (e.g., for k = 4, thegenome is represented by a 256-dimensional vector), which have shown to exhibit a degree of ro-bustness across different areas of the same genome . These k-mer vectors/proles are eitherused as direct representations of the DNA fragments as in, e.g., METABAT2, VAMP , andSEMIBIN2 or is used for learning k-mer-based embeddings in the spirit of WORD2VEC. More recently, genome foundation models have also been proposed, which include DNABERT ,DNABERT-2 , HYENADNA , and DNABERT-S . These foundation models provideembedding of the raw DNA fragments as represented by the sequences of four nucleotide letters. In this work, we show that although the contextualized embeddings produced by foundation modelsprovide a strong basis for downstream genome analysis tasks, the complexity of the models alsomakes them less scalable to the vast amounts of data currently being generated by the state-of-the-art sequencing technologies. Consequently, we consider more lightweight models and explore theuse and theoretical basis for models relying on k-mer representations of DNA fragments.",
  "3k-mer embeddings": "As we discussed in the previous section, the metagenomic binning problem aims to cluster thesequences (i.e. reads) according to their respective genomes. For the sake of the argument, wedenote with : R [K] the function that maps each read to the (index) ground-truth genome fromwhich the read originates. Here, we use R to denote the set of reads where each read is supposed tooriginate from one of the K genomes. Performing clustering directly on the reads has been shown to provide very poor performance ,mainly because reads lie in a complex manifold in a very high dimensional space. A well-testedapproach is to instead embed each of the objects in a lower dimensional space, known as the em-bedding or latent space, whose structure is much closer to Euclidean space, where clustering is farsimpler to perform. More formally, we characterize the problem as follows: Problem Denition. Let R + be a nite set of reads with a genome mapping function where = {A, C, T, G}. For a given threshold value R+, the objective is to learn an embeddingfunction E : R Rd that embeds reads into a low-dimensional metric space (X, dX), usually aEuclidean space, such that dX(E(r), E(q)) if and only if (r) = (q) for all reads r, q Rwhere d |R|. Once we establish an embedding function like the one described earlier, it becomes, in principle,straightforward to employ a simple clustering algorithm to bin or group the reads. However, forthis purpose, the embedding function E must be capable of distinguishing the intrinsic features ofthe various genomes, producing similar latent representations for reads that originate from the same",
  ".1k-mers are a powerful representation of reads": "The use of k-mer proles to represent reads helps overcome several challenges encountered dur-ing the clustering or binning of reads. These challenges include (i) the variation in read lengths inpractical scenarios, such as in genome sequencing where read lengths can differ signicantly, (ii) am-biguity in read direction, which is a result of reads lacking inherent directionality, complicating theanalysis, and (iii) the equivalence of a DNA sequence to its complementary sequence because DNAis composed of two complementary strands, meaning the information from one strand correspondsto that from its complementary strand. An initial important question concerns the identiability of reads, which examines to what extentdifferent reads share the same k-mer proles. We will call the reads that can be uniquely recon-structed from their given k-mer prole as identiable and this is crucial because if many readspossess the same k-mer prole, they will invariably be grouped into the same cluster, potentiallyleading to the loss of signicant information. In this context, Ukkonen et al. conjectured intheir study on the string matching problem that two sequences sharing the same k-mer prole couldbe transformed into one another through two specic operations, and this claim was later proved byPevzner . However, these specied operations fail to consider cases where sequences includerepeated overlapping occurrences of the same k-mer. In this regard, in Theorem 3.1, we demonstrate that a read can be perfectly reconstructed from itsk-mer prole under certain conditions, which become less restrictive with larger k values. In thefollowing theorem, we use ri rj, with i < j, to denote any subsequence of a read r that includesconsecutive nucleotides from position i to position j.",
  "Proof. The proof is omitted due to the limitation on the number of pages. Please see the appendix": "It is important to note that it is always possible to nd an optimal k value that ensures that each readdoes not meet any of the previously mentioned conditions and, in consequence, becomes identiable.Clearly, when k is equal to the length of the reads, all reads become identiable. However, ask increases, the k-mer proles become more prone to errors, and it will be harder to identify theunderlying patterns in the reads (in the extreme case scenario where k equals the length of the reads,each read will correspond to a unique k-mer). Thus, using large values of k is impractical. However,the results show that even with smaller k values, identiability could still be potentially achieved ifnot by all but by some of the reads. We hypothesize that the effectiveness of k-mer representationsstems, in part, from this fact. Another perspective to consider is the extent to which two similar reads share a similar k-mer prole.The identiability approach from the previous result addresses this issue by establishing that if tworeads have identical proles, then the reads themselves are identical. However, identiability islimited by the conditions outlined in Theorem 3.1, which may not always be met. The observationgiven in Proposition 3.2 provides a broader and more applicable nding. It demonstrates that if two k-mers are similar according to the l1 distance, then the correspondingreads are also similar according to the Hamming distance in the read space. It is important tonote that both the l1 and Hamming distances are natural measures for evaluating similarity in thiscontext. Technically speaking, we show that the l1 distance between k-mer proles can be upper and lower bounded by the Hamming distance between the corresponding identiable reads, so theyare Lipschitz equivalent spaces. In the next result, c : R k N denotes the function showingthe number of occurrences of a given k-mer in a given read. For simplicity, we use the notation, cr,to indicate the k-mer prole vector of a read r whose entries are ordered lexicographically. In otherwords, cr(x) is the number of appearances of x k in read r R. Proposition 3.2. Let M1 = (, dH) and M2 = (N|k|, 1) be the metric spaces denotingthe set of identiable reads and their corresponding k-mer proles equipped with edit and 1 dis-tances, respectively. The k-mer prole function, c : M1 M2, mapping given any read, r, to itscorresponding k-mer prole, cr := c(r), is a Lipschitz equivalence, i.e. it satises",
  "Linear read embeddings": "Below we consider two simple genome sequence models dening the embedding of a read as a linearcombination of the k-mer representations. The rst model (k-mer prole) does not involve any learn-ing procedure and it is simply dened by the k-mer counts of the read, whereas the second model(Poisson model) expands on the k-mer prole model by explicitly representing the dependenciesbetween k-mers. Both models will serve as baselines for more complex models.",
  "where zx represents the canonical basis vector for the k-mer x k, i.e. (zx {(u1, . . . , u|k|) {0, 1}|k| : i ui = 1} )": "As previously mentioned, our primary objective is to represent reads in a lower-dimensional space,where their relative positions in a latent space reect their underlying similarities. By Equation 2,the k-mer prole of a read can also be considered as its embedding vector, but its entries are notindependent. In other words, if we change one letter in a read, it can affect at most k different k-mercounts. In this regard, it might be possible to learn better representations than simple k-mer proles. Poisson model: For a given read r := (r1 . . . r), it is easy to see that the consecutive k-mersin the read are not independent. For instance, the k-mers located at position indices i and i + 1,(i.e. x := ri ri+k1 and y := ri+1 ri+k), share the same substring ri+1 ri+k1, whichhighlights the inherent dependencies between k-mers. Hence, we will learn the representation, zx, ofeach k-mer, x, instead of using the canonical basis vectors. We propose to model the co-occurrencefrequency of specic k-mer pairs within a xed window size, , using the Poisson distribution. Inother words, ox,y Pois(x,y), where ox,y indicates the number of co-appearances of k-mers,x := ri ri+k1 and y := rj rj+k1 for |i j| .",
  ": Illustration of the non-linear k-mer embedding approach described in .3": "where ox,y is the average number of co-occurrences of k-mers x and y per read within a windowof size in the dataset. Once we have obtained the k-mer embeddings, we can obtain the readembeddings by combining the k-mer embeddings with their respective occurrence counts, as givenin Equation 2. More specically, the embedding of read, r, is given by",
  "Non-linear read embeddings": "In the experimental section, we will show that the linear k-mer embeddings described previouslyoutperform raw k-mer proles in metagenomic binning tasks. However, the literature on machinelearning frequently emphasizes that non-linear embeddings typically provide superior results whenthe data, such as genomic sequences in this context, exist in complex high-dimensional manifoldspaces . We design a simple and efcient neural network architecture utilizing self-supervised contrastivelearning. Our model consists of two linear layers, and the rst one takes k-mer prole featuresas input, projecting them into a 512-dimensional space. A sigmoid activation function is applied,followed by a batch normalization operation and a dropout with a ratio of 0.2. The second layermaps them into the nal 256-dimensional embedding space. Our approach is inspired by previous methods in the context of metagenomic binning at the contiglevel . The primary aim here is not to introduce a novel methodology for learning embeddingsbut to demonstrate that simple non-linear embeddings, built upon k-mer representations, can matchthe effectiveness of existing state-of-the-art genomic foundation models for metagenomic binningtasks while being signicantly more scalable. The methodology is graphically depicted in . Initially, we create positive and negative pairsof read segments using the dataset provided. To create a positive pair, we split an existing readinto two equal-sized segments. Conversely, a negative pair is formed by combining two segmentsoriginating from the splitting of two distinct reads chosen at random. Subsequently, for each pair,we calculate the k-mer prole for the two segments in the pair. These two k-mer proles are theninput into the same neural network, which maps them to two vectors within the embedding space.The loss function evaluates the quality of these two embeddings; it penalizes distant embeddingsin positive pairs and close embeddings in negative pairs. The learning process involves optimizingthe neural networks weights to minimize this loss function across numerous positive and negativesamples. Let R = {ri}Ni=1 be the set of reads and rli and rri are the segments indicating the left and right halvesof read ri R. As described above, we use these segments to construct the positive and negative pairsamples required for the self-supervised contrastive learning procedure. Let {(ri , rj, yij)}(i,j)I bethe set of triplets where I [N] [N] is the index set for the pairs, and the symbol, yij {0, 1} is used to denote whether (ri , rj) is a positive sample (i.e. +1), or negative (i.e. 0). The positive labelmeans that the pair corresponds to the left and right segments of the same read, while a negativelabel indicates they are segments from different reads. Then, we dene the loss function as follows:",
  "where ENL(ri ) denotes the output embedding of the neural network for segment ri": "Given a large number of distinct genomes (i.e., clusters), it is highly likely that negative pairs con-sist of segments from different genomes, as they originate from different reads. Conversely, positivepairs are composed of segments from the same genome, as they originate from the same read. Con-sequently, the neural networks embedding function will learn to produce similar embeddings fork-mer proles belonging to the same genome and different embeddings for k-mer proles belong-ing to different genomes. As demonstrated in the next section, this straightforward approach built onk-mer proles competes effectively with state-of-the-art genomic foundation models, which involveneural networks with several orders of magnitude more parameters.",
  "In this section, we will provide the details regarding the experiments, datasets, and baseline ap-proaches that we consider to assess the performance of the proposed linear and non-linear models": "Datasets. We utilize the same publicly available datasets used to benchmark the genome foundationmodels . The training set consists of 2 million pairs of non-overlapping DNA sequences, each10, 000 bases in length, constructed by sampling from the dataset, including 17, 636 viral, 5, 011fungal, and 6, 402 distinct bacterial genomes from GenBank . For model evaluation, we usesix datasets derived from the CAMI2 challenge data , representing marine and plant-associatedenvironments and including fungal genomes. These datasets propose realistic and complex reads,making them one of the most utilized benchmarks for the metagenomics binning task. Additionally,the synthetic datasets consist of randomly sampled sequences from the fungi and viral referencegenomes, excluding any samples from the training data . Baselines and proposed models. For our experiments, we have employed the recent genome foun-dation models to assess the performance of our approach. (i) KMER is one of the most widely usedbaselines, and it also serves as a fundamental component of our model. The DNA sequences arerepresented as 4-mer proles Tetranucleotide Frequencies given in Eq. 2 so each read is representedby a 256-dimensional vector. (ii) HYENADNA is a genome foundation model, HYENADNA,pre-trained on the Human Reference Genome with context lengths up to 106 tokens at singlenucleotide resolution. (iii) DNABERT-2 is another foundation model pre-trained on multi-species genomes, and it proposes Byte Pair Encoding (BPE) for DNA language modeling to addressthe computational inefciencies related to k-mer tokenization. It also incorporates various tech-niques, such as Attention with Linear Biases (ALiBi) and Low-Rank Adaptation (LoRA), to addressthe limitations of current DNA language models. (iv) DNEBERT-S aims to generate effectivespecies-aware DNA representations and relies on the proposed Manifold Instance Mixup (MI-Mix)and Curriculum Contrastive Learning approaches. It relies on the pre-trained DNABERT-2 modelas the initial point of contrastive training. (v) OURS(KMER-l1) is similar to the KMER approachpresented in (i), but it uses l1 distance instead of the cosine-similarity distance so we will also namethe rst one as OURS(KMER-COSINE) to distinguish both models. (vii) OURS(POIS) refers to thePoisson approach described in .2. (vi) OURS(NL) refers to the non-linear k-mer embeddingapproach based on self-supervised constractive learning described in .3. Parameter Settings. Our proposed models were trained on a cluster equipped with various NVIDIAGPU models. For the optimization of our models, we employed the Adam optimizer with a learningrate of 103. We used smaller subsets of the dataset for training our models, and we sampled 104reads for OURS(POIS) and 106 sequences for OURS(NL). The OURS(NL) model was trained for300 epochs with a mini-batch size of 104, while OURS(POIS) was trained for 1000 epochs using : Evaluation of the models on multiple datasets for the metagenomic binning task. Eachcolor represents the number of clusters within a specic F1 score range, and the number of clusterswith the highest quality is highlighted in dark blue. full-batch updates and window size of 4. Since we incorporated the contrastive learning strategy forOURS(NL), we randomly sampled 200 read halves to form the negative instances for each positivesample (one half of a read). We have set k = 4 and the nal embedding dimension to 256 for ourall models. Following the experimental set-up of , we used the publicly available pre-trainedversions of the baseline genome foundation models in the Hugging Face platform.",
  "Metagenomics Binning Task": "We assess the performance of the models based on the number of detected species/clusters and theseclusters are classied into ve different quality levels in terms of their F1 scores. Our methods andeach baseline approach generate embeddings for the reads, and we cluster these read representationsby following the work with the modied K-Medoid algorithm. We refer readers to the citedwork for further details on this approach. In line with standard practices in the eld, we use cosinesimilarity for the baseline methods to measure the similarity between read embeddings required forthe K-Medoid algorithm. For OURS(KMER-l1), we employed the exp(dist(, )) function with l1distance, while Euclidean distance was used for OURS(POIS) and OURS(NL). highlights the number of detected bins/clusters across different quality levels. For instance,the number of bins/species whose F1 scores above 0.9 is represented in dark blue while those withF1 scores between 0.5 and 0.6 are highlighted in red. Since we observe that the deviation in thenumber of detected species in most cases changes between at most 5, the error bars were notincluded. The results underscore the effectiveness of k-mer features, which are central to our papers focus.More specically, as it was observed in the study , k-mer feature vectors (i.e., KMER-COSINE)surpass some genome foundation models like HYENADNA and DNABERT-2. Furthermore, wehighlight the importance of choosing an appropriate similarity measure by showcasing the perfor-mance of the OURS(KMER-l1) variant. We note that Proposition 3.2 establishes a link betweenk-mer space equipped with l1 distance and read space with edit or Hamming distance. Thus, lever-aging an appropriate metric in dening the similarities between reads in the binning stage alsocontributes to the performance improvement of OURS(KMER-l1).",
  ": Inuence of dimension size (d) on the OURS(NL) model across different datasets": "Despite the OURS(NL) models lightweight design compared to recent genome foundation architec-tures, our non-linear embeddings effectively identify both high and low-quality bins. In the metage-nomics binning task, for practical purposes, the high-quality bins are typically prioritized (depictedin dark blue), and our model demonstrates comparable performance to the DNABERT-S modelon both Synthetic and Plant datasets, and it also outperforms DNABERT-S on the Marine dataset.Overall, our ndings emphasize the efcacy of lightweight non-linear embeddings built on top ofk-mer proles.",
  "Ablation Study": "We conduct a series of ablation studies in order to gain deeper insights into different componentsof the proposed architectures. We will start rst by examining the impact of the parameter k whichis used to dene the k-mer proles. It plays a fundamental role in the paper because all the modelvariants that we introduced rely on it. As also explained in , the selection of k also inu-ences the identiability of reads. In this regard, we evaluate the performance of the OURS(KMER-l1)model across various k values. shows the number of high-quality bins (i.e., F1 > 0.9) fordifferent k settings and reveals that the optimal performance is generally achieved when k is set to4 on different datasets. It also holds true across our different architectures, so we have set k = 4 inour models. We also examine the inuence of the output dimension size on the performance for the OURS(NL)model. We employed a very shallow architecture as described in .3, so the output dimensionsize plays a vital role in the computational cost and performance. As can be observed in ,the increase in dimension size also positively contributes to the number of detected high-quality bins,and the performance mostly saturates after 27. In order to have a fair comparison with the baselines,we also used 28 as an output dimension size in our architectures. For the OURS(NL) architecture, it is very natural to use Bernoulli distribution to model whether agiven pair of reads belongs to the same genome or not. However, different organisms might sharesimilar regions in their genetic codes; therefore, assuming binary interactions might not suit well inevery situation. In this regard, we rewrite Eq. 6 by Poisson distribution that we also employed forthe OURS(POIS) architecture as follows:",
  "Conclusion": "In this study we have shown the efcacy of non-linear k-mer-based embeddings for metagenomicbinning tasks, providing a compelling alternative to more recently proposed complex genome foun-dation models. Our work revisits and expands the theoretical framework surrounding k-mers, specif-ically addressing the identiability of DNA fragments through their k-mer proles and establishingnew bounds on the distances dening relevant metric spaces. This theoretical insight not only rein-forces the validity of using k-mer-based approaches for genome representation but also highlightstheir broader applicability in genomic research, such as taxonomic proling/classication and phylogenetic analysis . The lightweight model being proposed in the paper, grounded in these theoretical principles, showsconsiderable promise in the eld of metagenomic binning. It achieves a performance comparable tothat of state-of-the-art genome foundation models while requiring orders of magnitude fewer com-putational resources. This feature is especially important for large-scale genomic analyses that arecurrently driven by recent advances in sequencing technologies and where computational efciencyis paramount.",
  "Limitations and Societal Impact": "The ability to scale up metagenomic binning holds the potential for broader societal impacts throughan improved understanding of the diversity and function of the microbial communities that inuenceour health and environment. Insights into these communities can also play an essential role inachieving the sustainability goals , in particular good health and well-being (SDG-3), lifebelow water (SDG-14), and life on land (SDG-15), to name a few. The current study is partly limitedby the experimental setup, which is only based on synthetically generated genomic data followingthe experimental setup of similar studies such as . While the discussions about computationalresources are not expected to be signicantly affected by the type of data being used, the evaluationsand comparisons of the quality of the recovered genomes most likely will. For instance, samplescontaining genomes of closely related species or strains of the same species will generally be moredifcult to separate into distinct clusters. As part of future work, we plan to pursue a more rigorousanalysis of the binning quality using long-read sequences from real-world data.",
  "C Burge, A M Campbell, and S Karlin.Over- and under-representation of short oligonu-cleotides in DNA sequences. Proceedings of the National Academy of Sciences, 89(4):13581362, 1992": "Hugo Dalla-Torre, Liam Gonzalez, Javier Mendoza-Revilla, Nicolas Lopez Carranza,Adam Henryk Grzywaczewski, Francesco Oteri, Christian Dallago, Evan Trop, Bernardo Pde Almeida, Hassan Sirelkhatim, et al. The nucleotide transformer: Building and evaluatingrobust foundation models for human genomics. BioRxiv, pages 202301, 2023. Veronika B. Dubinkina, Dmitry S. Ischenko, Vladimir I. Ulyantsev, Alexander V. Tyakht, andDmitry G. Alexeev. Assessment of k-mer spectrum applicability for metagenomic dissimilarityanalysis. BMC Bioinformatics, 17:38, 2016. Simon G Gregory, KF Barlow, KE McLay, R Kaul, D Swarbreck, A Dunham, CE Scott,KL Howe, Kathryn Woodne, CCA Spencer, et al. The dna sequence and biological anno-tation of human chromosome 1. Nature, 441(7091):315321, 2006. Yanrong Ji, Zhihan Zhou, Han Liu, and Ramana V Davuluri. Dnabert: pre-trained bidirectionalencoder representations from transformers model for dna-language in genome. Bioinformatics,37(15):21122120, 2021. Dongwan D. Kang, Feng Li, Edward Kirton, Ashleigh Thomas, Rob Egan, Hong An, andZhong Wang. MetaBAT 2: An adaptive binning algorithm for robust and efcient genomereconstruction from metagenome assemblies. PeerJ, 7:e7359, 2019. Mikhail Kolmogorov, Derek M. Bickhart, Bahar Behsaz, Alexey Gurevich, Mikhail Rayko,Sung Bong Shin, Kristen Kuhn, Jeffrey Yuan, Evgeny Polevikov, Timothy P. L. Smith, andPavel A. Pevzner. metaFlye: Scalable long-read metagenome assembly using repeat graphs.Nature Methods, 17(11):11031110, 2020.",
  "Olexiy Kyrgyzov, Vincent Prost, Stphane Gazut, Bruno Farcy, and Thomas Brls. Binningunassembled short reads based on k-mer abundance covariance using sparse coding. Giga-Science, 9(4):giaa028, 2020": "Andre Lamurias, Alessandro Tibo, Katja Hose, Mads Albertsen, and Thomas Dyhre Nielsen.Metagenomic Binning using Connectivity-constrained Variational Autoencoders. In Proceed-ings of the 40th International Conference on Machine Learning, pages 1847118481. PMLR,2023. Fernando Meyer, Adrian Fritz, Zhi-Luo Deng, David Koslicki, Till Robin Lesker, Alexey Gure-vich, Gary Robertson, Mohammed Alser, Dmitry Antipov, Francesco Beghini, et al. Criticalassessment of metagenome interpretation: the second round of challenges. Nature methods,19(4):429440, 2022. Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. Distributed Repre-sentations of Words and Phrases and their Compositionality. In Advances in Neural Informa-tion Processing Systems, volume 26. Curran Associates, Inc., 2013.",
  "Patrick Ng.dna2vec: Consistent vector representations of variable-length k-mers.arXivpreprint arXiv:1701.06279, 2017": "Eric Nguyen, Michael Poli, Marjan Faizi, Armin Thomas, Michael Wornow, Callum Birch-Sykes, Stefano Massaroli, Aman Patel, Clayton Rabideau, Yoshua Bengio, et al. Hyenadna:Long-range genomic sequence modeling at single nucleotide resolution. Advances in neuralinformation processing systems, 36, 2024. Jakob Nybo Nissen, Joachim Johansen, Rosa Lundbye Allese, Casper Kaae Snderby, JoseJuan Almagro Armenteros, Christopher Heje Grnbech, Lars Juhl Jensen, Henrik BjrnNielsen, Thomas Nordahl Petersen, Ole Winther, and Simon Rasmussen.Improvedmetagenome binning and assembly using deep variational autoencoders. Nature Biotechnology,39(5):555560, 2021. Shaojun Pan, Xing-Ming Zhao, and Luis Pedro Coelho.SemiBin2: Self-supervised con-trastive learning leads to better MAGs for short- and long-read sequencing. Bioinformatics,39(Supplement_1):i21i29, 2023. Edoardo Pasolli, Francesco Asnicar, Serena Manara, Moreno Zolfo, Nicolai Karcher, FedericaArmanini, Francesco Beghini, Paolo Manghi, Adrian Tett, Paolo Ghensi, Maria Carmen Col-lado, Benjamin L. Rice, Casey DuLong, Xochitl C. Morgan, Christopher D. Golden, Christo-pher Quince, Curtis Huttenhower, and Nicola Segata. Extensive Unexplored Human Micro-biome Diversity Revealed by Over 150,000 Genomes from Metagenomes Spanning Age, Ge-ography, and Lifestyle. Cell, 176(3):649662.e20, 2019.",
  "Ruohan Ren, Changchuan Yin, and Stephen S.-T. Yau. Kmer2vec: A Novel Method for Com-paring DNA Sequences by word2vec Embedding. 29(9):10011021, 2022": "Wei Shen, Hongyan Xiang, Tianquan Huang, Hui Tang, Mingli Peng, Dachuan Cai, PengHu, and Hong Ren. KMCP: Accurate metagenomic proling of both prokaryotic and viralpopulations by pseudo-mapping. Bioinformatics, 39(1):btac845, 2023. Caitlin M. Singleton, Francesca Petriglieri, Jannie M. Kristensen, Rasmus H. Kirkegaard,Thomas Y. Michaelsen, Martin H. Andersen, Zivile Kondrotaite, Sren M. Karst, Morten S.Dueholm, Per H. Nielsen, and Mads Albertsen. Connecting structure to function with the re-covery of over 1000 high-quality metagenome-assembled genomes from activated sludge usinglong-read sequencing. Nature Communications, 12(1):2009, 2021. Kenneth Timmis, Willem M. de Vos, Juan Luis Ramos, Siegfried E. Vlaeminck, AuxiliadoraPrieto, Antoine Danchin, Willy Verstraete, Victor de Lorenzo, Sang Yup Lee, Harald Brssow,James Kenneth Timmis, and Brajesh K. Singh. The contribution of microbial biotechnology tosustainable development goals. Microbial Biotechnology, 10(5):984987, 2017. Esko Ukkonen. Approximate string-matching with q-grams and maximal matches. Theoreticalcomputer science, 92(1):191211, 1992. Jens-Uwe Ulrich and Bernhard Y. Renard. Fast and space-efcient taxonomic classication oflong reads with hierarchical interleaved XOR lters. Genome Research, page gr.278623.123,2024. Ryan R. Wick, Louise M. Judd, Louise T. Cerdeira, Jane Hawkey, Guillaume Mric, BenVezina, Kelly L. Wyres, and Kathryn E. Holt. Trycycler: Consensus long-read assemblies forbacterial genomes. Genome Biology, 22(1):266, 2021. Yu-Wei Wu, Blake A. Simmons, and Steven W. Singer. MaxBin 2.0: An automated binningalgorithm to recover genomes from multiple metagenomic datasets. Bioinformatics, 32(4):605607, 2016. Chao Yang, Debajyoti Chowdhury, Zhenmiao Zhang, William K. Cheung, Aiping Lu, Zhaox-iang Bian, and Lu Zhang.A review of computational tools for generating metagenome-assembled genomes from metagenomic sequencing data.Computational and StructuralBiotechnology Journal, 19:63016314, 2021. Chenglong Yu, Mo Deng, Shiu-Yuen Cheng, Shek-Chung Yau, Rong L. He, and Stephen S. T.Yau. Protein space: A natural method for realizing the nature of protein universe. Journal ofTheoretical Biology, 318:197204, February 2013. Zhihan Zhou, Yanrong Ji, Weijian Li, Pratik Dutta, Ramana Davuluri, and Han Liu. Dnabert-2: Efcient foundation model and benchmark for multi-species genome.arXiv preprintarXiv:2306.15006, 2023. Zhihan Zhou, Winmin Wu, Harrison Ho, Jiayi Wang, Lizhen Shi, Ramana V Davuluri, ZhongWang, and Han Liu. Dnabert-s: Learning species-aware dna embedding with genome founda-tion models. arXiv preprint arXiv:2402.08777, 2024.",
  "A.1Theoretical Analysis": "Lemma A.1. Let r = r1 r be a read satisfying cr(xi) = 1 for its every (k 1)-mer, xi =ri ri+k2 where 1 i i for some i {1, . . . , k + 2}. If there exists a read q = q1 qhaving the same k-mer prole as r, then ri = qi for all 1 i i + k 2. Proof. Let r be a read where (k 1)-mers, xi := ri ri+k2, appears only once in r for all1 i i. As a basis step, we rst show that the initial k-mer of q must be the same as that of r, i.e.,q1 qk = r1 rk. Suppose this is not the case, then there must exist an index 1 j k + 1such that qj qj+k1 = r1 rk since they have identical k-mer proles by initial assumption.Note that j = 1; otherwise, the reads would share the same prexes. Therefore, qj1 . . . qj+k2is another k-mer of q, and it must also be present in r because they share the same k-mer prole.Since r1 rk1 = qj qj+k2, k-mer qj1 qj+k2 must be the prex of r; otherwise (k 1)-mer qj . . . qj+k2 (i.e. r1 . . . rk1) appears in r more than once and it violates the assumption thatcr(xi) = 1 for all xi = ri ri+k2 where i {1, . . . , i}. However, if qj1 qj+k2 is theprex of r, then it enforces that qj1 = qj = = qj+k2 = qj+k1 and a (k 1)-mer occursmore than once in the substring r1 ri so reads r and q must have the same initial k-mer. For the inductive step, suppose that reads r and q agree up to position index j where k j <i k 2, i.e., ri = qi for all 1 i j. We will show that rj+1 and qj+1 are also the same. Sincej < i k + 2, substring qjk+2 . . . qj+1 is also a k-mer of q. Since reads have the same k-merproles, r also includes it. By the inductive hypothesis, we have qjk+2 qj = rjk+2 rj,and we know (k 1)-mer rjk+2 rj occurs only once so it implies that qjk+2 qj+1 =rjk+2 rj+1, i.e. rj+1 = qj+1. In conclusion, we have ri = qi for all 1 i i k + 2.",
  "Corollary A.2. If the (k 1)-mer prole of a read contains at most one occurrence for each of its(k 1)-mers, then there is no other read having the same k-mer prole": "Proof. Let r = r1 r and q = q1 q be reads having the same k-mer prole and each of their(k 1)-mers appear only once. By Lemma A.1, we have ri = qi for all 1 i since cr(xi) = 1for all (k 1)-mers xi = ri . . . ri+k2 where 0 i k + 1",
  ". ri ri+k2 = rj rj+k2 = rh rh+k2 for some indices 1 i < j < h k+2where ri+k1 rj1 = rj+k1 rh1": "Proof. Let r = r1 r be a read of length , and we will rst show that if a read sat-ises one of these conditions, then we can nd a read other than r having the same k-merprole.(i) Suppose that we have r1 rk1=rk+2 r, then the read dened asriri+1 rk+2 r1rrkrk+1 ri2ri1 will be distinct from r for some i {k, . . . , k + 1}, and it shares the same k-mer prole. (ii) Let r be a read holding the second conditionso we have ri ri+k2 = rj rj+k2 and rg rg+k2 = rh rh+k2 for some indices1 i < g < j < h . Then, we can construct a different read having the same k-merprole by interchanging the substrings ri+k1 rg1 and rj+k1 rh1. (iii) As the last con-dition, suppose that we have ri ri+k2 = rj rj+k2 = rh rh+k2 for some indices1 i < j < h k + 2 such that substrings ri+k1 rj1 and rj+k1 rh1 are notthe same so we can generate a new read with an equivalent k-mer prole by swapping these sub-strings. Conversely, assume that there exists a read q that shares the same k-mer prole as r but doesnt meetany of the conditions outlined. Let x be the rst (k 1)-mer in r where it appears more than oncein r, and let i1 i2 . . . in be the position indices where x occurs in r, i.e. x = rih rih+k2 h {1, . . ., in} and cr(x) = n. It must satisfy i1 > 1 or in < k + 2; otherwise, it violatesthe rst condition. By Lemma A.1, r and q must match up to the position index in + k 3. Since rand q have the same k-mer proles and cr(ri11 ri1k+1) = cq(qi11 qi1k+1) = 1, we canalso write that rj = qj for all 1 j i1 + k 2 and we will show that reads, r and q, must be thesame up to the position index in + k 2. If (k 1)-mer, x, occurs more than twice in r (i.e., n > 2), then either ih+1 ih = 1 or substringsrih rih+1 for each h {1, n 1} must be the same due to the third condition. Thus, we obtainidentical reads up to in + k 2. Now, we will consider the case in which x appears exactly twice in r (i.e., n = 2). If substringri1+1 rin1 consists only of (k 1)-mers occurring at most once in r, then again, we achievethe equivalence of the reads up to index in + k 2. Therefore, suppose that there exists a (k 1)-mer y = x appearing more than once in r and let j1, . . . , jm be its position occurrence indices(i.e. y = rih rih+k2 h {1, . . . , jm}). Note that jm cannot be greater than in since itviolates the second condition, so we assume that all occurrences of y are within ri1+1 rin+k3.By recursively applying the same strategies for the substring, rj1+1 rjm1, we can conclude thatthe reads must be the same up to in + k 2.",
  "Note that the remaining part of the read, rin+k1 r, does not contain any (k 1)-mer appearingin r1 rin+k2, so by applying the same strategy to the rest of the read, we can obtain that r =q": "Proposition A.4. Let M1 = (, dH) and M2 = (N|k|, 1) be the metric spaces denotingthe set of identiable reads and their corresponding k-mer proles equipped with edit and 1 dis-tances, respectively. The k-mer prole function, c : M1 M2, mapping given any read, r, to itscorresponding k-mer prole, cr := c(r), is a Lipschitz equivalence, i.e. it satises",
  "= k||kdH (r, q)": "For the lower bound, we know that dH (r, q) must be greater than 0 if and only if r and q aredifferent since r, q L (i.e. identiable); otherwise we have cr cq1 = dH (r, q) = 0. Fornon-identical reads, there must exist at least one 1 i such that ri = qi, so it implies that thereis an k-mer x k such that cr(x) = cq(x). Then we can write that",
  "A.2Experiments": "For the evaluation of the models, we follow the same experimental set-up proposed by the recentgenome foundation model , and we assess the performance of the models with respect to thequality of the number of detected clusters. We suppose that the number of clusters (i.e., genomes) in the evaluation datasets is unknown, sowe utilize the modied K-medoid algorithm to infer the clusters. It requires a threshold valuedue to the initially unknown number of clusters so to address this, we use separate datasets derivedfrom the same source as the target evaluation datasets. For each method, we rst compute the clustercentroids using the ground-truth labels and the embeddings generated by the respective approaches.Then, we calculate the similarities between the centroid vector and the read embeddings within thesame cluster. The threshold value is selected as the 70th percentile of these sorted similarity scores.After inferring the clusters by the modied K-medoid algorithm, the extracted cluster labels are thenaligned with the ground truths labels by the Hungarian algorithm. For the experiments, we use the publicly available datasets provided by Zhou et al. , whichinclude a training set of 2 million non-overlapping DNA sequence pairs. For model evaluation, wework with 3 types of datasets, each having two variants, and we provide various statistics about themin . The datasets named as Dataset 0 are only used to detect the optimal threshold value forthe K-medoid algorithm and the other variants (i.e., Dataset 5 and Dataset 6) are considered for theevaluation. We truncated sequences longer than 10, 000 bases, excluded those shorter than 2, 500bases, and omitted species represented by fewer than 10 sequences.",
  "SymbolDescription": "Genetic alphabetRSet of readsE()Embedding functionr & qReadRead lengthkLength of k-merskAll k-mers of length kyijBinary variable showing if the pair is a positive samplepijSuccess probability of a positive pairij, x,yRate of the Poison distributionWindow sizecr(x)Number of occurrences of x in rox,y(x)Number of co-occurrences of x and y within a window of size"
}