{
  "Abstract": "This paper focuses on the system identification of an important class of nonlinearsystems: linearly parameterized nonlinear systems, which enjoys wide applicationsin robotics and other mechanical systems. We consider two system identificationmethods: least-squares estimation (LSE), which is a point estimation method; andset-membership estimation (SME), which estimates an uncertainty set that containsthe true parameters. We provide non-asymptotic convergence rates for LSE andSME under i.i.d. control inputs and control policies with i.i.d. random perturbations,both of which are considered as non-active-exploration inputs. Compared with thecounter-example based on piecewise-affine systems in the literature, the successof non-active exploration in our setting relies on a key assumption on the systemdynamics: we require the system functions to be real-analytic. Our results, togetherwith the piecewise-affine counter-example, reveal the importance of differentiabilityin nonlinear system identification through non-active exploration. Lastly, wenumerically compare our theoretical bounds with the empirical performance ofLSE and SME on a pendulum example and a quadrotor example.",
  "Introduction": "Learning control-dynamical systems with statistical methodology has received significant attention inthe past decade (Sarker et al., 2023; Li et al., 2023b; Chen and Hazan, 2021; Simchowitz and Foster,2020; Wagenmaker and Jamieson, 2020; Simchowitz et al., 2018; Dean et al., 2018; Abbasi-Yadkoriand Szepesvri, 2011; Li et al., 2021b). In particular, the estimation of linear dynamical systems, e.g.xt+1 = Axt+But+wt, is relatively well-studied: it has been shown that non-active exploration byi.i.d. noises on control inputs ut and system disturbances wt are already enough for accurate systemidentification, and least square estimation (LSE) can achieve the optimal estimation convergence rate(Simchowitz and Foster, 2020; Simchowitz et al., 2018). However, nonlinear control systems are ubiquitous in real-world applications, e.g. robotics (Sicilianoet al., 2010; Alaimo et al., 2013), power systems (Simpson-Porco et al., 2016), transportation (Konget al., 2015), etc. Motivated by this, there has been a lot of attention on learning nonlinear systemsrecently. One natural and popular direction to study nonlinear system identification is on learninglinearly parameterized nonlinear systems as defined below, which is a straightforward extension fromthe standard linear systems (Mania et al., 2022; Khosravi, 2023; Foster et al., 2020)",
  "where is a vector of unknown parameters and (xt, ut) is a known vector of nonlinear features": "On the one hand, some classes of these systems are shown to enjoy similar benefits of linear systems.For example, bilinear systems can also be estimated by LSE under non-active exploration with i.i.d.noises (Sattar et al., 2022), as well as linear systems with randomly perturbed nonlinear policies (Liet al., 2023b). On the other hand, it is also known that non-active exploration is insufficient for general linearlyparameterized nonlinear systems. In particular, (Mania et al., 2022) provides a counter exampleshowing that non-active exploration is insufficient to learn accurate models under piece-wise affinefeature functions. This motivates a sequence of follow-up work on the design of active explorationfor nonlinear system estimation, which is largely motivated by the non-smooth feature functions suchas ReLu in neural networks (Mania et al., 2022; Kowshik et al., 2021; Khosravi, 2023). However, there is a big gap between bilinear systems, which is infinitely differentiable, and thecounter example by non-smooth systems. A natural question is: to what extent can non-activeexploration still work for linearly parameterized nonlinear systems? Contributions.One major contribution of this paper is showing that LSE with non-active i.i.d.noises can efficiently learn any linearly parameterized nonlinear systems with real-analytic featurefunctions and provide a non-asymptotic convergence rate. Notice that real-analytic feature functionsare common in physical systems. For example, polynomial systems satisfy this requirement and havewide applications in power systems (Simpson-Porco et al., 2016), fluid dynamics (Noack et al., 2003),etc. Further, trigonometric functions also satisfy the real-analytic property so a large range of roboticsand mechanical systems also satisfy this requirement (Siciliano et al., 2010; Alaimo et al., 2013).",
  "A side product of our LSE convergence rate analysis is the convergence rate for another commonlyused uncertainty quantification method in control: set membership estimation (SME)": "Numerically, we test our theoretical results in pendulum and quadrotor systems. Simulations showthat LSE and SME can indeed efficiently explore the system and converge to the true parameter undernon-active exploration noises. Technically, the key step in our proof is establishing the block-martingale-small-ball condition(BMSB) for general analytic feature functions, which greatly generalizes the bilinear feature functionin Sattar et al. (2022). Our result is built on an intuition inspired by the counter example in (Maniaet al., 2022): the counter example in (Mania et al., 2022) requires that some feature function is zeroin a certain region, so nothing can be learned about its parameter if the states stay in this region.However, analytic functions cannot be a constant zero in a positive-measure region unless it is aconstant zero everywhere. Therefore, the counter example does not work, and non-active explorationaround any states can provide some useful information. Our proof formalizes this intuition by utilizingthe Paley-Zygmund Petrov inequality (Petrov, 2007). Related work.Inspired by neural network parameterization, nonlinear systems of the form xt+1 =(Axt) + wt is also studied in the literature, where () is a known nonlinear link function andA is unknown. The least square cost is no longer quadratic or even convex in this case and variousoptimization methods have been proposed to learn this type of systems (Kowshik et al., 2021; Sattaret al., 2022; Foster et al., 2020). Another related line of research focuses on nonlinear regression with dependent data (Ziemann andTu, 2022; Ziemann et al., 2023, 2024),1 which can be applied to nonlinear system identification.The nonlinear regression in (Ziemann and Tu, 2022; Ziemann et al., 2023, 2024) is based on non-parametric LSE and its variants, and their convergence rates under different scenarios have beenanalyzed. It is interesting to note that this line of work usually assumes certain persistent excitationassumptions,2 whereas our paper demonstrates that persistent excitation holds by establishing theBMSB condition for linearly parameterized and real-analytic nonlinear control systems.",
  "Uncertainty set estimation is crucial for robust control under model uncertainties Lu and Cannon(2023); Lorenzen et al. (2019); Li et al. (2021a). SME is a widely adopted uncertainty set estimation": "1yt = f(xt) + wt is considered, where xt and yt correlate with the historical data.2For example, (Ziemann and Tu, 2022) assumes hyper-contractivity, and (Ziemann et al., 2024) assumes theempirical covariance of the {xt}t0 process is invertible with high probability (Corollary 3.2). method in robust adaptive control (Lorenzen et al., 2019; Lu and Cannon, 2023; Bertsekas, 1971; Baiet al., 1995). Recently, there is an emerging interest in analyzing SMEs convergence and convergencerate for dynamical systems (Li et al., 2024; Lu et al., 2019; Xu and Li, 2024), because previousanalysis focus more on the linear regression problem (e.g. (Akay, 2004; Bai et al., 1998)). There arealso recent applications of SME to online control Yu et al. (2023), power systems Yeh et al. (2024),and computer vision Gao et al. (2024); Tang et al. (2024). Notation. The set of non-negative real numbers is denoted by R0. The notation stands for theceiling function. For a real vector z Rn, z2 represents its 2 norm, z represents its norm,and zi represents its i-th component with i = 1 n. The set of real symmetric matrices is denotedby Sn. For a real matrix Z, Z represents its transpose, Z2 its maximum singular value, ZF itsFrobenius norm, min(Z) its minimum singular value, vec(Z) its vectorization obtained by stackingits columns, and for a real square matrix Z, tr(Z) represents its trace. For a real symmetric matrixZ, Z 0 and Z 0 indicate that Z is positive definite and positive semi-definite, respectively.For a measurable set E Rn, n(E) represents its Lebesgue measure in Rn and Ec represents itscomplement in Rn. The notation stands for the empty set. For a set T of matrices Rnm,diam(T ) denotes its diameter and it is defined as diam(T ) = sup,T F . For zi R withi = 1, , , the notation diag(z1, , z) denotes a matrix in R with diagonal entries of zi.This paper uses truncated-Gaussian(0, w, [wmax, wmax]) to refer to the truncated Gaussiandistribution generated by Gaussian distribution with zero mean and 2w variance with truncated range[wmax, wmax]. The same applies to multi-variate truncated Gaussian distributions.",
  "Problem Formulation and Preliminaries": "This paper studies the system identification/estimation of linearly parameterized nonlinear systems:xt+1 = xt, ut+ wt,(1)where xt Rnx, ut Rnu, and wt Rnx denote the state, control input, and system disturbancerespectively; Rnxn denotes the unknown parameters to be estimated, and () denotes avector of known nonlinear feature/basis functions, i.e., () = (1(), , n()), where i() :Rnx+nu R. Without loss of generality, we consider zero initial condition, i.e., x0 = 0, and linearlyindependent feature functions, that is, ni=1 cii(xt, ut) = 0 implies that ci = 0 for all i.3 The linearly parameterized nonlinear system (1) is a natural generalization of linear control systemsxt+1 = Axt + But + wt and has wide applications in, e.g. robotics (Siciliano et al., 2010; Alaimoet al., 2013), power systems (Simpson-Porco et al., 2016), transportation (Kong et al., 2015), etc.Therefore, there has been a lot of research on learning this type of systems (1) by utilizing themethodology and insights from linear system estimation. For example, it is common to estimate alinearly parameterized nonlinear system by least square estimation (LSE), which enjoys desirableperformance in linear systems.",
  "xt+1 (xt, ut)22.(2)": "For linear systems, LSE enjoys the following good property: LSE can achieve the optimal rate ofconvergence with i.i.d. noises wt and i.i.d. control inputs ut under proper conditions ( (Simchowitzet al., 2018)). This good property has been generalized to some linearly parameterized nonlinearsystems, such as bilinear systems, and linear systems with nonlinear control policies. Unfortunately,general linearly parameterized nonlinear systems do not enjoy this good property of linear systems,meaning i.i.d. random inputs may not provide enough exploration for non-smooth feature functions(). Therefore, a sequence of follow-up work focuses on the design of active exploration methods. However, due to the simplicity of implementation, i.i.d. random inputs remain a popular method inempirical research of system identification and enjoy satisfactory performance sometimes, despitethe lack of theoretical guarantees. Therefore, this paper aims to establish more general conditionsthat allow provable convergence of nonlinear system estimation under i.i.d. random inputs. In the rest of this paper, we will show that with certain smoothness and continuous conditions, i.i.d.random inputs are sufficient for estimation of (1), which recovers the good property of linear systems.",
  "In the following, we formally describe the smoothness and continuity conditions that enables efficientexploration of (1) by i.i.d. random inputs": "Assumption 1 (Analytic feature functions). All the components of feature vector () are realanalytic functions in Rnx+nu,4 i.e., for every 1 i n, i(x, u) is an infinitely differentiablefunction such that the Taylor expansion at every (x, u) converges point-wisely to the i(x, u) in aneighborhood of (x, u). Analytic functions include polynomial functions and trigonometric functions, which are importantcomponents of many physical systems in real-world applications, e.g. power systems, robotics,transportation systems, etc. In particular, we provide two illustrative examples below. Example 1 (Pendulum). Many multi-link robotic manipulators can be understood as interconnectedpendulum dynamics. The motion equations of a single pendulum, consisting of a mass m suspendedfrom a weightless rod of length l fixed at a pivot with no friction, can be expressed as:",
  "ml2 + w,": "where represents the angle of the rod relative to the vertical axis, g is the gravity constant, u is thetorque input, and w is the disturbance applied to this system. After discretization the system dynamicscan be rewritten in the structure of (1) with the feature vector consisting of expressions involvingsin() and u, all of which are analytic functions. The matrix of unknown parameters contains termsof the pendulums mass and the rods length. Example 2 (Quadrotor (Alaimo et al., 2013)). Let p R3 and v R3 represent the center ofmass position and velocity of the quadrotor in the inertial frame, respectively; let R3 denote itsangular velocity in the body-fixed frame, and q R4 denote the quaternion vector. The quadrotorsequations of motion can then be expressed as:",
  "This assumption can be relaxed to locally analytic functions in a large enough bounded set": "Remark 1 (Connection with Lebesgue Decomposition Theorem). Definition 1 can be interpretedby the Lebesgue Decomposition Theorem, which suggests that any probability distribution can bedecomposed into a purely atomic component and a non-atomic component (see more details inHalmos (2013)). A semi-continuous distribution as defined in Definition 1 requires the distributionsnon-atomic component to be nonzero. In the following, we provide the assumptions on wt and ut using the semi-continuity definition.Assumption 2 (Bounded i.i.d. and semi-continuous disturbance). wt is i.i.d. following a semi-continuous distribution with zero mean and a positive definite covariance matrix w 2wInx 0and a bounded support, i.e. wt wmax almost surely for all t. The i.i.d. assumption is common in the literature of system identification for linear and nonlinearsystems. As for the bounded assumption on wt, though being stronger than the sub-Gaussianassumption on wt in the literature of linear system estimation, it is a common assumption in theliterature of nonlinear system estimation (Mania et al., 2022; Shi et al., 2021; Kim and Lavaei, 2024).Further, in many physical applications, noises are usually bounded, e.g. the wind disturbances inquadrotor systems are bounded, the renewable energy injections in power systems are also bounded,etc. The semi-continuity assumption may seem restrictive, since it rules out the discrete distributions.However, the disturbances in many realistic systems can satisfy the semi-continuity because realisticnoises are usually generated from a mixture distribution where at least one component is continuous,e.g. the wind disturbances and renewable generations are continuous. As for the control inputs ut, we first impose the same assumption as Assumption 2 for simplicity.Later in , we will also discuss the relaxation of this assumption to include control policies.Assumption 3 (Bounded i.i.d. and semi-continuous inputs). ut is i.i.d. following a semi-continuousdistribution with zero mean and a positive definite covariance u 2uInx 0 and bounded support,i.e. ut umax almost surely for all t. Lastly, we introduce our stability assumption based on the input-to-state stability definition below.Definition 2 (Locally input-to-state stability (LISS)). Consider the general nonlinear system xt+1 =f(xt, dt) with xt Rnx, dt Rnd, f being a continuous function such that f(0, 0) = 0. Thissystem is called locally input-to-state stable (LISS) if there exist constants x > 0, > 0 andfunctions K, KL such that for all x0 {x0 Rnx : x02 x} and any inputdt {d Rnd : supt dt } , it holds that xt2 x02, t+ supt dtfor allt 0.5",
  "Assumption 4 (LISS system). System (1) is LISS with parameters x and such that x x02and max(wmax, umax), respectively": "Assumption 4 is imposed, together with the bounded disturbances and inputs in Assumptions 2 and 3,to guarantee bounded states during the control dynamics (for instance, see the proof of Theorem 1inAppendix A). Notably, many studies on learning-based nonlinear control require certain boundednesson the states for theoretical analysis Sattar and Oymak (2022); Foster et al. (2020); Li et al. (2023a). In addition, it is interesting to note that this paper only requires local stability of the dynamics, whereasseveral learning-based nonlinear control papers assume certain global properties, such as globalexponential stability in (Foster et al., 2020), global exponential incremental stability in (Sattar andOymak, 2022; Li et al., 2023a; Lin et al., 2024), or global Lipschitz smoothness in (Lee et al., 2024).6This difference in the dynamics assumption reflects a trade-off with the disturbance assumptions:we assume a stronger assumption on the boundedness of disturbances and a weaker assumptionon local stability, whereas much of the literature considers (sub)Gaussian distributions (which canbe unbounded) but requires stronger global properties for dynamics. Since this paper is largelymotivated by physical systems, which typically encounter bounded disturbances/inputs and generallyonly satisfy local stability (Slotine and Li, 1991), we address this trade-off through our current set ofassumptions, leaving it as an exciting future direction to consider relaxing these assumptions. 5A function : R0 R0 is a K function if it is continuous, strictly increasing and (0) = 0. A function : R0 R0 R0 is a KL function if, for each fixed t 0, the function (, t) is a K function, and foreach fixed s 0, the function (s, ) is decreasing and (s, t) 0 as t .6Global Lipschitz smoothness may exclude system dynamics with higher-order polynomials.",
  "Main Results": "In this section, we provide the estimation error bounds of LSE for linearly parameterized nonlinearsystems under i.i.d. random inputs. The estimation error bounds rely on the establishment ofprobabilistic persistent excitation, which will be introduced in the first subsection. Later, we alsogeneralize the results to include control policies and discuss the convergence rate of another popularuncertainty quantification method in the control literature, set membership estimation, whose formaldefinition is deferred to the corresponding subsection.",
  "Probabilistic Persistent Excitation": "It is well-known that persistent excitation (PE) is a crucial condition for successful system identifi-cation (Narendra and Annaswamy, 1987). In the following, we introduce the persistent excitationcondition for our linearly parameterized nonlinear systems.Definition 3 (Persistent excitation (Skantze et al., 2000; Sastry and Bodson, 2011)). System (1) ispersistently excited if there exist s > 0 and m 1 such that for any t0 0, we have",
  "t=t0xt, utxt, ut s2In": "In the stochastic setting, PE is closely related with a block-martingale small-ball (BMSB) conditionproposed in Simchowitz et al. (2018), which can be viewed as a probabilistic version of PE.Definition 4 (BMSB (Simchowitz et al., 2018)). Let {Ft}t1 denote a filtration and let {yt}t1 bean {Ft}t1-adapted random process taking values in Rny. We say {yt}t1 satisfies the (k, sb, p)-block martingale small-ball (BMSB) condition for a positive integer k, a sb 0, and a p ,if for any fixed v Rny such that v2 = 1, the process {yt}t1 satisfies 1",
  "One major contribution of this paper is formally establishing the BMSB condition for linearlyparameterized nonlinear systems with real-analytic feature functions": "In the following, we first investigate the open-loop system with i.i.d. inputs and later extend theresults to the closed-loop systems with inputs ut = (xt) + t, where t represents the noise and : Rnx Rnu denotes a control policy. The following theorem considers the open-loop systems.Theorem 1 (BMSB for open-loop systems). Let ut = t and consider the filtration Ft =F(w0, , wt1, x0, , xt, 0, , t). Suppose Assumptions 1, 2, 3, 4 hold, then there ex-ist s > 0 and p (0, 1) such that the {Ft}t1-adapted processxt, ut",
  "t1 satisfies the1, s2In, p-BMSB condition": "Proof Sketch. Intuitively, BMSB requires that any linear combination of feature functions remainspositive with a non-vanishing probability. Notice that a linear combination of real-analytic functionsis itself real-analytic, and the zeros of an analytic function have measure zero. These facts allow us toshow that the probability of a linear combination of linearly independent feature functions equalingzero is less than one, as long as the noises follow semi-continuous distributions, by the connection ofthe Lebesgue measure and the probability measure in Definition 1. In more detail, the proof leverages a variant of the Paley-Zygmund argument (Petrov, 2007), whichprovides a lower bound for the tail properties of positive random variables. Specifically, it states thatthe probability of a positive random variable being small depends on the ratio of its even moments.We apply this result to the random variable |vT xt+1, ut+1| Ft| with v2 = 1 and aim to showthat the lower bound is non-trivial for any direction v with v2 = 1 and any filtration Ft, t 0. Wethen use results from measure theory to demonstrate the existence of such a non-trivial lower bound.This is done by showing that the Lebesgue measure of the set where |vT xt+1, ut+1| = 0 is zero,and thus the even moments of |vT xt+1, ut+1| Ft| are non-zero, provided that the noise anddisturbance distributions are semi-continuous. For further details, please refer to Appendix A.",
  "Non-asymptotic Bounds for LSE": "We are now prepared to present the non-asymptotic convergence rate for the LSE in learning theunknown parameters of the system (1).Theorem 2 (LSEs convergence rate for open-loop systems). Consider the dynamical system de-scribed in (1) with i.i.d. inputs ut = t and assume that Assumptions 1, 2, 3, 4 are satisfied. Let sand p be as defined in Theorem 1, and define b = supt0 E(zt)22. For a fixed (0, 1) andT 1, if T satisfies the condition",
  "T for linearly parameterized nonlinearsystems. This is consistent with the convergence rates of LSE for linear systems in terms of T": "Regarding the dimension dependence in the convergence rate, the explicit dependence is nx + n,where nx and n refer to the dimensions of the state and the feature vector, respectively. Besides, it isworth mentioning that other parameters, such as s, p,b, may implicitly depend on the dimensionsas well. For some special systems, such as bilinear systems, it has been shown that these constants areindependent of the dimensions (Sattar et al., 2022). It is left as future work to explore other nonlinearsystems implicit dimension dependence. Next, we can generalize the i.i.d. inputs ut to include control policies, i.e., ut = (xt) + t, wheret satisfies Assumption 3 and (xt) is analytic.Corollary 1 (LSEs convergence rate for closed-loop systems). Consider inputs ut = (xt) +t, where () is real-analytic, t satisfies Assumption 3, and the closed-loop system xt+1 =(xt, (xt) + t) + wt satisfies Assumption 4 for both wt and t. Then, the same convergencerate in Theorem 2 holds.",
  "Non-asymptotic Diameter Bounds for SME": "Set membership estimation (SME) is another popular method for uncertainty quantification in controlsystem estimation (Lu and Cannon, 2023; Bertsekas, 1971; Li et al., 2024). Unlike LSE, SME isa set-estimator and directly estimates the uncertainty set. Since the analysis of SME also relies onthe probabilistic persistent excitation analysis, we can also establish the convergence rate of SMEfor linearly parameterized nonlinear systems under i.i.d. noises in the following. In particular, SMEestimates the uncertainty set as",
  "The convergence of SME relies on an additional assumption as shown below: the tightness of thebound W on wts support. This tightness assumption is commonly considered in SMEs literature": "(Li et al., 2024; Lu et al., 2019; Akay, 2004). Further, (Li et al., 2024) discusses the relaxation ofthis assumption by learning a tight bound at the same time of learning the uncertainty set of forlinear systems. Similar tricks can be applied to nonlinear systems, but this paper only considers thevanilla case of SME for simplicity.Assumption 5 (Tight bound on disturbances). Assume for any > 0, there exists qw() > 0, suchthat for any 1 j n and t 0, we have P(wjt + wmax ) qw() > 0, P(wmax wjt ) qw() > 0. Assumption 5 requires that wt can visit set Ws boundary arbitrarily closely with a positive probability.For example, for a one-dimensional wt bounded by wmax wt wmax, Assumption 5 requiresthat there is a positive probability that wt is close to wmax and wmax, i.e., for any > 0, we haveP(wmax wt wmax) > 0 and P(wmax wt wmax + ) > 0. Next, we state a non-asymptotic bound on the diameter of the uncertainty set estimated by SME.Theorem 3 (SMEs diameter bound for open-loop systems). Consider system (1) with i.i.d. inputsut = t. Suppose Assumptions 1, 2, 3, 4 are satisfied. Consider s and p defined in Theorem 1 andlet b = supt0 (zt)2. For any m 0 and (0, 1), when T > m, we have",
  "The proof of Theorem 3 relies on Theorem 1 in this paper and Theorem 1 from (Li et al., 2024). Thedetailed proof is provided in Appendix C.1": "Theorem 3 establishes an upper bound on the \"failure\" probability of SME, i.e., the probability thatthe uncertainty sets diameter exceeds . To ensure the failure probability is less than 1, one can selectm = O(log(T)) and choose a sufficiently large T such that T m = O(log(T)). If wt is morelikely to visit the boundaries of the set W (meaning a larger q()), SME is less likely to estimate anuncertainty set with a diameter greater than . To provide more intuitions on the diameter bound in Theorem 3, we consider qw() = cw for somecw > 0. Note that several common distributions, including the uniform distribution and the truncatedGaussian distribution, satisfy this property on qw() (see Appendix C.2 for explicit formulas of cw).With qw() = cw, we can provide a convergence rate of SME in terms of T in the following.Corollary 2 (SMEs convergence rate when qw() = cw ). For any > 0, let",
  "The proof of Corollary 2 is provided in Appendix C.2": "Finally, similar to LSE, we can extend SMEs convergence rates from open-loop systems to closed-loop systems with real-analytic control policies, i.e., ut = (xt) + t, where t satisfies Assumption3 and (xt) is real-analytic.Corollary 3 (SMEs convergence rate for closed-loop systems). Consider inputs ut = (xt) +t, where () is real-analytic, t satisfies Assumption 3, and the closed-loop system xt+1 =(xt, (xt) + t) + wt satisfies Assumption 4 in terms of both wt and t. Then, the sameconvergence rates in Theorem 3 and Corollary 2 still hold.",
  "Numerical Experiments": "In this section, we evaluate the performance of LSE in estimating the unknown parameter andSME in estimating the uncertainty set for the unknown parameters using the pendulum and quadrotorexamples outlined in . We compare the empirical convergence rates of LSE and SME withthe theoretical rates in Theorem 2 and Corollary 2. In each case, the input ut is composed of acontrol policy and i.i.d. noise, such that ut = (xt) + t. For our experiments, we employ noiseand disturbances drawn from uniform and truncated-Gaussian distributions. To compute theoreticalrates, we numerically estimate parameters such as s and p (see Appendix E). Further details can befound in our source code.7",
  "ml2": "Quadrotor 2: For the quadrotor example in , the control input is defined asut = (xt) + t, where (xt) follows the controller proposed by Alaimo et al. (2013). Thequadrotor system involves 13 states and 4 inputs, with the unknown parameter matrix containing 7 parameters, including the mass m and specific elements of the inertia matrix I.",
  "Further details on controller gains and unknown parameters are provided in Appendix D": "LSE Results:Figures 1a and 1b present a comparison between the LSE theoretical bound fromTheorem 2 with its empirical estimation error of the unknown parameters versus trajectory lengthT for the pendulum example, with uniform and truncated-Gaussian noises and disturbances. Similarly,Figures 1c and 1d show this comparison for the quadrotor example. In each figure, both the theoreticalbound and empirical error are normalized by the l2 norm of the nominal parameter . The log-logplots for both scenarios demonstrate that the empirical error rate achieves O( 1",
  "(d) Truncated-Gaussian": ": Convergence rate of the SME for pendulum and quadrotor scenarios: (a) Pendulum example withuniform, (b) Pendulum example with truncated-Gaussian, (c) Quadrotor example with uniform, and (d) Quadrotorexample with truncated-Gaussian noises and disturbances. Here, uniform noises and disturbances are i.i.d.generated from uniform(), and truncated-Gaussian noises and disturbances are i.i.d. generated fromtruncated-Gaussian(0, 0.5, ). \"theo\" denotes the theoretical convergence rate, and \"empr\" representsthe empirical rate. The mean error across 10 trials is shown by dots on the empirical plots, with shaded areasillustrating empirical standard deviation.",
  "(a) Pendulum(b) Uncertainty set diameter(c) Uncertainty set": ": Performance of SME for pendulum in (a) with control input ut = k t + t where k = 0.1,t i.i.d. generated from truncated-Gaussian(0, 2, ) and disturbed with wt i.i.d. generated fromtruncated-Gaussian(0, 1, ). (b) Diameter of the uncertainty set estimated by SME. (c) Uncertaintyset depicted for T = 50, 200, 250, 400, 500.",
  "Concluding Remarks": "Conclusion. This study examines the probabilistic persistent excitation in a class of nonlinear systemsinfluenced by i.i.d. noise and stochastic disturbances, with the stipulation that their distributions donot concentrate on sets of Lebesgue measure zero. Based on this we then present an explicit boundon the convergence rate of SME estimations and LSE estimations for this class of dynamical systems.Additionally, numerical experiments in the context of robotics are provided to illustrate both methods. Limitations. One limitation of this work is that our analysis relies on a specific class of i.i.d. noisesand stochastic disturbances, where the probability distribution is not concentrated on sets of Lebesguemeasure zero. While this is a sufficient condition, it is possible that the BMSB conditions are satisfiedunder other circumstances. Another limitation is that, though we provide sufficient conditions for theexistence of parameters satisfying the BMSB condition, the explicit dependence is not detailed here.Lastly, imperfect observations are not considered here. Future Work. Our future work includes several promising directions, e.g., to explore cases that donot satisfy our semi-continuity assumption, such as discrete noises, and to investigate the explicitdependence of the BMSB parameter on system attributes, such as state, input, and feature dimensions,etc. Furthermore, extending this work to imperfect state observations is an important next step.Finally, a potential direction is to provide a non-asymptotic analysis of the volumes of uncertaintysets estimated by SME uncertainty sets, as opposed to the current focus on their diameters.",
  "Broader Impact": "This paper is a foundation research and develops theoretical insight to estimation of nonlinear controlsystems. We do not see a direct path to negative applications in general. But we want to mention thatsuccessful applications of our theoretical results rely on verifying the assumptions in this paper. Yasin Abbasi-Yadkori and Csaba Szepesvri. Regret bounds for the adaptive control of linearquadratic systems. In Proceedings of the 24th Annual Conference on Learning Theory, pages 126.JMLR Workshop and Conference Proceedings, 2011.",
  "Hseyin Akay. The size of the membership-set in a probabilistic framework. Automatica, 40(2):253260, 2004": "Andrea Alaimo, Valeria Artale, C Milazzo, Angela Ricciardello, and LUCA Trefiletti. Mathematicalmodeling and control of a hexacopter. In 2013 International conference on unmanned aircraftsystems (ICUAS), pages 10431050. IEEE, 2013. Er-Wei Bai, Roberto Tempo, and Hyonyong Cho. Membership set estimators: size, optimal inputs,complexity and relations with least squares.IEEE Transactions on Circuits and Systems I:Fundamental Theory and Applications, 42(5):266277, 1995.",
  "Jihun Kim and Javad Lavaei. Online bandit control with dynamic batch length and adaptive learningrate. 2024": "Jason Kong, Mark Pfeiffer, Georg Schildbach, and Francesco Borrelli. Kinematic and dynamic vehiclemodels for autonomous driving control design. In 2015 IEEE intelligent vehicles symposium (IV),pages 10941099. IEEE, 2015. Suhas Kowshik, Dheeraj Nagaraj, Prateek Jain, and Praneeth Netrapalli. Near-optimal offline andstreaming algorithms for learning non-linear dynamical systems. Advances in Neural InformationProcessing Systems, 34:85188531, 2021.",
  "Yingying Li, Subhro Das, and Na Li. Online optimal control with affine constraints. In Proceedingsof the AAAI Conference on Artificial Intelligence, volume 35, pages 85278537, 2021a": "Yingying Li, Yujie Tang, Runyu Zhang, and Na Li. Distributed reinforcement learning for decentral-ized linear quadratic control: A derivative-free policy optimization approach. IEEE Transactionson Automatic Control, 67(12):64296444, 2021b. Yingying Li, James A Preiss, Na Li, Yiheng Lin, Adam Wierman, and Jeff S Shamma. Onlineswitching control with stability and regret guarantees. In Learning for Dynamics and ControlConference, pages 11381151. PMLR, 2023a.",
  "Yingying Li, Tianpeng Zhang, Subhro Das, Jeff Shamma, and Na Li. Non-asymptotic systemidentification for linear systems with nonlinear policies. IFAC-PapersOnLine, 56(2):16721679,2023b": "Yingying Li, Jing Yu, Lauren Conger, Taylan Kargin, and Adam Wierman. Learning the uncertaintysets of linear control systems via set membership: A non-asymptotic analysis. In Proceedings ofthe 41st International Conference on Machine Learning, pages 2923429265. PMLR, 2024. URL Yiheng Lin, James A Preiss, Emile Anand, Yingying Li, Yisong Yue, and Adam Wierman. On-line adaptive policy selection in time-varying systems: No-regret via contractive perturbations.Advances in Neural Information Processing Systems, 36, 2024."
}