{
  "Abstract": "Pedestrian trajectory prediction is crucial for several applications such as roboticsand self-driving vehicles. Significant progress has been made in the past decadethanks to the availability of pedestrian trajectory datasets, which enable trajec-tory prediction methods to learn from pedestrians past movements and predictfuture trajectories. However, these datasets and methods typically assume thatthe observed trajectory sequence is complete, ignoring real-world issues such assensor failure, occlusion, and limited fields of view that can result in missingvalues in observed trajectories. To address this challenge, we present TrajImpute,a pedestrian trajectory prediction dataset that simulates missing coordinates inthe observed trajectory, enhancing real-world applicability. TrajImpute maintainsa uniform distribution of missing data within the observed trajectories. In thiswork, we comprehensively examine several imputation methods to reconstructthe missing coordinates and benchmark them for imputing pedestrian trajecto-ries. Furthermore, we provide a thorough analysis of recent trajectory predictionmethods and evaluate the performance of these models on the imputed trajec-tories. Our experimental evaluation of the imputation and trajectory predictionmethods offers several valuable insights. Our dataset provides a foundationalresource for future research on imputation-aware pedestrian trajectory prediction,potentially accelerating the deployment of these methods in real-world applica-tions. Publicly accessible links to the datasets and code files are available at",
  "Introduction": "Pedestrian trajectory prediction has various essential applications, such as self-driving automobiles, robot navigation, human behavior understanding, and more. These systemsforecast the future trajectory of pedestrians based on their previously observed paths. Research inpedestrian trajectory prediction has significantly advanced in recent times due to the developmentof data-driven solutions and datasets. However, a predominant assumption in most current researchis that the past observed coordinates of pedestrians are complete. This assumption does not holdin real-world scenarios where sensor failures, limited field of view, and occlusion can lead tomissing observations at any specific time instances, resulting in incomplete trajectories. This createschallenges for trajectory prediction tasks in real-world scenarios. To improve the effectivenessof trajectory prediction methods in real-world scenarios, they must anticipate and handle missingobserved coordinates.",
  "arXiv:2411.00174v1 [cs.CV] 31 Oct 2024": "15, 16] utilize statistical and deep learning approaches and have achieved state-of-the-art results forimputation time series data. However, there has been limited exploration of imputation techniques intrajectory prediction , and there is a gap in the availability of imputation-centric pedestriandatasets, evaluation protocols, and benchmarks. We introduce TrajImpute, an imputation-centrictrajectory prediction dataset, to address this. We have compiled commonly used pedestrian trajectoryprediction datasets , including ETH, HOTEL, UNIV, ZARA1, and ZARA2, (which arelicensed for research purposes 1) and introduced trajectories with missing observed coordinates. Wefollow two data generation strategies to simulate the missing coordinates: easy and hard modes. In theeasy mode, we simulate scenarios where observed coordinates are missed for a shorter duration (couldbe continuous or discontinuous time frame). In contrast, the hard mode simulates scenarios whereobserved coordinates are missing for a longer duration. In addition to data generation, we benchmarkseveral existing imputation methods on TrajImpute. We use these imputationmethods to reconstruct the missing coordinates and evaluate their performance in both easy and hardmodes. After extensive evaluation, we selected the best-performing imputation model and used itsimputed data for the trajectory prediction task. The motivation of our work is to provide insightsinto how trajectory prediction models perform when missing coordinates are imputed. Additionally,we aim to understand how imputation methods perform on the pedestrian trajectory imputation task.Thus, TrajImpute provides a dataset in which missing coordinates are present in observed trajectoriesto simulate real-world scenarios and offers a unified framework for evaluating both imputation andtrajectory prediction methods. Contributions. We introduce TrajImpute, a trajectory prediction dataset designed to simulate missingcoordinates in observed trajectories of pedestrians. TrajImpute bridges the gap between real-worldscenarios and the rigid assumption that all coordinates are present in observed trajectories. Weconduct extensive analyses and empirical studies to evaluate several existing imputation methods forthe task of trajectory imputation on our TrajImpute dataset. Furthermore, we evaluate the performanceof recent trajectory prediction methods on imputed data and provide insights for future developmentin this area. The dataset is provided under a Creative Commons CC BY-SA 4.0 license, allowingboth academics and industry to use it.",
  "Imputation": "RNN-based methods have initially been used for handling missing data in time series classification.Methods such as M-RNN use the bidirectional RNNs hidden states for imputing missingvalues. BRITS treats missing values as variables and considers feature correlations. Generativeadversarial network approaches have also been applied. For instance, Luo et al. propose GRUfor imputation to capture temporal information in incomplete time series, serving as the basis for boththe discriminator and generator in their GAN model. Additionally, Luo et al. introduce E2GAN,utilizing an auto-encoder to enhance imputation performance. Liu et al. propose NAOMI , anon-autoregressive model featuring a multiresolution decoder and bidirectional encoder, which wasadversarially trained. Fortuin et al. introduce GP-VAE, a variational auto-encoder method fortime series imputation. It uses the Gaussian process (GP) prior in the latent space to represent the data.Furthermore, L-VAE employs an additive multi-output GP-prior to accommodate additionalcovariate information alongside time for the imputation task. SGP-VAE uses GP approximationsto impute the missing values in spatiotemporal data. CNN-based methods such as TimesNet use the fast Fourier transform to transform 1D time series into a 2D representation, making it easierto interpret data using CNNs. Recently, methods have started using the self-attention mechanismfor data imputation. For instance, CDSA uses cross-dimension attention for the imputation ofmissing data. DeepMVI employs the transformer with convolutional window features and kernelregression. SAITS uses joint training for both the imputation and reconstruction tasks to imputethe missing values. SAITE employs two diagonally-masked self-attention mechanisms to capturethe temporal dependency. However, self-attention-based studies for time-series imputation are stilllimited.",
  "See the statement at the top of and in the Crowds Data\" card of": ": Comparison of different datasets for pedestrian trajectory prediction. The trajectory coordi-nates can be extracted from images (image-2D/3D) or directly from data containing only coordinates(world-2D/3D). Here, 2D/3D refers to the dimensionality of the coordinate output. The most widelyused pedestrian trajectory prediction datasets are ETH, HOTEL, UNIV, ZARA1, and ZARA2. Thesereported datasets only contain complete coordinates and do not simulate missing coordinates.",
  "Trajectory Prediction": "We use the imputed data obtained from the best-performing imputation model on each subset ofTrajImpute to perform the trajectory prediction task. We evaluate the performance of the trajectoryprediction model using the Average Displacement Error (ADE) and Final Displacement Error (FDE)metrics. The ADE calculates the average Euclidean distance between the predicted trajectory and the : Training Time (TT) and Test Inference Time (TIT) of various imputation methods on theETH-M dataset. The training time is reported per epoch in minutes, and the inference time is reportedin seconds.TransformerUS-GANBRITSM-RNNTimesNetSAITS",
  "Datasets for Pedestrian Trajectory Prediction": "With the advancement of pedestrian trajectory prediction research, various datasets have emerged(ref. ). The most popular pedestrian datasets are ETH and UCY , encompassingdiverse behaviors such as social interaction, walking, and grouping. These datasets model pedestrianinteractions across various scenarios. ETH and HOTEL datasets collectively contain 750 pedestriantrajectories, while UNIV, ZARA1, and ZARA2 datasets encompass 786 pedestrian trajectories, allin 2D coordinates. Another widely-used dataset is SDD , which includes pedestrians, bikers,skaters, carts, cars, and buses, totaling 10,300 trajectories. TrajNet is a synthetic dataset thatcombines elements from the above datasets to create an interaction-centric trajectory-based dataset.The PETS dataset consists of multi-sensor sequences depicting complex crowd scenarios, withcoordinates extracted from 7 fps video images. The Grand Central Station dataset captures crowdtrajectories from scenes lasting 33.20 minutes at 25 frames per second, with coordinate trajectorydata derived from scene images. Waymo , KITTI , and Argoverse are primarily utilizedin autonomous driving research, as they involve interactions between heterogeneous agents (e.g.,vehicles and pedestrians) in urban environments. The inD dataset, captured by drones, includes8,200 vehicles and 5,300 vulnerable road users from four locations, featuring classes such as cars,trucks, bicyclists, and pedestrians. The Ko-PER dataset, recorded using laser scanners andvideos, features trajectories of people and vehicles at urban intersections. TRAF is a dense andheterogeneous traffic video dataset with cars, bikes, pedestrians, rickshaws, and other road agents.There are several datasets for pedestrian trajectory prediction, as discussed above, but all of themassume that all coordinates are present in the observed trajectories. Our TrajImpute dataset, however,includes missing coordinates in observed trajectories to simulate real-world scenarios and offers aunified framework for evaluating both imputation and trajectory prediction methods.",
  "TrajImpute Dataset": "Problem Formulation. For the data generation, we consider the following trajectory predic-tion formulation where we represent the past observed trajectory with time stamp Tob as xp ={(xtp, ytp) | t [1, . . . , Tob]}, where (xtp, ytp) is the coordinates of the pth pedestrian. There couldbe N number of pedestrians where p N. So the original past observed trajectories data con-tain Xorg = [x1, x2, x3 . . . xN] trajectories where each xp Xorg. We follow the standard eightobserved time frame of 3.2 seconds time length and twelve prediction time frame of 4.8 seconds. Data Generation. To simulate real-time scenarios with missing coordinates in past trajectories, weintroduce missing coordinates into the original observed trajectories of the ETH, HOTEL, UNIV,ZARA1, and ZARA2 datasets. Due to uncertainty, the missing values can be randomly generatedfrom any given timeframe. To incorporate this uncertainty, we randomly induce missing values inpast trajectories. Moreover, the temporal missing pattern contains several variations; for instance,there could be scenarios where consecutive coordinates are missing from the observations, alternatecoordinates could be missing, or other possibilities. We ensure that our data generation covers thesekinds of patterns. We follow two protocols for generating missing coordinates: an easy protocol,where we induce missing coordinates in at most half of the total observed time frames, and a hardprotocol, where we induce missing coordinates in more than half of the time frames. Easy Protocol. In the easy protocol, from the total observations spanning 8 time frames, at most halfof the frames may contain missing observations; i.e., there are missing values in at most 4 of the timeframes. Thus, the number of missing coordinates could range from 0 to 4. The pedestrians observedtrajectory may contain 0, 1, 2, 3, or 4 missing coordinates. For each trajectory x, we introducemissing values as follows: (1) First, we uniformly randomly select the number of missing values,m {0, 1, 2, 3, 4}. (2) We then randomly choose m unique indices from the set of past observedtime frames {1, 2, . . . , Tob} with uniform probability. Lets denote these indices as {i1, i2, . . . , im}.(3) We set the coordinates of x at the selected indices to NaN as shown in Equation 1.",
  "(f) Hard Val Missing Values": ": Illustration of the total missing coordinates in the easy and hard protocols for the ETH-M,HOTEL-M, UNIV-M, ZARA1-M, and ZARA2-M subsets of TrajImpute. M refers to missing,indicating that the subset contains missing observed coordinates. The hard protocol creates moremissing values compared to the easy protocol. Hard Protocol. There could be scenarios where the trajectory prediction model is unable to acquiremost of the observations. In such cases, the question of how the prediction is influenced becomes ofinterest to many. To simulate these scenarios, we choose to miss the majority of observed coordinatesin the observed trajectories. Out of the total 8 observed coordinates, we generate trajectories with aminimum of 4 and a maximum of 7 missing coordinates. We induce 4, 5, 6, or 7 missing coordinates,thus m {4, 5, 6, 7}. For simulating the hard protocol, we follow the same strategy as shown in theeasy protocol but increase the number of missing coordinates (m).",
  "Data Analysis": "Training and Test Data. Our aim is to simulate real-world scenarios while generating the TrajImputedataset. In the training data, we maintain the original total number of trajectories as in the predefinedtraining split of the ETH, HOTEL, UNIV, ZARA1, and ZARA2 datasets for both the easy and hardprotocols. For instance, in the easy protocol, we generate training data by randomly dropping 0, 1, 2, Obs_trajectory 1 Pred_trajectory 1 Obs_trajectory 2 Obs_trajectory 3 Obs_trajectory NPred_trajectory N Pred_trajectory 2 Pred_trajectory 3 : Illustration of an example (right) showing the missing pattern in the trajectory sequence ofthe ETH-M subset under the easy protocol. TrajImpute ensures that coordinates are equally likelyto be dropped from the trajectory sequence, ensuring that any time frame can result in missingobservations in the past trajectory. Furthermore, the structure of the TrajImpute dataset contains adictionary structure with eight keys (left). Here, N is the number of trajectory sequences. 3, or 4 coordinates from each trajectory to create missing values. However, we increase the testingdata to ensure fairness and consistency in testing. For instance, in the easy protocol, we generate testdata as follows: first, we create |m| = 5 copies of each trajectory. The first copy contains no missingcoordinates. In the second copy, we randomly drop 1 coordinate. In the third copy, we randomly drop2 coordinates. In the same way, in the fifth copy, we randomly drop 4 coordinates. We repeat thisprocess for all trajectories in the test data. Finally, we merge all these trajectories to obtain a test splitfor the imputation and trajectory prediction tasks. Data Statistics. The total number of trajectories in the training, test, and validation splits in eachsubset of the TrajImpute dataset is shown in . displays the total number of missing valuesin each subset of TrajImpute for both the easy and hard protocols. The hard protocol results in moremissing values, whereas the easy protocol contains relatively fewer missing values. In TrajImpute,we ensure that the trajectory sequences capture the majority of the possible patterns/permutationsof missing coordinates that could occur in the observed sequence. By sampling the missing indicesfrom a random uniform distribution, each coordinate is equally likely to be missing, as shown in (right). Structure of Data. The TrajImpute dataset is built on top of the popular ETH, HOTEL, UNIV,ZARA1, and ZARA2 datasets, which collectively contain 1,536 human trajectories exhibiting diversebehaviors such as walking, crossing, grouping, and following. ETH and HOTEL include 750pedestrians, while UNIV, ZARA1, and ZARA2 include 786 pedestrians. Following prior pedestriantrajectory prediction works , we use the same settings. The dataset structure follows thesame format as previous works to ensure compatibility with existing pedestrian trajectory predictionmethods. The observed trajectory length is 3.2 seconds, divided into 8 frames, and the predictedtrajectory length is 4.8 seconds, corresponding to 12 frames. Missing observations can occur in theobserved trajectory, so our missing values (NaNs) are only in the past observed trajectory with 8 timeframes. The structure of the TrajImpute dataset follows a dictionary format ( (left)) with specifickeys, maintaining consistency across the training, testing, and validation splits. For instance, indata_train, there are 8 keys, each serving different purposes for the trajectory prediction task. Theobs_traj key contains (values) the observed trajectories of the pedestrians, where each trajectory isa sequence of (x, y) coordinates representing the pedestrians position. We simulate missing/NaNvalues in the observed trajectories. The pred_traj key contains the predicted trajectories or groundtruth trajectories, which do not contain missing values. The obs_traj_rel and pred_traj_relkeys represent the relative trajectories calculated by the finite difference/displacement from theprevious to the current position in observed trajectory and predicted trajectories. The missing_maskkey indicates where the missing values (NaNs) are present in the observed trajectory sequence. : Results obtained for various imputation methods on the ETH-M, HOTEL-M, UNIV-M,ZARA1-M, and ZARA2-M subsets of TrajImpute with the easy protocol (0 missing 4) and thehard protocol (4 missing 7). The reported results show that SITES performs relatively betterwhen imputing missing values. M refers to missing, indicating that the subset contains missingobserved coordinates.",
  "Experiments and Benchmarking": "In this section, we provide benchmarking of trajectory imputation and trajectory prediction methods.TrajImpute contains missing values in the observed trajectory sequences, and we experiment withseveral imputation models to fill in these missing values. We adopt various imputation methods (Sec.5.1) for the task of trajectory imputation, i.e., filling in the missing coordinates. We then use the : Results obtained for various trajectory prediction methods on the imputed subsets ofTrajImpute. We report the ADE/FDE for the trajectory prediction task on the clean, soft imputed,and hard imputed protocols. Clean refers to a subset with no missing coordinates. Performancedegradation occurs when trajectory prediction is performed on the hard imputed subsets.",
  "Trajectory Imputataion": "The performance of imputation methods is evaluated using four metrics: Mean Absolute Error (MAE),Root Mean Square Error (RMSE), Mean Square Error (MSE), and Mean Relative Error (MRE).It is important to note that only the values indicated by mask in the inputs are used to calculatethe imputation errors. For instance, calc_mae(prediction, target, mask) calculates the imputationerror using the MAE metric. Here, prediction is the imputed trajectory, the target is the originaltrajectory, and the mask is the indicating mask, which indicates the imputed indices {i1, i2, . . . , im}.More details on evaluation metrics are given in the appendix. Performance of Imputation Models. We evaluate six imputation baselines for the task of trajectoryimputation on the TrajImpute dataset. These baselines include SAITS , US-GAN , Trans-former , TimesNet , BRITS , and M-RNN . The results are reported in . Weevaluate the imputation methods on both easy and hard protocols separately. On the ETH-M subsetof the dataset, SAITS performs better than other methods. On HOTEL-M, SAITS achieves betterimputation results on both the easy and hard protocols. On UNIV-M, SAITS performs much better onboth protocols. On ZARA1-M, SAITS performs better on the easy protocol, while TimesNet performsbetter on the hard protocol. On ZARA2-M, SAITS outperforms the other imputation methods. Inconclusion, SAITS performs relatively better than the other imputation methods, indicating thatSAITS is able to reconstruct the missing coordinates with minimum errors most of the time amongall compared methods for pedestrian trajectory.",
  "ground truth trajectory for each time frame, while the FDE calculates the Euclidean distance at thefinal time frame. More details are provided in the appendix": "Performance of Prediction Models. We evaluate recent trajectory prediction models on the imputedtrajectory data, including GraphTern , SGCN-ET , EQMotion , TUTR , LBEBM-ET, and GPGraph . The results are reported in . It is evident from the results thatthe trajectory prediction performance of all models tends to decrease with the Hard-impute setting.EQMotion has shown a comparatively smaller decline in performance when predictions are made onthe hard imputed data. Training time and inference time of the imputation and trajectory predictionmodels are reported in Tables 4 and 5.",
  "Qualitative Results": "We visualize the trajectory predictions using the GraphTern model under four different settings: clean(no missing values), missing, Easy-Impute, and Hard-Impute (imputed using the SAITS method). b demonstrates that the poorest prediction results occur with missing observations. The predictionresults in d improve compared to b when using hard-imputed observations. Additionally,the prediction results in c show a significant improvement over b when using soft-imputedobservations, although they remain below the prediction results in a (clean observations nomissing values).",
  "Discussion": "From our comprehensive evaluation, we draw the following key insights: most of the imputationmethods do not perform well on the task of imputing missing coordinates for pedestrian trajectories,except for SAITS. However, the performance of SAITS also starts degrading as the number of missingvalues increases (Hard vs. Easy). This indicates a need for imputation methods specifically tailoredfor pedestrian trajectory imputation. Furthermore, most of the trajectory prediction models do notperform well even in the Easy-impute setting, and all perform very poorly in the Hard-impute setting.Therefore, existing trajectory prediction models are unable to handle imputed data effectively. Thisindicates a need for developing trajectory prediction models specifically tailored either to directlyhandle missing coordinates present in observed trajectories or to perform better with imputed data.Thus, our TrajImpute dataset will foster future research in the trajectory prediction area. Broader Impact. Our paper aims to bridge the gap between real-world scenarios and the rigidassumption that all coordinates are present in observed trajectories. By focusing on the challengeof anticipating and handling missing observed coordinates, we aim to enhance the effectivenessof trajectory prediction methods in real-world applications such as self-driving automobiles, robotnavigation, human behaviour understanding, and more. A breakdown of the broader impact acrossdifferent domains is given below: 1. For autonomous vehicles, trajectory prediction is essential for anticipating the movements ofpedestrians and obstacles. Missing data due to sensor occlusions or failures can compromise thevehicles ability to make safe decisions. Robust trajectory prediction under missing observationsenhances safety by ensuring the vehicle can operate safely. 2. In dynamic environments, robots must predict the movements of humans, other robots, and objectsto navigate safely. Missing data could lead to collisions or inefficient paths. Effective trajectoryprediction under these circumstances ensures that robots can avoid obstacles and navigate moreeffectively. 3. In applications like crowd monitoring or event management, predicting the trajectory of peopleis vital. Missing data due to occlusions, sensor limitations, or other factors can lead to inaccuratepredictions. Robust trajectory prediction can help manage large crowds more effectively, ensuringsafety and efficiency. Limitation. Future work can expand our work by incorporating new datasets, as mentioned in , and simulating the missing coordinates in these datasets, too. Imputation and trajectory predictionon these new datasets will provide additional insights to better access the performance of existingtrajectory prediction methods.",
  "Conclusion and Future Work": "This paper introduces a trajectory prediction dataset with missing values in the observed coordinates.We conduct a comprehensive examination of several imputation methods to reconstruct these missingcoordinates and benchmark their effectiveness for imputing pedestrian trajectories. Additionally, weanalyze recent trajectory prediction methods and assess their performance on the imputed trajectories.Our experimental evaluation of both imputation and trajectory prediction methods yields severalvaluable insights. We empirically demonstrate the necessity of imputation methods specificallydesigned for pedestrian trajectory imputation. Moreover, our findings reveal that most trajectoryprediction models perform poorly with imputed data, highlighting the need for developing modelsspecifically tailored to handle missing coordinates for real-world applications. Liushuai Shi, Le Wang, Chengjiang Long, Sanping Zhou, Mo Zhou, Zhenxing Niu, andGang Hua. Sgcn: Sparse graph convolution network for pedestrian trajectory prediction. InProceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages89949003, 2021. Chenxin Xu, Maosen Li, Zhenyang Ni, Ya Zhang, and Siheng Chen. Groupnet: Multiscalehypergraph neural networks for trajectory prediction with relational reasoning. In Proceedingsof the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR), pages64986507, June 2022. Mingkun Wang, Xinge Zhu, Changqian Yu, Wei Li, Yuexin Ma, Ruochun Jin, Xiaoguang Ren,Dongchun Ren, Mingxu Wang, and Wenjing Yang. Ganet: Goal area network for motionforecasting. In 2023 IEEE International Conference on Robotics and Automation (ICRA), pages16091615. IEEE, 2023. Karttikeya Mangalam, Yang An, Harshayu Girase, and Jitendra Malik. From goals, waypoints &paths to long term human trajectory forecasting. In Proceedings of the IEEE/CVF InternationalConference on Computer Vision, pages 1523315242, 2021. Luigi Filippo Chiara, Pasquale Coscia, Sourav Das, Simone Calderara, Rita Cucchiara, andLamberto Ballan. Goal-driven self-attentive recurrent networks for trajectory prediction. InProceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages25182527, 2022.",
  "Pranav Singh Chib and Pravendra Singh. Recent advancements in end-to-end autonomousdriving using deep learning: A survey. IEEE Transactions on Intelligent Vehicles, 9(1):103118,2024": "Yi Xu, Armin Bazarjani, Hyung-gun Chi, Chiho Choi, and Yun Fu. Uncovering the missingpattern: Unified framework towards trajectory imputation and prediction. In Proceedings of theIEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 96329643, 2023. Jinsung Yoon, William R. Zame, and Mihaela van der Schaar. Estimating missing data intemporal data streams using multi-directional recurrent neural networks. IEEE Transactions onBiomedical Engineering, 66(5):14771490, 2019. Yukai Liu, Rose Yu, Stephan Zheng, Eric Zhan, and Yisong Yue. NAOMI: Non-autoregressivemultiresolution sequence imputation. In Advances in Neural Information Processing Systems,volume 32. Curran Associates, Inc., 2019. Siddharth Ramchandran, Gleb Tikhonov, Kalle Kujanp, Miika Koskinen, and HarriLhdesmki. Longitudinal variational autoencoder. In Arindam Banerjee and Kenji Fukumizu,editors, Proceedings of The 24th International Conference on Artificial Intelligence and Statis-tics, volume 130 of Proceedings of Machine Learning Research, pages 38983906. PMLR,1315 Apr 2021.",
  "Parikshit Bansal, Prathamesh Deshpande, and Sunita Sarawagi. Missing value imputation onmultidimensional time series. ArXiv, abs/2103.01600, 2021": "Haixu Wu, Tengge Hu, Yong Liu, Hang Zhou, Jianmin Wang, and Mingsheng Long. Timesnet:Temporal 2d-variation modeling for general time series analysis. In The eleventh internationalconference on learning representations, 2022. Mengshi Qi, Jie Qin, Yu Wu, and Yi Yang. Imitative non-autoregressive modeling for trajectoryforecasting and imputation. In Proceedings of the IEEE/CVF Conference on Computer Visionand Pattern Recognition, pages 1273612745, 2020. Pranav Singh Chib, Achintya Nath, Paritosh Kabra, Ishu Gupta, and Pravendra Singh. Ms-tip:Imputation aware pedestrian trajectory prediction. In International Conference on MachineLearning, pages 83898402. PMLR, 2024.",
  "Alon Lerner, Yiorgos Chrysanthou, and Dani Lischinski. Crowds by example. In Computergraphics forum, volume 26, pages 655664. Wiley Online Library, 2007": "Stefano Pellegrini, Andreas Ess, Konrad Schindler, and Luc Van Gool. Youll never walk alone:Modeling social behavior for multi-target tracking. In 2009 IEEE 12th international conferenceon computer vision, pages 261268. IEEE, 2009. Vincent Fortuin, Dmitry Baranchuk, Gunnar Raetsch, and Stephan Mandt. GP-VAE: Deepprobabilistic time series imputation. In Proceedings of the Twenty Third International Confer-ence on Artificial Intelligence and Statistics, volume 108 of Proceedings of Machine LearningResearch, pages 16511661. PMLR, 2628 Aug 2020.",
  "Wei Cao, Dong Wang, Jian Li, Hao Zhou, Lei Li, and Yitan Li. Brits: Bidirectional recurrentimputation for time series. Advances in neural information processing systems, 31, 2018": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez,ukasz Kaiser, and Illia Polosukhin. Attention is all you need. Advances in neural informationprocessing systems, 30, 2017. Yonghong Luo, Xiangrui Cai, Ying ZHANG, Jun Xu, and Yuan xiaojie. Multivariate timeseries imputation with generative adversarial networks. In S. Bengio, H. Wallach, H. Larochelle,K. Grauman, N. Cesa-Bianchi, and R. Garnett, editors, Advances in Neural Information Pro-cessing Systems, volume 31. Curran Associates, Inc., 2018.",
  "Dirk Helbing and Peter Molnar. Social force model for pedestrian dynamics. Physical review E,51(5):4282, 1995": "Alexandre Alahi, Kratarth Goel, Vignesh Ramanathan, Alexandre Robicquet, Li Fei-Fei, andSilvio Savarese. Social lstm: Human trajectory prediction in crowded spaces. In Proceedings ofthe IEEE conference on computer vision and pattern recognition, pages 961971, 2016. Yingfan Huang, Huikun Bi, Zhaoxin Li, Tianlu Mao, and Zhaoqi Wang. Stgat: Modelingspatial-temporal interactions for human trajectory prediction. In Proceedings of the IEEE/CVFinternational conference on computer vision, pages 62726281, 2019.",
  "Sepp Hochreiter and Jrgen Schmidhuber. Long short-term memory. Neural computation,9(8):17351780, 1997": "Mihee Lee, Samuel S Sohn, Seonghyeon Moon, Sejong Yoon, Mubbasir Kapadia, and VladimirPavlovic. Muse-vae: multi-scale vae for environment-aware long term trajectory prediction. InProceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages22212230, 2022. Chenxin Xu, Yuxi Wei, Bohan Tang, Sheng Yin, Ya Zhang, and Siheng Chen. Dynamic-group-aware networks for multi-agent trajectory prediction with relational reasoning. arXiv preprintarXiv:2206.13114, 2022. Karttikeya Mangalam, Harshayu Girase, Shreyas Agarwal, Kuan-Hui Lee, Ehsan Adeli, JitendraMalik, and Adrien Gaidon. It is not the journey but the destination: Endpoint conditionedtrajectory prediction. In Computer VisionECCV 2020: 16th European Conference, Glasgow,UK, August 2328, 2020, Proceedings, Part II 16, pages 759776. Springer, 2020. Amir Sadeghian, Vineet Kosaraju, Ali Sadeghian, Noriaki Hirose, Hamid Rezatofighi, andSilvio Savarese. Sophie: An attentive gan for predicting paths compliant to social and physicalconstraints. In Proceedings of the IEEE/CVF conference on computer vision and patternrecognition, pages 13491358, 2019. Yue Hu, Siheng Chen, Ya Zhang, and Xiao Gu. Collaborative motion prediction via neuralmotion message passing. In Proceedings of the IEEE/CVF conference on computer vision andpattern recognition, pages 63196328, 2020. Agrim Gupta, Justin Johnson, Li Fei-Fei, Silvio Savarese, and Alexandre Alahi. Social gan:Socially acceptable trajectories with generative adversarial networks. In Proceedings of theIEEE conference on computer vision and pattern recognition, pages 22552264, 2018. Vineet Kosaraju, Amir Sadeghian, Roberto Martn-Martn, Ian Reid, Hamid Rezatofighi, andSilvio Savarese. Social-bigat: Multimodal trajectory forecasting using bicycle-gan and graphattention networks. Advances in Neural Information Processing Systems, 32, 2019. Weibo Mao, Chenxin Xu, Qi Zhu, Siheng Chen, and Yanfeng Wang. Leapfrog diffusion modelfor stochastic trajectory prediction. In Proceedings of the IEEE/CVF Conference on ComputerVision and Pattern Recognition, pages 55175526, 2023. Roger Girgis, Florian Golemo, Felipe Codevilla, Martin Weiss, Jim Aldon DSouza,Samira Ebrahimi Kahou, Felix Heide, and Christopher Pal. Latent variable sequential settransformers for joint multi-agent motion prediction. In International Conference on LearningRepresentations, 2022. Ye Yuan, Xinshuo Weng, Yanglan Ou, and Kris M Kitani. Agentformer: Agent-aware transform-ers for socio-temporal multi-agent forecasting. In Proceedings of the IEEE/CVF InternationalConference on Computer Vision, pages 98139823, 2021. Zikang Zhou, Jianping Wang, Yung-Hui Li, and Yu-Kai Huang. Query-centric trajectoryprediction. In Proceedings of the IEEE/CVF Conference on Computer Vision and PatternRecognition, pages 1786317873, 2023. Cunjun Yu, Xiao Ma, Jiawei Ren, Haiyu Zhao, and Shuai Yi. Spatio-temporal graph transformernetworks for pedestrian trajectory prediction. In Computer VisionECCV 2020: 16th EuropeanConference, Glasgow, UK, August 2328, 2020, Proceedings, Part XII 16, pages 507523.Springer, 2020.",
  "Pranav Singh Chib and Pravendra Singh. Ccf: Cross correcting framework for pedestriantrajectory prediction. arXiv preprint arXiv:2406.00749, 2024": "Pei Lv, Wentong Wang, Yunxin Wang, Yuzhen Zhang, Mingliang Xu, and Changsheng Xu.Ssagcn: social soft attention graph convolution network for pedestrian trajectory prediction.IEEE transactions on neural networks and learning systems, 2023. Jasmine Sekhon and Cody Fleming. Scan: A spatial context attentive network for joint multi-agent intent prediction. In Proceedings of the AAAI Conference on Artificial Intelligence,volume 35, pages 61196127, 2021. Thomas Kipf, Ethan Fetaya, Kuan-Chieh Wang, Max Welling, and Richard Zemel. Neuralrelational inference for interacting systems. In Jennifer Dy and Andreas Krause, editors, Pro-ceedings of the 35th International Conference on Machine Learning, volume 80 of Proceedingsof Machine Learning Research, pages 26882697. PMLR, 1015 Jul 2018.",
  "Pranav Singh Chib and Pravendra Singh. Improving trajectory prediction in dynamic multi-agentenvironment by dropping waypoints. Knowledge-Based Systems, 300:112240, 2024": "Pranav Singh Chib and Pravendra Singh.Enhancing trajectory prediction through self-supervised waypoint distortion prediction. In International Conference on Machine Learning,pages 84038416. PMLR, 2024. Alessio Monti, Angelo Porrello, Simone Calderara, Pasquale Coscia, Lamberto Ballan, andRita Cucchiara. How many observations are enough? knowledge distillation for trajectoryforecasting. In 2022 IEEE/CVF Conference on Computer Vision and Pattern Recognition(CVPR), pages 65436552, 2022.",
  "James Ferryman and Ali Shahrokni. Pets2009: Dataset and challenge. In 2009 Twelfth IEEEinternational workshop on performance evaluation of tracking and surveillance, pages 16.IEEE, 2009": "Julian Bock, Robert Krajewski, Tobias Moers, Steffen Runde, Lennart Vater, and Lutz Eckstein.The ind dataset: A drone dataset of naturalistic road user trajectories at german intersections. In2020 IEEE Intelligent Vehicles Symposium (IV), pages 19291934. IEEE, 2020. Benjamin Wilson, William Qi, Tanmay Agarwal, John Lambert, Jagjeet Singh, SiddheshKhandelwal, Bowen Pan, Ratnesh Kumar, Andrew Hartnett, Jhony Kaesemodel Pontes, DevaRamanan, Peter Carr, and James Hays. Argoverse 2: Next generation datasets for self-drivingperception and forecasting. In Proceedings of the Neural Information Processing Systems Trackon Datasets and Benchmarks (NeurIPS Datasets and Benchmarks 2021), 2021.",
  "Andreas Geiger, Philip Lenz, and Raquel Urtasun. Are we ready for autonomous driving?the kitti vision benchmark suite. In Conference on Computer Vision and Pattern Recognition(CVPR), 2012": "Elias Strigel, Daniel Meissner, Florian Seeliger, Benjamin Wilking, and Klaus Dietmayer. Theko-per intersection laserscanner and video dataset. In 17th International IEEE Conference onIntelligent Transportation Systems (ITSC), pages 19001901. IEEE, 2014. Rohan Chandra, Uttaran Bhattacharya, Aniket Bera, and Dinesh Manocha. Traphic: Trajectoryprediction in dense and heterogeneous traffic using weighted interactions. In Proceedings of theIEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 84838492, 2019. Nick Webb, Dan Smith, Christopher Ludwick, Trent Victor, Qi Hommes, Francesca Favaro,George Ivanov, and Tom Daniel. Waymos safety methodologies and safety readiness determi-nations. arXiv preprint arXiv:2011.00054, 2020. Inhwan Bae, Jean Oh, and Hae-Gon Jeon. Eigentrajectory: Low-rank descriptors for multi-modal trajectory forecasting. In Proceedings of the IEEE/CVF International Conference onComputer Vision, pages 1001710029, 2023. Xiaoye Miao, Yangyang Wu, Jun Wang, Yunjun Gao, Xudong Mao, and Jianwei Yin. Generativesemi-supervised learning for multivariate time series imputation. In Proceedings of the AAAIconference on artificial intelligence, volume 35, pages 89838991, 2021. Chenxin Xu, Robby T Tan, Yuhong Tan, Siheng Chen, Yu Guang Wang, Xinchao Wang, andYanfeng Wang. Eqmotion: Equivariant multi-agent motion prediction with invariant interactionreasoning. In Proceedings of the IEEE/CVF Conference on Computer Vision and PatternRecognition, pages 14101420, 2023. Liushuai Shi, Le Wang, Sanping Zhou, and Gang Hua. Trajectory unified transformer forpedestrian trajectory prediction. In Proceedings of the IEEE/CVF International Conference onComputer Vision, pages 96759684, 2023."
}